{
    "Android, iOS and HTML5: Integrating Facebook":"Android、iOS和HTML5:整合Facebook",
    "Facebook is one of the most important social media sites on the internet and many games and developers currently have their own pages for posting games and media. {}GameMaker{} has an extension that permits you to connect with Facebook and perform certain actions and tasks that their API permits. It is recommended that you visit the {}Facebook Developers{} page before starting to use the extension as a firm understanding of how the Facebook Graph works and the available calls and permissions is essential for you to get the most from these functions.{} {} You can find out how to setup and use the Facebook extension for all available platforms from the following link: ":"Facebook是互联网上最重要的社交媒体网站之一，许多游戏和开发商目前都有自己的页面来发布游戏和媒体。{}GameMaker{}有一个扩展，允许你连接到Facebook，并执行他们的API允许的某些操作和任务。建议您在开始使用扩展之前访问{}Facebook开发者{}页面，以坚定地理解Facebook Graph如何工作和可用的调用和权限是必要的，以便从这些函数中获得最大的好处。{}{}你可以从以下链接了解如何设置和使用所有可用平台的Facebook扩展:",
    "The following are&nbsp;{}obsolete functions{} that were only valid for the legacy Facebook API. As such you {}can no longer use these functions{} in your projects and they are listed here in case you have imported an old project with them in it. For current Facebook functionality you need to have activated the {}Facebook API{} in the appropriate {}Game Options{} for the target platform, which will prompt you to download and install an extension. The extension comes with a {}*.pdf{} format \"mini-manual\" explaining how to use it as well as showing all the function definitions and examples. All references to the old {}facebook_*(){} functions will need to be replaced (and updated) to use the extension {}fb_*(){} equivalents.":"以下是只对旧版 Facebook API 有效的{}过时函数{}。 因此，您{}不能再在您的项目中使用这些函数{}，它们列在此处以防您导入了包含它们的旧项目。 对于当前的 Facebook 函数，您需要在目标平台的相应{}游戏选项{}中激活 {}Facebook API{}，这将提示您下载并安装扩展程序。 该扩展附带一个 {}*.pdf{} 格式的“迷你手册”，解释了如何使用它以及显示所有函数定义和示例。 所有对旧 {}facebook_*(){} 函数的引用都需要替换(和更新)以使用扩展 {}fb_*(){} 等价物。",
    "The functions listed below were for integrating your game with Facebook:":"下面列出的函数用于将您的游戏与 Facebook 集成："
}