{
    "It is also worth noting that if the URL argument you pass in is the name of a {}script function{} (ie: it doesn\u0027t start with \"http://\") AND the script is called {}{}gmcallback_*{}{} then you can get direct feeds into an html5 event. {}GameMaker{}&nbsp;script function names are {}not{} obfuscated if they begin with {}gmcallback_{}.":"同样值得注意的是，如果你传入的URL参数是一个{}脚本函数{}的名称(例如:它不是以“http://”开头)，并且脚本名为{}{}gmcallback_*{}{}，那么你可以直接得到一个html5事件的提要。{}GameMaker{} 脚本函数名如果以{}gmcallback_{}开头，则{}不会{}进行混淆。",
    "The URL (website address) to link to, or the script to be run.":"要链接到的 URL (网站地址)或要运行的脚本。",
    "The above code creates a clickable DOM icon at the position (32, 32) of the page that the game canvas is running on. The icon uses the sprite referenced from the texture page as \"spr_MS_Home\" and when clicked the icon will open a new window for the specified URL and with the defined properties for that window. the button will also be scaled to twice the original sprite size and half an image alpha of 1.":"上面的代码在游戏画布运行的页面(32,32)的位置创建了一个可点击的DOM图标。该图标使用从纹理页面引用的精灵“spr_MS_Home”，当单击该图标时，将为指定的URL和已定义的窗口属性打开一个新窗口。该按钮也将被缩放到两倍的原始精灵大小，使图像alpha为 1。",
    "The image alpha of the icon (default 1).":"图标的图像 alpha (默认值为1)。",
    "The scale of the icon (default 1).":"图标的比例(默认为1)。",
    "The texture page entry for the sprite to be used.":"要使用的精灵的纹理页面条目。",
    "The various parameters for the icon (see description).":"图标的各种参数(参见说明)。",
    "The x position within the {}window{}.":"{}窗口{}中的 x 位置。",
    "The y position within the {}window{}.":"{}窗口{}中的 y 位置。",
    "This function works exactly the same as the {}{}clickable_add(){}{} function, where you must set the position relative to the (0,0) of the browser window, give the texture page entry for the sprite you wish the button icon to have (see: {}{}sprite_get_tpe(){}{}), specify either a URL to open or a script (from the Asset Browser of {}GameMaker{}) to be opened or run then set the target and parameters to use. However this function also has two additional options that permit you to set the icon alpha from 0 (fully transparent) to 1 (fully opaque) and the scale of the icon, which is a multiplier value applied to the sprite used. So a value of 1 is the default scale, while (for example) 0.5 would be half scale and 2 would be double.":"该函数的工作原理与{}{}clickable_add(){}{}函数完全相同，在该函数中，你必须设置相对于浏览器窗口(0,0)的位置，为你希望按钮图标拥有的精灵提供纹理页面条目(参见:{}{}sprite_get_tpe(){}{})，指定要打开的URL或要打开或运行的脚本(来自{}GameMaker{}的资产浏览器)，然后设置要使用的目标和参数。然而，这个函数还有两个额外的选项，允许你将图标alpha从0(完全透明)设置为1(完全不透明)和图标的比例，这是应用于所使用的精灵的缩放乘数值。因此，值1是默认比例，而(例如)0.5是一半比例，2是两倍比例。",
    "This is the target area to open the URL in (see description).":"这是打开 URL 的目标区域(参见描述)。",
    "With this function you can create a custom, clickable, icon that acts as a \"button\" outside of the game canvas, but within the browser window itself. The function will return an ID value which must be stored in a variable to be used in all further button functions that reference the new clickable. This function is very useful to prevent the browser creating a pop-up window when clicking on the button as it is all done through {}GameMaker{} itself.":"有了这个功能，你可以创建一个自定义的、可点击的图标，充当游戏画布之外的“按钮”，但在浏览器窗口内。该函数将返回一个ID值，该值必须存储在一个变量中，以便在引用新的可点击按钮的所有后续按钮函数中使用。这个函数对于防止浏览器在点击按钮时弹出窗口非常有用，因为这都是通过{}GameMaker{}本身完成的。"
}