{
    "Opens the linked document in a new window or tab.":"在新窗口或选项卡中打开链接文档。",
    "Opens the linked document in the full body of the window.":"在整个窗口中打开链接文档。",
    "Opens the linked document in the parent frame.":"在父框架中打开链接文档。",
    "Opens the linked document in the same frame as it was clicked (this is default).":"在单击时在同一框架中打开链接文档（这是默认设置）。",
    "The URL (website address) to link to, or the script to be run.":"要链接到的URL(网站地址)，或要运行的脚本。",
    "The above code creates a clickable DOM icon at the position (32, 32) of the page that the game canvas is running on. The icon uses the sprite referenced from the texture page as \"spr_MS_Home\" and when clicked the icon will open a new window for the specified URL and with the defined properties for that window.":"上面的代码在游戏画布运行的页面(32,32)的位置创建了一个可点击的DOM图标。该图标使用从纹理页面引用的精灵“spr_MS_Home”，当单击该图标时，将为指定的URL和已定义的窗口属性打开一个新窗口。",
    "The height of the window, with the minimum value being 100.":"窗口的高度，最小值为100。",
    "The left position of the window.":"窗口的左侧位置。",
    "The texture page entry for the sprite to be used.":"要使用的精灵的纹理页面条目。",
    "The top position of the window (IE only).":"窗口的顶部位置(仅限 IE)。",
    "The various parameters for the icon (see description).":"图标的各种参数(参见说明)。",
    "The width of the window, with the minimum value being 100.":"窗口的宽度，最小值为100。",
    "The x position within the {}window{}.":"{}窗口{}中的 x 位置。",
    "The y position within the {}window{}.":"{}窗口{}中的 y 位置。",
    "This is the target area to open the URL in (see description).":"这是打开URL的目标区域(参见描述)。",
    "Valid parameters are:":"有效参数如下:",
    "Valid targets are:":"有效的目标是:",
    "Whether or not the window is resizable (default is 1).":"窗口是否可以调整大小(默认为1)。",
    "Whether or not to add a status bar (default is 1).":"是否添加状态栏(默认值为1)。",
    "Whether or not to display scroll bars (default is 1).":"是否显示滚动条(默认值为1)。",
    "Whether or not to display the address field (default is 1).":"是否显示地址字段(默认值为1)。",
    "Whether or not to display the browser toolbar (default is yes).":"是否显示浏览器工具栏(默认值为 yes)。",
    "Whether or not to display the menu bar (default is 1).":"是否显示菜单栏(默认为1)。",
    "Whether or not to display the title bar. This is ignored unless the calling application is an HTML Application or a trusted dialog box (default is 1);":"是否显示标题栏。除非调用应用程序是 HTML 应用程序或受信任对话框(默认值为1) ，否则将忽略此选项;",
    "With this function you can create a custom, clickable, icon that acts as a \"button\" outside of the game canvas, but within the browser window itself. The function will return an ID value which must be stored in a variable to be used in all further button functions that reference the new clickable. This function is very useful to prevent the browser creating a pop-up window when clicking on the button as it is all done through {}GameMaker{} itself.":"使用此功能，您可以创建一个自定义的、可点击的图标，作为游戏画布之外但在浏览器窗口内的“按钮”。 该函数将返回一个 ID 值，该值必须存储在一个变量中，以便在引用新可点击对象的所有其他按钮函数中使用。 此功能对于防止浏览器在点击按钮时创建弹出窗口非常有用，因为这一切都是通过 {}GameMaker{} 本身完成的。",
    "You must first set the position, which is relative to the (0,0) of the browser window (top left corner) and then give the texture page entry for the sprite you wish the button icon to have (see: {}{}sprite_get_tpe(){}{}). You can then specify either a URL to open or a script (from the Asset Browser of {}GameMaker{}) to be opened or run. The \"target\" parameter that you specify is the same as the standard JavaScript \"name\" value when you use the {}open(){} method (be aware that all but \u0027_self\u0027 may result in the browser blocking, or asking the user if they wish to allow it) and the \"params\" argument is the same as the JavaScript \"specs\" parameter for controlling what properties the new window/tab should display (not all browsers may support all features). If you are using the icon to run an internal script, these last two arguments can be left as empty strings \"\".":"您必须首先设置相对于浏览器窗口（左上角）的 (0,0) 的位置，然后为您希望按钮图标具有的精灵提供纹理页面条目（请参阅：{}{} sprite_get_tpe(){}{})。 然后，您可以指定要打开的 URL 或要打开或运行的脚本（来自 {}GameMaker{} 的资源浏览器）。 当您使用 {}open(){} 方法时，您指定的“目标”参数与标准 JavaScript“name”值相同（请注意，除“_self”之外的所有参数都可能导致浏览器阻塞，或询问 user 如果他们希望允许它）并且“params”参数与 JavaScript“specs”参数相同，用于控制新窗口/选项卡应显示的属性（并非所有浏览器都支持所有功能）。 如果您使用图标运行内部脚本，最后两个参数可以保留为空字符串“”。",
    "{}\n    It is also worth noting that if the URL argument you pass in is the name of a {}script function{} (ie: it doesn\u0027t start with \"http://\") AND the script is called {}{}gmcallback_*{}{} then you can get direct feeds into an html5 event. {}GameMaker{}&nbsp;script function names are {}not{} obfuscated if they begin with {}gmcallback_{}.":"{}\n同样值得注意的是，如果你传入的URL参数是一个{}脚本函数{}的名称(例如:它不是以“http://”开头)，并且脚本名为{}{}gmcallback_*{}{}，那么你可以直接得到一个html5事件的提要。{}GameMaker{} 脚本函数名如果以{}gmcallback_{}开头，则{}不会{}进行混淆。"
}