{
    "The above code creates a new sequence instance on the \"Background\" layer. It then tries to find an instance of \"obj_Tree_Christmas\" using {}instance_find{}. If an instance of this object is found it then replaces the first instance of object \"obj_Trees_Winter\" in the sequence by this instance using {}sequence_instance_override_object{}. All other object tracks with \"obj_Trees_Winter\" as the object will {}not{} have an instance.":"上面的代码在\"背景\"层上创建一个新的序列实例。然后，它尝试使用{}instance_find{}查找\"obj_Tree_Christmas\"的实例。 如果找到此对象的实例，则使用{}sequence_instance_override_object{}用此实例替换序列中对象\"obj_Trees_Winter\"的第一个实例。 具有\"obj_Trees_Winter\"的所有其他对象轨迹{}将不{}具有实例。",
    "The above code creates a new sequence instance on the given layer and then modifies it so that all instances of the object \"obj_Trees_Winter\" are replaced by instances of the object \"obj_Trees_Summer\".":"上述代码在给定层上创建新的序列实例，然后对其进行修改，使得对象\"obj_Trees_Winter\"的所有实例被对象\"obj_Trees_Summer\"的实例替换。",
    "The object index of the object within the sequence to override.":"序列中要覆盖的对象的对象索引。",
    "The object index or instance ID to use to override the sequence objects.":"用于覆盖序列对象的对象索引或实例ID.",
    "The sequence instance struct to modify.":"要修改的序列实例结构。",
    "With this function you can override (replace) all instances of an object used in a sequence with another one or override a single instance of an object with an existing instance.":"使用此功能，您可以用另一个实例覆盖(替换)序列中使用的对象的所有实例，或用现有实例覆盖对象的单个实例。",
    "You supply the sequence instance struct ID (as returned when the sequence instance was created in the room or by using one of the room layer functions - see {}here{}), as well as the object index (as defined in the asset browser) for the object that you want to override. Finally you give an object index or an instance ID to use as the object that is going to override the sequence (supplying an instance ID will simply use the object that the instance was created from as the override). Note that this can only be done on sequence instances (not sequence objects) and must be done before the sequence starts to play, otherwise it won\u0027t work.":"为要替代的对象提供序列实例结构 ID(在房间中创建序列实例时返回，或使用房间层功能之一时返回)，请参见{}here{})，以及对象索引(如资源浏览器中定义)。最后，您给出一个对象索引或实例ID作为要覆盖序列的对象(提供实例ID将简单地使用创建实例的对象作为替代)。请注意，这只能在序列实例(而不是序列对象)上完成，并且必须在序列开始播放之前完成，否则它将不起作用。",
    "{}{}IMPORTANT{}{}&nbsp;If you provide an existing instance ID the instance will stay on the layer it is already on. The instance isn\u0027t moved to the layer that the sequence instance/element is on. This is different from creating a sequence instance on a layer using {}layer_sequence_create{}, where all instances are added to the layer with the sequence element.":"{}{}IMPORTANT{}{}如果提供现有实例 ID，则实例将停留在它已经所在的层上。实例未移动到序列实例/元素所在的层。这与使用{}layer_sequence_create{}在层上创建序列实例不同，在该层上，所有实例都与sequence元素一起添加到层中。",
    "{}{}IMPORTANT{}{}&nbsp;If you use this function with a sequence instance that has multiple object tracks of the same object asset and you provide an instance ID as the second argument then only the first instance is replaced with the given instance. The other object tracks will not get an instance.":"{}{}IMPORTANT{}{}如果将此函数与具有相同对象资产的多个对象轨迹的序列实例一起使用，并且提供了实例 ID 作为第二个参数，则只有第一个实例被给定实例替换。其他对象轨迹将不会获得实例。"
}