{
    "Cameras And Display":"相机及显示",
    "Cameras And View Ports":"相机和视口",
    "Display":"展示",
    "However, sometimes it\u0027s not enough to get information about the game window and views only, and you really need to know things about the {}display{} itself (essentially the screen that the game window is being displayed on). The following function all give you details about the size and orientation of the display, details about the GUI layer, and information on the mouse:":"但是，有时仅仅获取有关游戏窗口和视图的信息是不够的，您确实需要了解{}显示器{}本身(实际上是游戏窗口显示的屏幕)的相关信息。以下函数均提供有关显示器大小和方向的详细信息、有关 GUI 层的详细信息以及有关鼠标的信息：",
    "However, sometimes it\u0027s not enough to get information about the game window and views only, and you really need to know things about the {}display{} itself (essentially the screen that the game window is being displayed on). The following functions all give you details about the size and orientation of the display, details about the GUI layer, and information on the mouse:":"不过，有时仅获取有关游戏窗口和视图的信息是不够的，您确实需要了解有关 {} 显示器 {} 本身 (本质上是显示游戏窗口的屏幕) 的信息。以下函数都为您提供有关显示器的大小和方向的详细信息、有关 GUI 层的详细信息以及有关鼠标的信息：",
    "Screen Saves":"屏幕保存",
    "The Game Window":"游戏窗口",
    "The {}window{}&nbsp;is where {}GameMaker{} displays your game, and, depending on the target device, there are different things that can be done with it, like set it to fullscreen or not, for example. {}Cameras{} (and {}view ports{}), however, govern {}what{} you see within that window, and so have another series of functions dedicated to them. The following two sections deal with these two aspects of displaying your game:":"{}窗口{}是 {}GameMaker{} 显示游戏的位置，根据目标设备的不同，可以使用不同的设备完成不同的操作，例如，是否将游戏设置为全屏。{}摄像头{}(和{}视口{})，但是，控制{}您在该窗口中看到的内容{}，因此还有一系列专用于它们的函数。以下两个部分涉及显示游戏的以下两个方面：",
    "The {}window{}&nbsp;is where {}GameMaker{} displays your game, and, depending on the target device, there are different things that can be done with it, like set it to fullscreen or not, for example. {}Cameras{} (and {}viewports{}), however, govern {}what{} you see within that window, and so have another series of functions dedicated to them. The following two sections deal with these two aspects of displaying your game:":"{} 窗口 {} 是 {}GameMaker{} 显示游戏的地方，根据目标设备，可以使用它执行不同的操作，例如将其设置为全屏或不全屏。然而，{} 相机 {}( 和 {} 视口 {}) 控制着您在该窗口中看到的 {} 内容 {}，因此还有另外一系列专用于它们的功能。以下两部分涉及展示游戏的两个方面：",
    "There are also a few special functions that can be used to save the display, or part of it, to an image file, either as {}*.png{} or {}*.gif{}:":"还有一些特殊函数可用于将显示器或其一部分保存到图像文件，如 {}*.png{} 或 {}*.gif{}：",
    "There are also a few special functions that can be used to save the display, or part of it, to an image file, either as {}*.png{} or {}*.gif{}:&nbsp;":"还有一些特殊函数可用于将显示内容或其一部分保存到图像文件 (例如 {}*.png{} 或 {}*.gif{})：",
    "{}Cameras And Display{}":"{} 相机和显示器 {}"
}