{
    "By default on all platforms {}except{} PS4, Ubuntu and HTML5, {}GameMaker{} will use the vsync timing method, while on the unsupported platforms, {}only{} sleep margin timing can be used.":"默认情况下，在除 {}PS4、Ubuntu 和 HTML5 之外的所有平台{}上，{}GameMaker{} 将使用 vsync 计时方法，而在不支持的平台上，{}只能{}使用 sleep margin 计时。",
    "Certain Android devices make use of specific framerates. When running on these devices&nbsp;you may want to use the system timing method.&nbsp;This method removes all of&nbsp;{}GameMaker{}\u0027s sleeps and game speed control and allows the game speed to be set by the system.":"某些 Android 设备使用特定的帧速率。在这些设备上运行时，您可能需要使用系统计时方法。此方法删除了 {}GameMaker{} 的所有睡眠和游戏速度控制，并允许系统设置游戏速度。",
    "Display Timing Method Constant":"显示计时方法常量",
    "If you wish to set the sleep margin you can do so using the function {}{}display_set_sleep_margin(){}{} and you can find which timing method is currently being used with the function {}{}display_get_timing_method(){}{}.":"如果要设置 sleep margin，可以使用函数 {}{}display_set_sleep_margin(){}{} 执行此操作，并且可以找到函数 {}{}display_get_timing_method(){}{} 当前使用的计时方法。",
    "If you wish to set the sleep margin you can do so using the function&nbsp;{}{}display_set_sleep_margin{}{} and you can find which timing method is currently being used with the function {}{}display_get_timing_method{}{}.":"如果您希望设置睡眠余量，可以使用函数 {}{}display_set_sleep_margin{}{} 进行设置，并且您可以通过函数 {}{}display_get_timing_method{}{} 查找当前使用的计时方法。",
    "System timing is the main timing method":"系统计时是主要计时方式",
    "The above code will check the timing method and if it\u0027s not set to {}tm_sleep{} it will be set to that and the sleep margin set to 20.":"上述代码将检查计时方法，如果未设置为 {}tm_sleep{}，则会将其设置为该值，并将睡眠裕度设置为 20。",
    "The above code will check the timing method and then if it\u0027s not set to {}tm_sleep{} it will be set to that and the sleep margin set to 20.":"上述代码将检查定时方法，如果未将其设置为 {}tm_sleep{}，则会将其设置为该值，并将 sleep margin 设置为 20。",
    "The method can be one of the following constants:":"该方法可以是以下常量之一：",
    "The sleep margin value is the main timing method":"休眠余量值是主要的计时方法",
    "The timing method to use (see the list of constants, above)":"要使用的计时方法(参见上面的常量列表)",
    "The vsync timing method uses the target platform\u0027s&nbsp;support for vertical synchronisation to provide an anchor for the game\u0027s render timing calculations, while setting the mode to sleep margin will just try to ensure that each frame lasts for the correct amount of time (say 1/30th or 1/60th of a second) by waiting or sleeping. In general the default vsync timing will give the smoothest results, but note that when using the vsync method, the sleep margin values are still relevant, although it will have a reduced impact and we recommend keeping it at its default value when using this method.":"vsync 计时方法利用目标平台对垂直同步的支持来为游戏的渲染计时计算提供锚点，而将模式设置为睡眠余量只会尝试确保每一帧持续正确的时间量 (例如 1/30) 或 1/60 秒) 通过等待或睡眠。一般来说，默认的垂直同步计时将给出最平滑的结果，但请注意，当使用垂直同步方法时，睡眠裕度值仍然相关，尽管它会减少影响，我们建议在使用此方法时将其保留为默认值。",
    "The vsync timing method uses the target platforms support for vertical synchronisation to provide an anchor for the games render timing calculations, while setting the mode to sleep margin will just try to ensure that each frame lasts for the correct amount of time (say 1/30th or 1/60th of a second) by waiting or sleeping. In general the default vsync timing will give the smoothest results, but note that when using the vsync method, the sleep margin values are still relevant, although it will have a reduced impact and we recommend keeping it at its default value when using this method.":"vsync 计时方法使用目标平台对垂直同步的支持来为游戏的渲染计时计算提供一个锚点，而将模式设置为 sleep margin 将只是试图通过等待或睡眠来确保每一帧持续正确的时间(比如 1/30 或 1/60 秒)。一般来说，默认的 vsync 计时会给出最平滑的结果，但是请注意，当使用 vsync 方法时，sleep margin 的值仍然是相关的，尽管它的影响会减少，我们建议在使用这种方法时保持其默认值。",
    "This function can be used to set the timing method to be used for rendering your game. The method can be one of the following constants:":"此函数可用于设置用于渲染游戏的计时方法。该方法可以是以下常量之一：",
    "This function sets the timing method to be used for rendering your game.":"此函数设置用于渲染游戏的计时方法。",
    "Use the sleep margin value as the main timing method":"sleep margin 是主要的计时方法",
    "Use vsync timing as the main timing method (default for all supported platforms)":"Vsync 计时是主要的计时方法(所有支持的平台都默认为此值)",
    "Vsync timing is the main timing method (default for all supported platforms)":"Vsync计时是主要计时方式 (所有支持平台默认)"
}