{
    "If you have used the {}display_set_gui_maximise(){} function then the (0,0) position for the GUI layer will default to the top left corner of the game window, or display (when in fullscreen or on devices), with the scaling factor set by that function,\n    and the width and height set by this one. You can reset the GUI layer at any time to the default configuration by calling this function using -1 as both the width and height - this will set the (0, 0) position to the application surface and the width\n    and height will be reset to 1:1 with the surface too.":"如果您使用了 {}display_set_gui_maximise(){} 函数，那么，GUI 层的 (0,0) 位置将默认设置为游戏窗口的左上角，或者显示(在全屏或设备上时)，并具有由该函数设置的缩放比例因子，以及由此函数设置的宽度和高度。通过使用 -1 作为宽度和高度调用此函数，可以随时将 GUI 层重置为默认配置-这将设置 (0,0) 应用程序曲面的位置，并且宽度和高度也将与曲面重置为 1:1。",
    "The above code will lock the draw GUI event to the given width and height, scaling all components to fit either the application surface, or the display, using that proportion.":"上述代码将把绘制 GUI 事件锁定到给定的宽度和高度，使用该比例缩放所有组件以适应应用程序曲面或显示。",
    "The height of the GUI":"GUI 的高度",
    "The width of the GUI":"GUI 的宽度",
    "This function will only affect things drawn in the {}Draw GUI Event{} and can be used to set a specific width and height for all GUI components in that event, and no matter what\n    size of display or window is used to display the GUI, it will be scaled to fit correctly. Where the GUI is positioned (ie: the (0,0) position) will depend on whether you have used the function {}{}display_set_gui_maximise(){}{}    or not. If you do not use this function (the default setting) then the GUI layer will be positioned with its (0,0) point at the same position as that for the application surface (the area where your game is being drawn) and the width and height will\n    be stretched to fit the this surface, such that setting a GUI width of 256px with this function when the application surface is 512px would stretch those 256 pixels to fit, effectively making the pixels twice as large. This is ideal for those games\n    that have aspect ratio correction set in the global Game Settings.":"此函数仅影响{}绘制 GUI 事件{}中绘制的内容，并可用于为该事件中的所有 GUI 组件设置特定的宽度和高度，无论使用何种尺寸的显示或窗口来显示 GUI，都将缩放以适应正确的大小。将取决于您是否使用了函数 {}{}display_set_gui_maximise(){}{}。如果不使用此函数(默认设置)，则将使用其 (0,0) 点将 GUI 层定位在与应用程序曲面(绘制游戏的区域)相同的位置，并拉伸宽度和高度以适应此曲面，这样，当应用程序曲面为 512 px时，使用此函数将 GUI 宽度设置为 256 px 将拉伸这 256 个像素以适应，从而有效地使像素变得两倍大。这非常适合于在全局游戏设置中设置纵横比校正的游戏。"
}