{
    "Finally, you can reset the GUI layer using this function by setting the scaling factors to -1. This will set the GUI layer to have a 1:1 scale again and set the draw position to the (0,0) position of the application surface rather than the display or window.":"最后，通过将缩放系数设置为 -1，可以使用此函数重置 GUI 层。这将再次设置 GUI 层的比例为 1:1，并将绘制位置设置为应用程序表面的 (0,0) 位置，而不是显示或窗口。",
    "However, you can set the {}scaling factor{} for the GUI layer, and the width and height will be scaled by that amount. Remember that the GUI layer is always made to fit the size of the display or game window, or the application surface, so setting this value to anything other than 1 basically scales the pixel count along the width and height. If your display is 1024x768 and you set the scaling factor to scale by 0.5, then your GUI layer will be half the size of the display, effectively doubling the pixel size:":"但是，您可以为 GUI 图层设置{}缩放系数{}，并且宽度和高度将按该比例缩放。请记住，要始终根据显示器或游戏窗口或应用程序表面的大小来设置 GUI 层，因此将此值设置为 1 以外的任何值都会基本上沿着宽度和高度缩放像素计数。如果显示屏为 1024 x 768，并将缩放系数设置为缩放 0.5，则贵层的尺寸将是显示屏尺寸的一半，从而有效地将像素大小加倍：",
    "Setting the values in this way will also set the draw position to the (0,0) of the display or game window, so you can provide offset values to \"move\" the (0,0) position:":"通过这种方式设置值还会将绘图位置设置为显示或游戏窗口的 (0,0)，因此您可以提供偏移值来\"移动\" (0,0) 位置：",
    "The above code will lock the draw GUI event to the given width and height, scaling all components to fit the display, using that proportion.":"上述代码将按照给定的宽度和高度锁定绘制 GUI 事件，使用该比例缩放所有组件以适应显示。",
    "This function can be used to maximise the GUI layer and set it to be scaled and offset in relation to the screen dimensions, rather than the default application surface position and dimensions. By default, the GUI layer is 1:1 with the application surface resolution and drawn at the (0,0) position of the surface too. However this is not always what you want and so you can use this function to set it to be drawn relative to the absolute (0,0) position of the display or game window. What arguments you provide to this function will depend on the effect you wish it to have on the GUI layer. Simply calling the function with no arguments will set the GUI layer to be drawn at the (0,0) position of the screen or game window, with the width and height being scaled to fit the whole area:":"此函数可用于最大化 GUI 层，并将其设置为相对于屏幕尺寸进行缩放和偏移，而不是设置为默认的应用程序表面位置和尺寸。默认情况下，GUI 层的应用表面分辨率为 1:1，并且绘制在表面的 (0,0) 位置。但是，这并不总是您想要的，因此您可以使用此函数将其设置为相对于显示或游戏窗口的绝对位置 (0,0) 进行绘制。您为此函数提供的参数取决于您希望它对 GUI 层产生的效果。只需在不使用参数的情况下调用该函数，就可以在屏幕或游戏窗口的位置 (0,0) 设置要绘制的 GUI 层，并缩放宽度和高度以适应整个区域：",
    "{}OPTIONAL{}&nbsp;The horizontal scaling factor (use -1 to reset to default).":"{}可选{} 水平缩放系数(用 -1 来重置为默认值)。",
    "{}OPTIONAL{}&nbsp;The vertical scaling factor (use -1 to reset to default).":"{}可选{} 垂直缩放系数(用 -1 来重置为默认值)。",
    "{}OPTIONAL{}&nbsp;The x offset position for drawing.":"{}可选{} 绘制的 X 偏移位置。",
    "{}OPTIONAL{}&nbsp;The y offset position for drawing.":"{}可选{} 绘制的 Y 偏移位置。"
}