{
    "Note that there are no built-in limits on number of frames or on the size of those frames in your GIF, but if you use too much memory then the function will fail and return -1, otherwise it will return 0.":"请注意，对于 GIF 中的帧数或这些帧的大小没有内置限制，但如果使用了太多内存，则函数将失败并返回 -1，否则将返回 0。",
    "The ID of gif to add the surface data to":"要将表面数据添加到的 GIF 的 ID",
    "The ID of the surface to use as the added frame":"用来作为添加框架的表面的 ID",
    "The ID of the&nbsp;GIF to add the surface data to":"添加表面数据的 GIF 的 ID",
    "The above code will create a GIF image file with 30 frames taken from the application surface and then save it.":"以上代码将创建从应用程序表面获取的具有 30 帧的 GIF 图像文件，然后保存该文件。",
    "The delay time for the frame (in 100ths of a second)":"帧的延迟时间(以 100 秒为单位)",
    "The surface to use as the added frame":"用作添加框架的表面",
    "This function saves a frame to a GIF file from a surface.":"此函数将表面上的帧保存为 GIF 文件。",
    "With this function you can save a frame to a GIF file from a surface. You supply the GIF file ID (as returned by the function {}{}gif_open(){}{}) and a surface ID (as returned by the function {}{}surface_create(){}{}), as well as a delay time between frames. The delay time is calculated in 1/100ths of a second, but note that once the GIF has been created, if you use it for promotional purposes for example, different browsers may interpret the frame delay slightly differently - see {}here{} for more details. You may (optionally) supply X and Y offset values for the surface being used to add to the GIF, in which case the part drawn to the GIF will begin from the offset and not the default (0,0) position, permitting you to select only a section of the surface to add. You can also supply a quantization value, which is an integer between 0 and 3, where 0 is full quantization and 3 is zero quantization (lower values will have a subsequent degradation in quality, but create a smaller GIF). Note that there isn\u0027t much difference between the default quality of 2, and the highest of 3, and using 3 will significantly slow down the creation of the GIF so care should be taken when using the maximum value.":"使用此函数，可以将框架从表面保存到 GIF 文件。提供 GIF 文件 ID (由函数 {}{}gif_open(){}{} 返回)和表面 ID (由函数 {}{}surface_create(){}{} 返回)，以及帧之间的延迟时间。延迟时间以 1/100 秒为单位计算，但请注意，创建 GIF 后，如果您将其用于促销目的(例如，不同的浏览器对帧延迟的解释可能略有不同-有关详细信息，请参阅{}此处{})。您可以(可选)为用于添加到 GIF 的表面提供 X 和 Y 偏移值，在这种情况下，绘制到 GIF 的零件将从偏移开始，而不是默认 (0,0)位置，从而允许您仅选择要添加的表面的一部分。您还可以提供一个量化值，它是介于 0 和 3 之间的整数，其中 0 表示完全量化，3 表示零量化(值越低，质量越差，但会创建越小的 GIF)。请注意，默认质量 2 和最高质量 3 之间没有太大差异，使用3将显著减慢 GIF 的创建速度，因此在使用最大值时应小心。",
    "You supply the GIF file ID (as returned by the function {}{}gif_open{}{}) and a surface (as returned by the function {}{}surface_create{}{}), as well as a delay time between frames. The delay time is calculated in 1/100ths of a second, but note that once the GIF has been created, if you use it for promotional purposes for example, different browsers may interpret the frame delay slightly differently - see {}here{} for more details. You may (optionally) supply X and Y offset values for the surface being used to add to the GIF, in which case the part drawn to the GIF will begin from the offset and not the default (0, 0) position, permitting you to select only a section of the surface to add. You can also supply a quantization value, which is an integer between 0 and 3, where 0 is full quantization and 3 is zero quantization (lower values will have a subsequent degradation in quality, but create a smaller GIF). Note that there isn\u0027t much difference between the default quality of 2, and the highest of 3, and using 3 will significantly slow down the creation of the GIF so care should be taken when using the maximum value.":"您提供 GIF 文件 ID(由函数 {}{}gif_open{}{} 返回) 和表面 (由函数 {}{}surface_create{}{} 返回)，以及帧之间的延迟时间。延迟时间以 1/100 秒计算，但请注意，创建 GIF 后，如果您将其用于促销目的，不同的浏览器对帧延迟的解释可能会略有不同 - 请参阅 {} 此处 {} 了解更多细节。您可以 (可选) 为用于添加到 GIF 的表面提供 X 和 Y 偏移值，在这种情况下，绘制到 GIF 的部分将从偏移开始，而不是从默认 (0, 0) 位置开始，从而允许您仅选择要添加的曲面的一部分。您还可以提供一个量化值，该值是 0 到 3 之间的整数，其中 0 是完全量化，3 是零量化 (较低的值将导致质量随后下降，但会创建较小的 GIF)。请注意，默认质量 2 和最高质量 3 之间没有太大区别，并且使用 3 会显着减慢 GIF 的创建速度，因此在使用最大值时应小心。",
    "{}OPTIONAL{} The offset along the X axis of the surface to add from":"{}可选{} 要添加的表面沿 X 轴的偏移",
    "{}OPTIONAL{} The offset along the Y axis of the surface to add from":"{}可选{} 要添加的表面沿 Y 轴的偏移",
    "{}OPTIONAL{} The quantization amount from 0 to 3 (0 lowest quality, 3 highest quality, default is 2)":"{}可选{} 从 0 到 3 的量化数量 (0 最低质量，3 最高质量，默认值为 2)",
    "{}{}NOTE{}{}&nbsp;This function will only work with surfaces that use the&nbsp;{}{}surface_rgba8unorm{}{} (default) surface format.":"{}{}备注{}{} 此函数仅适用于使用 {}{}surface_rgba8unorm{}{} (默认)表面 格式的表面 。"
}