{
    "A {}do{} function is another way of iterating over one or more {}statement{}{}s{} multiple times, and is really a \"{}do... until{}\" statement as you cannot have one without the other since you are telling {}GameMaker{} to do something until a specific {}expression{} returns {}true{}. It has this form:":"{}do{}函数是对一个或多个{}语句{}{} {}进行多次迭代的另一种方式，它实际上是一个\"{}do...until{}\"语句，因为您要告诉{}GameMaker{}在特定的{}表达式{}返回{}true{}之前执行某些操作，所以不能只使用其中一个语句。它具有以下形式：",
    "A {}do{} statement is another way of iterating over one or more {}statement{}{}s{} multiple times, and is really a \"{}do... until{}\" statement as you cannot have one without the other since you are telling {}GameMaker{} to do something until a specific {}expression{} returns {}true{}. It has this form:":"{}do{} 语句是另一种方式，用于多次迭代一个或多个 {}statement{}{}s{}，实际上它是一个 \"{}do... until{}\" 语句，因为你不能单独使用其中之一，你是在告诉 {}GameMaker{} 执行某些操作，直到特定的 {}expression{} 返回 {}true{}。它的形式如下：",
    "An example of using continue in a {}do / until{} loop would be:":"在{}do/until{}循环中使用continue的一个例子是:",
    "For more examples of loop keywords please see the sections on {}{}repeat{}{}, {}{}while{}{}, and {}{}for{}{}.":"更多关于循环关键字的例子，请参见{}{}repeat{}{},{}{}while{}{},和{}{}for{}{}章节。",
    "In the above code, we create a local variable and set it to hold the keyword {}noone{}. We then perform a {}do / until{} loop checking the first position of a DS list to see if it holds a valid instance ID, and if it does then we {}break{} the loop, otherwise the value for the list position is deleted. After the loop is terminated (either by the {}break{} or because the list is empty) the local variable value is then assigned to the instance variable {}target{}.":"在上面的代码中，我们创建了一个局部变量，并将其设置为持有关键字{}noone{}。然后我们执行一个{}do/until{}循环，检查DS列表的第一个位置，看它是否有一个有效的实例ID，如果有，我们{}中断{}循环，否则列表位置的值被删除。循环结束后(无论是通过{}break{}还是因为列表为空)，本地变量的值被分配给实例变量{}target{}。",
    "One final note: be careful with your {}do{} loops, as you can easily make them loop forever, in which case your game will hang and not react to any user input anymore and they will have to force close it.":"最后一个注意事项：小心{}do{}循环，因为您可以轻松地让它们永远循环，在这种情况下，您的游戏将挂起，不再对任何用户输入做出反应，它们将不得不强制关闭。",
    "The above code tries to place the current object at a free position and will set the x and y variables at least once, and then perform as many {}iteration{}{}s{} as required until the {}place_free(){} expression returns {}true{}.":"上述代码尝试将当前物体放置在一个空闲的位置，并将 x 和 y 变量设置至少一次，然后执行所需的 {}iteration{}{}s{}，直到 {}place_free(){} 表达式返回 {}true{}。",
    "The above code tries to place the current object at a free position and will set the x/y variables at least once, and then perform as many {}iteration{}{}s{} as required until the {}place_free(){} expression returns {}true{}.":"上述代码试图将当前对象放置在一个自由的位置上，并将至少设置一次x/y变量，然后根据需要进行多次{}迭代{}{}s{}，直到{}place_free(){}表达式返回{}true{}。",
    "The statement (which can be a code block of multiple statements within curly brackets {}{}{}) is executed until the expression is found to be {}true{}, and the initial statement is {}always executed at least once{}.&nbsp;Below you can find an example of a typical way to use {}do... until{}:":"语句(可以是大括号内的多个语句的代码块{}{})被执行，直到发现表达式为{}true{}，并且初始语句{}总是被至少执行一次{}。下面你可以看到一个使用{}do...until{}的典型方法的例子。",
    "This code will generate a random room position then check if an instance of the object {}obj_Enemy{} exists at that position. If it does, the current loop iteration is terminated using {}continue{} and a new iteration is started, and if it doesn\u0027t then an instance of the object {}obj_Enemy{} is created at the random position. The loop will only terminate when there are 10 or more instances of the object in the room.":"此代码将生成随机房间位置，然后检查对象{}obj_Enemy{}的实例是否存在于该位置。如果是，则使用{}继续{}终止当前循环迭代，并启动新的迭代;如果不是，则在随机位置创建对象{}obj_Enemy{}的实例。只有当房间中有10个或更多对象实例时，循环才会终止。",
    "You can also use the {}{}break{}{} and {}{}continue{}{} statements within your {}do{} loops.&nbsp;Using {}break{} will immediately exit the loop and move on to any code that is in the event or function after the loop should have finished, e.g.:":"你也可以在 {8}do{9} 循环中使用 {}{}break{}{} 和 {}{}continue{}{} 语句。使用 {}break{} 将立即退出循环，并继续执行循环结束后在事件或函数中的任何代码，例如：",
    "You can also use the {}{}break{}{} and {}{}continue{}{} statements within your {}do{} loops.&nbsp;Using {}break{} will immediately exit the loop and move on to any code that is in the event or function after the loop should have finished, eg:":"你也可以在你的{}do{}循环中使用{0}{1}break{2}{3}和{4}{5}continue{6}{7}语句。使用{}break{}将立即退出循环，并在循环结束后继续处理事件或函数中的任何代码，例如。",
    "{}When should you use a {}do{} / {}until{} loop?{} It should be used any time you want to repeat one or more statements, but don\u0027t actually know how many times it has to repeat, and want to ensure that the statements are run {}at least once{} before the loop ends.":"{}什么时候应该使用{}do{}/{}until{}循环？{}当您希望重复一个或多个语句，但不知道必须重复多少次时，应该使用该循环，并希望确保在循环结束之前至少运行{}次{}语句。",
    "以上代码尝试将当前对象置于自由位置，并且将至少设置x/ y变量一次，然后根据需要执行多次{}迭代{}{}s{}，直到{}plac_free(){}表达式返回{}true{}。":"以上代码尝试将当前对象置于自由位置，并且将至少设置x/y变量一次，然后根据需要执行多次{}迭代{}{} {}，直到{}place_free(){}表达式返回{}true{}。",
    "在上述代码中，我们创建一个局部变量并将其设置为保留关键字{}noone{}。然后执行{}do/直到{}循环检查DS列表的第一个位置，以查看它是否保留有效的实例ID，如果保留了，则我们将{}中断循环，否则将删除列表位置的值。循环终止后(通过{}中断{}或因为列表为空)，将局部变量值分配给实例变量{}target{}。{}":"在上述代码中，我们创建一个局部变量并将其设置为保留关键字{}noone{}。然后执行{}do/ 直到{}循环检查DS列表的第一个位置，以查看它是否保留有效的实例ID，如果保留了，则我们将{}中断循环，否则将删除列表位置的值。循环终止后( 通过{}中断{}或因为列表为空)，将局部变量值分配给实例变量{}目标{}。{}"
}