{
    "An example of using {}continue{} in a {}for{} loop would be:":"在{}for{}循环中使用{}continue{}的一个例子是:",
    "For more examples of loop keywords please see the sections on {}{}repeat{}{}, {}{}while{}{}, and {}{}do / until{}{}.":"有关循环关键字的更多示例，请参阅{}{}repeat{}{}、{}{}while{}{}和{}{}do / until{}{}部分。",
    "Go back to step 2 and perform the expression again and continue or exit the loop":"返回步骤2并再次执行表达式，然后继续或退出循环",
    "It is worth noting that you can use the special {}{}break{}{} and {}{}continue{}{} statements within a {}for{} loop too. Using {}break{} will immediately exit the loop and move on to any code that is in the event or function after the loop should have finished, e.g.:":"值得注意的是，您也可以在{8}for{9}循环中使用特殊的{}{}break{}{}和{}{}continue{}{}语句。使用{}break{}将立即退出循环，并在循环应该结束后移到事件或函数中的任何代码，例如:",
    "Now, this may sound complicated when written like that, but you should interpret it as:":"现在，这样写可能听起来很复杂，但你应该把它解释为。",
    "One of the most used ways to iterate over a&nbsp;{}statement{}&nbsp;(or statements) multiple times is to use a {}for{} loop, which has this form:":"对{}语句{}(或语句)进行多次迭代的最常用方法之一是对{}循环使用{}，其形式如下：",
    "The above code initialises a {}for{} loop, starting at 0 and counting up to (and including) 9, and then uses the loop value of {}i{} to draw the values stored in an array down the screen. Note how the {}for{} loop variable {}i{} is used to not only loop through the array, but to draw a number as well as tell {}GameMaker{} where to draw the values to in the room. This flexibility is one of the main reasons why {}for{} loops are so important in programming.":"上面的代码初始化了一个{}for{}循环，从0开始，一直数到(包括)9，然后使用{}i{}的循环值，在屏幕上画出存储在数组中的数值。请注意{}for{}循环变量{}i{}是如何被用于不仅循环数组，而且绘制数字以及告诉{}GameMaker{}在房间里把数值画到哪里。这种灵活性是{}for{}循环在编程中如此重要的主要原因之一。",
    "The above code loops through the 10 nearest instances of the given \"parent\" object, and if an instance is found it checks the instance object ID, and if it is an instance of {}obj_Enemy_Melee{} then the loop is ended using {}break{} and the ID value assigned to a variable (if no instance is found, then the keyword {}{}noone{}{} will be&nbsp;added to the variable).":"上面的代码循环遍历给定“父”对象的10个最近的实例，如果找到一个实例，它会检查实例对象ID，如果它是{}obj_Enemy_Melee{}的一个实例，那么循环将使用{}break{}和分配给变量的ID值结束(如果没有找到实例，则关键字{}{}noone{}{}将被添加到变量中)。",
    "The expression tests whether the loop should be ended":"测试循环表达式是否应结束 (语法中 expression)",
    "The first assignment initializes the for-loop":"首先赋值初始化for-循环 (语法中 assignment)",
    "The operation is performed":"执行运算 (语法中 operation)",
    "The statement is performed":"执行语句 (&#123;&#125;内语句 statement)",
    "This code will check the value stored in each array position of a 10 length 1D&nbsp;{}array{}, and if any are less than or equal to 0 it will {}continue{} the loop, meaning that the current iteration will end, {}i{} will be incremented, and the next loop iteration will be started. If the value is greater than 0, then it is added to the local variable {}_val{}, and after the loop is finished the total value is drawn to the screen.":"这段代码将检查存储在长度为10的1D {}数组{}的每个数组位置中的值，如果其中任何值小于或等于0，它将{}继续{}循环，这意味着当前迭代将结束，{}i{}将递增，并开始下一个循环迭代。如果该值大于0，则将其添加到本地变量{}_val{}中，在循环完成后，将总值绘制到屏幕上。",
    "This is extremely useful for doing repetitive tasks that would involve multiple lines of code in any other way, and is commonly used as a counter for evaluating arrays, drawing things, setting incremental values, etc...&nbsp;The following code example illustrates a typical use for this type of statement:":"这对于做重复性的工作是非常有用的，因为以任何其他方式都会涉及到多行代码，而且通常被用作评估数组、绘制东西、设置增量值等的计数器。下面的代码例子说明了这种类型的语句的典型用途。",
    "This works as follows - First&nbsp;the assignment is executed which assigns a value to a variable, then the {}expression{}&nbsp; is evaluated and, if it is&nbsp;{}true{}, the statements in the curly brackets{} are executed executed. Next the operation is performed on the assigned variable and then the expression is evaluated again. This loop will continue until the expression is found to be&nbsp;{}false{}.":"其工作原理如下-首先执行为变量赋值的赋值，然后计算{}表达式{}，如果它为{}真{}，则执行花括号{}中的语句。接下来，对指定的变量执行操作，然后再次计算表达式。此循环将继续，直到发现表达式为{}false{}。",
    "{}NOTE{}: You will see multiple examples when working with other people of the variables \"{}i{}\" and \"{}j{}\" being used for the loop counter variable. These are {}not{} obligatory variable names and you can use anything like \"{}a{}\" or \"{}foo{}\" or whatever. The use of \"{}i{}\" and \"{}j{}\" is simply a standard convention in programming.":"{}注意{}:您将看到许多其他人一起使用变量“{}i{}”和“{}j{}”作为循环计数器变量的例子。这{}不是{}必选变量名，你可以使用诸如\"{}a{}\"或\"{}foo{}\"之类的东西。使用“{}i{}”和“{}j{}”只是编程中的一种标准约定。",
    "{}When should you use a {}for{} loop?{} Anytime you need to perform a fixed number of iterations over one or more statements&nbsp;while keeping track of the {}iteration{} that is currently being run and using that iteration value.":"{}什么时候应该使用{}for{}循环？{}任何时候，你需要对一条或多条语句执行固定数量的迭代，同时跟踪当前正在运行的{}迭代{}，并使用该迭代值。"
}