{
    "Alternatively you can use the {}{}break{}{} statement to break out of the loop, for example, the following code will generate 100 random numbers then continue, even though the {}while{} evaluation is {}always{}&nbsp;going to be {}true{}:":"或者，您也可以使用{}{}break{}{}语句打破循环，例如，以下代码将生成100个随机数，然后继续，即使{}计算结果总是{}为true{}：",
    "For more examples of loop functions please see the sections on {}{}repeat{}{}, {}{}do... until{}{}, and {}{}for{}{}.":"关于循环函数的更多例子，请参见{}{}repeat{}{}、{}{}do... until{}{}和{}{}for{}{}部分。",
    "Here you have a {}statement{}&nbsp;that is iterated over again and again based on the results of the evaluation of an {}expression{}, ie: with a {}while{} loop, as long as the expression evaluates to {}true{}, the statement (which can also be a code block of multiple statements with curly brackets {}{}{}) is executed. Below you can find an example of a typical way to use \"while\":":"这里有一个{}语句{}，它根据{}表达式{}的求值结果反复迭代，即：使用{}while{}循环，只要表达式的计算结果为{}true{}，就会执行该语句(也可以是带有大括号{}{}{}的多个语句的代码块)。以下是使用 \"while\" 的典型方法示例：",
    "Now, the&nbsp;above code may work fine, but it may also cause an&nbsp;infinite loop if the instance is unable to find an empty position to move to, and this will cause the game to hang. If you find yourself in a position where this kind of thing is a possibility, then you should either use a different non-blocking loop kind, or use an additional&nbsp;variable check in the expression (you can use multiple expressions along with the {}{}and{} (&amp;{}&amp;{}){}, {}{}or{}&nbsp;({}||{}){} and {}{}xor{} ({}^^{}){} {}= (greater than or equal to), but there are many more.\">operator{}{}s{} for the check):":"现在，上面的代码可能工作正常，但是如果实例无法找到要移动到的空位置，也可能导致无限循环，这将导致游戏挂起。如果您发现自己处于这种可能性的位置，那么您应该使用不同的非阻塞循环类型，或者在表达式中使用额外的变量检查(可以与{}{}and{}(&{}&{}){},{}{}or{}({}||{}){}和{}{}xor{}({}^^{}){}{}=(大于或等于)，但还有很多。\"> 运算符{}{} {}用于检查):",
    "Please not that you should {}be very careful with your {}while{} loops{}! You can easily make {}infinite{} loops, in which case your game will hang and not react to any user input anymore and need to be force closed. For example:":"请注意你应该{}在{}循环{}时非常小心你的{}！你可以轻松地进行{}infinite{}循环，在这种情况下，你的游戏将挂起并且不再对任何用户的输入做出反应，需要强制关闭。例如：",
    "The GameMaker Language has a number of ways that you can perform {}loops{}, one of the most important is the {}while{} loop. This loop function&nbsp;has the form:":"GameMaker语言有许多方法可以进行{}循环{}，其中最重要的是{}while{}循环。这个循环函数的形式是:",
    "The above code is checking for a collision between the calling instance and a \"wall\" instance, and it will perform multiple {}iteration{}{}s{} while one is occurring - moving&nbsp;the instance left by one pixel -&nbsp;until the instance is no longer in collision.":"上述代码正在检查调用的实例和 \"墙 \"的实例之间是否发生碰撞，当发生碰撞时，它将执行多次{}迭代{}{} {} --将实例向左移动一个像素，直到实例不再发生碰撞。",
    "This code above will open a file and read a line from it each loop iteration until the end of the file contents are reached. If the line being read is an empty string, the current loop iteration is ended using the {}continue{} statement and a new iteration will be started, otherwise the string is added into an {}array{} and the array position incremented.":"上面这段代码将打开一个文件，并在每次循环迭代中从其中读取一行，直到达到文件内容的末尾。如果被读取的行是一个空字符串，则使用{}continue{}语句结束当前的循环迭代，并开始新的迭代，否则该字符串将被添加到{}数组{}中，数组的位置将被增加。",
    "You may also use the {}continue{} statement in a {}while{} loop. Using this will end the current loop iteration and restart the loop&nbsp;again on a new iteration, for example:":"你也可以在一个{}while{}循环中使用{}continue{}语句。例如，使用它将结束当前的循环迭代，并在新的迭代中再次重启循环。",
    "{}When should you use a {}while{} loop?{} It should be used any time you want to repeat one or more statements, but don\u0027t actually know - or care -&nbsp;how many times it has to repeat, keeping in mind that if the initial evaluation is {}false{}, the statements may not even be run.":"{}什么时候应该使用{}while{}循环？{}当您想重复一个或多个语句时，应该使用该循环，但实际上不知道或不关心它必须重复多少次，请记住，如果初始评估为{}false{}，则可能无法运行这些语句。"
}