{
    "Returns whether the Siri Remote touchpad accepts absolute input, or relative input. In absolute mode, the center of the touch pad is considered the (0,0) position - ie: where the analog stick is at rest or where the center of the dpad would be - and movement around this position will generate input. When set to relative, then the (0,0) position will be considered as being wherever the initial touch on the pad is made and all input will be generated from that position, not the center of the pad.":"返回 Siri Remote 触摸板是接受绝对输入还是相对输入。在绝对模式下，触摸板的中心被视为 (0,0) 位置——即：模拟摇杆处于静止状态的位置或 dpad 的中心所在位置——围绕该位置移动将生成输入。当设置为相对位置时，(0,0) 位置将被视为在触摸板上进行初始触摸的任何位置，所有输入都将从该位置生成，而不是从触摸板的中心生成。",
    "Returns whether the Siri Remote will be rotation locked (ie: can only be used vertically) or not. When unlocked, rotating the control will change the input, such that a rotation of 90º to the left will make the \"right\" side of the touch pad return \"up\", etc... such that all input will be relative to the orientation of the device":"返回Siri遥控器是否将被旋转锁定 (即: 只能垂直使用)。解锁时，旋转控件将改变输入，这样向左旋转90 ° 将使触摸板的 “右侧” 返回 “向上”，等等...使得所有输入都将相对于设备的方向",
    "The above code loops through all the gamepad slots and checks for the \"Siri Remote\" on the tvOS platform. If one is detected, it then sets the remote to allow input rotation.":"上述代码循环通过所有游戏板插槽，并检查tvOS平台上的“Siri Remote”。如果检测到一个，则设置遥控器以允许输入旋转。",
    "The name of the option to get the value from (a string, see the table above)":"从中获取值的选项的名称(字符串，参见上表)",
    "This function can be used to retrieve the given option value. You supply the gamepad \"slot\" to check, as well as the option string and the function will return the associated value. The available option string will depend on the platform that the project is being run on, as listed below:":"该函数可用于检索给定的选项值。您提供要检查的游戏手柄 “插槽”，以及选项字符串和函数将返回关联的值。可用选项字符串将取决于正在运行项目的平台，如下所示:",
    "Which gamepad device \"slot\" to check.":"要检查哪个游戏手柄设备 “插槽”。",
    "{}{}Boolean{}{}, {}{}Real{}{}, {}{}String{}{}, or&nbsp;{}N/A{} (depends on platform and option)":"{}{}Boolean{}{}、{}{}Real{}{}、{}{}String{} {}或{}N/A{}(取决于平台和选项)"
}