{
    "Camera ID":"Camera ID",
    "Note that cameras are like all dynamic resources and will occupy memory when created. This means that you need to take care not to create cameras unnecessarily and to destroy those that you don\u0027t need by calling the function {}{}camera_destroy(){}{}. This also means that cameras will persist from room to room if assigned to a {}global{} variable (they will persist when assigned to instance or local variables too, but you can\u0027t access them after changing room, hence the memory leak), so that you can - for example - create a new camera, assign it to a global variable, and then at the start of each room set the required view and projection matrices and the view port you need to use.":"请注意，相机与所有动态资源一样，在创建时将占用内存。这意味着您需要注意不要创建不必要的相机，并通过调用函数 {}{}camera_destroy(){}{} 来销毁不需要的相机。这也意味着，如果将相机分配给{}全局{}变量，它们将在每个房间之间持续存在(当将相机分配给实例或局部变量时，它们也将持续存在，但在更换房间后无法访问它们，从而导致内存泄漏)，以便您可以例如创建新相机，将其分配给全局变量，然后在每个房间的开始处设置所需的视图和投影矩阵以及需要使用的视口。",
    "The above code creates a new camera and assigns its ID to view[0]. The view and projection matrices are then created and stored in local variables before being used to set the camera.":"上述代码创建了一个新的照相机并将其 ID 分配给 view[0]。然后，创建视图矩阵和投影矩阵并将其存储在局部变量中，然后再用于设置摄影机。",
    "This function will create an \"empty\" camera, ie: a camera with no view or projection settings defined. Once you have created the camera you can then use the different {}matrix functions{} to set the view and projection matrices. You can also use this function to create the camera and then use the different {}camera_set_*{} functions to set up the view, however note that you {}must{} provide at least a position and view size, otherwise the resulting camera will not be valid and give odd results if applied to a view port (if you do not set the object following, borders or move speed these will be set to the default values for a view camera in the Room Editor).":"此函数将创建一个\"空\"相机，即：未定义视图或投影设置的相机。创建相机后，可以使用不同的{}矩阵函数{}来设置视图矩阵和投影矩阵。也可以使用此函数创建摄影机，然后使用不同的 {}camera_set_*{} 函数设置视图，但请注意{}必须{}至少提供位置和视图大小，否则生成的摄影机将无效，如果应用于视口，则会产生奇怪的结果(如果未设置以下对象，则会在 \"房间编辑器\" 中将这些边界或移动速度设置为视图摄影机的默认值)。"
}