{
    "If you use this function to switch to a perspective projection (as opposed to the default orthographic projection), automatic drawing of tiled sprites will stop working and will need to be handled manually. This includes any background layers that use horizontal or vertical tiling and the {}{}draw_sprite_tiled(){}{}&nbsp;and {}{}draw_sprite_tiled_ext(){}{} functions, which will only draw the sprite once instead of tiling it if a perspective projection is being used.":"如果使用此功能切换到透视投影(而不是默认的正交投影)，则 tiled 精灵的自动绘制将停止工作，并且需要手动处理。这包括使用水平或垂直 tiled 的任何背景图层以及 {}{}draw_sprite_tiled(){}{} 和 {}{}draw_sprite_tiled_ext(){}{} 函数，如果使用透视投影，这些函数将只绘制一次子画面，而不是平铺它。",
    "If your camera does automatic object tracking - ie: it has been created using {}{}camera_create_view(){}{} with an object index / instance ID that isn\u0027t -1, or you are setting a camera defined in the Room Editor, or you are setting the default camera - then this matrix will get overwritten the next game frame.":"如果您的相机执行自动对象跟踪 - 即：它是使用 {}{}camera_create_view(){}{} 创建的，并且对象索引/实例ID不是t-1，或者您正在设置在\"房间编辑器\"中定义的摄影机，或者您正在设置默认相机 - 则此矩阵将在下一个游戏帧中被覆盖。",
    "The above code creates a new camera and assigns it to view port[0]. This camera then has its view and projection matrices set.":"上述代码将创建一个新摄像头并将其分配给 viewport[0]。然后，该相机将设置其视图矩阵和投影矩阵。",
    "The unique camera ID value returned when you created the camera.":"创建相机时返回的唯一相机 ID 值。",
    "The unique matrix ID returned when you created the matrix.":"创建矩阵时返回的唯一矩阵 ID。",
    "There are some things you need to keep in mind when using this function:":"使用此功能时，需要记住一些事情：",
    "This function will set the {}projection matrix{} for a given camera. You give the unique camera ID value (as returned by the different {}{}camera_create(){}{} functions) and a projection matrix to be applied. You can find out more about creating projection matrices from the section {}Matrix Functions{}, specifically {}{}matrix_build_projection_perspective(){}{}&nbsp;and {}{}matrix_build_projection_ortho(){}{}.":"此函数将为给定的相机设置{}投影矩阵{}。提供唯一的相机 ID 值(由不同的 {}{}camera_create(){}{} 函数返回)和要应用的投影矩阵。有关创建投影矩阵的详细信息，请参阅{}矩阵函数{}一节，特别是 {}{}matrix_build_projection_perspective(){}{} 和 {}{}matrix_build_projection_ortho(){}{}."
}