{
    "The above code will set the view camera border for the camera assigned to view port[0].":"上述代码将为分配给 viewport[0] 的相机设置视图的相机边框。",
    "The border (in pixels) for the view camera along the horizontal axis":"沿水平轴的相机边框(以像素为单位)",
    "The border (in pixels) for the view camera along the vertical axis":"沿垂直轴的相机边框(以像素为单位)",
    "The exact point that is checked against this buffer zone is the point at the&nbsp;{}x{} and&nbsp;{}y{} position for that instance, and it does not make use of its {}mask{}.":"针对该缓冲区检查的确切点是该实例的 {}x{} 和 {}y{} 位置处的点，并且它不使用其 {} 掩码 {}。",
    "The unique camera ID value returned when you created the camera.":"创建相机时返回的唯一相机 ID 值。",
    "These values will only be used when the view camera has been assigned an instance target to follow (either in the Room Editor - see&nbsp;{}Object Following{}&nbsp;- or using the function {}{}camera_set_view_target(){}{}) and relate to how far from the border of the view the instance needs to be before the view will update its position to follow.":"仅当为视图相机分配了要跟随的实例目标时，才会使用这些值 (在房间编辑器中 - 请参阅 {} 对象跟随 {}- 或使用函数 {}{}camera_set_view_target(){}{}) 并且与视图更新其要跟随的位置之前实例需要距视图边界多远有关。",
    "You can use this function to set the border size of the camera within the room.":"您可以使用此功能设置摄像机在房间内的边框大小。",
    "You can use this function to set the follow border of the view camera within the room. You give the unique camera ID value (as returned by the different {}camera_create{} functions) and then give the x border size and the y border size (horizontal and vertical). These values will only be used when the view camera has been assigned an instance target to follow (either in the Room Editor or using the function {}{}camera_set_view_target(){}{}) and relate to how far from the border of the view the instance needs to be before the view will update its position to follow.":"您可以使用此函数设置房间内视图的相机的跟随边框。给出唯一的相机ID值(由不同的{}camera_create{}函数返回)，然后给出 x 边框大小和 y 边框大小(水平和垂直)。只有在为视图的相机指定了要跟随的实例目标(在\"房间编辑器\"中或使用函数 {}{}camera_set_view_target(){}{})并且相关时，到实例需要离视图边框多远才会使用这些值，视图才会更新其位置以跟随。",
    "You give the unique camera ID value (as returned by the different {}camera_create{} functions) and then give the x border size and the y border size (horizontal and vertical).":"您提供唯一的相机 ID 值 (由不同的 {}camera_create{} 函数返回)，然后提供 x 边框大小和 y 边框大小 (水平和垂直)。"
}