{
    "Draw the surface in the Draw GUI or Post Draw event of an instance, since these events are independent of views.":"在实例的\"绘制GUI\"或\"后期绘制\"事件中绘制表面，因为这些事件与视图无关。",
    "Enable a new view and draw the surface only in that view (using {}{}view_current{}{} to check which view is being drawn)":"启用新视图并仅在该视图中绘制表面(使用 {}{}view_current{}{} 检查正在绘制的视图)",
    "In this extended example, we will create a surface and assign it to view port[0] so it captures the camera view assigned to that port, then draw that to the screen in the Draw GUI event. To start with we need to initialise our surface variable in the {}Create Event{} of a controller instance:":"在此扩展示例中，我们将创建一个表面并将其指定给 viewport[0]，以便它捕获指定给该端口的相机视图，然后将其绘制到 绘制GUI 事件中的屏幕。首先，我们需要在控制器实例的{}创建事件{}中初始化表面变量：",
    "Note that you can also set a view port to a surface using the function {}{}view_set_surface_id(){}{}.":"请注意，还可以使用函数 {}{}view_set_surface_id(){}{} 将视口设置为表面。",
    "Surfaces are {}volatile{} meaning that they could be removed from memory at any time due to OS memory management and other things, so here we check to see if our surface exists and if it doesn\u0027t we create it and assign it to the view 0. With that done, everything that would appear in view 0 will now be drawn to the surface we have created instead. If you do nothing else at this point, when you run your game you will simply get a blank screen as all drawing is being done on the surface, but the surface itself is not being drawn anywhere. Therefore we now need to draw the surface to the screen in the {}Draw GUI{} event like this:":"表面是{}易失性{}，这意味着由于系统内存管理和其他原因，它们可以随时从内存中删除，因此我们在这里检查表面是否存在，如果表面不存在，我们将创建表面并将其分配给视图0。完成此操作后，视图0中出现的所有内容现在都将被绘制到我们创建的表面。如果此时不执行任何其他操作，则在运行游戏时，您只会看到一个空白屏幕，因为所有绘制都是在表面上完成的，但表面本身不会在任何地方绘制。因此，我们现在需要在{}绘制GUI{}事件中将表面绘制到屏幕，如下所示：",
    "This code will now draw the surface that we have created from the view camera stretched to fill the entire GUI layer.":"此代码现在将绘制我们从拉伸的视图的相机创建的表面，以填充整个 GUI 层。",
    "We set the surface variable to -1, as all surface functions should really be used in the {}Draw{} events to prevent odd errors or undefined behaviours. So, with that done, we would then have this in the main {}Draw{} event:":"我们将表面变量设置为-1，因为所有表面函数都应该真正用于{}绘制{}事件，以防止出现奇怪错误或未定义的行为。因此，完成此操作后，我们将在主{}绘制{}事件中执行以下操作：",
    "With this variable you can set the contents of a given view port to draw to a surface, or get the current surface id if one has been assigned to a view port. When working with surfaces, it is often required that you capture the {}whole{} visible region of the screen to the surface, and so you would assign it to a view port using this variable. This means that everything that is shown in the chosen view will now be drawn to the assigned surface. The view will now {}not{} be drawn to the screen, meaning that you will need to either:":"使用此变量，可以将给定视口的内容设置为绘制到面，或者获取当前面 ID (如果已将其指定给视口)。使用面时，通常需要将屏幕的{}整个{}可见区域捕捉到面，以便使用此变量将其指定给视口。这意味着选定视图中显示的所有内容现在都将绘制到指定的面。现在将{}不会{}将视图绘制到屏幕上，这意味着您需要：",
    "You can also read this variable to get the index of the surface that has been assigned to the chosen view or it will return -1 if no surface has been assigned, and generally the surface used for this function should be the size of the view camera itself (not the view port). The extended example below shows a basic setup for capturing a view and drawing it in the {}Draw GUI{} event, and for more information on surfaces see the section {}Surfaces{}.":"您也可以读取此变量以获取已指定给所选视图的表面的索引，或者，如果未指定表面，它将返回-1，并且通常用于此函数的表面应为视图的相机本身的大小(而不是视口)。下面的扩展示例显示了在{}绘制GUI{}事件中捕获视图和绘制视图的基本设置，有关表面的详细信息，请参见{}表面{}一节。",
    "{}IMPORTANT{}&nbsp;Care must be taken when drawing surfaces or textures to a view with a surface assigned to it, because if you try to draw the view\u0027s assigned surface (or its texture) inside that same view, you will get an error as you are essentially trying to draw a texture onto itself.":"{}重要{} 在为具有指定表面的视图绘制表面或纹理时必须小心，因为如果您尝试在同一视图内绘制视图的指定表面(或其纹理)，则会遇到一个错误，因为您正在尝试将纹理绘制到自身上。",
    "{}{}Surface ID{}{}&nbsp;or -1 (if no surface has been assigned)":"{}{}表面 ID {}{}或 -1 (如果未指定表面)"
}