{
    "Draw the surface in the Draw GUI or Post Draw event of an instance, since these events are independent of views.":"在实例的\"绘制GUI\"或\"后期绘制\"事件中绘制曲面，因为这些事件与视图无关。",
    "Enable a new view and draw the surface only in that view (using {}{}view_current{}{} to check which view is being drawn)":"启用新视图并仅在该视图中绘制曲面(使用 {}{}view_current{}{} 检查正在绘制的视图)",
    "The above code will check to see if a surface has been assigned to the view port[0] and if it has not then one is assigned.":"以上代码将检查是否已将曲面指定给 viewport[0] ，以及是否尚未指定曲面。",
    "The surface to apply to the view":"要应用于视图的曲面",
    "The view port to target (0 - 7)":"到目标的视口 (0 - 7)",
    "When using this function you give the view port index (from 0 to 7) and a surface index (either the {}{}application_surface{}{} or the unique index value returned by the function {}{}surface_create(){}{}) or, if a surface has previously been assigned and you want to remove it, a value of -1. For more examples on setting the view port to a surface see the variable {}{}view_surface_id{}{}.":"使用此函数时，可以给出视口索引(从0到7)和曲面索引 ({}{}application_surface{}{} 或函数 {}{}surface_create(){}{} 返回的唯一索引值)，或者，如果之前已指定曲面并且要删除它，则给出 -1 的值。有关将视口设置为曲面的详细示例，请参见变量 {}{}view_surface_id{}{}。",
    "With this variable you can set the contents of a view port to draw to a surface. When working with surfaces, it is often required to capture the {}whole{} visible region of the screen to the surface, and so you would assign it to a view port using this function. This means that everything that is shown in the chosen view port will now be drawn to the assigned surface and the contents of that view port will no longer be displayed, meaning that you will need to either:":"使用此变量，可以将要绘制的视口内容设置为曲面。使用曲面时，通常需要将屏幕的{}整个{}可见区域捕获到曲面，因此您可以使用此功能将其指定给视口。这意味着，所选视口中显示的所有内容现在都将绘制到指定的曲面，并且该视口的内容将不再显示，这意味着您需要：",
    "{}IMPORTANT{}&nbsp;Care must be taken when drawing surfaces or textures to a view with a surface assigned to it, because if you try to draw the view\u0027s assigned surface (or its texture) inside that same view, you will get an error as you are essentially trying to draw a texture onto itself.":"{}重要{} 在为具有指定曲面的视图绘制曲面或纹理时必须小心，因为如果您尝试在同一视图内绘制视图的指定曲面(或其纹理)，则会遇到一个错误，因为您正在尝试将纹理绘制到自身上。"
}