{
    "Even if you have defined the physics for your objects, without a world to place them in they will default to the traditional {}GameMaker{} collision system, so you need this function to create the physics system for the specified room either\n    in an object event, or the creation code of the room itself (it can also be defined without using code in the room editor). This function will associate a physics \"world\" with the room and all instances created in the room will behave using\n    the physics that has been defined for them and the world itself.":"即使你已经为你的对象定义了物理学，如果没有一个世界来放置它们，它们将默认为传统的 {}GameMaker{} 碰撞系统，所以你需要这个函数为指定的房间创建物理系统，可以在对象事件中，也可以在房间本身的创建代码中(也可以不使用房间编辑器的代码来定义)。这个函数将把一个物理学的\"世界\"与房间联系起来，在房间中创建的所有实例将使用为它们定义的物理学和世界本身的行为。",
    "The above code will create a physics world in the current room with a scale ratio of 32 pixels being the equivalent of 1 metre.":"上述代码将在当前房间内创建一个物理世界，其比例为 32 像素，相当于 1 米。",
    "defines the ratio of pixels on screen to metres in the real world. A ratio of 32:1 will be specified as 1/32 (or 0.03125).":"定义真实世界中屏幕上像素与米的比率。32:1 的比率将指定为 1/32 (或 0.03125)。",
    "{}You\u0027ll notice that we have an argument that defines a ratio between pixel size and metres.\n    This is because the physics functions work using real-world measurements and thus we must translate pixel coordinates and pixel sizes into these real-world measurements using a \"pixel to metre scale\". You\u0027ll want to adjust the {}pixeltometrescale{}    setting until the average pixel size of the objects you are using translates roughly into simulated physics objects of an appropriate size, and above you can see that we have set it to 32 pixels being the equivalent of 1 metre. It should be noted\n    that the physics system will work with larger and smaller ratios, but that the best performance is when the real world measurements of your objects are no less than 0.1 metres and no more than 50 metres.":"{}你会注意到，我们有一个参数定义了像素大小和米之间的比例。这是因为物理函数的工作是使用现实世界的测量，因此我们必须使用 \"像素到米的比例 \"将像素坐标和像素尺寸转化为这些现实世界的测量。你要调整 {}pixeltometrescale{} 的设置，直到你使用的物体的平均像素大小大致转化为适当大小的模拟物理对象，上面你可以看到，我们将其设置为 32 像素，相当于 1 米。应该注意的是，物理系统将在更大和更小的比例下工作，但最好的性能是当你的物体的现实世界测量值不低于 0.1 米，不超过 50 米。"
}