{
    "As with all the physics functions, {}physics_world_gravity(){} will only work on an instance if the room has a physics world defined for it in the room editor or using {}{}physics_world_create(){}{}. It will\n    then use the 0,0 defining point of the physics world to calculate the direction and strength of gravity based on the vector calculated from the xg and yg inputs. Here are some images to illustrate...":"与所有物理函数一样，{}physics_world_gravity(){} 只有在房间编辑器中为其定义了物理世界或使用 {}{}physics_world_create(){}{} 时才能在实例上工作。然后，它将使用物理世界的 0,0 定义点，根据 xg 和 yg 输入计算的矢量来计算重力的方向和强度。下面是一些图片来说明...",
    "The above code will set gravity to be (assuming the room physics 0,0 is set to top left) to the right - 0 degrees - with an acceleration of 5 metres per second squared.":"上述代码将把重力设置为(假设房间物理学 0,0 设置为左上角)向右 -- 0 度，加速度为每秒平方 5 米。",
    "The x component of the gravity vector":"重力矢量的 X 分量",
    "The y component of the gravity vector":"重力矢量的 Y 分量",
    "{}As you can see, the xg,yg coordinates are relative to the position of 0,0 as defined for\n    the physics world, and the gravity itself is calculated as a vector of those two components. So, the default values of 0,10 will give you a gravity direction of down (270 degrees) with an acceleration of 10 metres per second squared. Note the {}metres per second squared{}!\n    Like all the physics functions, gravity is calculated using metres as a base measurement so the pixel to metre scale that you set in {}physics_world_create{} function is important here. Gravity is also {}cumulative{} on the object (but the\n    exact amount depends on what you have set for the function {}{}physics_fixture_set_linear_damping(){}{}), meaning that in a room with a room_speed of 60, with no damping, the instance\n    will accelerate by 10 metres per second, every second - which, if you have a 0.1 pixel to metre scale is the same as saying it will accelerate to a speed of 100 pixels per second in 60 steps.":"{}如您所见，xg、yg 坐标相对于为物理世界定义的 0,0 的位置，并且重力本身作为这两个分量的矢量进行计算。因此，默认值 0, 10 将为您提供向下(270 度)的重力方向以及每秒 10 米的加速度。请注意{}米/秒平方{}!与所有物理函数一样，重力也是使用米作为基本测量值进行计算的，因此在 {}physics_world_create{} 函数中设置的像素到米的比例非常重要。对象上的重力也是{}累积{}(但确切数量取决于您为设置的函数 {}{}physics_fixture_set_linear_damping(){}{})，这意味着在房间速度为 60 且没有阻尼的房间中，实例将以每秒 10 米的速度加速，如果您有 0.1 像素到米的比例，这与说它将以 60 步的速度加速到每秒 100 像素是相同的。"
}