{
    "A single asset tag string or an array with various asset tags.":"单个资源标签字符串或具有各种资源标签的数组。",
    "If the function succeeds in removing the tag(s) it will return {}true{} otherwise it will return {}false{}.":"如果函数成功删除标记，它将返回{}true{}，否则它将返回{}false{}。",
    "OPTIONAL! The type of asset to remove the tags from, only used when supplying an index for the first argument.":"可选!要从中删除标签的资源类型，仅在为第一个参数提供索引时使用。",
    "The above code will create an array of tags and then remove them from the given object.":"上面的代码将创建一个标签数组，然后将它们从给定的对象中删除。",
    "The name of the asset (a string) or its index value (an integer).":"资源的名称 (字符串) 或其索引值 (整数)。",
    "The given name refers to a {}Sequence{}.":"给定的名称指的是{}序列{}。",
    "The given name refers to a {}font{}.":"给定的名称指的是{}字体{}。",
    "The given name refers to a {}path{}.":"给定的名称指的是{}路径{}。",
    "The given name refers to a {}room{}.":"给定的名称指的是{}房间{}。",
    "The given name refers to a {}script{}.":"给定的名称指的是{}脚本{}。",
    "The given name refers to a {}shader{}.":"给定的名称指的是{}着色器{}。",
    "The given name refers to a {}sound{}.":"给定的名称指的是{}声音{}。",
    "The given name refers to a {}sprite{}.":"给定的名称指的是{}精灵{}。",
    "The given name refers to a {}tile set{}.":"给定的名称指的是{}图块{}。",
    "The given name refers to a {}time line{}.":"给定的名称指的是{}时间线{}。",
    "The given name refers to a&nbsp;{}Particle System{}.":"给定的名称指的是{}粒子系统{}。",
    "The given name refers to an asset that either does not exist, or is not one of the above listed.":"给定的名称指的是不存在或不是上述资源之一的资源。",
    "The given name refers to an {}Animation Curve{}.":"给定的名称指的是{}动画曲线{}。",
    "The given name refers to an {}object{}.":"给定的名称指的是{}对象{}。",
    "With this function you can remove one or more tag strings to any asset from the asset browser. You supply either the asset name (as a string) or its asset index, as well as either a single tag string or an array where each item is a single tag string. If you supply an asset index value, then you will need to supply the optional asset type argument (a constant), as assets of different types can have the same index, even though they cannot have the same name. The available asset types are listed in the table below:":"使用此函数，您可以从资源浏览器将一个或多个标签字符串删除到任何资源。您可以提供资源名称 (作为字符串) 或其资源索引，以及单个标签字符串或每个项目是单个标签字符串的数组。如果提供资源索引值，则需要提供可选的资源类型参数 (常量)，因为不同类型的资源可以具有相同的索引，即使它们不能具有相同的名称。下表列出了可用的资源类型:"
}