{
    "A single asset tag string or an array with various asset tags.":"单个资源标签字符串或具有各种资源标签的数组。",
    "If the function succeeds and one or more of the tag(s) is present for the asset then it will return {}true{} otherwise it will return {}false{}. If you need to check for a precise match to any given tag or set of tags, then use the function {}{}asset_has_tags(){}{}.":"如果函数成功，并且该资源存在一个或多个标记，则它将返回{}true{}，否则它将返回{}false{}。如果您需要检查与任何给定标签或一组标签的精确匹配，请使用函数{}{}asset_has_tags(){}{}。",
    "OPTIONAL! The type of asset to check the tags for, only used when supplying an index for the first argument.":"可选!检查标签的资源类型，仅在为第一个参数提供索引时使用。",
    "The above code will create an array of tags and then check to see if any of them are applied to the given object,&nbsp;and if they are it will create an instance of another object.":"上面的代码将创建一个标签数组，然后检查是否有任何标签应用于给定的对象，如果它们是，它将创建另一个对象的实例。",
    "The name of the asset (a string) or its index value (an integer).":"资源的名称 (字符串) 或其索引值 (整数)。",
    "The given name refers to a {}Sequence{}.":"给定的名称是指一个{}Sequence{}。",
    "The given name refers to a {}font{}.":"给定的名称指的是{}font{}。",
    "The given name refers to a {}path{}.":"给定的名称指的是{}path{}。",
    "The given name refers to a {}room{}.":"给定的名称是指{}room{}。",
    "The given name refers to a {}script{}.":"给定的名称指的是{}script{}。",
    "The given name refers to a {}shader{}.":"给定的名称指的是{}shader{}。",
    "The given name refers to a {}sound{}.":"给定的名称指的是{}sound{}。",
    "The given name refers to a {}sprite{}.":"给定的名称指的是{}sprite{}。",
    "The given name refers to a {}tile set{}.":"给定的名称是指{}tile set{}。",
    "The given name refers to a {}time line{}.":"给定的名称指的是{}time line{}。",
    "The given name refers to an asset that either does not exist, or is not one of the above listed.":"给定的名称是指不存在或不是上述资源之一的资源。",
    "The given name refers to an {}Animation Curve{}.":"给定的名称指的是{}Animation Curve{}。",
    "The given name refers to an {}object{}.":"给定的名称指的是一个{}object{}。",
    "With this function you can check to see if one or more tag strings is assigned to any asset from the asset browser. You supply either the asset name (as a string) or its asset index, as well as either a single tag string or an array where each item is a single tag string. If you supply an asset index value, then you will need to supply the optional asset type argument (a constant), as assets of different types can have the same index, even though they cannot have the same name. The available asset types are listed in the table below:":"使用此函数，您可以检查是否从资源浏览器将一个或多个标签字符串分配给任何资源。您可以提供资源名称 (作为字符串) 或其资源索引，以及单个标签字符串或每个项目是单个标签字符串的数组。如果提供资源索引值，则需要提供可选的资源类型参数 (常量)，因为不同类型的资源可以具有相同的索引，即使它们不能具有相同的名称。下表列出了可用的资源类型:"
}