{
    "A single asset tag string or an array with various asset tags.":"单个资源标签字符串或具有各种资源标签的数组。",
    "An asset type constant (listed above)":"资源类型常数 (上面列出)",
    "The above code uses the tag \"enemy\" to find all the path assets with that tag, before choosing one at random and assigning it to the instance running the code.":"上面的代码使用标签 “enemy” 来查找带有该标签的所有路径资源，然后随机选择一个并将其分配给运行代码的实例。",
    "The function will return an array, where each item in the array will be a single asset index value. If there are no assets of the type that have the given tag(s), an empty array will be returned.":"函数将返回一个数组，其中数组中的每个项目将是单个资源索引值。如果没有具有给定标记的类型的资源，则将返回一个空数组。",
    "The given name refers to a {}Sequence{}.":"给定的名称是指一个{}Sequence{}。",
    "The given name refers to a {}font{}.":"给定的名称指的是{}font{}。",
    "The given name refers to a {}path{}.":"给定的名称指的是{}path{}。",
    "The given name refers to a {}room{}.":"给定的名称是指{}room{}。",
    "The given name refers to a {}script{}.":"给定的名称指的是{}script{}。",
    "The given name refers to a {}shader{}.":"给定的名称指的是{}shader{}。",
    "The given name refers to a {}sound{}.":"给定的名称指的是{}sound{}。",
    "The given name refers to a {}sprite{}.":"给定的名称指的是{}sprite{}。",
    "The given name refers to a {}tile set{}.":"给定的名称是指{}tile set{}。",
    "The given name refers to a {}time line{}.":"给定的名称指的是{}time line{}。",
    "The given name refers to an asset that either does not exist, or is not one of the above listed.":"给定的名称是指不存在或不是上述资源之一的资源。",
    "The given name refers to an {}Animation Curve{}.":"给定的名称指的是{}Animation Curve{}。",
    "The given name refers to an {}object{}.":"给定的名称指的是一个{}object{}。",
    "With this function you can get all the assets of a given type that have the given tags assigned to them. You supply either a single tag (as a string) or an array, where each item in the array is a tag (as a string), as well as the type of asset to check. the type of asset should be one of the following constants:":"使用此函数，您可以获取给定类型的所有资源，这些资源具有分配给它们的给定标签。您可以提供单个标签 (作为字符串) 或数组，其中数组中的每个项目都是标签 (作为字符串)，以及要检查的资源类型。资源的类型应该是以下常数之一:"
}