{
    "Note that animation curves created in this way {}must be deleted when no longer required{} as they will take up space in memory otherwise, which may lead to a memory leak, slowing down and eventually crashing your game. You can remove an animation curve when no longer needed using the function {}{}animcurve_destroy(){}{}. You do not need to to clean up any channel or point data within the curve, as this will be done by the garbage collector automatically when the curve itself is destroyed.":"请注意，以这种方式创建的动画曲线{}必须在不再需要{}时删除，否则它们将占用内存空间，这可能会导致内存泄漏，减慢速度并最终使游戏崩溃。您可以在不再需要时使用函数{}{}animcurve_destroy(){}{}移除动画曲线。您不需要清理曲线内的任何通道或点数据，因为这将由垃圾收集器自动完成，当曲线本身被破坏时。",
    "The above code creates a new animation curve struct and stores it in the variable \"my_curve\". This struct is then populated with a name and a channel array. The channel array contains a single channel with three points.":"上面的代码创建了一个新的动画曲线结构，并将其存储在变量 “my_curve” 中。然后用名称和通道数组填充此结构。通道阵列包含具有三个点的单个通道。",
    "The function will return a pointer to the struct and this is then used to add channels and other data to the animation curve. You can also supply this to functions like {}{}animcurve_get(){}{} to later get the data from the curve.":"该函数将返回一个指向结构的指针，然后将其用于向动画曲线添加通道和其他数据。您还可以将其提供给 {}{}animcurve_get(){}{} 之类的函数，以便以后从曲线中获取数据。",
    "This function creates an empty animation curve {}struct{}, ready for you to populate with channel data.":"此函数将创建一个空的动画曲线{}struct{}，供您填充通道数据。",
    "This function will create an empty animation curve {}struct{}, ready for you to populate with channel data. The function will return a pointer to the struct and this is then used to add channels and other data to the animation curve. You can also supply this to functions like {}{}animcurve_get(){}{} to later get the data from the curve.":"此函数将创建一个空的动画曲线{}struct{}，供您填充通道数据。该函数将返回一个指向结构的指针，然后将其用于向动画曲线添加通道和其他数据。您还可以将其提供给{}animcurve_get(){}{}之类的函数，以便以后从曲线中获取数据。",
    "When you use this function, the struct created will have no data in it, and to use it you should add at least one channel and the channel should have points added to it. To add a channel, see the function {}{}animcurve_channel_new(){}{}, and to add points to the channel, see the function {}{}animcurve_point_new(){}{}. Additionally you can give the animation curve struct a name by setting the \"name\" variable (as shown in the example code, below). Channels added to a new animation curve should be added as an {}array{}, where each item in the array references a channel struct, and the points in a channel should also be added as an array, where each array item references a point struct.":"当您使用此函数时，创建的结构将没有数据，要使用它，您应该至少添加一个通道，并且该通道应该添加点。要添加通道，请参见函数{}{}animcurve_channel_new(){}{}, 要向通道添加点，请参见函数{}{}animcurve_point_new(){}{}。此外，您可以通过设置 “名称” 变量为动画曲线结构命名 (如下面的示例代码所示)。添加到新动画曲线的通道应添加为{}数组{}, 其中数组中的每个项目引用一个通道结构，并且通道中的点也应添加为数组，其中每个数组项目引用一个点结构。"
}