{
    "Animation Curve Channel Struct":"动画曲线通道结构",
    "Animation Curve Interpolation Type Constant":"动画曲线插值类型常数",
    "If the channel is using catmull-rom (\"smooth\") interpolation this holds how many points have been generated for each segment of the curve (note that these extra points are internal to the function and only used for the runtime calculations). If the channel is using linear interpolation, this value will still exist but can be ignored as it has no bearing on how the curve is interpolated.":"如果通道使用catmull- rom (“平滑”) 插值，则可以保存为曲线的每段生成了多少个点 (请注意，这些额外的点在函数内部，仅用于运行时计算)。如果通道使用线性插值，则该值仍将存在，但可以忽略，因为它与曲线的插值方式无关。",
    "The above code creates a new animation curve struct and stores it in the variable \"my_curve\". This struct is then populated with a name and a channel array. The channel array contains a single channel with three points.":"上面的代码创建了一个新的动画曲线结构，并将其存储在变量 “my_curve” 中。然后用名称和通道数组填充此结构。通道阵列包含具有三个点的单个通道。",
    "This function can be used to create a new animation curve channel {}struct{}. A channel struct has the following variables:":"该函数可用于创建新的动画曲线通道{}struct{}。通道结构具有以下变量:",
    "This is an array, where each item in the array is an&nbsp;{}{}Animation Curve Point Struct{}{}.":"这是一个数组，其中数组中的每个项目都是一个{}{}Animation Curve Point Struct{}{}。",
    "This is the name of the channel.":"这是通道的名称。",
    "This will be one of the constants given in the table below.":"这将是下表中给出的常数之一。",
    "Used for Bezier interpolation between points.":"用于点之间的贝塞尔插值。",
    "Used for linear interpolation between points.":"用于点之间的线性插值。",
    "Used for smooth interpolation between points using catmull-rom interpolation.":"用于使用catmull- rom插值进行点之间的平滑插值。",
    "{} By default when you create a new channel struct, the \"name\" variable will be an empty string, the \"type\" will be {}animcurvetype_linear{} and the \"iterations\" will be 16. All these variables can be set to the values that you require (note that the \"iterations\" value has no effect on linear curve types). Once created you need to add points to the curve, which is done by adding different point structs to the \"points\" {}array{}. These point structs can be created using the function {}{}animcurve_point_new(){}{}.":"{}默认情况下，当您创建新的通道结构时，“名称” 变量将是一个空字符串，“类型” 将是{}animcurvetype_linear{}，“迭代” 将是16。所有这些变量都可以设置为您需要的值 (请注意，“迭代” 值对线性曲线类型没有影响)。创建后，您需要将点添加到曲线，这是通过将不同的点结构添加到 “点”{}数组{}来完成的。这些点结构可以使用函数{}{}animcurve_point_new(){}{}创建。"
}