{
    "&nbsp;{}{}NOTE{}{}&nbsp;Each of these functions&nbsp;takes the index of the {}particle system{}&nbsp;to which it belongs as a first argument.":"{}{}注意{}{}这些函数中的每一个都将其所属的{}粒子系统{}的索引作为第一个参数。",
    "Function Reference":"函数参考",
    "Particle Emitters":"粒子发射器",
    "Particle {}emitters {}are used by {}GameMaker{} to emit particles over an area of the screen which can have different forms and distributions. They can also either create a continuous stream of particles or they can burst out a number of particles all at once, depending on the way the functions are used.":"{}GameMaker{}使用粒子{}发射器{}在屏幕上具有不同形式和分布的区域上发射粒子。它们还可以创建连续的粒子流，或者根据函数的使用方式，它们可以一次性爆发出许多粒子。",
    "Since a particle emitter is a dynamically created resource, you must create it and store the returned index in a variable to reference the emitter in all further function calls, and it is very important that you also destroy the emitter when it is no longer needed or else you will have a memory leak that will slow down and eventually crash your game. It is also worth noting that particle emitters will live on forever after they are created, even if the index is no longer stored. So even if you change room or restart the game, the systems and the particles will remain, and be visible, in all further rooms so you should ensure you destroy them once you no longer need them.":"由于粒子发射器是动态创建的资源，因此必须创建粒子发射器并将返回的索引存储在变量中，以便在所有进一步的函数调用中引用该发射器，并且在不再需要该发射器时也销毁该发射器非常重要，否则会导致内存泄漏，从而降低速度并最终导致游戏崩溃。另外值得注意的是，粒子发射器在创建后将永远存在，即使索引不再存储。因此，即使您更换空间或重新启动游戏，系统和粒子仍将保留，并且可以在所有其他房间中看到，所以您应该确保在不再需要它们时将其销毁。",
    "The following functions are available to set the emitters and to let them create particles. Note that each of them gets the index of the {}particle system{}&nbsp;to which it belongs as a first argument.":"以下函数可用于设定发射器并允许它们创建粒子。请注意，每个参数都将获取其所属的 {} 粒子系统 {} 的索引作为第一个参数。",
    "{}{}TIP{}{}&nbsp;If you prefer a more visual approach to creating particles and don\u0027t need the extensive functionality that&nbsp;{}GML Code{}&nbsp;offers,&nbsp;you can also create a&nbsp;{}{}Particle System Asset{}{}&nbsp;using&nbsp;{}The Particle System Editor{}.":"{}{} 提示{}{} 如果您更喜欢使用更直观的方法来创建粒子，并且不需要 {}GML 代码 {} 提供的大量功能，也可以使用 {} 粒子系统编辑器 {} 创建 {6}{7} 粒子系统资源 {8}{9}。",
    "{}{}TIP{}{}&nbsp;If you prefer a more visual approach to creating particles and don\u0027t need the extensive functionality that&nbsp;{}GML Code{}&nbsp;offers,&nbsp;you can also create a&nbsp;{}{}Particle System Asset{}{}&nbsp;using&nbsp;{}The Particle System Editor{}. Additionally, you can generate the&nbsp;{}GML Code{}&nbsp;for it using the editor\u0027s {}Copy GML to Clipboard{} {}.":"{}{} 提示{}{} 如果您喜欢更直观的方法来创建粒子，并且不需要 {}GML 代码 {} 提供的大量功能，则还可以使用 {10} 粒子系统编辑器 {11} 创建 {}{} 粒子系统资源 {}{}。此外，还可以使用编辑器的 {} 复制 GML 到剪贴板 {}{} 为其生成 {12}GML 代码 {13}。"
}