{
    "\"{}ps_create_backup{}\" -&nbsp;{}(PlayStation&nbsp;only){}&nbsp;- Setting this to {}true{} makes sure that the save data is backed up when the save directory is unmounted (i.e. when the {}{}buffer_async_group_end(){}{} function is called). See the console documentation for more information.":"\"{}ps_create_backup{}\"-{}(仅限 PlayStation){}-将其设置为{}true{}可确保在卸载保存目录时(即调用{}{}buffer_async_group_end (){}{}函数时)备份保存数据。有关更多信息，请参阅控制台文档。",
    "\"{}savepadindex{}\" - For this option you would specify the {}pad index{} of the player who is saving {}or{} loading and the system will write data to and read data from this player\u0027s save folder.":"\"{}savepadindex{}\"-对于此选项，您需要指定正在保存{}或{}加载的玩家的{}pad 索引{}，系统将向该玩家的保存文件夹写入数据并从中读取数据。",
    "\"{}saveslotsize{}\" - This option requires that you specify the actual size in bytes you want to save (so you can do a {}{}buffer_seek(){}{} and {}{}buffer_tell(){}{} to get that, for example). Note that it is not obligatory to supply this value as all saves are pre-assigned a minimum space, which usually varies with the target platform.":"\"{}saveslotsize{}\"-此选项要求您指定要保存的实际大小(例如，您可以使用{}{}buffer_seek(){}{}和{}{}buffer_tell(){}{}来获得它)。请注意，并非必须提供此值，因为所有保存都预先分配了最小空间，这通常因目标平台而异。",
    "\"{}showdialog{}\" - The value for this option is a boolean {}true{} or {}false{}. If set to {}true{}, when you save {}or{} load {}GameMaker{} will show the System UI, otherwise it will do a quicksave/quickload with no UI shown. You normally only need this if you\u0027re supporting multiple save slots to allow the user to pick a slot, but if you just support one slot per user, set this to {}false{}.":"\"{}showdialog{}\"-此选项的值是布尔值{}true{}或{}false{}。如果设置为{}true{}，当你保存{}或{}load{}时，GameMaker{}将显示系统界面，否则它将在不显示用户界面的情况下快速保存/快速加载。通常，只有当你支持多个保存槽以允许用户选择一个槽位时，你才需要这个，但如果你只支持每个用户一个插槽，请将其设置为{}false{}。",
    "\"{}subtitle{}\" or \"{}slottitle{}\" - The value for this option would be a string, which will be shown to the user when managing their save data in the OS. This is only important when saving data, not when loading again.":"\"{}subtitle{}\" 或 \"{}slottitle{}\"-此选项的值将是一个字符串，将在操作系统中管理用户的保存数据时显示给用户。这仅在保存数据时很重要，在再次加载时不重要。",
    "The above code starts a buffer group then sets the group options before it sets 4 files to save asynchronously. The group definition is then ended (at which point saving will begin).":"上面的代码启动一个缓冲区组，然后设置组选项，然后设置4个文件异步保存。然后结束组定义(此时将开始保存)。",
    "The option to set.":"设置选项。",
    "The value to set (can be a real or string, depending on the option).":"要设置的值(可以是实数或字符串，取决于选项)。",
    "With this function you can set some platform specific options for the buffer group being saved/loaded. The options available are as follows:":"使用此函数，您可以为正在保存/加载的缓冲区组设置一些平台特定的选项。可用选项如下：",
    "{}IMPORTANT!{} This function is currently only valid for the PSVita, PS4 and XBox One target modules. On all the other targets it will do nothing.":"{}重要！{}此函数目前仅对PSVita、PS4和Xbox One目标模块有效。在所有其他目标上，它什么也不会做。"
}