{
    "A buffer of fixed size.":"固定大小的缓冲区。",
    "A buffer that will \"grow\" dynamically as data is added":"一个缓冲区，将在添加数据时动态 \"增长\"",
    "A buffer where the data will \"wrap\". When the data being added reaches the limit of the buffer size, the overwrite will be placed back at the start of the buffer, and further writing will continue from that point.":"数据将在其中\"包装\"的缓冲区。当添加的数据达到缓冲区大小的限制时，覆盖将被放回缓冲区的开头，并从该点继续进一步写入。",
    "Apart from the buffer type, you will also have to set the {}byte alignment{} for the buffer. This value will vary depending on the data that you wish to store in the buffer, and in most cases a value of 1 is perfectly fine. However, be aware that for some operations a specific alignment is {}essential{}, and an incorrect alignment may cause errors (for further details on alignment see {}Buffers{}). The following is a general guide to show which values are most appropriate for each data type (when in doubt, use an alignment of 1):":"除了缓冲区类型之外，您还必须为缓冲区设置{}字节对齐{}。此值将根据您希望存储在缓冲区中的数据而变化，并且在大多数情况下，值为1是完全可以的。但是，请注意，对于某些操作，特定的对齐是{}必不可少的{}，并且不正确的对齐可能会导致错误 (有关对齐的更多详细信息，请参见{}缓冲区{})。以下是显示哪些值最适合每种数据类型的通用指南 (如有疑问，请使用1的对齐方式):",
    "Buffer Type Constant":"缓冲区类型常量",
    "Floats of up to 16bits should be aligned to 2 bytes. {}(Not currently supported!){}":"最多16位的浮点数应与2个字节对齐。{}(当前不支持!){}",
    "Floats of up to 32bits should be aligned to 4 bytes.":"最多32位的浮点数应与4字节对齐。",
    "Floats of up to 64bits should be aligned to 8 bytes.":"最多64位的浮点数应与8个字节对齐。",
    "Signed or unsigned 16bit integers should be aligned to 2 bytes.":"有符号或无符号的16位整数应对齐2字节。",
    "Signed or unsigned 32bit integers should be aligned to 4 bytes":"有符号或无符号的32位整数应对齐为4字节",
    "Signed or unsigned 8bit integers can be aligned to any value, but note that for a fast buffer (see {}{}buffer_write(){}{}) it {}must{} be aligned to 1.":"有符号或无符号的8位整数可以与任何值对齐，但是请注意，对于快速缓冲区 (请参阅{}{}buffer_write(){}{})，它{}必须{}与1对齐。",
    "Special \"stripped\" buffer that is extremely fast to read/write to. Can only be used with {}buffer_u8{} {}data types{}, and {}must{} be 1 byte aligned.":"读取/写入速度极快的特殊 \"剥离\" 缓冲区。只能与{}buffer_u8{}{}数据类型{}一起使用，而{}必须{}为1字节对齐。",
    "Strings should be aligned to 1 byte.":"字符串应对齐为1字节。",
    "The above code allocates 16384 bytes of memory to a buffer and returns the index of that buffer, which is stored in the variable \"player_buffer\", for future use. The buffer is aligned to a two byte boundary.":"上面的代码将16384字节的内存分配给缓冲区，并返回该缓冲区的索引，该索引存储在变量 \"player_buffer\" 中，以备将来使用。缓冲区对齐到两个字节的边界。",
    "The byte alignment for the buffer":"缓冲区的字节对齐",
    "The size (in bytes) of the buffer.":"缓冲区的大小 (以字节为单位)。",
    "The type of buffer to create (see the constants list above).":"要创建的缓冲区类型 (请参见上面的常量列表)。",
    "This type of buffer is to be used as a vertex buffer only.":"这种类型的缓冲区仅用作顶点缓冲区。",
    "You use this function to allocate a portion of memory as a buffer in your game, with the function returning the unique {}buffer id{} that should be stored in a variable and used for all further function calls to the buffer. The buffer can then be used to store different types of data (specified when you write to the buffer using the {}{}buffer_write(){}{} function, with the following constants being used to define the buffer type:":"您可以使用此函数将一部分内存分配为游戏中的缓冲区，该函数返回唯一的{}缓冲区 ID{}，该缓冲区应存储在变量中，用于对缓冲区的所有后续函数调用。然后，该缓冲区可用于存储不同类型的数据(使用{}{}buffer_write (){}{}函数写入缓冲区时指定，使用以下常量定义缓冲区类型：",
    "{}NOTE{}: Byte alignment can be very important as the wrong choice may adversely affect performance.":"{}注意{}: 字节对齐可能非常重要，因为错误的选择可能会对性能产生不利影响。",
    "{}NOTE{}: It\u0027s important that you remove any dynamically created resources like this from memory when you no longer need them to prevent memory leaks, so when you are finished with the buffer that you have created you should free it up again using {}{}{}buffer_delete(){}{}{}.":"{}注意{}: 重要的是，当您不再需要它们以防止内存泄漏时，从内存中删除任何动态创建的资源，因此，当您用完创建的缓冲区时，您应该使用{}{}{}buffer_delete(){}{}{}{}再次释放它。"
}