{
    "The above code will copy the vertex data stored in the vertex buffer indexed in the variable \"model_buffer\", and then paste it into the buffer indexed in the variable \"player_buffer\".":"上述代码将复制存储在变量\"model_buffer\"中索引的顶点缓冲区中的顶点数据，然后将其粘贴到变量\"player_buffer\"中索引的缓冲区中。",
    "The index of the buffer to copy {}to{}.":"要复制{}到{}的缓冲区索引。",
    "The index of the vertex buffer to copy {}from{}.":"要从{}复制{}的顶点缓冲区的索引。",
    "The offset position to copy the data to (in bytes).":"将数据复制到(以字节为单位)的偏移位置。",
    "The starting vertex.":"起始顶点。",
    "The total number of vertices to use.":"要使用的顶点总数。",
    "This function can be used to copy some (or all) of the vertex data stored in one vertex buffer into a previously created regular buffer. When copying from a vertex buffer into a regular buffer with this function, both buffers must have previously been created (using the {}{}vertex_create_buffer(){}{} and {}{}buffer_create(){}{} functions, for example). You can specify the range of vertex data that you wish to copy into the buffer, where the start vertex can be anywhere between 0 and the number of vertices -1, and you can give the number of vertices from that point on to copy. You can use the function {}{}vertex_get_number(){}{} on the vertex buffer to get the total number of vertices stored. Finally you give the buffer index to copy the vertex data into, as well as a data offset to define the position to copy the vertex data to in the destination buffer.":"此函数可用于将存储在一个顶点缓冲区中的部分(或全部)顶点数据复制到先前创建的常规缓冲区中。使用此函数从顶点缓冲区复制到常规缓冲区时，两个缓冲区必须事先创建过(例如，使用{}{}vertex_create_buffer(){}{}和{}{}buffer_create(){}{}函数)。您可以指定要复制到缓冲区的顶点数据的范围，其中起始顶点可以介于 0 和顶点数 1 之间的任何位置，并且可以给出从该点开始复制的顶点数。你可以使用顶点缓冲区上的函数{}{}vertex_get_number(){}{}来获取存储的顶点总数。最后，你给出要将顶点数据复制到的缓冲区索引，以及一个数据偏移量，用于定义将顶点数据复制到目标缓冲区中的位置。",
    "此函数可用于将存储在一个顶点缓冲区中的部分(或全部)顶点数据复制到先前创建的常规缓冲区中。使用此函数从顶点缓冲区复制到常规缓冲区时，两个缓冲区必须事先创建过(例如，使用{}{}vertex_create_buffer (){}{}{}和{}{}buffer_create (){}函数)。您可以指定要复制到缓冲区的顶点数据的范围，其中起始顶点可以介于 0 和顶点数 1 之间的任何位置，并且可以给出从该点开始复制的顶点数。你可以使用顶点缓冲区上的函数{}{}vertex_get_number (){}来获取存储的顶点总数。最后，你给出要将顶点数据复制到的缓冲区索引，以及一个数据偏移量，用于定义将顶点数据复制到目标缓冲区中的位置。{}":"此函数可用于将存储在一个顶点缓冲区中的部分( 或全部) 顶点数据复制到先前创建的常规缓冲区中。使用此函数从顶点缓冲区复制到常规缓冲区时，两个缓冲区必须事先创建过( 例如，使用{}{}vertex_create_buffer(){}{}{}和{}{}buffer_create(){}函数)。您可以指定要复制到缓冲区介的顶点数据的范围，其中起始顶点可以可以于0和顶点数1之间的任何位置，并且点数给出从该点开始复制顶。你可以使用顶点缓冲区上的函数{}{}vertex_get_number(){}来获取存储的顶点总数。最后，你给出要将顶点数据复制到的缓冲区索引，以及一个数据偏移量，用于定义将顶点数据复制到目标缓冲区中的位置。{}"
}