{
    "The above code will use the {}mp_grid_path{} function to generate a path and store it in the variable \"path\". If the path is successfully created, it is then drawn on the screen at a position relative to the instance running the code.":"上述代码将使用{}mp_grid_path{}函数生成路径并将其存储在变量\"路径\"中。如果路径创建成功，则会在屏幕上相对于运行代码的实例的某个位置绘制该路径。",
    "The path to draw":"绘制的路径",
    "The x coordinate of where the path is drawn":"绘制路径的位置的x坐标",
    "The y coordinate of where the path is drawn":"绘制路径的位置的y坐标",
    "Whether the path is drawn at the absolute position ({}true{}) or the relative position ({}false{})":"无论是在绝对位置({}true{})还是在相对位置({}false{})绘制路径",
    "With this function you can get {}GameMaker{} to draw a path to the screen. The path will be drawn as a simple line, and can be either relative to the calling instance or at the absolute position it was created at in the path editor or through code. This function is extremely useful when debugging dynamic paths (for example, those created for instances with the {}{}mp_grid_path(){}{} function).":"使用此函数，您可以让{}GameMaker{}绘制到屏幕的路径。路径将绘制为一条简单的线，并且可以相对于调用实例，也可以位于路径编辑器中或通过代码创建的绝对位置。此函数在调试动态路径(例如，为使用{}{}mp_grid_path(){}{}函数的实例创建的路径)时非常有用。",
    "{}NOTE{}: If you are wanting to draw a shape using a shader, you should be aware that most shaders expect the following inputs: vertex, texture, Colour. However, when using this function, only vertex and colour data are being passed in, and so the shader may not draw anything (or draw something but not correctly). If you need to draw shapes in this way then the shader should be customised with this in mind.":"{}注意{}：如果要使用着色器绘制形状，请注意，大多数着色器都需要以下输入：顶点、纹理、颜色。但是，使用此函数时，仅传入顶点和颜色数据，因此着色器可能无法绘制任何内容(或绘制某些内容但不正确)。如果需要以这种方式绘制形状，则应考虑到这一点对着色器进行自定义。",
    "{}{}NOTE{}{}&nbsp;If you want to draw a shape using a shader, you should be aware that most shaders expect the following inputs: vertex, texture, colour. However, when using this function, only vertex and colour data are being passed in, and so the shader may not draw anything (or draw something but not correctly). If you need to draw shapes in this way then the shader should be customised with this in mind.":"{}{} 注意{}{} 如果您想使用着色器绘制形状，您应该知道大多数着色器需要以下输入：顶点、纹理、颜色。但是，当使用此函数时，仅传入顶点和颜色数据，因此着色器可能不会绘制任何内容 (或绘制某些内容但不正确)。如果您需要以这种方式绘制形状，那么应该在定制着色器时考虑到这一点。"
}