{
    "The above code will draw an arrow from the position of the instance to the position of the mouse, with the arrow head being 10 pixels long.":"上述代码将从实例的位置绘制一个箭头到鼠标的位置，箭头长度为10像素。",
    "The length of the arrow in pixels.":"箭头的长度(以像素为单位)。",
    "The x coordinate of the end of the line (where the arrowhead ends).":"直线终点(箭头终点处)的x坐标。",
    "The x coordinate of the start of the line.":"直线起点的x坐标。",
    "The y coordinate of the end of the line (where the arrowhead ends).":"直线终点(箭头终点处)的y坐标。",
    "The y coordinate of the start of the line.":"直线起点的y坐标。",
    "This function will draw an arrow from point (x1,y1) to point (x2,y2). The stem of the arrow is drawn along these points with the actual arrow head being drawn at the end, where the size of the arrowhead is defined by the argument \"size\" and is calculated as being part of the stem so that the end point is always aligned with the position defined by x2,y2. The width of the arrow head is calculated automatically in proportion to the length.":"此函数将绘制从点(x 1, y 1 )到点(x 2, y 2 )的箭头。箭头的箭头柄沿着这些点绘制，最后绘制实际箭头，其中箭头的大小由参数\"size\"定义，并且作为阀杆的一部分进行计算，以便终点始终与x 2、y 2定义的位置对齐。箭头的宽度将根据长度的比例自动计算。",
    "{}NOTE{}: If you are wanting to draw a shape using a shader, you should be aware that most shaders expect the following inputs: vertex, texture, Colour. However, when using this function, only vertex and colour data are being passed in, and so the shader may not draw anything (or draw something but not correctly). If you need to draw shapes in this way then the shader should be customised with this in mind.":"{}注意{}：如果要使用着色器绘制形状，请注意，大多数着色器都需要以下输入：顶点、纹理、颜色。但是，使用此函数时，仅传入顶点和颜色数据，因此着色器可能无法绘制任何内容(或绘制某些内容但不正确)。如果需要以这种方式绘制形状，则应考虑到这一点对着色器进行自定义。",
    "{}{}NOTE{}{}&nbsp;If you want to draw a shape using a shader, you should be aware that most shaders expect the following inputs: vertex, texture, colour. However, when using this function, only vertex and colour data are being passed in, and so the shader may not draw anything (or draw something but not correctly). If you need to draw shapes in this way then the shader should be customised with this in mind.":"{}{} 注意{}{} 如果您想使用着色器绘制形状，您应该知道大多数着色器需要以下输入：顶点、纹理、颜色。但是，当使用此函数时，仅传入顶点和颜色数据，因此着色器可能不会绘制任何内容 (或绘制某些内容但不正确)。如果您需要以这种方式绘制形状，那么应该在定制着色器时考虑到这一点。"
}