{
    "Example:":"示例：",
    "Returns:":"返回：",
    "Syntax:":"语法：",
    "The above code will draw a 4 vertex triangle strip (making a rectangle) textured with the texture held in the \"tex\" variable, and the whole texture will be used to cover the completed primitive.":"上面的代码将绘制一个4顶点三角形条(制作一个矩形)，纹理保存在\"tex\"变量中，整个纹理将用于覆盖完成的基元。",
    "The above code will draw a 4 vertex triangle strip (making a rectangle) textured with the texture held in the {}_tex{}&nbsp;variable, and the whole texture will be used to cover the completed primitive.":"上面的代码将绘制一个 4 顶点三角形条 (形成一个矩形)，并使用 {}_tex{} 变量中保存的纹理进行纹理化，并且整个纹理将用于覆盖已完成的图元。",
    "The fraction of the height of the texture. 0 corresponds to the top side of the sprite on the texture page. 1 corresponds to the bottom side of the sprite on the texture page.":"纹理高度的分数。 0 对应于纹理页面上精灵的顶部。 1 对应于纹理页面上精灵的底侧。",
    "The fraction of the width of the texture. 0 corresponds to the left side of the sprite on the texture page. 1 corresponds to the right side of the sprite on the texture page.":"纹理宽度的分数。 0 对应于纹理页面上精灵的左侧。 1 对应于纹理页面上精灵的右侧。",
    "The height of the texture sample to use.":"要使用的纹理采样的高度。",
    "The width of the texture sample to use.":"要使用的纹理采样的宽度。",
    "The x coordinate of the vertex.":"顶点的x坐标。",
    "The y coordinate of the vertex.":"顶点的y坐标。",
    "This function defines the position of a textured vertex for a primitive. The final look of the primitive will depend on the primitive type chosen to draw (See {}{}draw_primitive_begin(){}{} for more information), the order with which you add the vertexes to it and the position of the start point you set for the texture. To end and draw the primitive you must call {}{}draw_primitive_end(){}{}.":"此函数定义基元的纹理顶点的位置。基元的最终外观将取决于选择绘制的基元类型(有关详细信息，请参阅{}{}draw_primitive_begin(){}{})、向其添加顶点的顺序以及为纹理设置的起点位置。要结束并绘制基元，您必须调用{}{}draw_primitive_end(){}{}.",
    "This function defines the position of a textured vertex for a primitive. The final look of the primitive will depend on the primitive type chosen to draw (See&nbsp;{}{}draw_primitive_begin{}{} for more information), the order with which you add the vertices to it and the position of the start point you set for the texture. To end and draw the primitive you must call {}{}draw_primitive_end{}{}.":"该函数定义图元的纹理顶点的位置。图元的最终外观将取决于选择绘制的图元类型 (有关详细信息，请参阅 {}{}draw_primitive_begin{}{})、向其添加顶点的顺序以及您设置的起点的位置对于纹理。要结束并绘制图元，您必须调用 {}{}draw_primitive_end{}{}。",
    "When drawing a textured primitive, the texture will be blended with the colour set by {}{}draw_set_colour{}. This means that to draw the texture with no blending this should be set to {}c_white{}, as shown in the example below.{}":"绘制带纹理的基元时，纹理将与{}{}draw_set_colour{}设置的颜色混合。这意味着要绘制不带混合的纹理，应将其设置为{}c_white{}，如下例所示。{}",
    "When drawing a textured primitive, the texture will be blended with the colour set by&nbsp;{}{}draw_set_colour{}{}. This means that to draw the texture with no blending this should be set to {}c_white{}, as shown in the example below.":"绘制纹理图元时，纹理将与 {}{}draw_set_colour{}{} 设置的颜色混合。这意味着要绘制不进行混合的纹理，应将其设置为 {}c_white{}，如下例所示。",
    "You can also choose to draw only {}part{} of the texture over the surface of the primitive by setting the appropriate xtex/ytex position to sample to (these coordinates are also known as the {}UV{} points). This point is defined by a value between 0 and 1 with the top left corner of the image to use being the (0,0) point and the bottom right corner being the (1,1) point. In this way you can texture a primitive with only a part of the source image asset.":"也可以通过设置要采样到的相应xtex/ytex位置(这些坐标也称为{}{}Uv点)来选择在基元表面上绘制纹理的{}部分{}。该点由介于0和1之间的值定义，要使用的图像的左上角为(0,0 )点，右下角为(1,1 )点。通过这种方式，可以仅使用源图像资源的一部分对基元进行纹理。",
    "You can also choose to draw only {}part{} of the texture over the surface of the primitive by setting the appropriate xtex/ytex position to sample to (these coordinates are also known as the {}UV{} points). This point is defined by a value between 0 and 1, with the top-left corner of the sprite image to use being the (0, 0) point and the bottom-right corner being the (1, 1) point. In this way you can texture a primitive with only a part of the source image asset.":"您还可以通过设置要采样的适当 xtex/ytex 位置 (这些坐标也称为 {}UV{} 点) 来选择仅在图元表面上绘制纹理的 {} 部分 {}。该点由 0 到 1 之间的值定义，要使用的精灵图像的左上角为 (0, 0) 点，右下角为 (1, 1) 点。通过这种方式，您可以仅使用源图像资源的一部分来对图元进行纹理化。",
    "{}{}NOTE{}{} For a texture to repeat it must be a power of two in size, ie: 32x32, 128x128, etc...":"{}{}注意{}{}要重复纹理，它的大小必须是2的幂，即：32x32、128x128等…",
    "{}{}NOTE{}{}&nbsp;For a texture to repeat it must be a power of two in size, i.e.: 32x32, 128x128, etc.":"{}{} 注意{}{} 对于要重复的纹理，其大小必须是 2 的幂，即：32x32、128x128 等。"
}