{
    "A primitive is a type of drawing done using points to define what is shown on the screen. They can be made up of single points, lines, or triangles and can be coloured, have alpha blending and even be given a texture, which means that they can be used to create some very exciting effects in a 2D game! For example, you can create a rectangle using multiple triangle primitives, then texture it with a flag sprite and in the draw event of an instance have that flag \"wave\" in the wind and distort the sprite you used by simply modifying the points that form the primitive.":"原语是一种使用点定义屏幕上显示内容的绘图类型。它们可以由单点、直线或三角形组成，并可以着色、进行Alpha混合甚至赋予纹理，这意味着它们可以用来在2D游戏中创造一些非常令人兴奋的效果！例如，可以使用多个三角形基本体创建矩形，然后使用标记子画面对其进行纹理处理，并且在实例的绘制事件中具有风中的\"波浪\"标记，并通过简单地修改形成原语的点来扭曲所使用的子画面。",
    "For an overview of how to build primitives using the vertex functions, see:":"有关如何使用顶点函数构建基本体的概述，请参见：",
    "Information on drawing primitives can be found on the following pages:":"有关绘图原语的信息，请参见以下页面：",
    "Once you have created your vertex format (see the section above) you can then use it to build the primitives that you want to draw using the following veretx buffer functions:":"创建顶点格式(请参见上面的部分)后，可以使用它来构建要使用以下veretx缓冲区函数绘制的基本体：",
    "{}GameMaker{}&nbsp;permits you to define your own {}vertex formats{} from which you can create your own custom primitives. This can greatly speed up shader operations or can be used to extend their capabilities and create surprising effects. You can find information on this in the following sections:":"{}GameMaker{}允许您定义自己的{}顶点格式{}，从中可以创建自己的自定义基元。这可以大大加快着色器操作的速度，也可以用于扩展其功能并创建令人惊讶的效果。您可以在以下部分中找到有关此的信息：",
    "{}IMPORTANT!{} The primitives that you build should follow the format that you have set using the Vertex Format functions, so if you have defined a vertex format with only positional data, there is no point building your primitive with colour data. You should note that the order in which you add properties to the primitive you are building is defined by the order in which you added these properties when creating the vertex format, so if you have defined the vector format with the order position, colour and texture coordinate, you {}must{} add these properties to the primitive being built in the same order otherwise you will get errors.":"{}重要信息!{}构建的基本体应遵循使用\"顶点格式\"功能设置的格式，因此，如果定义的顶点格式仅包含位置数据，则无需使用颜色数据构建基本体。请注意，向正在构建的基本体添加特性的顺序由创建顶点格式时添加这些特性的顺序定义，因此，如果已使用顺序位置、颜色和纹理坐标定义了矢量格式，则{}必须{}将这些特性添加到正在以相同顺序构建的基本体，否则将出现错误。",
    "{}WARNING! {}These functions do not work with the HTML5 module unless you have enabled OpenGL in the {}Game Options{}.":"{}警告！{}除非您在{}游戏选项{}中启用了OpenGL，否则这些功能不能与HTML5模块一起使用。"
}