{
    "The above code creates a new vertex buffer and store its handle in the variable {}v_buff{}.":"上述代码创建一个新的顶点缓冲区并将其句柄存储在变量 {}v_buff{} 中。",
    "The above code will create a new a new vertex buffer and store its handle in the variable \"v_buff\".":"上述代码将创建一个新的顶点缓冲区，并将其句柄存储在变量\"v_buffs\"中。",
    "The function will return a handle to the buffer which should then be used in all further calls to it.":"该函数将返回缓冲区的句柄，然后应在对其进行的所有进一步调用中使用该句柄。",
    "This function creates a new vertex buffer. This is a special {}grow{} buffer created by {}GameMaker{} which is pre-formatted for use when building primitives (for use with shaders, for example).":"该函数创建一个新的顶点缓冲区。这是由 {}GameMaker{} 创建的特殊 {}grow{} 缓冲区，已预先格式化以供构建基元时使用 (例如，与着色器一起使用)。",
    "When using a vertex buffer created with this function you simply call {}{}vertex_begin(){}{} to start assigning vertex data to it to start to define your custom primitive, which will then be held in the buffer ready for submission to the shader. The buffer can be re-used when necessary (unless you have used the {}{}vertex_freeze(){}{} function), with each call of {}{}vertex_begin(){}{} wiping the previous buffer data ready to accept the new data.":"使用使用此函数创建的顶点缓冲区时，只需调用{}{}vertex_begin(){}{}即可开始为其指定顶点数据，以开始定义自定义基元，然后将该基元保存在缓冲区中，以便提交到着色器。必要时可以重新使用缓冲区(除非您已使用{}{}vertex_freeze(){}{}函数)，每次调用{}{}vertex_begin(){}{}都会擦除先前的缓冲区数据，以便接受新数据。",
    "When using a vertex buffer created with this function you simply call&nbsp;{}{}vertex_begin{}{} to start assigning vertex data to it to start to define your custom primitive, which will then be held in the buffer ready for submission to the shader. The buffer can be re-used when necessary (unless you have used the&nbsp;{}{}vertex_freeze{}{} function), with each call to&nbsp;{}{}vertex_begin{}{} wiping the previous buffer data ready to accept the new data.":"当使用通过此函数创建的顶点缓冲区时，您只需调用 {}{}vertex_begin{}{} 即可开始为其分配顶点数据，以开始定义您的自定义基元，然后将其保存在缓冲区中，准备提交给着色器。必要时可以重新使用缓冲区 (除非您使用了 {}{}vertex_freeze{}{} 函数)，每次调用 {}{}vertex_begin{}{} 都会擦除之前的缓冲区数据以准备接受新的数据数据。",
    "With this function you can create a new vertex buffer. This is a special {}grow{} buffer created by {}GameMaker{} which is pre-formatted for use when building primitives (for use with shaders, for example). The function will return an index for the buffer which should then be used in all further calls to it.":"使用此函数可以创建新的顶点缓冲区。这是由{}GameMaker{}创建的特殊{}增长{}缓冲区，该缓冲区已预先格式化，可用于构建基本体(例如，用于着色器)。该函数将返回缓冲区的索引，然后应在对其进行的所有进一步调用中使用该索引。"
}