{
    "As a help to setting up, when you give a path to certain merge tools, {}GameMaker{} will fill in some defaults to get started with, depending on the tool chosen:":"作为设置的帮助，当您提供某些合并工具的路径时，根据所选的工具，{}GameMaker{} 将填写一些要开始使用的默认设置：",
    "As each merge tool is different, there are four macros that can be used to help specify files to it which can be set up from the {}Conflicts {}window by clicking the button labelled {}Choose Merge Tool{}{}{}:":"由于每个合并工具都不同，因此有四个宏可用于帮助为其指定文件，您可以通过单击标记为{}选择合并工具{}的按钮，在{}冲突{}窗口中设置这些文件{}{}：",
    "Diff Tool":"比较工具",
    "Due to the fact that you can have issues with other files, it means that your workflow when using remote or shared repositories should be as follows:":"由于您可能会遇到其他文件的问题，这意味着您在使用远程或共享仓库时的工作流程应如下所示：",
    "External Merge/Diff Tools":"外部合并/差异工具",
    "In order to view changes between current and previous revisions using the Diff tool, simply open up the Commit window and then double click on a file. If the tool has been setup correctly, it will be launched and you\u0027ll be able to see the changes between the files.":"要使用比较工具查看当前版本和以前版本之间的更改，只需打开提交窗口，然后双击文件。如果该工具已正确设置，它将被启动，您将能够看到文件之间的更改。",
    "Make Changes &gt; Save &gt; Commit &gt; Pull &gt; Merge &gt; Push":"进行更改 &gt; 保存 &gt; 提交 &gt; 拉取 &gt; 合并 &gt; 推送",
    "Merge Tool":"合并工具",
    "Note that if you don\u0027t have (or don\u0027t want to use) a merge tool, then you can open up the script in the IDE and attempt to fix it from there.":"请注意，如果您没有(或不想使用)合并工具，则可以在 IDE 中打开脚本并尝试从那里修复它。",
    "So, back to our example Conflict as stated in the section on {}Conflicts{}... We have done a pull from master and one of the files is conflicted. This opens the Source Control {}Conflicts {}window, where you can click on the conflicted script, and now click on {}Merge{}, since you have configured your merge tool. Clicking merge will now open the tool where you can deal with the conflict and then use the macro(s) supplied to make the required changes. Once you have finished and closed the merge tool, the {}GameMaker{} IDE will show the following confirmation window:":"因此，回到我们的示例冲突，如关于{}冲突{}的部分所述...。我们已从 master 获取，其中一个文件冲突。这将打开源代码控制{}冲突{}窗口，您可以在其中单击冲突的脚本，然后单击{}合并{}，因为您已经配置了合并工具。现在，单击合并将打开工具，您可以在其中处理冲突，然后使用提供的宏进行所需的更改。完成并关闭合并工具后，{}GameMaker{} IDE 将显示以下确认窗口：",
    "We can click {}Commit {}now.":"我们现在可以单击{}提交{}。",
    "When you click that button the {}Preferences{} window will open on the Git plugin:":"当您单击该按钮时，将在 Git 插件上打开{}首选项{}窗口：",
    "When you work on a project with other people, there\u0027s always a chance there could be a conflict, as multiple people edit the same file and most source control systems can make a good attempt at merging any conflicted files, but when there are changes in the same place, it requires a bit of help to know what to do – this is where a {}merge tool {}comes in to show you the changes, and let you decide.":"当您与其他人一起处理一个项目时，总是存在冲突的可能性，因为多个人编辑同一个文件，并且大多数源代码控制系统可以很好地尝试合并任何冲突的文件，但是当在同一位置有更改时，它需要一些帮助才能知道该做什么 -- 这就是{}合并工具{}发挥作用的地方，它会向您显示更改，并让您做出决定。",
    "You should also set up a {}Diff Tool{} for use when doing commits to a repository. This is set up from the {}Preferences{}, same as for the Merge tool:":"您还应该设置一个{}比较工具{}，以便在提交到仓库时使用。这是从{}首选项{}设置的，与合并工具的设置相同：",
    "{}${scm_base}{}: path to the version before the conflicted changes occurred":"{}${scm_base}{}: 冲突更改发生前版本的路径",
    "{}${scm_merged}{}: path to where the merge tool should save to":"{}${scm_merged}{}: 合并工具应保存到的路径",
    "{}${scm_mine}{}: path to your version":"{}${scm_mine}{}: 您的版本的路径",
    "{}${scm_theirs}{}: path to their version":"{}${scm_theirs}{}: 指向其他版本的路径",
    "{}Here you provide a path to the chosen merge tool and then a {}Merge Tool Options{} macro (or macros) to use when deciding what to do, with the following options available:":"{}在此处提供所选合并工具的路径，然后提供在决定要执行什么操作时使用的{}合并工具选项{}宏(或多个宏)，并提供以下选项：",
    "{}Simply answer \"Yes\" to this prompt as you\u0027ve just done it yourself using the merge tool, and then you need to commit this change to signify the end of the merge operation ({}Source Control {}&gt; {}Commit Changes{}). The Commit window will now show that a merge is in progress as well as show some unstaged files:":"{}只需对此提示回答\"是\"，因为您刚刚使用合并工具自己完成了这项工作，然后您需要提交此更改以表示合并操作的结束({}源代码管理{}>{}提交更改{})。提交窗口现在将显示合并正在进行，并显示一些未转移的文件：",
    "{}The Diff tool is configured in much the same manner as the Merge tool, but only uses the {}${scm_base}{} and {}${scm_theirs}{} options - in this case, {}${scm_base}{} represents the unmodified file whereas {}${scm_theirs}{} represents the current state of the file. The Tool Options should be pre-populated with the default options for {}Meld{}, {}KDiff3 {}and {}TortoiseMerge{}, just as they were for the Merge tool. Note that {}GameMaker{} does {}not {}support the outputting of single file diff patches, therefore there is no default for {}Notepad++{}.":"{} 比较工具的配置方式与合并工具大致相同，但只使用了 {}${scm_base}{} 和 {}${scm_theirs}{} 选项-在本例中，{}${scm_base}{} 表示未修改的文件，而 {}${scm_theirs}{} 表示文件的当前状态。工具选项应该预先填充 {}Meld{}、{}KDiff 3{} 和 {}TortoiseMerge{} 的默认选项，就像它们用于合并工具一样。请注意，{}GameMaker{} {}不支持{}输出单个文件的不同补丁，因此没有默认的 {}Notepad++{}。",
    "{}These unstaged files are our script file with the addition of {}.base{}, {}.ours{} and {}.theirs{}. We can safely delete all these so click&nbsp;{}&nbsp;on the top one and then {}&nbsp;+ {}&nbsp;on the bottom one to select them all. Next, we right click on the selected files and choose {}Delete Path{} to remove them. There\u0027s also a commit message pre-filled for us as well, stating that this was a merge, and that there was a conflict (we can add to this or edit it as we wish).":"{}这些未暂存的文件是我们的脚本文件，添加了 {}.base{}、{}.ours{} 和 {}.theirs{}。我们可以安全地删除所有这些内容，因此请单击顶部的 {}，然后单击底部的 {}+{} 将其全部选中。接下来，我们在所选文件上单击鼠标右键并选择 {} 删除路径 {} 以删除它们。还为我们预先填充了一条提交消息，声明这是一个合并，并且存在冲突 (我们可以根据需要添加或编辑它)。"
}