{
    "After working for a while, you may want to check and see what you\u0027ve committed at any given time, and so for that you\u0027ll want to open the {}Commit History{}. To open the history window you simply go to {}Source Control{} &gt; {}View History{} which opens another window with three panes:":"在工作一段时间后，您可能希望在任何给定时间检查和查看您已提交的内容，因此您需要打开{}提交历史记录{}。要打开历史记录窗口，只需转到{}源代码管理{}>{}查看历史记录{}，这将打开另一个包含三个窗格的窗口：",
    "As you work on your project, you will naturally create sprites, edit scripts, delete timelines, and whatever else is required as your project develops over time. These are all actions which you may want to keep track of and get back should something go wrong. This is the main reason to use Source Control - so that any accidents can be reverted - and we will quickly take you through the basic workflow from start so you understand how this works.":"当您在项目中工作时，您将很自然地创建精灵、编辑脚本、删除时间线，以及随着项目随着时间的推移而发展所需要的任何其他东西。这些都是您可能想要跟踪并在出现错误时返回的操作。这是使用源代码管理的主要原因 -- 这样任何意外都可以恢复 -- 我们将从开始快速向您介绍基本的工作流程，以便您了解它是如何工作的。",
    "For now, click the {}Stage All{} button, as we want to commit all the changes, and type something like \"First Commit!\" into the Commit Message and click {}Commit{}. All our resources should now have a green tick{} , meaning there\u0027s no modifications found.":"现在，点击{}暂存所有{}按钮，因为我们想要提交所有更改，然后输入类似于 \"First Commit!\" 到提交消息，然后单击{}提交{}。我们的所有资源现在都应该有一个绿色的勾号{}，这意味着没有找到任何修改。",
    "It is worth noting that as you work within this window, the various {}Staged {}and {}Unstaged {}messages will be prefixed by a symbol. The symbol being used will vary depending on the operation and file, with the following being used:":"值得注意的是，当您在此窗口中工作时，各种{}已分段的{}和{}未分段的{}消息将带有一个符号前缀。使用的符号将根据操作和文件的不同而有所不同，使用的符号如下：",
    "Our work process can now begin, and we can start to build our project and save and commit changes, just as we\u0027ve done in the paragraphs above.":"我们的工作流程现在可以开始了，我们可以开始构建项目并保存和提交更改，就像我们在上面段落中所做的那样。",
    "Standard Workflow":"标准工作流程",
    "Starting from the beginning, create a new GML project and then activate source control through the {}main options{}. This gives us access to the Source Control menu on the top, so we\u0027ll immediately go and select&nbsp;{}Create Project Repository{}. If you look at the room resources, you can see that the default room has gained a red exclamation {}, meaning that it has been {}modified {}from it\u0027s last state. If we had other resources in the project, you\u0027d see that they all have the same icon as shown in the image below:":"从头开始，创建一个新的 GML 项目，然后通过{}主选项{}激活源代码管理。这使我们可以访问顶部的源代码管理菜单，因此我们将立即选择{}创建项目存储库{}。如果您查看聊天室资源，您可以看到默认的聊天室已获得红色感叹号{}，这意味着它已从上次状态{}修改{}。如果我们在项目中有其他资源，您将看到它们都有相同的图标，如下图所示：",
    "{}Commit Message{}: This is a note that we can add to explain what the changes are.":"{}提交消息{}：这是一个注释，我们可以添加它来解释更改是什么。",
    "{}Staged Changes{}: This represent the changes which will be committed to source. This will likely be blank, but it may show a Main Options change, which is fine.":"{}已暂存的更改{}：这表示将提交到源的更改。这可能是空白的，但它可能会显示主要选项的变化，这是好的。",
    "{}The top pane describes the commits, the middle pane describes the comment given to the selected commit, and the bottom pane describes the files that have been modified in this commit. Note that if you have set up a {}Diff Tool{}, then double-clicking on any file in this window will open the diff tool and you\u0027ll be able to see the changes between the files.":"{}顶部窗格描述提交，中间窗格描述对所选提交的注释，底部窗格描述在此提交中修改的文件。请注意，如果您已设置了{}比较工具{}，则双击此窗口中的任何文件都将打开比较工具，您将能够看到文件之间的变化。",
    "{}Unstaged Changes{}: This shows the files that have changed, but that we haven\u0027t told Git that we want to commit them - they\u0027re \"pending\" changes.":"{}未暂存的更改{}：这显示了已经更改的文件，但我们还没有告诉 Git 我们想要提交它们 -- 它们是\"挂起\"的更改。",
    "{}We now have the option of either committing the blank project as it is, or getting it to a base state. For now, we\u0027ll do our first commit so click {}Source Control{} &gt; {}Commit Changes{}. We\u0027ll now get a new window opened which is split into three areas:":"{}我们现在可以选择是按原样提交空白项目，还是将其转换为基本状态。目前，我们将进行第一次提交，因此请单击{}源代码管理{}>{}提交更改{}。现在我们将打开一个新窗口，该窗口分为三个区域：",
    "{}[!]{} - Missing File":"{}[!]{} - 丢失的文件",
    "{}[+]{} - Newly Added":"{}[+]{} - 新增",
    "{}[-&gt;]{} - Renamed/Moved":"{}[-&gt;]{} - 重命名/移动",
    "{}[-]{} - Removed":"{}[-]{} - 删除",
    "{}[...]{} - Staged Change (was previously [A])":"{}[...]{} - 已暂存的更改(以前为[A])",
    "{}[?]{} - Untracked File":"{}[?]{} - 未被跟踪的文件",
    "{}[M]{} - Unstaged Changes":"{}[M]{} - 未暂存的更改"
}