{
    "Epsilon is a value used to determine whether two numbers subject to rounding error are close enough to be considered \"equal\". It is useful when dealing with floating point maths as it can reduce the \"rounding errors\" that make certain operations return values that appear incorrect or contrary to what we expect. For example, we may have added a value to the image index of a sprite and expect the result to be a single integer, but due to the nature of floating point maths, the actual final value ends up being something like 5.0000002, so when we have the following check:":"Epsilon(精度) 是一个值，用于确定受舍入误差影响的两个数字是否足够接近以被视为“相等”。 它在处理浮点数学时很有用，因为它可以减少“舍入错误”，这些错误会使某些操作返回看起来不正确或与我们预期相反的值。 例如，我们可能已经在精灵的图像索引中添加了一个值，并期望结果是一个整数，但由于浮点数学的性质，实际最终值最终会是 5.0000002 这样的东西，所以当我们 进行以下检查：",
    "Floating point calculations may behave differently depending on the platform your game is running on. The default epsilon of {}0.00001{}&nbsp;provides a safe range for rounding errors across different platforms.":"根据运行游戏的平台的不同，浮点计算的行为可能会有所不同。默认的精度为跨平台舍入误差提供了安全的范围 {}0.00001{}。",
    "Floating point calculations may behave differently depending on the platform your game is running on. The default epsilon of {}{}0.00001{}{}&nbsp;provides a safe range for rounding errors across different platforms.":"浮点计算的行为可能会有所不同，具体取决于游戏运行的平台。默认 epsilon{}{}0.00001{}{} 为不同平台上的舍入误差提供了安全范围。",
    "It is also used by the&nbsp;{}{}sqrt{}{}&nbsp;function.":"{}{}sqrt{}{} 函数也使用它。",
    "Note that setting an epsilon value of 0 will disable all rounding, and using a value of 1 will give an error.":"请注意，将精度值设置为 0 将禁用所有舍入，而将值设置为 1 将产生错误。",
    "The code does not behave as expected and returns {}false{}. However, if we set the epsilon value to 0.000001, the {}image_index{} value will be rounded to the nearest real number that is +/- 0.000001 of the original value, making the above comparison return true.":"该代码未按预期运行并返回 {}false{}。 但是，如果我们将 epsilon 值设置为 0.000001，{}image_index{} 值将四舍五入为最接近的实数，即原始值的 +/- 0.000001，从而使上述比较返回 true。",
    "The code does not behave as expected and returns {}false{}. However, with the epsilon set to 0.00001, the {}image_index{} value is rounded to the nearest real number that is +/- 0.000001 of the original value, making the above comparison return true.":"代码的行为与预期不符，并返回 {}false{}。但是，当精度设置为 0.00001 时，{}image_index{} 值将舍入为最接近的实数，即原始值的 +/-0.000001，从而使上述比较返回 true。",
    "The code does not behave as expected and returns {}false{}. However, with the epsilon set to {}{}0.00001{}{}, the&nbsp;{}{}image_index{}{} value is rounded to the nearest real number that is +/-&nbsp;{}0.00001{} of the original value, making the above comparison return {}true{}.":"该代码的行为不符合预期并返回 {}false{}。不过，当 epsilon 设置为 {}{}0.00001{}{} 时，{}{}image_index{}{} 值将舍入为最接近的实数，即原始值的 +/-{}0.00001{}，使上述比较返回 {}true{}。",
    "The epsilon is used to determine whether two numbers subject to rounding errors are close enough to be considered \"equal\". The default epsilon is {}0.00001{}.":"精度用于确定两个受舍入误差影响的数字是否足够接近，从而被视为\"相等\"。默认精度为 {}0.00001{}。",
    "The epsilon is used to determine whether two numbers subject to rounding errors are close enough to be considered \"equal\". The default epsilon is {}{}0.00001{}{}.":"epsilon 用于确定两个存在舍入误差的数字是否足够接近以被视为 \" 相等\"。默认 epsilon 为 {}{}0.00001{}{}。",
    "The epsilon value will be used for all the following comparison {}Operators{}:":"epsilon 值将用于以下所有比较 {} 运算符 {}：",
    "The epsilon value will be used for all the following integer {}operators{}:":"精度值将用于以下所有整数{}运算符{}：",
    "The new epsilon value (from 0 to 0.999999999).":"新的精度值(从 0 到 0.999999999)。",
    "This function sets the epsilon value for number comparisons.":"此函数设置数字比较的 epsilon 值。",
    "This is useful when dealing with floating point maths as it can reduce the \"rounding errors\" that make certain operations return values that appear incorrect or contrary to what we expect. For example, we may have added a value to the image index of a sprite and expect the result to be a single integer (5), but due to the nature of floating point maths, the actual final value ends up being something like 5.000002, so when we have the following check:":"这在处理浮点数学时很有用，因为它可以减少使某些运算返回的值看起来不正确或与我们预期相反的\"舍入误差\"。例如，我们可能已经向精灵的图像索引添加了一个值，并期望结果是一个整数(5)，但由于浮点数学的性质，实际的最终值最终类似于 5.000002，因此当我们进行以下检查时：",
    "This will set the epsilon value for all further floating point operations.":"这将为所有进一步的浮点运算设置精度值。",
    "{}!=&nbsp;{}: Not equal to":"{}!=&nbsp;{}: 不等于",
    "{}&gt;&nbsp;{}:&nbsp;Greater than":"{}&gt;&nbsp;{}:&nbsp;大于",
    "{}&gt;=&nbsp;{}: Greater than or equal to":"{}&gt;=&nbsp;{}: 大于或等于",
    "{}&lt;&nbsp;{}: Less than":"{}&lt;&nbsp;{}: 小于",
    "{}&lt;=&nbsp;{}:&nbsp;Less than or equal to":"{}&lt;=&nbsp;{}:&nbsp;小于或等于",
    "{}==&nbsp;{}: Equal to":"{}==&nbsp;{}: 等于",
    "{}{}NOTE{}{}&nbsp;Setting an epsilon value of 0 will disable all rounding, and using a value of 1 will give an error.":"{}{} 注意 {}{} 将 epsilon 值设置为 0 将禁用所有舍入，使用值 1 将产生错误。"
}