{
    "It is worth noting that if the sequence contains any object tracks, their instances will be created as soon as the sequence element itself is created, regardless of where their asset keys are positioned on the {}Dope Sheet{}. The Sequence controller simply toggles the {}visibility{} of the instance to hide and show it depending on the position and duration of the track\u0027s asset key and does {}not {}repeatedly create&nbsp;and destroy it. As a result, instances will run their Create events when the sequence element is created and not when their&nbsp;asset keys begin.":"值得注意的是，如果序列包含任何对象轨迹，它们的实例将在序列元素本身创建后立即创建，而不管它们的资源键位于{}摄影表{}上的何处。 Sequence 控制器只需切换实例的{}可见性{}，以根据轨迹资源键的位置和持续时间隐藏和显示实例，并且{}不会重复{}创建和销毁它。因此，实例将在创建sequence元素时运行其Create事件，而不是在其资源键开始时运行。",
    "The above code creates a new sequence on the layer \"Background\" then pauses it.":"上面的代码在\"背景\"层上创建一个新序列，然后暂停它。",
    "The sequence asset to use, as defined in the Asset Browser":"要使用的资源顺序，如资源浏览器中所定义",
    "The unique ID value of the layer to target":"目标层的唯一ID值",
    "The x position in the room to create the sequence at":"在房间内创建序列的x位置",
    "The y position in the room to create the sequence at":"房间中创建序列的y位置",
    "With this function you can create an instance of a sequence asset on the given layer. You supply the layer ID which can be a string of the layer name - as defined in the room editor - or the unique layer ID - as returned by the function {}{}layer_get_id(){}{}, as well as the X and Y position in the room to create the sequence at, and finally the ID of the sequence to create. The sequence ID is the name constant that you defined in the Asset Browser for the sequence. The function will return the unique ID of the sequence element, which can then be used in all further layer functions for sequences, or it can be used to retrieve the sequence instance struct using the function {}{}layer_sequence_get_instance(){}{}.":"使用此函数，可以在给定层上创建序列资源的实例。可以提供层 ID(可以是房间编辑器中定义的层名称的字符串)或函数{}{}layer_get_id(){}{}返回的唯一层 IDas，以及在创建序列的房间中的 X 和 Y 位置，最后提供要创建的序列的 ID。序列 ID 是您在\"资源浏览器\"中为序列定义的名称常量。函数将返回sequence元素的唯一ID，然后可以在序列的所有其他层函数中使用该ID，或者可以使用函数{}{}layer_sequence_get_instance(){}{}检索序列实例结构。",
    "{}{}NOTE{}{}&nbsp;All instances that are created for the object tracks are created on the same layer as the sequence instance.":"{}{}注释{}{}为对象轨迹创建的所有实例都创建在与序列实例相同的层上。"
}