{
    "After going through all the sequence elements and destroying them it shows a debug message with the contents of the variable {}track_struct{}. While the sequences were destroyed, {}track_struct{} still contains the struct of the first track of the last encountered sequence instance.":"遍历所有序列元素并销毁它们后，它显示带有变量{}track_struct{}内容的调试消息。 序列被销毁时，{}track_struct{}仍包含最后一个遇到序列实例的第一个轨迹的结构。",
    "The above code gets the IDs for all the elements assigned to the layer of the instance running the code. The code then checks to see if any of the returned elements are sequence assets and if they are then they are destroyed.":"上面的代码获取分配给运行代码的实例层的所有元素的ID。然后，代码检查返回的元素是否是序列资产，如果是，则它们被销毁。",
    "The above code gets the IDs for all the elements assigned to the layer of the instance running the code. The code then checks to see if any of the returned elements are sequence assets. If they are, it then gets the instance struct using {}layer_sequence_get_instance{}. Next it assigns the first element of the {}activeTracks{} array to a temporary variable {}track_struct{}&nbsp;and it destroys the sequence afterwards.":"上面的代码获取分配给运行代码的实例层的所有元素的ID。然后，代码检查返回的元素是否是序列资产。如果是，则使用{}layer_sequence_get_instance{}获取实例结构。 接下来，它将{}activeTracks{}数组的第一个元素指定给临时变量{}track_struct{}，然后破坏序列。",
    "The function frees the {}sequence instance struct{}&nbsp;and all the structs under it. Any structs under the sequence instance struct that have been assigned to a variable are {}not{} freed at that point, e.g. if you assigned one of the track structs under&nbsp;{}activeTracks{}&nbsp;to a variable then that struct will only be freed when the variable no longer references it.{}\n    The function also destroys all instances that were created for the sequence\u0027s object tracks. This also applies to instances created from an override object defined with&nbsp;{}sequence_instance_override_object{}.{}\n    Already existing instances that were provided as a replacement for an object index using&nbsp;{}sequence_instance_override_object{}&nbsp;are {}not{} destroyed automatically.":"函数释放{}序列实例结构{}及其下的所有结构。序列实例结构下已分配给变量的任何结构在该点不{}被释放{}，例如，如果您将{}activeTracks{}下的轨迹结构之一分配给变量，则仅在变量不再引用该结构时释放该结构。{}\n该函数还会销毁为序列的对象轨迹创建的所有实例。这也适用于从使用{}sequence_instance_override_object{}定义的覆盖对象创建的实例。{}\n使用{}sequence_instance_override_object{}替换对象索引的现有实例不会{}自动销毁。",
    "The unique ID value of the sequence element to target":"序列元素到目标的唯一ID值",
    "With this function you can destroy (remove from the room) a sequence element and its corresponding sequence instance.":"使用此函数，您可以销毁(从房间中删除)序列元素及其对应的序列实例。",
    "You supply the sequence element ID as returned by {}{}layer_sequence_create(){}{} or by one of the {}layer element functions{} and the sequence will be destroyed.":"{}{}layer_sequence_create(){}{}或{}层元素函数之一{}返回的序列元素Id将被销毁。"
}