{
    "Also note that you shouldn\u0027t change the {}image_xscale{} \\ {}image_yscale{} \\ {}image_angle{} \\ {}x{} \\ {}y{} variables for any instances in a sequence that uses this function as they will be&nbsp;overwritten as soon as the sequence updates after calling the function.":"另请注意，您不应更改使用此函数序列中任何实例的{}image_xscale{}\\{}image_yscale{}\\{}image_angle{}\\{}x{}\\{}y{}变量，因为调用该函数后，一旦序列更新，这些变量将被覆盖。",
    "It is very important to note that applying {}uneven{}&nbsp;scaling (eg: scaling the X axis by 3 and the Y axis by 2) to sequence elements that contain any instance which uses {}rotation{}, {}may cause issues with the instance drawing, collisions, culling, and many other things{}. Basically, if your sequence relies on&nbsp;{}any{}&nbsp;instance properties then we do not recommend that you combine uneven scaling along with instance rotation.":"值得注意的是，对包含使用{}旋转{}，{}的任何实例的序列元素应用{}不均匀{}缩放(例如：将X轴缩放3，将Y轴缩放2)，可能会引起实例绘制、冲突、剔除和许多其他问题{}。 基本上，如果您的序列依赖于{}any{}实例属性，我们不建议您将不均匀缩放与实例旋转结合起来。",
    "The above code checks the value held in the {}seq_scale{}&nbsp;variable, and if it is less than 2 then it adds to it then uses the value to set the X and Y scale of the sequence element referenced in the variable {}my_seq{}.":"上面的代码检查{}seq_scale{}变量中保存的值，如果它小于2，则它加到它上，然后使用该值来设置变量{}my_seq{}中引用的序列元素的X和Y比例。",
    "The new Y axis scale value to apply to the sequence element":"应用于序列元素的新Y轴比例值",
    "The unique ID value of the sequence element to target":"序列元素到目标的唯一ID值",
    "With this function you can set the Y&nbsp;scale for the given sequence element. You supply the sequence element ID as returned by {}{}layer_sequence_create(){}{} or by one of the {}layer element functions{} along with the new scale to set on the Y&nbsp;axis and the sequence will be scaled by this amount.&nbsp;A scale of 1 indicates no scaling (1:1), smaller values will scale down (0.5, for example, will half the width of the sequence), larger values will scale up and negative values will flip the sequence about its origin&nbsp;{}and{} scale it unless the value used is exactly -1 (in which case the sequence is just flipped about its origin with no scaling).":"使用此功能，可以设置给定序列元素的 Y 比例。提供由{}{}layer_sequence_create(){}{}或由其中一个{}层元素函数{}返回的序列元素 ID，以及要在 Y 轴上设置的新比例，序列将按此量缩放。1表示没有缩放(1：1)，较小的值将缩小(例如，0.5，将缩放序列宽度的一半)，较大值将按比例放大，负值将围绕其原点翻转序列{}，{}缩放序列，除非所用值恰好为-1(在这种情况下，序列仅围绕其原点翻转，没有缩放)。"
}