{
    "Setting the head position in this way will not stop playback and the sequence will simply continue from the new playhead position unless it is paused.":"以这种方式设置磁头位置不会停止播放，除非暂停，否则该序列将从新的播放头位置继续。",
    "The above code gets the IDs for all the elements assigned to the layer of the instance running the code. The code then checks to see if any of the returned elements are sequence assets and if they then their playhead position is set to 0.":"上面的代码获取分配给运行代码的实例层的所有元素的ID。然后，代码检查返回的元素是否为序列资源，如果是序列资源，则它们的播放头位置设置为0。",
    "The position within the sequence (in frames) to set the playhead position to (can be a decimal value)":"设置播放头位置的序列(以帧为单位)内的位置(可以是小数值)",
    "The unique ID value of the sequence element to target":"序列元素到目标的唯一ID值",
    "With this function you can set the {}playhead{}&nbsp;position of a sequence element to a specific frame. You supply the sequence element ID as returned by {}{}layer_sequence_create(){}{} or by one of the {}layer element functions{} along with the new position to set. Note that the position is in {}frames{} and if you set a value greater than the total number of frames (or less than 0) then the actual final playhead position will depend on the type of sequence playback that has been selected, following these rules:":"使用此功能，可以将序列元素的{}播放头{}位置设置为特定帧。提供由{}{}layer_sequence_create(){}{}或{}层元素函数{}之一返回的序列元素 ID 以及要设置的新位置。请注意，位置在{}帧{}中，如果设置的值大于总帧数(或小于0)，则实际的最终播放头位置将取决于所选的序列回放类型，遵循以下规则：",
    "{}Looping{}: The playhead will wrap back to the beginning of the sequence plus the extra frames, eg: if you set the playhead on a 30 frame sequence to a position of frame 45, the actual playhead position will end up being 15. If you give a negative value, then the sequence playhead will wrap in the reverse direction.":"{}循环{}： 播放头将回退到序列的开头加上额外的帧，例如： 如果将 30 帧序列上的播放头设置为第 45 帧的位置，实际的播放头位置将结束为 15。如果您给出一个负值，那么顺序播放头将反向缠绕。",
    "{}No looping{}: The playhead will clamp to the end of the loop (or the beginning if the value given is negative)":"{}无循环{}： 播放头将夹紧到循环的末尾(如果给定值为负，则夹到开始)",
    "{}Ping-pong looping{}: The playhead will advance to the end and then go back the extra number of frames that are over the total frame length, reversing the direction of playback, eg: If the sequence is 30 frames and you set the playhead to 40, the final playhead position will be 20 and the direction will be reversed (going down to 0). Note that you should {}never{} give a negative value for ping-pong playback of a sequence, as it may have undefined results.":"{}乒乓循环{}：播放头将前进到结尾，然后返回超过总帧长度的额外帧数，反转播放方向，例如：如果顺序为30帧，且将播放头设置为40，则最终播放头位置将为20，且方向将反转(下降至0)。请注意，您不应给{}一个序列的乒乓回放负值，因为它可能具有未定义的结果。"
}