{
    "&nbsp;{}NOTE{}: Please consult the {}Spine documentation{} for more information regarding Spine\u0027s internal variables.":"{}注意{}：有关 Spine 的内部变量的更多信息，请参考 {}Spine 文档 {}。",
    "(Internal to Spine) Blend mode for the slot":"(Spine 内部) 插槽的混合模式",
    "(Internal to Spine) Scale value on X":"(Spine 内部) X 轴上的缩放值",
    "(Internal to Spine) Scale value on Y":"(Spine 内部) Y 轴上的缩放值",
    "(Internal to Spine) Shear value on X":"(Spine 内部) X 轴上的剪切值",
    "(Internal to Spine) Shear value on Y":"(Spine 内部) Y 轴上的剪切值",
    "(Internal to Spine) The transform mode":"(Spine 内部) 变形模式",
    "*&nbsp;{}NOTE{}: The dark color variables are only available if the slot has {}Tint Black{} enabled.":"*{}注意{}：深色变量仅在插槽启用了{}浅黑色{}时才可用。",
    "*&nbsp;{}{}NOTE{}{} The dark colour variables are only available if the slot has {}Tint Black{} enabled.":"* {}{}注意{}{} 深色变量仅在插槽启用了{}浅黑色{}时才可用。",
    "Alpha component of the slot\u0027s colour (0-1)":"插槽颜色的 Alpha 分量 (0-1)",
    "Alpha component of the slot\u0027s {}dark {}colour (0-1)":"插槽的 {} 暗 {} 颜色的 Alpha 分量 (0-1)",
    "Array containing structs for each bone in this sprite&nbsp;(more information under \"Spine Sprite Data\")":"包含此精灵中每个骨骼的结构的数组(\"Spine 精灵数据\"下的更多信息)",
    "Array containing structs for each slot in this sprite&nbsp;(more information under \"Spine Sprite Data\")":"包含此精灵中每个槽的结构的数组(\"Spine 精灵数据\"下的更多信息)",
    "Array containing the names of each animation in this sprite":"数组，包含此精灵中每个动画的名称。",
    "Array containing the names of each skin in this sprite":"数组，包含此精灵中每个皮肤的名称。",
    "Array of broadcast messages for this sprite, where each broadcast message is a struct containing information on the message (more information under \"General Sprite Data\")":"此精灵的广播消息数组，其中每个广播消息都是一个包含有关该消息的信息的结构(“常规精灵数据”下的更多信息)",
    "Array of frames for this sprite, where each frame is a struct containing information on its texture&nbsp;(more information under \"Bitmap Sprite Data\")":"此精灵的帧数组，其中每个帧都是一个包含其纹理信息的结构(“位图精灵数据”下的更多信息)",
    "Array of frames for this sprite, where each frame is a struct containing information on its timing&nbsp;(more information under \"General Sprite Data\")":"此精灵的帧数组，其中每个帧都是一个包含其计时信息的结构(“常规精灵数据”下的更多信息)",
    "Array of texture IDs used for the atlas":"用于图集的纹理ID的数组",
    "Attachment name":"附件名称",
    "Blue component of the slot\u0027s colour (0-1)":"插槽颜色的蓝色分量 (0-1)",
    "Blue component of the slot\u0027s {}dark {}colour (0-1)":"插槽的 {} 暗 {} 颜色的蓝色分量 (0-1)",
    "Green component of the slot\u0027s colour (0-1)":"插槽颜色的绿色分量 (0-1)",
    "Green component of the slot\u0027s {}dark {}colour (0-1)":"插槽的 {} 暗 {} 颜色的绿色分量 (0-1)",
    "Position of the bottom edge of the bounding box (in pixels)":"边界框下边缘的位置(以像素为单位)",
    "Position of the left edge of the bounding box (in pixels)":"边界框左边缘的位置(以像素为单位)",
    "Position of the right edge of the bounding box (in pixels)":"边界框右边缘的位置(以像素为单位)",
    "Position of the top edge of the bounding box (in pixels)":"边界框上边缘的位置(以像素为单位)",
    "Red component of the slot\u0027s colour (0-1)":"插槽颜色的红色分量 (0-1)",
    "Red component of the slot\u0027s {}dark {}colour (0-1)":"插槽的 {} 暗 {} 颜色的红色分量 (0-1)",
    "Sprite Info Struct":"精灵信息结构",
    "The X offset from the left edge of the original image to the left edge of the cropped section":"从原始图像的左边缘到裁剪部分的左边缘的 X 偏移",
    "The X position of this bone":"骨骼的 X 位置",
    "The X position of this frame on its texture page (in pixels)":"此框架在其纹理页面上的 X 位置 (以像素为单位)",
    "The Y offset from the top edge of the original image to the top edge of the cropped section":"从原始图像的左边缘到裁剪部分的左边缘的 Y 偏移",
    "The Y position of this bone":"骨骼的 Y 位置",
    "The Y position of this frame on its texture page (in pixels)":"此框架在其纹理页面上的 Y 位置 (以像素为单位)",
    "The above code gets the info struct for the instance\u0027s sprite,&nbsp;and then checks if it\u0027s not {}undefined{} and that its type is 0 (meaning that it\u0027s a bitmap sprite). In that case, it gets the broadcast message&nbsp;array for that sprite and then runs a for loop to print each broadcast message (along with its frame) to the output log.":"上面的代码获取实例的精灵的信息结构，然后检查它是否不是{}undefined{}并且它的类型是0(意味着它是一个位图精灵)。在这种情况下，它获取该精灵的广播消息数组，然后运行 for 循环以将每个广播消息(及其帧)打印到输出日志。",
    "The above code gets the info struct for the instance\u0027s sprite,&nbsp;and then checks if it\u0027s not&nbsp;{}{}{}undefined{}{}{} and that its type is 0 (meaning that it\u0027s a bitmap sprite). In that case, it gets the broadcast message&nbsp;array for that sprite and then runs a for loop to print each broadcast message (along with its frame) to the output log.":"上面的代码获取实例的精灵的信息结构，然后检查它是否不是 {}{}{}undefined{}{}{}，并且它的类型是 0( 意味着它是位图精灵)。在这种情况下，它获取该子画面的广播消息数组，然后运行 for 循环将每个广播消息 (及其帧) 输出到输出日志。",
    "The actual height of the frame on the texture page after cropping and scaling":"裁剪和缩放后纹理页面上框架的实际高度",
    "The actual width of the frame on the texture page after cropping and scaling (since {}GameMaker{} automatically trims the empty space around an image, and also scales it down if it doesn\u0027t fit)":"裁剪和缩放后纹理页面上框架的实际宽度 (因为 {}GameMaker{} 会自动裁剪图像周围的空白空间，如果不适合，也会缩小)",
    "The broadcast message string":"广播消息字符串",
    "The duration of this frame (in frames)":"此帧的持续时间(以帧为单位)",
    "The frame speed set for the sprite (see:&nbsp;{}The Sprite Editor{})":"为精灵设置的帧速度(请参阅：{}精灵编辑器{})",
    "The function returns a {}struct{} with the following variables:":"该函数将返回包含以下变量的{}结构{}：",
    "The function will return {}undefined{} if the given sprite doesn\u0027t exist. Also note that information returned in this struct should be considered {}read-only{} as modifying any of these variables will not affect the sprite.":"如果给定的精灵不存在，该函数将返回{}undefined{}。另请注意，此结构中返回的信息应被视为{}只读{}，因为修改这些变量中的任何一个都不会影响精灵.",
    "The image index of this frame":"此帧的图像索引",
    "The index of the slot":"插槽的索引",
    "The index of the sprite to get the information for.":"要获取其信息的精灵的索引。",
    "The index of this bone":"骨骼的索引",
    "The length of this bone":"骨骼的长度",
    "The logical height of the frame (in pixels) used internally":"内部使用的帧的逻辑高度(以像素为单位)",
    "The logical width of the frame (in pixels) used internally":"内部使用的帧的逻辑宽度(以像素为单位)",
    "The name of the parent bone, or&nbsp;{}undefined{} if this bone doesn\u0027t have a parent":"父骨骼的名称，如果此骨骼没有父骨骼，则为 {}未定义(undefined){}",
    "The name of the slot":"插槽的名称",
    "The name of the slot\u0027s bone, or {}\"(none)\"{} if there is no bone for this slot":"插槽骨骼的名称，如果该插槽没有骨骼，则为{}\"(none)\"{}",
    "The name of the sprite":"精灵的名称",
    "The name of this bone":"骨骼的名称",
    "The number of atlas textures used":"使用的图集纹理的数量",
    "The number of masks in this sprite (will be greater than 1 if the sprite uses per-frame masks)":"此子画面中的遮罩数(如果子画面使用每帧遮罩，则大于1)",
    "The number of sub-images (or frames) in the sprite":"精灵中的子图像(或帧)数",
    "The original height of the frame (in pixels)":"帧的原始高度(以像素为单位)",
    "The original width of the frame (in pixels)":"帧的原始宽度(以像素为单位)",
    "The rotation of this bone":"骨骼的旋转值",
    "The sections below contain information on the arrays and structs included in the returned struct based on the sprite type:":"以下部分包含有关基于精灵类型返回的结构中包含的数组和结构的信息：",
    "The sprite\u0027s X offset/origin (in pixels)":"精灵的X偏移/原点(以像素为单位)",
    "The sprite\u0027s Y offset/origin (in pixels)":"精灵的Y偏移/原点(以像素为单位)",
    "The sprite\u0027s height (in pixels)":"精灵的高度(以像素为单位)",
    "The sprite\u0027s width (in pixels)":"精灵的宽度(以像素为单位)",
    "The texture page ID for this frame":"此框架的纹理页面 ID",
    "The timing for the start of this frame (in frames)":"此帧开始的时间(以帧为单位)",
    "The timing of this broadcast message from the start of the animation (in frames)":"该广播消息从动画开始的计时(以帧为单位)",
    "The type of speed set for the sprite, either {}spritespeed_framespersecond{} or {}spritespeed_framespergameframe{}":"为精灵设置的速度类型，可以是 {}spritespeed_framespersecond{} 或 {}spritespeed_framespergameframe{}",
    "The type of the sprite:{} {}0{} - Bitmap (Regular sprites){} {}1{} - SWF{} {}2{} - Spine ":"精灵的类型：{}{}0{}-Bitmap(常规子画面){}{}1{}-SWF{}{}2{}-Spine",
    "The {}Nine Slice struct{} for this sprite, or {}undefined{} if it has no nine slice data":"此精灵的{}九宫格结构{}，或者{}undefined{}(如果它没有九宫格数据)",
    "The {}bones{} variable is an array that contains information on all bones in the given Spine sprite. Each bone in this array is a struct containing the following variables:":"{}骨骼(bones){} 变量是一个数组，它包含给定 Spine 精灵中所有骨骼的信息。此数组中的每个骨骼都是一个包含以下变量的结构：",
    "The {}frame_info{} variable is an array that contains information on the timings of the sprite\u0027s frames. Each frame in this array is a struct containing the following variables:":"{}帧信息(frame_info){} 变量是一个数组，它包含有关精灵帧的计时的信息。此数组中的每个帧都是一个包含以下变量的结构：",
    "The {}frames{} variable is an array that contains information on the textures of the sprite\u0027s frames. Each frame in this array is a struct containing the following variables:":"{}帧(frames){} 变量是一个数组，它包含有关精灵帧的纹理的信息。此数组中的每个帧都是一个包含以下变量的结构：",
    "The {}messages{} variable is an array that contains information on the broadcast messages that exist in the given sprite. Each broadcast message in this array is a struct containing the following variables:":"{}消息(messages){} 变量是一个数组，它包含有关给定子画面中存在的广播消息的信息。该数组中的每个广播消息都是一个包含以下变量的结构：",
    "The {}slots{} variable is an array that contains information on all slots in the given Spine sprite. Each slot in this array is a struct containing the following variables:":"{}插槽(slots){} 变量是一个数组，包含给定 Spine 精灵中所有插槽的信息。此数组中的每个槽都是一个包含以下变量的结构：",
    "This function is used to retrieve information for the given sprite. You supply a sprite index (which can be an asset added through the {}Asset Browser{} or a sprite&nbsp;{}added{} at runtime)":"此函数用于检索给定子画面的信息。您提供一个精灵索引(可以是通过{}资源浏览器{}添加的资源，也可以是在运行时{}添加{}的精灵)",
    "This function is used to retrieve information for the given sprite. You supply a sprite index (which can be an asset added through the {}Asset Browser{} or a sprite&nbsp;{}added{} at runtime) and the function returns a {}struct{} with the following variables:":"此函数用于检索给定子画面的信息。您提供一个精灵索引(可以是通过{}Asset Browser{}添加的资源，也可以是在运行时{}添加{}的精灵)，该函数将返回包含以下变量的{}结构{}：",
    "This section contains information on variables included in the struct for Bitmap sprites (sprites that are not Spine or SWF type sprites).":"本节包含有关位图精灵 (不是 Spine 或 SWF 类型精灵) 的结构中包含的变量的信息。",
    "This section contains information on variables included in the struct for Spine sprites.":"本节包含有关 Spine 精灵的结构中包含的变量的信息。",
    "This section contains information on variables included in the struct for all kinds of&nbsp;sprites.":"本节包含有关所有精灵的结构中包含的变量的信息。",
    "{}Bitmap Sprite Data{}{}Bitmap Sprite Data{}":"{}位图精灵数据{}{}位图精灵数据{}",
    "{}General Sprite Data{}{}General Sprite Data{}":"{}通用精灵数据{}{}通用精灵数据{}",
    "{}Spine Sprite Data{}{}Spine Sprite Data{}":"{}Spine 精灵数据{}{}Spine 精灵数据{}",
    "{}These additional variables are available only for Spine sprites:{}":"{}以下附加变量仅适用于 Spine 精灵：{}",
    "{}This additional variable is available only for Bitmap (regular)&nbsp;sprites:{}":"{}此附加变量仅适用于位图(常规)精灵：{}",
    "{}true{} if the sprite is marked as smooth, otherwise {}false{}{} {}{}(This can only be specified through {}{}sprite_add(){}{}&nbsp;or similar functions, and will be {}false{} for sprites created in the IDE){}{}{}{} ":"如果精灵标记为平滑，则为{}true{}，否则为{}false{}{}{}{}(这只能通过{}{}sprite_add(){}{})或类似的函数来指定，并且对于在IDE中创建的精灵将为{}false{}){}{}{}{}",
    "{}true{} if the sprite is marked as transparent, otherwise {}false{}{} {}(This can only be specified through {}{}sprite_add(){}{}&nbsp;or similar functions, and will be {}false{} for sprites created in the IDE){} ":"如果精灵标记为透明，则为{}true{}，否则为{}false{}{}{}(这只能通过{}{}sprite_add(){}{}或类似的函数来指定，并且对于在IDE中创建的精灵将为{}false{}){}",
    "{}true{} if this sprite is marked as premultiplied, otherwise {}false{}":"如果此精灵标记为预乘，则为{}true{}，否则为{}false{}",
    "{}true{} if this sprite uses a collision mask, otherwise {}false{}":"如果此精灵使用碰撞遮罩，则为{}true{}，否则为{}false{}",
    "{}{}NOTE{}{}&nbsp;Please consult the {}Spine documentation{} for more information regarding Spine\u0027s internal variables.":"{}{}注意{}{} 有关 Spine 内部变量的更多信息，请参考{} Spine 文档{}。"
}