{
    "Also note that there are some basic file&nbsp;functions for saving games available from the following pages (be aware that these functions are designed for beginners to get a basic save system up and running as quickly as possible, but for more complex projects, you should create your own save system using the functions listed in the sections above):":"还需要注意的是，以下页面中有一些用于保存游戏的基本 文件函数(注意，这些函数是为初学者设计的，以便尽快建立并运行基本的保存系统，但对于更复杂的项目，你应该使用上面列出的函数创建自己的保存系统):",
    "At some point while creating your game it will be necessary to store information externally and be able to retrieve this information. For example, you may wish to store login details, or hi-scores, or maybe the progression of the player through your levels. Whatever the reason, you will need to know how to use the different file functions that are available to you when working with {}GameMaker{}.":"在创造游戏的过程中，有必要在外部存储信息并能够检索这些信息。例如，你可能希望存储登录细节，或最高分列表，或玩家在关卡中的进程。不管是什么原因，你都需要知道在使用{}GameMaker{}时如何使用不同的文件函数。",
    "Binary Files":"二进制文件",
    "Encoding&nbsp;And Hashing":"编码 和 哈希运算",
    "File Directories":"文件目录",
    "File Handling":"文件处理",
    "File System":"文件系统",
    "Finally you can find more advanced {}buffer{} functions that can be used for loading and saving data on the following pages:":"最后，你可以找到更高级的{}buffer{}函数，可以用来在以下页面上加载和保存数据:",
    "Finally, you should also note that there are some distinct differences between certain target platforms which would be taken into account when using the file functions. These are:{}{}":"最后，您还应该注意，在某些目标平台之间有一些明显的差异，在使用文件函数时要考虑到这一点。这些是:{}{}",
    "If you have been granted permission by Steam to use their dedicated API with your game, you will find that there is also a new set of file functions available to you. These are explained in the {}Steam API{} section of this manual.":"如果你已经获得Steam的许可，可以在游戏中使用他们的专用API，你会发现还有一组新的文件函数可供你使用。这些将在本手册的{}Steam API{}部分进行解释。",
    "Information on the different file functions can be found in the following pages:":"有关不同文件功能的资料，请参阅以下页面:",
    "Ini Files":"Ini 文件",
    "It is very important to realise that {}GameMaker{} is {}Sandboxed&nbsp;{}by default, meaning that there are a number of limits and minor complications when using the file system functions that are available, and it is worth noting too that the file system will work slightly differently depending on the platform you are targeting. For more information this, please see the following section:":"我们必须意识到，默认情况下{}GameMaker{}是{}沙箱化{}的，这意味着在使用可用的文件系统函数时存在一些限制和复杂性，而且值得注意的是，文件系统的工作方式会因你的目标平台而略有不同。了解更多信息，请参阅以下部分:",
    "Text Files":"文本文件",
    "The File System":"文件系统",
    "You can turn off sandboxing on the desktop targets (Windows, macOS and Ubuntu (Linux)) from the Game Options for the chosen platform, meaning that you can then save and load from anywhere, within the limits of the OS permissions.":"你可以从游戏的平台选项中关闭桌面目标上的沙箱(Windows, macOS和Ubuntu (Linux))，这意味着你可以在操作系统权限的限制内，从任何地方保存和加载。",
    "{}GameMaker{} also includes a number of functions for {}encoding{} and {}hashing{} files and data, which you can find here:":"{}GameMaker{} 还包括许多用于{}编码{}和{}哈希{}文件和数据的函数，您可以在此处找到它们：",
    "{}HTML5{}: On HTML5, saving and loading to and from {}local storage{} will work as explained within the different function pages, however if you are loading a file from a server, you {}must only use the function {}{}buffer_load_async(){}{}{} as loading synchronously has been deprecated on most browsers and will eventually be obsoleted. Also note that you cannot create or destroy directories in the browser local storage.":"{}HTML5{}:在HTML5上，保存和加载到{}本地存储{}和从{}加载将在不同的函数页面中解释，但是，如果你从服务器加载文件，你必须只使用函数{}{}{}buffer_load_async(){}{}，因为同步加载在大多数浏览器上已经被弃用，最终将被淘汰。还要注意，您不能在浏览器本地存储中创建或销毁目录。",
    "{}iOS{}: On iOS, if you are loading an included file from a folder, ie: with a path something like \"{}Backgrounds/background1.png{}\", you do NOT need to include the folder as part of the path and simply supplying the file name is sufficient. On all other platforms you must supply the folder(s) as part of the path to the file.{}{}":"{}iOS{}:在iOS上，如果你从一个文件夹中加载一个包含的文件，例如:路径类似于“{}Backgrounds/background1.png{}”，你不需要将文件夹作为路径的一部分，只需提供文件名就足够了。在所有其他平台上，必须提供文件夹作为文件路径的一部分。{}{}",
    "{}macOS and Ubuntu (Linux){}: On the macOS and Ubuntu, filenames and paths are case sensitive on these platforms, and so to prevent any potential issues, {}GameMaker{} will automatically make all names/paths use lower case by default.{}{}":"{}macOS和Ubuntu (Linux){}:在macOS和Ubuntu上，文件名和路径在这些平台上是区分大小写的，因此为了防止任何潜在的问题，{}GameMaker{}将自动使所有名称/路径默认使用小写。{}{}"
}