{
    "For information on the&nbsp;{}Runtime{} functions available for&nbsp;{}Nine Slicing{}, see the following page:":"关于{}运行时{}函数可用于{}九宫格{}的信息，见以下页面。",
    "In conjunction with {}Sequences{}, this feature can be used to build user interfaces, and can be used, for example, to create rectangular walls in a game level. Texture memory can also be saved using {}{}Nine Slicing{}{}, as a smaller image can be used to cover a larger area on-screen.":"与{}序列{}结合使用，该功能可用于构建用户界面，例如，可用于在游戏关卡中创建矩形墙。使用{}{}九宫格{}{}还可以节省纹理内存，因为较小的图像可以用来覆盖屏幕上的较大区域。",
    "Nine Slice":"九宫格",
    "Nine Slice Functions":"九宫格函数",
    "The following visual demonstrates each Tile Mode when applied to the centre slice:{}If {}Nine Slicing{} is enabled for a sprite, it will be used for resizing the sprite wherever it appears, and will work in any existing places where the sprite was used without any other changes being required.":"下面的视觉效果展示了应用于中心片时的每种图块模式：{}如果{}九宫格{}被启用于精灵，那么它将被用于调整精灵出现的任何地方的大小，并将在任何现有的使用过精灵的地方发挥作用，而不需要做任何其他的改变。",
    "This is achieved by dividing the image into nine separate parts or \"slices\". The corner slices are moved during scaling and drawn at the same scale, then the edge and centre slices are stretched or repeated (depending on your setting) to fill the space.":"这是通过将图像划分为九个独立的部分或 \"图块 \"来实现的。角落的图块在缩放过程中被移动，并以相同的比例绘制，然后边缘和中心的图块被拉伸或重复（取决于你的设置）以填补空间。",
    "{}Four {}guides {}are placed on a sprite to divide the image into nine slices. The following visual demonstrates how the guides stay in place after the sprite is scaled using Nine Slice:":"{}四条{}导引线{}被放置在一个精灵上，将图像分成九个片断。下面的视觉效果展示了在使用 \"九段式 \"缩放精灵后，导引线是如何保持原位的。",
    "{}NOTE{}: Nine Slicing will not work with functions that draw only a part of the sprite or distort it, such as&nbsp;{}{}draw_sprite_part(){} {}or&nbsp;{}{}draw_sprite_pos(){}{}.":"{}注意{}：九宫格对于只绘制精灵的一部分或扭曲精灵的函数，如&nbsp;{}{}draw_sprite_part(){} {}或&nbsp;{}{}draw_sprite_pos(){}{}，将无法工作。",
    "{}Nine Slicing{}&nbsp;(also known as 9-slicing) is a technique used to scale rectangular images for preserving details, making them retain their original form after scaling.":"{}九宫格{} (又称9-slicing)是一种用于缩放矩形图像以保留细节的技术，使其在缩放后保持原有形态。",
    "{}Nine Slicing{}&nbsp;can be enabled on Sprites in the IDE. For more information,&nbsp;see {}The Sprite Editor{}.":"{}九宫格{} 可以在 IDE 中启用精灵。更多信息，请参阅{}精灵编辑器{}。",
    "{}The {}Tile Mode{} of a slice determines how that slice is displayed when the sprite is scaled. It can only be set for the edge and centre slices (as corner slices are not scaled).":"{}一个片断的{}图块模式{}决定了当精灵被缩放时，该片断的显示方式。它只能被设置为边缘和中心的片断（因为角落的片断不会被缩放）。"
}