{
    "It is recommended that you use this function carefully as it will impact on how everything is drawn to the screen. In general you would want to have it as an option in a menu of your game, or call it only once at the start of your game and write your code around whether you have it enabled or disabled.":"建议您仔细使用此函数，因为它将影响所有内容绘制到屏幕的方式。一般情况下，您会希望在游戏菜单中将其作为一个选项，或者在游戏开始时只调用一次，并围绕是否启用或禁用编写代码。",
    "Set to enable ({}true{}) or disable ({}false{}) the application surface.":"设置为启用({}true{})或禁用({}false{})应用程序表面。",
    "The above code check for a key press and the toggle the application surface on or off depending on its state (like in an options menu).":"上述代码检查是否按键，以及是否根据应用程序表面的状态(如在选项菜单中)打开或关闭应用程序表面。",
    "With this function you can enable or disable the application surface. By default the application surface is enabled and all drawing for the Draw events will be done to that and the surface drawn to the screen. However on some older devices and specific chipsets this may result in poorer performance. In those cases you can switch off drawing to the application surface and all Draw event drawing will then be done directly to the screen buffer.":"使用此函数，您可以启用或禁用应用程序表面。默认情况下，应用程序表面处于启用状态，\"绘制\"事件的所有绘制都将完成，并且表面将绘制到屏幕。但是，在某些较旧的设备和特定的芯片组上，这可能会导致性能较差。在这些情况下，可以关闭对应用程序表面的绘制，然后所有绘制事件绘制都将直接对屏幕缓冲区执行。",
    "You can use this function to enable or disable the application surface at any time in your game, but you should note that it requires at least one frame (step) for the changes to take effect. Switching it off {}{}will switch off all aspect ratio correction{}{}, as set in the {}Game Options{} for the target platform. This means that you should have some method in place that scales the game to the required device, window or screen dimensions. If you switch it back on again, then the {}Game Options{} will take effect again the next step.":"您可以在游戏中的任何时候使用此函数启用或禁用应用程序表面，但应注意，要使更改生效，至少需要一个帧(步骤)。关闭{}{}将关闭目标平台的{}游戏选项{}中设置的所有纵横比校正{}{}。这意味着您应该使用某种方法将游戏扩展到所需的设备、窗口或屏幕尺寸。如果再次打开，{}游戏选项{}将在下一步再次生效。"
}