{
    "The ID of the surface to get the texture of.":"要获取纹理的表面的 ID。",
    "The ID of the surface to get the width of.":"要获取宽度的表面的ID。",
    "The above code will draw a 4 vertex triangle strip textured with the texture held in the \"tex\" variable, which is itself taken from a previously created surface.":"以上代码将绘制一个带有纹理的4顶点三角形条纹，该纹理保持在\"tex\"变量中，该变量本身取自以前创建的表面。",
    "The above code will draw a 4 vertex triangle strip textured with the texture held in the {}_tex{}&nbsp;variable, which is itself taken from a previously created surface {}surf{}.":"以上代码将绘制一个带有纹理的 4 顶点三角形条纹，该纹理保持在{}tex{}变量中，该变量本身取自以前创建的表面 {}surf{}。",
    "The surface to get the texture of.":"要获取纹理的表面。",
    "This function returns a special {}pointer{} for the surface\u0027s texture. This value can then be used in other draw functions, particularly in general 3D and some of the 2D primitive functions.":"此函数返回表面纹理的特殊{}指针{}。然后，该值可用于其他绘制函数，特别是在常规3D和某些2D基本体函数中。",
    "This function returns a special {}pointer{} for the surface\u0027s texture. This value can then be used in other draw functions, particularly in general 3D and some of the 2D primitive functions.{}{}":"此函数返回表面纹理的特殊{}指针{}。然后，该值可用于其他绘制函数，特别是在常规3D和某些2D基本体函数中。{}{}",
    "This function returns the ID of the texture used by the surface, rather than a pointer to it, as is the case for&nbsp;{}{}sprite_get_texture{}{}.&nbsp;{}GameMaker{}\u0027s drawing functions accept both in the same way.":"该函数返回表面使用的纹理的 ID，而不是像 {}{}sprite_get_texture{}{} 那样指向它的指针。{}GameMaker{} 的绘图函数以相同的方式接受两者。",
    "This function returns the texture for the surface\u0027s texture page. This value can then be used in other draw functions, particularly in general 3D and some of the 2D primitive functions.{}{}":"此函数返回表面纹理页的纹理。该值随后可用于其他绘图函数，特别是一般 3D 和一些 2D 基元函数。{}{}",
    "{}NOTE{} On HTML5, this returns a struct instead of a texture pointer, as a pointer cannot be used on that platform. However this does not change the use of the returned value, as its usage in {}texture functions{} still remains the same.":"{}注意{}在HTML5上，这将返回结构而不是纹理指针，因为指针不能在该平台上使用。但是，这不会更改返回值的使用，因为其在{}纹理函数{}中的用法仍然保持不变。",
    "{}TIP{}&nbsp;How a surface appears depends on its contents, especially the alpha values inside the surface. A surface {}cleared{} with an alpha of 0 may appear different from a surface cleared with an alpha of 1, due to the way they blend with the background. Take care of this whenever you notice a difference in the way something renders on a custom surface as opposed to the {}{}application_surface{}{}.":"{}提示{} 表面的显示方式取决于其内容，尤其是表面内部的 alpha 值。Alpha 值为 0 的表面 {}cleared{} 可能与 Alpha 值为 1 的曲面不同，这是因为它们与背景混合的方式不同。当您注意到自定义图面上的渲染方式与 {}{}application_surface{}{} 上的渲染方式不同时，请注意这一点。",
    "{}{}{}NOTE{}&nbsp;When working with surfaces there is the possibility that they can cease to exist at any time due to them being stored in texture memory. You should {}ALWAYS{} check that a surface exists using {}{}{}surface_exists(){}{}{} before referencing them directly.":"{}{}{}注意{}使用表面时，由于表面存储在纹理内存中，因此表面可能随时停止存在。在直接引用表面之前，应该{}始终{}使用{}{}{}surface_exists(){}{}{}检查表面是否存在。"
}