{
    "The above code creates two surfaces of different sizes, assigning each one to a different canvas element, and then those surfaces are assigned to two views so that the correct part of the room is captured.":"上述代码创建两个不同大小的表面，将每个表面指定给不同的画布元素，然后将这些表面指定给两个视图，以便捕捉房间的正确部分。",
    "The height of the surface to be created.":"要创建的表面的高度。",
    "The name of the canvas element to link the surface to.":"要将表面链接到的画布元素的名称。",
    "The width of the surface to be created.":"要创建的表面的宽度。",
    "This function allows you to attach a surface to a canvas element that already exists in your web page, meaning that you can effectively split up portions of your game to be drawn at various different places within the page. To that end, you {}must{} have defined the canvas element correctly within the {}*.html{} page of your game using the correct sizes and names that correspond to the surfaces you wish to create. So, you would have your \"main\" canvas, and then your secondary surface canvas elements, which will be assigned using this function to the correct surfaces. The following image is an example of how a page with three canvas elements would be set up:":"此函数允许您将表面附加到网页中已存在的画布元素，这意味着您可以有效地拆分游戏的各个部分，以便在页面中的各个不同位置绘制。为此，{}必须{}在游戏的{}*. html{}页面中正确定义画布元素，并使用与要创建的表面相对应的正确大小和名称。因此，您将拥有\"main\"画布，然后是次表面画布元素，这些元素将使用此函数指定给正确的表面。下图是如何设置具有三个画布元素的页面的示例：",
    "This function will always create a surface with the&nbsp;{}{}surface_rgba8unorm{}{} format.":"此函数将始终使用 {}{}surface_rgba8unorm{}{} 格式创建曲面。",
    "{}Finally you would then use this function to create the surfaces, with the name being the same as that used for the canvas elements and the size corresponding to the size of that same canvas. The function will return the index of the surface which should be stored in a variable for future function calls. When the surface is first created, it may contain \"noise\" as basically it is just an area of memory that is put aside for the purpose (and that memory may still contain information), so you may want to clear the surface before use with a function like {}{}draw_clear_alpha(){}{}.":"{}最后，您将使用此函数创建表面，其名称与画布元素所使用的名称相同，大小与同一画布的大小相对应。该函数将返回表面的索引，该索引应存储在一个变量中，以便将来调用函数。首次创建表面时，它可能包含\"噪波\"，因为基本上它只是为此目的而放在一边的内存区域(该内存可能仍包含信息)，因此您可能希望在使用诸如{}{}draw_clear_alpha(){}{}之类的函数之前清除表面。",
    "{}The page layout can be tricky, especially if you wish all the elements to line up correctly, but once the hard task of creating the layout has been completed, you can then add this {}html{} file as the default page file for the game using the {}HTML5 Tab{} of the {}Game Options{}. The next thing you should do is set up your room and views, as each surface will need to be associated with a specific view to \"capture\" the game images (see the view variable {}{}view_surface_id[0...7]{}{}). The image below shows how the game room for the above canvas example would be set out:":"{}页面布局可能很复杂，尤其是如果您希望所有元素都正确排列，但创建布局的硬任务完成后，您可以使用{}游戏选项{}的{}HTML5选项卡{}将此{}html{}文件添加为游戏的默认页面文件。接下来您应该做的是设置房间和视图，因为每个表面都需要与特定视图关联，以便\"捕捉\"游戏图像(请参阅视图变量{}{}view_surface_id[ 0...7 ]{}{})。下面的图像显示了如何设置上面画布示例的游戏房间：",
    "{}{}{}NOTE{}{}&nbsp;{}This function is only available for use with the HTML5 module.":"{}{}{}注意{}{} {}此函数仅适用于HTML5模块。"
}