{
    "Instead, you must reset the target for each of the surfaces that you set, much like you must use opening and closing brackets {} for code blocks. So the above should be written as either this:":"相反，必须为所设置的每个表面重置目标，就像必须对代码块使用左括号和右括号{}一样。因此，上面的内容应该写成以下两种情况：",
    "Instead, you must reset the target for each of the surfaces that you set, much like you must use opening and closing brackets {} for code blocks. So the above should be written either like this:":"相反，您必须为您设置的每个表面重置目标，就像您必须对代码块使用左括号和右括号 { } 一样。所以上面的内容应该这样写：",
    "One thing that should be noted is that surfaces are {}stacked{} so you cannot jump from target to target and then reset to the normal draw target at the end, but rather you must open and close rendering targets. For example, this will {}not{} work correctly:":"需要注意的一点是，表面是{}层叠的{}，因此不能从一个目标跳到另一个目标，然后在结束时重置为法线绘制目标，而是必须打开并关闭渲染目标。例如，这将导致{}无法正常工作：",
    "Please note that if you do not call {}{}surface_reset_target{}{}&nbsp;after you have finished, nothing will be drawn on the screen as all further drawing (even in other instances) will be done on the surface. You should also realise that nothing will be seen if the surface itself is not drawn on the screen in the draw event of an instance. You can check the return value of this function too as a debug tool to check whether the surface target was set or not, with a return value of 0 being a failure to set the target and any other positive value being a success.":"请注意，如果您完成后不调用 {}{}surface_reset_target{}{}，则屏幕上不会绘制任何内容，因为所有进一步的绘制 (即使在其他情况下) 都将在表面上完成。您还应该意识到，如果在实例的绘制事件中没有在屏幕上绘制表面本身，则什么也看不到。您也可以检查此函数的返回值作为调试工具来检查表面目标是否设置，返回值 0 表示设置目标失败，任何其他正值表示成功。",
    "The ID of the surface to set as the drawing target.":"要设置为绘制目标的表面的ID。",
    "The above code checks to see which view is currently being drawn, and if it is view[0] it sets the draw target to a surface and draws all instances of the object {}obj_Effect{}&nbsp;before resetting the draw target again. If the view is not view[0] the surface is drawn to the screen.":"上面的代码检查当前正在绘制哪个视图，如果是 view[0]，则会将绘制目标设置为表面并绘制对象 {}obj_Effect{} 的所有实例，然后再次重置绘制目标。如果视图不是 view[0]，则表面将绘制到屏幕上。",
    "The above code will check to see which view is currently being drawn, and if it is view[0] it sets the draw target to a surface and draws all instances of the object \"obj_Effect\" before resetting the draw target again. If the view is not view[0] the surface is drawn to the screen.":"上述代码将检查当前正在绘制的视图，如果是view[ 0 ]，则会将绘制目标设置为表面，并在再次重置绘制目标之前绘制对象\"obj_Effect\"的所有实例。如果视图不是视图[ 0 ]，则将表面绘制到屏幕上。",
    "The surface to set as the drawing target.":"设置为绘图目标的表面。",
    "With this function you set all further drawing to the target surface rather than the screen and in this way you can tell {}GameMaker{} to only draw specific things to the specified surface.":"通过此函数，您可以将所有进一步绘制设置到目标表面而不是屏幕，这样您就可以告诉 {}GameMaker{} 仅将特定内容绘制到指定表面。",
    "With this function you set all further drawing to the target surface rather than the screen and in this way you can tell {}GameMaker{} to only draw specific things to the specified surface. Please note that if you do not call {}{}surface_reset_target(){}{} after you have finished, nothing will be drawn on the screen as all further drawing (even in other instances) will be done on the surface. You should also realise that nothing will be seen if the surface itself is not drawn on the screen in the draw event of an instance. You can check the return value of this function too as a debug tool to check whether the surface target was set or not, with a return value of 0 being a failure to set the target and any other positive value being a success.":"使用此函数，您可以将所有进一步绘制设置为目标表面而不是屏幕，并通过这种方式告诉{}GameMaker{}仅将特定内容绘制到指定表面。请注意，如果完成后不调用{}{}surface_reset_target(){}{}，屏幕上将不会绘制任何内容，因为所有进一步绘制(即使在其他实例中)都将在表面上完成。您还应该意识到，如果在实例的绘制事件中没有在屏幕上绘制表面本身，则不会看到任何内容。您也可以作为调试工具检查此函数的返回值，以检查是否设置了表面目标，返回值0表示设置目标失败，其他任何正值表示成功。",
    "or like this:":"或者像这样：",
    "{}NOTE{}: When working with surfaces there is the possibility that they can cease to exist at any time due to them being stored in texture memory. You should {}ALWAYS{} check that a surface exists using {}{}{}surface_exists(){}{}{} before referencing them directly.":"{}注意{}：使用表面时，由于表面存储在纹理内存中，因此表面可能随时停止存在。在直接引用表面之前，应该{}始终{}使用{}{}{}surface_exists(){}{}{}检查表面是否存在。",
    "{}{}Boolean{}{}&nbsp;Whether the render target was set successfully":"{}{}Boolean{}{} 渲染目标是否设置成功",
    "{}{}NOTE{}{}&nbsp;If you have not previously set a render target with the function {}{}surface_set_target{}{},&nbsp;using this function will silently (i.e.&nbsp;without any error messages) end all further code execution for the event.":"{}{} 注意{}{} 如果您之前没有使用函数 {}{}surface_set_target{}{} 设置渲染目标，则使用此函数将静默 (即没有任何错误消息) 结束该函数的所有进一步代码执行事件。"
}