{
    "Instead, you must reset the target for each of the surfaces that you set, much like you must use opening and closing brackets {} for code blocks. So the above should be written as either this:":"相反，必须为所设置的每个曲面重置目标，就像必须对代码块使用左括号和右括号{}一样。因此，上面的内容应该写成以下两种情况：",
    "One thing that should be noted is that surfaces are {}stacked{} so you cannot jump from target to target and then reset to the normal draw target at the end, but rather you must open and close rendering targets. For example, this will {}not{} work correctly:":"需要注意的一点是，曲面是{}层叠的{}，因此不能从一个目标跳到另一个目标，然后在结束时重置为法线绘制目标，而是必须打开并关闭渲染目标。例如，这将导致{}无法正常工作：",
    "The ID of the surface to set as the drawing target.":"要设置为绘图目标的曲面的Id。",
    "The above code will check to see which view is currently being drawn, and if it is view[0] it sets the draw target to a surface and draws all instances of the object \"obj_Effect\" before resetting the draw target again. If the view is not view[0] the surface is drawn to the screen.":"上述代码将检查当前正在绘制的视图，如果是view[ 0 ]，则会将绘制目标设置为曲面，并在再次重置绘制目标之前绘制对象\"obj_Effect\"的所有实例。如果视图不是视图[ 0 ]，则将曲面绘制到屏幕上。",
    "With this function you set all further drawing to the target surface rather than the screen and in this way you can tell {}GameMaker{} to only draw specific things to the specified surface. Please note that if you do not call {}{}surface_reset_target(){}{} after you have finished, nothing will be drawn on the screen as all further drawing (even in other instances) will be done on the surface. You should also realise that nothing will be seen if the surface itself is not drawn on the screen in the draw event of an instance. You can check the return value of this function too as a debug tool to check whether the surface target was set or not, with a return value of 0 being a failure to set the target and any other positive value being a success.":"使用此功能，您可以将所有进一步绘制设置为目标曲面而不是屏幕，并通过这种方式告诉{}GameMaker{}仅将特定内容绘制到指定曲面。请注意，如果完成后不调用{}{}surface_reset_target(){}{}，屏幕上将不会绘制任何内容，因为所有进一步绘制(即使在其他实例中)都将在曲面上完成。您还应该意识到，如果在实例的绘制事件中没有在屏幕上绘制曲面本身，则不会看到任何内容。您也可以作为调试工具检查此函数的返回值，以检查是否设置了曲面目标，返回值0表示设置目标失败，其他任何正值表示成功。",
    "{}NOTE{}: When working with surfaces there is the possibility that they can cease to exist at any time due to them being stored in texture memory. You should {}ALWAYS{} check that a surface exists using {}{}{}surface_exists(){}{}{} before referencing them directly.":"{}注意{}：使用曲面时，由于曲面存储在纹理内存中，因此曲面可能随时停止存在。在直接引用曲面之前，应该{}始终{}使用{}{}{}surface_exists(){}{}{}检查曲面是否存在。"
}