{
    "As mentioned above, {}GameMaker{} doesn\u0027t actually render most things to the screen directly, but instead it renders them to the {}application surface{}. This is essentially a surface - just like any that you can make yourself using the surface functions -&nbsp;and as such it can be manipulated, drawn to, sent to shaders, etc... Basically,&nbsp;anything that you would normally do with a surface you created can also be applied to the application surface.":"如上所述，{}GameMaker{}实际上并不直接将大部分内容渲染到屏幕，而是将它们渲染到{}应用程序表面{}。这本质上是一个表面，就像任何可以使用表面函数创建自己的表面一样，因此可以对其进行操作、绘制、发送到着色器等...基本上，通常对创建的表面执行的任何操作也可以应用于应用程序表面。",
    "Draw GUI end event":"绘制 GUI 结束事件",
    "Draw GUI event":"绘制 GUI 事件",
    "Finally, it is worth noting that drawing to a surface will take into consideration the colour&nbsp;{}and{}&nbsp;the alpha component of each pixel, both from the surface itself and also from what is being drawn to it. This may lead to some rather unintuitive results (for example, drawing a sprite with 0.5 alpha to a surface with 0 alpha will give a final alpha of 0.25). The reasons for this are explained on&nbsp;the following page, and we recommend that you read it before working with surfaces:&nbsp;{}Guide To Using Blendmodes{}":"最后，值得注意的是，绘制到表面将考虑每个像素的颜色{}和{}的Alpha分量，这两个分量既来自表面本身，也来自绘制到表面的内容。这可能会导致一些相当不直观的结果(例如，将具有0.5 Alpha的精灵绘制到具有0 Alpha的表面将给出0.25的最终Alpha)。下一页说明了这样做的原因，我们建议您在处理表面之前阅读这些原因：{}使用混合模式指南{}",
    "Finally, you have two functions for storing and retrieving surfaces in {}Buffers{}:":"最后，您有两个用于在{}缓冲区{}中存储和检索表面的函数：",
    "Finally, you would draw the surface (or use it in a shader, or whatever is required).":"最后，绘制表面(或者在着色器中使用，或者根据需要使用)。",
    "First, you should realise that surfaces ({}except{} the application surface) are \"volatile\". This means that if the device or window loses focus or is minimised (good examples are when you ALT +Tab&nbsp;to different window and back again on&nbsp;Windows, or on an Android device when the app loses focus due to a call) then the surface {}may be destroyed{}. This is because it is stored {}only{}&nbsp;in the texture memory ({}VRAM{}) and may be overwritten when the target platform needs that memory for something else which means that you should {}{}always{}{} have some type of fail-safe code in place, usually with the {}{}surface_exists(){}{} function.":"首先，您应该意识到表面(应用程序表面{}除外{})是\"易变的\"。这意味着，如果设备或窗口失去焦点或被最小化(很好的例子是，当您 Alt+ Tab 键切换到不同的窗口，然后在 Windows 上返回，或者当应用程序由于调用而失去焦点时，在 Android 设备上返回)，则表面{}可能会被破坏{}。这是因为它{}仅{}存储在纹理内存 ({}VRAM{})中，并且可能会在目标平台需要该内存进行其他操作时被覆盖，这意味着您应该{}{}始终{}{}具有某种类型的失败安全代码，通常具有 {}{}surface_exists(){}{} 函数。",
    "Fourth, when drawing to a surface manually, the surface is {}always{} at the position of (0,0). This means that you may need to convert {}absolute{} coordinates into {}relative{} coordinates for the surface. For example, if you have a camera-sized surface and wish to draw something that is currently visible in the camera to that surface, you should subtract the camera view x and y coordinates from the actual x and y coordinates to get a relative position to the surface (0,0) position. So, the code would look something like this:":"第四，当手动绘制到表面时，表面总是{}处于(0,0 )的位置。这意味着您可能需要将{}绝对{}坐标转换为表面的{}相对{}坐标。例如，如果具有摄影机大小的表面，并希望将摄影机中当前可见的内容绘制到该表面，则应从实际的x和y坐标中减去摄影机视图x和y坐标，以获得与表面(0,0 )位置的相对位置。因此，代码看起来像这样：",
    "However, apart from this application surface, you can also create your own surfaces and use them to create stunning or subtle special effects in your game. For example, you can use surfaces to \"catch\" instances, which can then be destroyed, and in this way you can create a decal effect where the sprite for the instance is displayed on the surface as if it still existed, permitting graphical effects like debris, blood, etc... without any real processing overhead. Another thing you can do with surfaces is use them as textures to be manipulated, or to create sprites \"on the fly\", or to create complex overlays. in fact, the uses for surfaces are endless!":"但是，除了这个应用程序表面，你还可以创建自己的表面，并使用它们在游戏中创建令人惊叹或微妙的特殊效果。例如，可以使用表面来\"捕捉\"实例，然后可以销毁这些实例，通过这种方式，可以创建贴花效果，其中实例的精灵显示在表面上，就好像它仍然存在一样，允许出现碎片、血液等图形效果，而不会产生任何实际的处理开销。你可以对表面做的另一件事情是把它们当作纹理来操纵，或者创建\"飞行中的精灵\"，或者创建复杂的叠加，实际上对表面的用途是无穷的！",
    "In the normal draw events, {}GameMaker{} doesn\u0027t actually draw directly to the screen, but rather draws to a {}surface{} called the {}application surface{}. This surface is basically a blank \"canvas\" that can then later be manipulated before being drawn to the screen when needed, and in most cases {}GameMaker{} handles this for you (although you can also manipulate it yourself in code for shaders, scaling and many other things - further details are given below).":"在正常绘制事件中，{}GameMaker{} 实际上并不直接绘制到屏幕，而是绘制到称为{}应用程序表面{}的{2}表面{3}。此表面基本上是一个空白的\"画布\"，稍后可以在需要时在绘制到屏幕之前对其进行操作，并且在大多数情况下 {}GameMaker{} 会为您处理此事件(尽管您也可以在着色器、缩放和许多其他事情的代码中自行操作它，但下面会提供进一步的详细信息)。",
    "Next, you would draw the things you wish as well as perform any other manipulations.":"接下来，您将绘制所需的内容以及执行任何其他操作。",
    "Normal surfaces are quite easy to use, but there are a few basic rules to be followed when you use them:":"法线表面非常容易使用，但使用它们时需要遵循一些基本规则：",
    "Once you are done you reset the drawing target so that all further drawing happens on the screen again.":"完成后，将重置绘制目标，以便所有进一步的绘制再次出现在屏幕上。",
    "One thing to note is that should you require drawing the whole display to a surface (including tiles, backgrounds etc...) you can simply access the application surface itself (see below for further details) or you could assign a surface to a view port using the variable {}{}view_surface_id[0..7]{}{} as with this, all that is visible in that view port will be drawn to the corresponding surface.":"需要注意的一点是，如果需要将整个显示绘制到一个表面(包括图块、背景等)，可以简单地访问应用程序表面本身(有关详细信息，请参阅下面的内容)，或者可以使用变量{}{}view_surface_id[ 0..7 ]{}{}将表面指定给视口，因此，在该视口中可见的所有内容都将绘制到相应的表面。",
    "Pre-draw event{} &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;--- &gt; {}the application surface is created (if it doesn\u0027t exist) and the render target is set{}":"绘制前事件{}---&gt;{}将创建应用程序表面(如果它不存在)并设置渲染目标{}",
    "Second, you should note that surfaces can require large quantities of VRAM to be used, and so you should attempt to keep them as small as possible. Normally you would try and keep them no larger than the size of the view or display window.":"其次，应注意，表面可能需要大量 VRAM 才能使用，因此应尝试将其保持尽可能小的尺寸。通常，您会尝试使它们不大于视图或显示窗口的大小。",
    "Surfaces":"表面",
    "The basic use of a surface would be as follows:":"表面的基本用途如下：",
    "The following functions exist for drawing surfaces:":"绘制表面具有以下函数：",
    "The following functions exist to deal with surfaces (these functions are specific for creating and manipulating surfaces, but to actually draw them to the screen you should be using the specific draw functions that can be found&nbsp;below):":"以下函数用于处理表面(这些函数专用于创建和操作表面，但要将它们实际绘制到屏幕，应使用下面可以找到的特定绘制函数)：",
    "The use of this surface means that you can easily create incredible transitions using shaders, or take the screen and wrap it around a 3D form, or simply scale a low-res game up to any resolution screen... The possibilities are endless!":"使用此表面意味着您可以使用着色器轻松创建令人难以置信的过渡，或者将屏幕包裹在3D形状周围，或者简单地将低分辨率游戏缩放到任何分辨率屏幕...可能性是无穷的！",
    "Third, you should {}only create surfaces in the draw event{}. If you create a surface in the Create Event of an instance, you could potentially get the {}same{} index as the {}application_surface{}. This can then cause lots of problems and confusion as you think you are&nbsp;using your own surface, but you are actually using the current render target. You should also always try to limit {}drawing{} to a surface in the draw event too, since due to the optimised way in which {}GameMaker{} draws to the screen, it is recommended that you keep all draw functions {}within the draw event{} - this includes clearing a surface when it is first created, etc... Drawing to a surface outside of the draw event is possible and may even be necessary for some effects, but it\u0027s not how it {}should{} be done.":"第三，{}只应在绘制事件中创建表面{}。如果在实例的\"创建事件\"中创建表面，则可能会获得与 {}application_surface{} {2}相同的{3}个索引。这可能会导致许多问题和混淆，因为您认为使用的是自己的表面，但实际上使用的是当前渲染目标。您还应该始终尝试将{}绘制{}限制在绘制事件中的表面，因为 {}GameMaker{} 绘制到屏幕的优化方式，建议您将所有绘制函数{}保留在绘制事件{}-这包括在首次创建表面时清除表面，等等...绘制到绘制事件外部的表面是可能的，甚至对于某些效果可能是必需的，但这不是{}应该如何进行{}。",
    "To access this surface, you need to use the built-in global variable {}application_surface{} which is explained on the following page:":"要访问此表面，您需要使用内置全局变量 {}application_surface{}，该变量在以下页面中进行了说明：",
    "When you run your game, this surface is created the first time that the {}draw event{} is called in each new room that you enter, which means that nothing is drawn until that point. However, you can still get the application surface position and resize it in the {}Create Event{} or any other event without getting any errors and the values used will be relevant to the surface when it is created. The actual sequence of events for the creation&nbsp;and drawing of the application surface is as follows:":"运行游戏时，在您进入的每个新房间中第一次调用{}绘制事件{}时会创建此表面，这意味着在此之前不会绘制任何内容。但是，您仍然可以在{}创建事件{}或任何其他事件中获取应用程序表面位置并调整其大小，而不会出现任何错误，并且在创建表面时使用的值将与表面相关。创建和绘制应用程序表面的实际事件顺序如下：",
    "You also have a few specialist functions that are designed {}only {}for use with the application surface:":"您还具有一些专业函数，这些函数仅设计为{}用于应用程序表面：",
    "You first create a surface and assign its index to a variable.":"首先创建表面并将其索引指定给变量。",
    "You would then set the drawing target to the surface rather than the display.":"然后将绘制目标设置为表面而不是显示。",
    "{}NOTE{}&nbsp;This is not true of the {}application surface{}, only user-created surfaces.":"{}注意{}这不适用于{}应用表面{}，只适用于用户创建的表面。",
    "{}NOTE{}: The only thing you {}cannot{} do with the application surface is free it. It always exists, although the index value to access it may change.":"{}注意{}：{}不能对应用程序表面执行的唯一操作是将其释放。它始终存在，尽管用于访问它的索引值可能会更改。",
    "{}NOTE{}{}&nbsp;{}This doesn\u0027t appear to happen with sprites or other visual assets (but actually does!) as they are also stored in regular memory (RAM) and when they are removed from texture memory (VRAM) they immediately get restored from regular memory when the game regains focus.":"{}注意{}{}{}这种情况似乎不会发生在精灵或其他视觉资源上(但实际上会发生！)，因为它们也存储在常规存储器 (RAM) 中，当它们从纹理存储器 (VRAM) 中移除时，当游戏重新聚焦时，它们会立即从常规存储器中恢复。",
    "{}{}Draw GUI begin event":"{}{}绘制 GUI 开始事件",
    "{}{}For each visible view port, or, if no views ports are active, once {} {}Draw begin event{} {}Draw event{} {}Draw end event{} &nbsp; &nbsp; &nbsp; &nbsp; --- &gt; {}the application surface render target is reset here{}{} {} ":"{}{}对于每个可见视图端口，或者，如果没有活动的视图端口，则执行一次{}{}绘制开始事件{}{}绘制事件{}{}绘制结束事件{}---&gt;{}此处重置应用程序表面渲染目标{}{}{}",
    "{}{}NOTE{}&nbsp;{}When working with surfaces there is the possibility that they can cease to exist at any time due to them being stored in texture memory. You should&nbsp;{}ALWAYS{}&nbsp;check that a surface exists using&nbsp;{}{}{}surface_exists(){}{}{}&nbsp;before referencing them directly.":"{}{}注意{}{}使用表面时，由于表面存储在纹理内存中，因此表面可能随时停止存在。在直接引用表面之前，应该{}始终{}使用{}{}{}surface_exists(){}{}{}检查表面是否存在。",
    "{}{}Post draw event{} &nbsp; &nbsp; &nbsp; &nbsp; --- &gt; {}the application surface is now drawn to the {}display buffer{} by default{} &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;{}(although you can switch this off using&nbsp;{}{}application_surface_draw_enable(){}{})":"{}{}绘制后事件{}---&gt;{}默认情况下，应用程序表面将绘制到{}显示缓冲区{}中{}{}(虽然您可以使用 {}{}application_surface_draw_enable(){}{} 关闭此函数)"
}