{
    "Note that you can change these values directly within the array and pass the full array to the function as a single argument (as shown in the example below).":"请注意，您可以直接在数组中更改这些值，并将整个数组作为单个参数传递给函数(如下例所示)。",
    "The above code creates a local array and gets the current extended blend mode with separate alpha values. This array is then manipulated and returned to set the blend mode.":"上述代码将创建一个局部数组，并获取具有单独Alpha值的当前扩展混合模式。然后操纵该数组并返回以设置混合模式。",
    "The values of the array will be one of the following constants (\"s\" denotes a value taken from the source while a \"d\" denotes a value from the destination):":"数组的值将是以下常量之一(\"s\"表示从源获取的值，而\"d\"表示从目标获取的值)：",
    "This function can be used to retrieve the current extended blend mode being used for drawing, separating out the blend modes into two parts - the RGB component and the Alpha component. The function returns a 4 element 1D array with the following elements in it:":"此函数可用于检索用于绘制的当前扩展混合模式，将混合模式分为两部分- RGB 组件和Alpha组件。函数返回一个包含以下元素的4 element 1D数组：",
    "When creating the extended blend modes in this way, the RGB components will be taken from one blend mode and the Alpha component will be taken from another, so that - for example - if you use {}bm_zero{} (0, 0, 0, 0) as the RGB blend mode and {}bm_one{} as the alpha blend mode, you will get a composite blend of (0,0,0,1).":"以这种方式创建扩展混合模式时，将从一个混合模式获取 RGB 组件，从另一个混合模式获取 Alpha 组件，因此，例如，如果使用 {}bm_zero{}(0,0,0,0) 作为 RGB 混合模式，{}bm_one{} 作为 Alpha 混合模式，将获得 (0,0,0,1) 的复合混合。",
    "[0] = Source blend mode minus the alpha component (default is {}bm_src_alpha{} (As, As, As))":"[0] = 源混合模式减去 Alpha 分量 (默认为 {}bm_src_alpha{}(As、As、As))",
    "[1] = Destination blend mode minus the alpha component (default is {}bm_inv_src_alpha{} (1-As, 1-As, 1-As))":"[1] = 目标混合模式减去 Alpha 分量 (默认为 {}bm_inv_src_alpha{}(1-As，1-As，1-As))",
    "[2] = Source alpha component (default is {}bm_src_alpha{} (As))":"[2] = 源 Alpha 组件 (默认为 {}bm_src_alpha{}(As))",
    "[3] = Destination alpha component (default is {}bm_inv_src_alpha{} (1-As))":"[3] = 目标 Alpha 组件 (默认为 {}bm_inv_src_alpha{}(1-As))"
}