{
    "Destination blend mode factor Alpha (see constants above)":"目标混合模式因子Alpha(参见上面的常量)",
    "Destination blend mode factor for RGB&nbsp;(see constants above)":"Rgb的目标混合模式因子(参见上面的常量)",
    "Guide To Using Blendmodes":"使用混合模式的指南",
    "Note that you can either supply four individual arguments to this function or you can supply an array of arguments (as returned by the function {}{}gpu_get_blendmode_ext_sepalpha(){}{} for example). If supplying an array it should have the following four elements:":"请注意，您可以为此函数提供四个单独的参数，也可以提供一个参数数组(例如，由函数{}{}gpu_get_blendmode_ext_se丈(){}{}返回)。如果提供数组，则应具有以下四个元素：",
    "Source blend mode factor Alpha (see constants above).":"源混合模式因子Alpha(请参见上面的常量)。",
    "Source blend mode factor for RGB (see constants above).":"Rgb的源混合模式因子(请参见上面的常量)。",
    "The above code creates a local array and gets the current extended blend mode with separate alpha values. This array is then manipulated and returned to set the blend mode.":"上述代码将创建一个局部数组，并获取具有单独Alpha值的当前扩展混合模式。然后操纵该数组并返回以设置混合模式。",
    "The following chart shows the RGBA values for each blend mode, where (Rs, Gs, Bs, As) are considered the source values and (Rd, Gd, Bd, Ad) are the destination values. The eleven constants that are available for use can be either source or destination (or both) when used in this function.":"下图显示了每个混合模式的Rgba值，其中(R、G、B、As)被视为源值，(Rd、Gd、Bd、Ad)是目标值。在此函数中使用时，可用的十一个常量可以是源或目标(或两者)。",
    "This function permits you to set the different component parts that should be factored together to create a custom blend mode, selecting different parts of different blend mode factors for the RGB components and the Alpha component. So the \"src\" and \"dest\" argument will use the first 3 blend mode values (RGB) and the \"alphasrc\" and \"alphadest\" arguments will take the last part of the blend mode factor. For example, if you have the RGB source as {}bm_zero{}, then (0, 0, 0) will be used. If you then set the Alpha source as bm_one then (1) will be used, giving a final source blend mode of (0, 0, 0, 1).":"通过此功能，您可以设置不同的零部件部件，这些零部件部件应该被系数化在一起以创建自定义混合模式，从而为Rgb零部件和Alpha零部件选择不同混合模式因子的不同部件。因此，\"src\"和\"dests\"参数将使用前3个混合模式值(Rgb)，\"alphasrc\"和\"alphadests\"参数将采用混合模式因子的最后一部分。例如，如果Rgb源为{}bm_zero{}，则将使用(0, 0,0 )。如果随后将Alpha源设置为bm_one，则将使用(1 )，最终源混合模式为(0, 0, 0,1 )。",
    "To help you get the most from blend modes and to help understand how they work and how they affect the final image being drawn to the screen, we recommend that you read the following guide:":"为了帮助您充分利用混合模式，并帮助您了解它们如何工作以及它们如何影响绘制到屏幕的最终图像，建议您阅读以下指南：",
    "When {}GameMaker{} goes to draw a pixel there is a source colour (the colour of the pixel we\u0027re going to draw) and a destination colour(the colour that\u0027s already in the pixel we\u0027re drawing to), so when determining the new colour of the pixel, the source and destination colours are calculated according to the chosen blend mode. Each component of the colours is stored as a floating point value between 0 and 1, and the new colour is calculated by multiply each component of the source colour by some factor and by multiplying each component of destination colour by some other factor and then adding the results together component by component.":"{}GameMaker{}在绘制像素时，会显示源颜色(我们要绘制的像素的颜色)和目标颜色(我们要绘制的像素中已有的颜色)，因此在确定像素的新颜色时，会根据所选的混合模式计算源颜色和目标颜色。将颜色的每个分量存储为介于0和1之间的浮点值，并且通过将源颜色的每个分量乘以某个因子，并通过将目标颜色的每个分量乘以某个其他因子，然后将结果与分量相加来计算新颜色。",
    "[0] = Source blend mode minus the alpha component (default is {}bm_src_alpha{} (As, As, As))":"[ 0 ]=源混合模式减去Alpha分量(默认值为{}bm_src_alpha{}(As、As、As))",
    "[1] = Destination blend mode minus the alpha component (default is {}bm_inv_src_alpha{} (1-As, 1-As, 1-As))":"[ 1 ]=目标混合模式减去Alpha分量(默认为{}bm_inv_src_alpha{}(1-As，1-As，1-As))",
    "[2] = Source alpha component (default is {}bm_src_alpha{} (As))":"[ 2 ]=源Alpha组件(默认值为{}bm_src_alpha{}(As))",
    "[3] = Destination alpha component (default is {}bm_inv_src_alpha{} (1-As))":"[ 3 ]=目标Alpha组件(默认为{}bm_inv_src_alpha{}(1-As))",
    "{}IMPORTANT!{} HTML5 without WebGL enabled will {}not{} be able to display use following modes correctly:":"{}重要信息！{}未启用WebGL的HTML5将无法{}正确显示以下使用模式："
}