{
    "Enable or disable texture filtering ({}true{} / {}false{})":"启用或禁用纹理过滤({}true{}/{}false{})",
    "The above code checks to see if texture repeating is on or off and switches it accordingly.":"上述代码检查纹理重复是打开还是关闭，并相应地将其切换。",
    "This function can be used to indicate to {}GameMaker{} whether textures should repeat ({}true{}) or not ({}false{}) when used for models and primitives. Normally texture widths and heights lie in the range 0 - 1, but if you specify a value larger than 1 by default the rest is not drawn (the entire texture will be drawn with an \"empty\" section corresponding to the percentage over 1 that is used. So a value of 2 for a texture width or height would draw the texture in half the space and leave the other half empty). However, by using this function to set repeat to true the texture is repeated automatically over all models and primitives. The likely use case for these functions is for repeating a texture in 3D but in order for it to work and not pull images from the rest of the texture page, the sprite used will need to be marked as being on a \"Separate Texture Page\" in the Sprite Editor.":"此函数可用于向{}GameMaker{}指示在用于模型和基本体时纹理是否应该重复({}true{})或({}false{})。通常，纹理宽度和高度在0-1范围内，但如果默认情况下指定的值大于1，则不会绘制其余部分(整个纹理将使用与所使用的大于1的百分比相对应的\"空\"部分绘制)。因此，如果纹理宽度或高度的值为2，则会在一半的空间中绘制纹理，并将另一半留空)。但是，通过使用此函数将重复设置为true，会在所有模型和基本体上自动重复纹理。这些函数的可能使用情形是在3D中重复纹理，但为了使其工作而不是从纹理页面的其余部分拉出图像，需要在精灵编辑器中将使用的精灵标记为\"单独的纹理页面\"。",
    "{}NOTE{}: Sprites and backgrounds are always drawn without repeating, so once you draw a sprite or background this value is reset to {}false{}. This default behaviour will not affect texture stage settings (ie: calling the function will, but the internal setting to false will not).":"{}注意{}：始终绘制精灵和背景而不重复，因此一旦绘制精灵或背景，此值将重置为{}false{}。此默认行为不会影响纹理载物台设置(即：调用函数将会影响纹理载物台设置，但内部设置为false不会影响纹理载物台设置)。",
    "{}NOTE{}: This setting will over-ride any texture stage repeats set for shaders when using the function {}{}gpu_set_texrepeat_ext(){}{}.":"{}注意{}：使用函数{}{}gpu_set_texrepeat_ext(){}{}时，此设置将覆盖为着色器设置的任何纹理载物台重复项。"
}