{
    "All supported {}JSDoc identifiers{} (e.g. {}@desc{}, {}@param{}, {}@url{}, etc.)":"所有受支持的 {}JSDoc 标识符 {}( 例如 {}@desc{}、{}@param{}、{}@url{} 等)",
    "Also see: Contextual options in&nbsp;{}The Edit Menu{}.":"另请参阅：{} 编辑菜单 {} 中的上下文选项。",
    "Any {}{}{} brackets, {}begin ... end{}":"任何 {}{ }{} 括号、{} 开始 ... 结束 {}",
    "Anything selected can be copied, cut{} {}or pasted{} {}using the standard keyboard shortcuts of {}{}CTRL/CMD + C{},{} {}{}CTRL/CMD + X{}{} and {}{}CTRL/CMD + V{}{}.":"使用标准键盘快捷键 {4}{5}CTRL/CMD + C{6}、{7}{8}{9}CTRL/CMD + X{10}{11} 和 {12}{13}CTRL/CMD + V{14}{15}{}{} 可以复制、剪切 {} 或粘贴 {} 任何选定内容。",
    "As described on {}The Code Editor{}, some asset types contain {}documents{} within them. For example, Objects have {}events{}, Timelines have {}moments{}, and Shaders have {}fragment{} and {}vertex&nbsp;{}shaders, which are separate {}documents{} within an asset.":"如 {} 代码编辑器 {} 中所述，某些资产类型中包含 {} 文档 {}。例如，对象具有 {} 事件 {}，时间轴具有 {} 时刻 {}，着色器具有 {} 片段 {} 和 {} 顶点 {} 着色器，它们是资产内的独立 {} 文档 {}。",
    "As multicursors are inserted, the last one becomes the active text cursor. When a navigation input clears the multicursor selection, this is the place where the single, active text cursor will be placed.":"插入多个光标后，最后一个光标将成为活动文本光标。当导航输入清除多光标选择时，这就是放置单个活动文本光标的位置。",
    "Auto-Indent":"自动缩进",
    "Auto-indentation is also supported for code pasted from the clipboard, which can be enabled from the {}preferences{}, with one of the following indent modes:":"从剪贴板粘贴的代码也支持自动缩进，可以通过以下缩进模式之一从 {} 首选项 {} 启用自动缩进：",
    "By default, the editor will display all documents for the current asset at the same time, one after another. This can be disabled in the&nbsp;{}Code Editor Preferences{}.":"默认情况下，编辑器将同时显示当前资产的所有文档，一个接一个。可以在 {} 代码编辑器首选项 {} 中禁用此功能。",
    "By default, the line your text cursor is on is highlighted. You can change this in the&nbsp;{}Code Editor Preferences{}.":"默认情况下，文本光标所在的行会突出显示。您可以在 {} 代码编辑器首选项 {} 中更改此设置。",
    "Code Folding":"代码折叠",
    "Code Selection":"代码选择",
    "Comments started with {}BUG{}, {}TODO{} or {}HACK{}":"以 {}BUG{}、{}TODO{} 或 {}HACK{} 开头的评论",
    "Contents":"内容",
    "Context Menu":"上下文菜单",
    "Document Manipulation":"文件操作",
    "Documents &amp; Headers":"文件及标头",
    "Documents can also have JSDoc&nbsp;comments that define the properties of the functions they contain, so when you use the functions in your code they show up in auto-complete along with their arguments and other details. See&nbsp;{}JSDoc Comments{}&nbsp;for more information.":"文档还可以有 JSDoc 注释来定义它们所包含的函数的属性，因此当您在代码中使用这些函数时，它们会自动完成以及它们的参数和其他详细信息。请参阅 {}JSDoc 注释 {} 了解更多信息。",
    "Editing GML":"编辑 GML",
    "Escape codes in strings (e.g. {}\\n{}, {}\\\"{})":"字符串中的转义码 (例如 {}\\n{}、{}\\\"{})",
    "Find &amp; Replace":"查找 和 代替",
    "Folding for these is only provided if the body is surrounded in {}{}{} brackets (multi-line)":"仅当正文被 {}{ }{} 括号 (多行) 包围时才提供折叠",
    "Fonts that make use of ligatures for special characters (such as combined {}&lt;={} or {}!={} operators) are supported as well (like {}JetBrains Mono{}). This has to be enabled from the&nbsp;{}Theme{}&nbsp;preferences.":"还支持使用特殊字符连字 (例如组合的 {}&lt;={} 或 {}!={} 运算符) 的字体 (例如 {}JetBrains Mono{})。必须从 {} 主题 {} 首选项启用此功能。",
    "For GML code completion features, see:&nbsp;{}Code Completion{}":"有关 GML 代码完成功能，请参阅：{} 代码完成 {}",
    "For GML documents, the following parts are foldable:":"对于 GML 文档，以下部分是可折叠的：",
    "For GML documents, the&nbsp;{}Code Editor{} will display either {}GML{} Code or {}GML Visual{} depending on the type of the document.":"对于 GML 文档，{} 代码编辑器 {} 将根据文档类型显示 {}GML{} 代码或 {}GML Visual{}。",
    "For Objects and Timelines, since they won\u0027t have any documents to begin with, you will see this:":"对于对象和时间线，由于它们一开始就没有任何文档，因此您将看到以下内容：",
    "For Objects, parent events will be displayed in child objects but will be greyed out unless they are overridden/inherited.":"对于对象，父事件将显示在子对象中，但除非被覆盖 / 继承，否则将显示为灰色。",
    "For example, all events for an {}Object{} or both {}Shader{} files are displayed within the same editor:":"例如，{}Object{} 或两个 {}Shader{} 文件的所有事件都显示在同一编辑器中：",
    "For more information, see&nbsp;{}Parent Objects{}.":"如需了解更多信息，请参阅 {} 父对象 {}。",
    "From the&nbsp;{}Code Editor Preferences{}, you can choose to use spaces or tabs for indentation (i.e. what is inserted when you press {}tab{}&nbsp;in a document).":"在 {} 代码编辑器首选项 {} 中，您可以选择使用空格或制表符进行缩进 (即在文档中按 {} 制表符 {} 时插入的内容)。",
    "Further Reading":"进一步阅读",
    "Guides":"指南",
    "Here are some basic inputs for manipulating a document:":"以下是操作文档的一些基本输入：",
    "Highlighting":"突出显示",
    "Hyperlinks in comments and strings":"注释和字符串中的超链接",
    "If the text cursor is on a {}break{} or a {}continue{}, the parent loop or statement ({}for{}, {}while{} or {}case{}) is highlighted":"如果文本光标位于 {}break{} 或 {}continue{} 上，则父循环或语句 ({}for{}、{}while{} 或 {}case{}) 会突出显示",
    "If you have text selected, other occurrences of the selected string are highlighted":"如果您选择了文本，则所选字符串的其他出现位置将突出显示",
    "In Replace mode, a second text field allows you to enter a string of text to replace search results with. This mode contains the following buttons:":"在替换模式下，第二个文本字段允许您输入文本字符串来替换搜索结果。该模式包含以下按钮：",
    "Indentation Modes":"压痕模式",
    "Initials of symbol names are also accepted (like {}mgc{} above showing {}mp_grid_c...{} functions). For other features when editing GML Code, see&nbsp;{}Code Completion{}.":"也接受符号名称的首字母 (如上面显示 {}mp_grid_c...{} 函数的 {}mgc{})。有关编辑 GML 代码时的其他功能，请参阅 {} 代码完成 {}。",
    "Inserting a new line will auto-indent the next line where appropriate (e.g. after starting an {}if{} statement).":"插入新行将在适当的情况下自动缩进下一行 (例如，在启动 {}if{} 语句后)。",
    "International Support (RTL)":"国际支持 (RTL)",
    "It will also highlight matching occurrences when you have your text cursor on a symbol. For example:":"当您将文本光标放在符号上时，它还会突出显示匹配的事件。例如：",
    "Multi-line comments ({}///{}, {}/* ... */{})":"多行注释 ({}///{}、{}/* ... */{})",
    "Multicursor":"多光标",
    "Navigation Between Documents":"文档之间的导航",
    "Note that if you want to do a {}global{} {}search{} (i.e.: search the whole project rather than the currently open documents), then you can press&nbsp;{}CTRL/CMD + SHIFT + F{}.":"请注意，如果您想要执行 {} 全局 {}{} 搜索 {}( 即：搜索整个项目而不是当前打开的文档)，则可以按 {}CTRL/CMD + SHIFT + F{}。",
    "Other occurrences of the word beneath your text cursor will be highlighted":"文本光标下方出现的其他单词将突出显示",
    "Parent View":"父视图",
    "Part of this is covered under&nbsp;{}Code Completion{}.":"其中部分内容包含在 {} 代码完成 {} 中。",
    "Press {}CTRL/CMD + F{} to open this window in Find mode, and {}CTRL/CMD + H{} to open it in Replace mode.":"按 {}CTRL/CMD + F{} 可在查找模式下打开此窗口，按 {}CTRL/CMD + H{} 可在替换模式下打开此窗口。",
    "Press {}CTRL/CMD + R{} to rename the selected identifier":"按 {}CTRL/CMD + R{} 重命名所选标识符",
    "Rainbow Brackets":"彩虹括号",
    "Rainbow Brackets are&nbsp;{}enabled by default{}. This colours each pair of brackets at a level ({}{}{}, {}(){}, {}[]{}, {}[? ]{}, {}[| ]{}, {}begin{}, {}end{}, etc.) with the same colour, making it easier to identify where a block begins and ends.":"彩虹括号{} 默认启用 {}。这会为某个级别的每对括号着色 ({}{ }{},{}(){},{}[]{},{}[? ]{},{}[| ]{},{}begin{}、{}end{} 等) 使用相同的颜色，从而更容易识别块的开始和结束位置。",
    "Regions ({}#region ... #endregion{})":"区域 ({}#region ... #endregion{})",
    "Rendering":"渲染",
    "Right-clicking anywhere within the Editor will show you the following options:":"右键单击编辑器中的任意位置将显示以下选项：",
    "See:&nbsp;{}Code Completion{}":"请参阅：{} 代码完成 {}",
    "Text Cursor Location History":"文本光标位置历史记录",
    "Text Cursor Navigation":"文本光标导航",
    "Text Highlighting":"文本突出显示",
    "The \"{}Detect Tab Type{}\" preference, enabled by default, makes the editor use whichever indentation mode the currently open document is using, overriding the mode set in preferences. This is useful for ensuring consistency within a document, regardless of overall project-level consistency.":"默认情况下启用的 \"{} 检测选项卡类型 {}\" 首选项使编辑器使用当前打开的文档所使用的缩进模式，并覆盖首选项中设置的模式。无论整体项目级别的一致性如何，这对于确保文档内的一致性很有用。",
    "The \"{}Tab Size{}\" preference determines how long your indentation tabs are. When using spaces for indentation, pressing {}TAB{} will insert this number of spaces. When using tabs, it will insert one tab character which appears as long as the number of spaces set in \"{}Tab Size{}\".":"\"{} 制表符大小 {}\" 首选项决定缩进制表符的长度。使用空格进行缩进时，按 {}TAB{} 将插入此数量的空格。使用制表符时，它将插入一个制表符，该字符的长度与 \"{} 制表符大小 {}\" 中设置的空格数一样长。",
    "The Find &amp; Replace window lets you search for text within all open documents in an Editor window, and optionally replace occurrences with a new string of text.":"寻找与发现替换窗口允许您在编辑器窗口中的所有打开的文档中搜索文本，并可以选择用新的文本字符串替换出现的内容。",
    "The document header for such events will display a menu, where you can choose to open the original event for editing, inherit the event or override it:":"此类事件的文档标题将显示一个菜单，您可以在其中选择打开原始事件进行编辑、继承事件或覆盖它：",
    "The exception to this are switch statements and their cases, which do not require brackets for folding":"switch 语句及其 case 是个例外，它们不需要括号来折叠",
    "The following inputs can be used for navigating with the text cursor:":"以下输入可用于使用文本光标进行导航：",
    "The following inputs make use of this functionality:":"以下输入利用了此功能：",
    "The other end of a bracket pair ({}[]{}, {}{}{}, {}(){}, or {}begin...end{}) is highlighted":"括号对的另一端 ({}[]{}、{}{ }{}、{}(){} 或 {}begin...end{}) 突出显示",
    "The rest of this page will cover editing text-based documents, i.e. anything that is not {}GML Visual{}.":"本页的其余部分将介绍编辑基于文本的文档，即任何非 {}GML Visual{} 的文档。",
    "The text cursor\u0027s actions are limited to the current document, even when multiple documents are visible at once, so something like selecting text via keyboard navigation will not continue the selection into the next/previous document.":"即使同时显示多个文档，文本光标的操作也仅限于当前文档，因此通过键盘导航选择文本之类的操作不会继续选择下一个 / 上一个文档。",
    "The text cursor\u0027s location is logged in the history when you modify text on a new line, or use {}Go To Declaration{}. You can navigate this history to restore the text cursor\u0027s location using the following shortcuts:":"当您修改新行上的文本或使用 {} 转到声明 {} 时，文本光标的位置会记录在历史记录中。您可以使用以下快捷键导航此历史记录以恢复文本光标的位置：",
    "The {}Code Editor{} supports multiple text cursors at once, in a single document, allowing you to insert text in multiple places.":"{} 代码编辑器 {} 支持在单个文档中同时使用多个文本光标，允许您在多个位置插入文本。",
    "The {}Code Editor{} will open when you create an asset that requires it (e.g. Objects, Scripts, Shaders, etc.).":"当您创建需要它的资源 (例如对象、脚本、着色器等) 时，{} 代码编辑器 {} 将会打开。",
    "The&nbsp;{}Code Editor{} supports right-to-left text.":"{} 代码编辑器 {} 支持从右到左的文本。",
    "There are some handy shortcuts for document navigation:":"有一些方便的文档导航快捷方式：",
    "This section covers how the {}Code Editor{} renders parts of your code.":"本部分介绍 {} 代码编辑器 {} 如何呈现部分代码。",
    "This section covers navigating with the text cursor.":"本节介绍如何使用文本光标进行导航。",
    "This window contains the following buttons:":"该窗口包含以下按钮：",
    "Tooltips":"工具提示",
    "Tooltips appear when hovering over part of your code that is either highlighted by diagnostics, or is a keyword that has documentation (for custom functions,&nbsp;{}JSDoc{} information is shown).":"将鼠标悬停在通过诊断突出显示的代码部分或包含文档的关键字 (对于自定义函数，会显示 {}JSDoc{} 信息) 时，会出现工具提示。",
    "Upon pasting code into the editor which contains leading whitespace, that whitespace will be converted into your selected indentation mode, e.g. you insert a line starting with 6 spaces, and you are using tab characters with a \"{}Tab Size{}\" of 4, then the first 4 spaces in the pasted line will become a tab character and the rest 2 will remain spaces (as there are not enough to be converted into a tab character).":"将包含前导空格的代码粘贴到编辑器中后，该空格将转换为您选择的缩进模式，例如您插入以 6 个空格开头的行，并且使用 \"{} 制表符大小 {}\" 为 4 的制表符，则粘贴行中的前 4 个空格将成为制表符，其余 2 个空格仍为空格 (因为没有足够的字符可以转换为制表符)。",
    "When all documents are displayed in the same editor, you can easily navigate between them by scrolling or using the {}Vertical Scrollbar{}.":"当所有文档都显示在同一编辑器中时，您可以通过滚动或使用 {} 垂直滚动条 {} 轻松地在它们之间导航。",
    "When scrolling down into a document, its header will stick to the top so you can see the name of the document. This can be disabled from the {}Preferences{}.":"向下滚动到文档时，其标题将粘在顶部，以便您可以看到文档的名称。可以从 {} 首选项 {} 中禁用此功能。",
    "While a selection is active, you can:":"当选择处于活动状态时，您可以：",
    "While writing code you will get syntax highlighting and auto-complete for the language you are currently editing.":"在编写代码时，您将获得当前正在编辑的语言的语法突出显示和自动完成功能。",
    "Whitespace guides can also be enabled, which will render spaces as dots&nbsp;and tab characters as horizontal lines.":"还可以启用空白参考线，这会将空格渲染为点，将制表符渲染为水平线。",
    "Writing Code":"编写代码",
    "You can also enable sticky Statement Headers, so the initial lines for foldable regions stick to the top while they\u0027re visible.":"您还可以启用粘性语句标题，因此可折叠区域的初始行在可见时会粘在顶部。",
    "You can change these colours in the&nbsp;{}Feather{} settings. Read more about errors on&nbsp;{}Syntax Errors (Feather Messages){}.":"您可以在 {} 羽化 {} 设置中更改这些颜色。有关错误的更多信息，请参阅 {} 语法错误 (Feather 消息 ){}。",
    "You can have your text cursor at the last line of your event, and press the {}down arrow key{} to move to the first line of the next event document.":"您可以将文本光标置于事件的最后一行，然后按 {} 向下箭头键 {} 移至下一个事件文档的第一行。",
    "You can right-click on a Document Header for options that are specific to the opened asset. For Object Events, the options shown are the same as those for an event\u0027s context menu, which are documented on&nbsp;{}Object Events{}.":"您可以右键单击文档标题以获取特定于打开的资产的选项。对于对象事件，显示的选项与事件上下文菜单的选项相同，这些选项记录在 {} 对象事件 {} 中。",
    "You can select parts of your text using the following inputs:":"您可以使用以下输入选择部分文本：",
    "{}: Enabling this will allow you to enter a {}Regular Expression{} into the search field, giving you more flexibility in searching for text.":"{}：启用此选项将允许您在搜索字段中输入 {} 正则表达式 {}，从而使您可以更灵活地搜索文本。",
    "{}: This filters the search so only occurrences that match the exact case of the input string are shown. For example, if you have a sprite called \"{}spr_Dog{}\" and do a search for \"dog\" with this toggle {}off{}, then the sprite string will be highlighted, however if the toggle is {}on {}then it won\u0027t since \"Dog\" is no longer considered the same as \"dog\".":"{}：这会过滤搜索，以便仅显示与输入字符串的大小写完全匹配的匹配项。例如，如果您有一个名为 \"{}spr_Dog{}\" 的精灵，并在 {} 关闭 {} 此开关的情况下搜索 \"dog\"，则该精灵字符串将会突出显示，但如果此开关 {} 开启 { } 那么就不会了，因为 \"Dog\" 不再被认为与 \"dog\" 相同。",
    "{}: This toggles Replace Mode.":"{}：这会切换替换模式。",
    "{}: This will highlight the next search occurrence.":"{}：这将突出显示下一个搜索事件。",
    "{}: This will highlight the previous search occurrence.":"{}：这将突出显示之前的搜索结果。",
    "{}: When enabled, the search will only highlight those strings that match the whole input string. For example, with it turned off, a search for \"{}random{}\" will show all words that contain this string - like {}irandom(){}, or {}randomise(){} - while enabling it would only show the function {}random(){}.":"{}：启用后，搜索将仅突出显示与整个输入字符串匹配的那些字符串。例如，关闭该功能后，搜索 \"{}random{}\" 将显示包含该字符串的所有单词 - 例如 {}irandom(){} 或 {}randomise(){}- 而启用它只会显示显示函数 {}random(){}。",
    "{}:&nbsp;Clicking this will replace the next search string found in the document with the given replace string. Note that the \"next\" term is considered the next one after the current cursor position.":"{}：单击此按钮会将文档中找到的下一个搜索字符串替换为给定的替换字符串。请注意，\"下一个 \" 术语被认为是当前光标位置之后的下一个术语。",
    "{}:&nbsp;Clicking this will replace {}all {}examples of the search string within the document using the given replace string.":"{}：点击此按钮将使用给定的替换字符串替换文档中搜索字符串的所有示例。{}",
    "{}ALT/OPT + LMB{}: Move the cursor to the line/column under the mouse in box selection mode":"{}ALT/OPT + LMB{}：在框选模式下将光标移动到鼠标下方的行 / 列",
    "{}ALT/OPT + SHIFT + LEFT/RIGHT{}: Extend box selection left/right":"{}ALT/OPT + SHIFT + LEFT/RIGHT{}：向左 / 向右扩展框选择",
    "{}ALT/OPT + SHIFT + UP/DOWN{}: Insert a multicursor on the previous/next line if none exist, extending the box selection":"{}ALT/OPT + SHIFT + 向上 / 向下 {}：在上一行 / 下一行中插入多光标 (如果不存在)，从而扩展框选择",
    "{}ALT/OPT + UP/DOWN{}: Move the text cursor to the previous/next document":"{}ALT/OPT + 向上 / 向下 {}：将文本光标移至上一个 / 下一个文档",
    "{}Arrow keys{}: Move the text cursor left/right/up/down":"{} 箭头键 {}：左 / 右 / 上 / 下移动文本光标",
    "{}Braces{}: In addition to the previous behaviour, blocks beginning with {}{{}, {}({}, {}[{} or {}begin{} are indented.":"{} 大括号 {}：除了之前的行为之外，以 {}{{}、{}({}、{}[{} 或 {}begin{} 开头的块会缩进。",
    "{}CTRL/CMD + ALT + UP/DOWN{}: Move the text cursor to the previous/next region within the active document":"{}CTRL/CMD + ALT + 向上 / 向下 {}：将文本光标移动到活动文档中的上一个 / 下一个区域",
    "{}CTRL/CMD + ALT/OPT + HOME/END{}: Go to the first or last line among all the open documents.":"{}CTRL/CMD + ALT/OPT + HOME/END{}：转到所有打开的文档中的第一行或最后一行。",
    "{}CTRL/CMD + ALT/OPT + LEFT/RIGHT{}: When text is selected, it searches the document for all substrings of the selected text, and places multicursors at the beginning/end of all occurrences":"{}CTRL/CMD + ALT/OPT + LEFT/RIGHT{}：选择文本时，它会在文档中搜索所选文本的所有子字符串，并将多光标放置在所有匹配项的开头 / 结尾处",
    "{}CTRL/CMD + HOME/END{}: Go to the first or last line of the active document.":"{}CTRL/CMD + HOME/END{}：转到活动文档的第一行或最后一行。",
    "{}CTRL/CMD + HOME/END{}: Move the text cursor to the start or end of the active document":"{}CTRL/CMD + HOME/END{}：将文本光标移动到活动文档的开头或结尾",
    "{}CTRL/CMD + LEFT/RIGHT{}: Move left/right by one word boundary (a word is defined as {}alphanumeric_.{})":"{}CTRL/CMD + 左 / 右 {}：向左 / 右移动一个单词边界 (单词定义为 {} 字母数字_.{})",
    "{}CTRL/CMD + MINUS{}: Move the text cursor back one entry in the {}Text Cursor Location History{}, which is shared among editors, including editors that have been closed. Closed editors will be restored when needed. Multicursor locations are ignored.":"{}CTRL/CMD + 减号 {}：将文本光标移回 {} 文本光标位置历史记录 {} 中的一个条目，该历史记录在编辑器 (包括已关闭的编辑器) 之间共享。关闭的编辑器将在需要时恢复。多光标位置将被忽略。",
    "{}CTRL/CMD + SHIFT + MINUS{}: Move the text cursor forward one entry in the {}Text Cursor Location History{}.":"{}CTRL/CMD + SHIFT + MINUS{}：将文本光标在 {} 文本光标位置历史记录 {} 中向前移动一个条目。",
    "{}CTRL/CMD + UP/DOWN{}: Scroll the view up/down by 1 line":"{}CTRL/CMD + 向上 / 向下 {}：将视图向上 / 向下滚动 1 行",
    "{}CTRL/CMD + {{}:&nbsp;{}Move the Text Cursor to the matching brace under the text cursor, toggling between opening and closing brace. If the text cursor is not currently under a brace, but is inside of a braced region, the text cursor is moved to the opening brace; otherwise nothing happens.{}":"{}CTRL/CMD +{{}：{} 将文本光标移动到文本光标下的匹配大括号，在左大括号和右大括号之间切换。如果文本光标当前不在大括号下，而是在大括号区域内，则文本光标将移动到左大括号 ; 否则什么也不会发生。{}",
    "{}Click and drag with LMB{}: Move the selected text to a new position":"{} 使用 LMB 单击并拖动 {}：将所选文本移动到新位置",
    "{}Code will also be highlighted by \"diagnostic squiggles\", lines appearing under the offending part of code. There are three types of squiggles:":"{} 代码还将通过 \" 诊断波形曲线 \" 突出显示，这些线条出现在有问题的代码部分下方。波浪线分为三种类型：",
    "{}Convert case to...{}&nbsp;({}when text is selected{}) {} {}{}UPPERCASE{}{}&nbsp;{}({}CTRL/CMD + SHIFT + U{}): Converts selected text to {}UPPERCASE{}{} {}{}lowercase&nbsp;{}({}CTRL/CMD + U{}){}:{}&nbsp;Converts selected text to {}lowercase{}{} {}{}Proper Case&nbsp;{}({}ALT/OPT + U{}): Converts selected text to {}Proper Case{}{} {}{}Sentence case&nbsp;{}({}CTRL/CMD + ALT + U{}): Converts selected text to {}Sentence case{}{} {}{}iNVERTED:{}&nbsp;Converts selected text to {}iNVERTED cASE{} where uppercase characters are converted to lowercase and vice versa{} {}{}rAndOM cAse:{}&nbsp;Converts selected text to random casing{} {} ":"{} 将大小写转换为 ...{}({} 选择文本时 {}){}{}{} 大写 {}{}{}({}CTRL/CMD + SHIFT + U{})：转换所选文本转换为 {} 大写 {}{}{}{} 小写 {}({}CTRL/CMD + U{}){}：{} 将所选文本转换为 {} 小写 {}{}{}{} 正确大小写 {}({}ALT/OPT + U{})：将所选文本转换为 {} 正确大小写 {}{}{}{} 句子大小写 {}({}CTRL/CMD + ALT + U{})：将所选文本转换为 {} 句子大小写 {}{}{}{}iNVERTED：{} 将所选文本转换为 {}iNVERTED CASE{}，其中大写字符转换为小写，反之亦然 {}{}{}rAndOM cAse：{} 转换所选文本随机大小写 {}{}",
    "{}Copy{} ({}CTRL/CMD + C){}: Copy the selected text, or the whole line when no text is selected":"{} 复制 {}({}CTRL/CMD + C){}：复制所选文本，或在未选择任何文本时复制整行",
    "{}Cut{} ({}CTRL/CMD + X{}): Cut the selected text, or the whole line when no text is selected":"{} 剪切 {}({}CTRL/CMD + X{})：剪切所选文本，或在未选择任何文本时剪切整行",
    "{}Drag an asset from the Asset Browser into the {}Code Editor{}{}: This will replace the selected text with the name of the asset":"{} 将资源从资源浏览器拖动到 {} 代码编辑器 {}{}：这会将所选文本替换为资源名称",
    "{}END{}: Move the text cursor to the end of the line.":"{}END{}：将文本光标移至行尾。",
    "{}ESCAPE{}: Clear multicursors if any are set":"{}ESCAPE{}：清除多光标 (如果设置了)",
    "{}Each document begins with a \"header\", e.g. where it says \"{}Create{}\" before the contents of the Create event above, or \"{}Vertex Shader{}\" in the Shader asset. You can press&nbsp;&nbsp;{}&nbsp; next to it in the&nbsp;{}Gutter{} (on the left-hand side) to collapse that document.":"{} 每个文档都以 \" 标头 \" 开头，例如其中在上面的 Create 事件的内容之前显示 \"{}Create{}\"，或者在 Shader 资源中显示 \"{}Vertex Shader{}\"。您可以在 {} 装订线 {}( 左侧) 中按其旁边的 {} 以折叠该文档。",
    "{}Editing Code{}":"{} 编辑代码 {}",
    "{}Edit{}: {} {}{}Tab In&nbsp;{}({}TAB{}): Tab the current line{} {}{}Tab Out&nbsp;{}({}SHIFT + TAB{}): Untab the current line{} {}{}Comment&nbsp;{}({}CTRL/CMD + K{}): Comment line{} {}{}Uncomment&nbsp;{}({}CTRL/CMD + SHIFT + K{}): Uncomment line{} {}{}Duplicate{}{}&nbsp;{}({}CTRL/CMD + D{}): Duplicate the current line{} {}{}Join Lines&nbsp;{}({}CTRL/CMD + J{}): Joins current line and next line{} {}{}Sort lines alphanumerically:{}&nbsp;Sorts the selected lines alphanumerically, only shows when there is a valid selection{} {} ":"{} 编辑 {}：{}{}{} 按 Tab 键进入 {}({}TAB{})：按 Tab 键切换当前行 {}{}{} 按 Tab 键退出 {}({}SHIFT + TAB{})：取消按 Tab 键当前行 {}{}{} 注释 {}({}CTRL/CMD + K{})：注释行 {}{}{} 取消注释 {}({}CTRL/CMD + SHIFT + K{})：取消注释行 {}{}{} 复制 {}{}{}({}CTRL/CMD + D{})：复制当前行 {}{}{} 连接行 {}({}CTRL/CMD + J{}) ：连接当前行和下一行 {}{}{} 按字母数字顺序对行进行排序：{} 按字母数字顺序对所选行进行排序，仅在存在有效选择时显示 {}{}",
    "{}Error{}: These appear in a red colour":"{} 错误 {}：它们显示为红色",
    "{}Find Usages{} ({}Shift + F1{}): Finds all usages of the identifier and displays them in the Search Results window":"{} 查找用法 {}({}Shift + F1{})：查找标识符的所有用法并将其显示在搜索结果窗口中",
    "{}For more features that assist with code writing, see&nbsp;{}Code Completion{}.":"{} 如需了解更多有助于代码编写的功能，请参阅 {} 代码完成 {}。",
    "{}Full{}: In addition to the previous behaviour, rules from the document\u0027s&nbsp;language are also applied (e.g. for GML, {}switch{} cases will be intended, etc.)":"{} 完整 {}：除了之前的行为之外，还应用文档语言的规则 (例如，对于 GML，将采用 {}switch{} 情况等)",
    "{}Function{} declarations":"{} 函数 {} 声明",
    "{}Go To Declaration{} ({}F1{}): Navigates to the identifier\u0027s declaration (or manual entry, in case of a built-in GML identifier)":"{} 转到声明 {}({}F1{})：导航至标识符的声明 (或手动输入，如果是内置 GML 标识符)",
    "{}HOME{}: Move the text cursor to the start of the first non-whitespace character on the line, when pressed again it moves the text cursor to the true start of the line. Continuous pressing toggles between these two positions.":"{}HOME{}：将文本光标移动到行中第一个非空白字符的开头，再次按下时，会将文本光标移动到行的真正开头。连续按下可在这两个位置之间切换。",
    "{}Indentation guides are enabled by default, and appear as vertical lines, which can be disabled&nbsp;from the {}preferences{}.":"{} 缩进参考线默认处于启用状态，并显示为垂直线，可以从 {} 首选项 {} 中禁用。",
    "{}Indent{}&nbsp;the line(s) with {}{}Tab{}{} and {}reverse-indent{} with {}{}Shift + Tab{}{}":"使用 {}{} Tab {}{}{} 缩进{} 行，并使用 {}{}Shift + Tab{}{}{} 反向缩进 {}",
    "{}Insert...{}: {} {}{}UUID:{}&nbsp;A random{}&nbsp;{}{}UUIDv4{}{}&nbsp;{}in{}&nbsp;{}{}{}00000000-0000-0000-0000-000000000000{} format, replacing any selected text{}{} {}{}The options below appear only when text is selected:{} {} {}{}MD5:{}&nbsp;Hashes and replaces selected text with the MD5 algorithm{} {}{}SHA1:{}&nbsp;Hashes and replaces selected text with the SHA1 algorithm{} {}{}SHA256:{}&nbsp;Hashes and replaces selected text with the SHA256 algorithm{} {}{}To Base 64:{}&nbsp;Converts selected text to base64 encoded text{} {}{}From Base 64:{}&nbsp;Converts selected text from base64 encoded text. If the selected text is not a valid base64 string then nothing happens.{} {} {} {} ":"{} 插入 ...{}：{}{}{}UUID：{} 随机 {}{}{}UUIDv4{}{} 在 {}{}{}{}00000000-0000-0000-0000 中 -000000000000{} 格式，替换任何选定的文本 {}{}{}{} 以下选项仅在选择文本时出现：{}{}{}{}MD5：{} 使用 MD5 算法散列并替换选定的文本 { }{}{}SHA1：{} 使用 SHA1 算法散列并替换所选文本 {}{}{}SHA256：{} 使用 SHA256 算法散列并替换所选文本 {}{}{} 转为 Base 64：{} 转换所选文本为 Base64 编码文本 {}{}{} 从 Base 64：{} 将所选文本从 Base64 编码文本转换。如果所选文本不是有效的 Base64 字符串，则不会发生任何事情。{}{}{}{}",
    "{}Keep{}: The current line\u0027s indentation is copied to new lines":"{} 保留 {}：将当前行的缩进复制到新行",
    "{}LMB{}: Move the text cursor to the mouse position":"{}LMB{}：将文本光标移动到鼠标位置",
    "{}Navigation Between Documents{}":"{} 文档之间的导航 {}",
    "{}None{}: No indentation is inserted by the editor":"{} 无 {}：编辑器不插入缩进",
    "{}PAGE UP/PAGE DOWN{}: Move the text cursor up or down a full page (i.e. the number of lines visible in the editor), limited to the active document":"{}PAGE UP/PAGE DOWN{}：将文本光标向上或向下移动整页 (即编辑器中可见的行数)，仅限于活动文档",
    "{}Paste{} ({}CTRL/CMD + V{}): Paste text, replacing any selected text":"{} 粘贴 {}({}CTRL/CMD + V{})：粘贴文本，替换任何选定的文本",
    "{}Preview Declaration{} ({}ALT + F1{}): Previews the identifier\u0027s declaration (or manual entry, in case of a built-in GML identifier)":"{} 预览声明 {}({}ALT + F1{})：预览标识符的声明 (或手动输入，如果是内置 GML 标识符)",
    "{}Refactor Identifier{} ({}CTRL/CMD + R{}): Rename the identifier":"{} 重构标识符 {}({}CTRL/CMD + R{})：重命名标识符",
    "{}Regions{}: {} {}{}Fold All Regions{} ({}CTRL/CMD + M{}): Fold all the regions in the document{} {}{}Unfold All Regions{} ({}CTRL/CMD + U{}): Unfold all regions in the document{} {}{}Fold/Unfold region{} ({}CTRL/CMD + ENTER{}): Fold/unfold the region at the text cursor{} {} ":"{} 区域 {}：{}{}{} 折叠所有区域 {}({}CTRL/CMD + M{})：折叠文档中的所有区域 {}{}{} 展开所有区域 {}({}CTRL/CMD + U{})：展开文档中的所有区域 {}{}{} 折叠 / 展开区域 {}({}CTRL/CMD + ENTER{})：折叠 / 展开文本光标处的区域 {}{}",
    "{}Select All{} ({}CTRL/CMD + A{}): Select all text in the document":"{} 全选 {}({}CTRL/CMD + A{})：选择文档中的所有文本",
    "{}Suggestion{}: These appear in a blue colour":"{} 建议 {}：它们显示为蓝色",
    "{}The rightmost button in the&nbsp;{}Horizontal Scrollbar{}&nbsp;allows you to switch between {}GML Code{} and {}GML Visual{}.":"{} 通过 {} 水平滚动条 {} 中最右侧的按钮，您可以在 {}GML Code{} 和 {}GML Visual{} 之间切换。",
    "{}The text field allows you to enter a string of text to search for in the document(s), and contains a drop-down menu that display your past searches (limited to the current session of the IDE, however shared by all editor windows).":"{} 文本字段允许您输入要在文档中搜索的文本字符串，并包含一个下拉菜单，用于显示您过去的搜索 (仅限于 IDE 的当前会话，但由所有编辑器共享) 视窗)。",
    "{}The {}Code Editor{} will highlight parts of your text:":"{}{} 代码编辑器 {} 将突出显示部分文本：",
    "{}These options are explained below:":"{} 这些选项的说明如下：",
    "{}This&nbsp;{}Candidate Window{} will pop up while you are writing your code (normally after a slight pause, but this can be set in the {}Preferences{}) and give you a selection of \"best-fit\" answers in alphabetical order, followed by close suggestions.":"{} 在您编写代码时 (通常会稍作停顿，但这可以在 {} 首选项 {} 中进行设置)，此 {} 候选窗口 {} 将会弹出，并为您提供 \" 最适合 \" 答案的选择按字母顺序排列，然后是密切的建议。",
    "{}Tooltips{}":"{} 工具提示 {}",
    "{}Warning{}: These appear in a yellow colour":"{} 警告 {}：它们显示为黄色",
    "{}You can change these colours in a {}Theme{}&nbsp;and also define colours for deeper levels.":"{} 您可以在 {} 主题 {} 中更改这些颜色，也可以定义更深层次的颜色。",
    "{}You can click on the \"{}Create [Document]{}\" button to create your first document (in this example, clicking on \"{}Create Event{}\" would open the {}Events{} menu as it is an object).":"{} 您可以点击 \"{}Create [Document]{}\" 按钮来创建您的第一个文档 (在此示例中，点击 \"{}Create Event{}\" 将打开 {}Events{} 菜单，因为它是一个东西)。",
    "{}backspace{}: Deletes a single character at the text cursor\u0027s position. If at the start of a line, the newline is deleted and the text cursor is moved to the end of the previous line.&nbsp;{}If the \"Auto insert braces\" feature is enabled and the erased character is an initiating brace and the next character is a terminating brace, then both braces are deleted.{}":"{} 退格键 {}：删除文本光标位置处的单个字符。如果位于行首，则删除换行符，并将文本光标移动到上一行的末尾。{} 如果启用 \" 自动插入大括号 \" 功能，并且擦除的字符是起始大括号，下一个字符是终止大括号，则两个大括号都会被删除。{}",
    "{}ctrl/CMD + c{} or {}ctrl&nbsp;+ insert{}:&nbsp;{}If text is selected then the selected text is copied to the OS clipboard. If no text is selected and the line is not empty, then the whole line is copied. If no text is selected and the line is only whitespace or empty then nothing is copied to the OS clipboard.{}":"{}ctrl/CMD + c{} 或 {}ctrl + insert{}：{} 如果选择文本，则所选文本将复制到操作系统剪贴板。如果未选择任何文本且该行不为空，则复制整行。如果未选择任何文本且该行仅为空格或空，则不会将任何内容复制到操作系统剪贴板。{}",
    "{}ctrl/CMD + d{}: Duplicates the current line or the selected lines.":"{}ctrl/CMD + d{}：复制当前行或所选行。",
    "{}ctrl/CMD + j{}: Joins the current line with the next line, deleting the newline character at the end of the current line.":"{}ctrl/CMD + j{}：将当前行与下一行连接起来，删除当前行末尾的换行符。",
    "{}ctrl/CMD + v{} or {}shift + insert{}:&nbsp;{}Inserts text from the OS clipboard at the text cursor\u0027s position (if text is in the OS clipboard).{}":"{}ctrl/CMD + v{} 或 {}shift + insert{}：{} 将操作系统剪贴板中的文本插入到文本光标位置 (如果文本位于操作系统剪贴板中)。{}",
    "{}ctrl/CMD + x{} or {}shift + delete{}:&nbsp;{}If text is selected then the selected text is deleted and copied to the OS clipboard. If no text is selected and the line is not empty, then the whole line is deleted and copied to the OS clipboard. If no text is selected and the line is only whitespace or empty then the line is still deleted but nothing is copied to the clipboard.{}":"{}ctrl/CMD + x{} 或 {}shift + delete{}：{} 如果选择文本，则所选文本将被删除并复制到操作系统剪贴板。如果未选择任何文本且该行不为空，则整行将被删除并复制到操作系统剪贴板。如果未选择任何文本且该行仅为空格或空，则该行仍会被删除，但不会将任何内容复制到剪贴板。{}",
    "{}ctrl/CMD + y{} or {}ctrl/CMD + shift + z{}: Redoes a single change to the active document.":"{}ctrl/CMD + y{} 或 {}ctrl/CMD + shift + z{}：重做对活动文档的单个更改。",
    "{}ctrl/CMD + z{}: Undoes a single change to the active document.":"{}ctrl/CMD + z{}：撤消对活动文档的单个更改。",
    "{}ctrl/OPT + backspace{}:&nbsp;{}Erases a word at the text cursor\u0027s position. All other {}BACKSPACE{} rules are inherited.{}":"{}ctrl/OPT + 退格键 {}：{} 擦除文本光标位置处的单词。所有其他 {}BACKSPACE{} 规则均会继承。{}",
    "{}ctrl/OPT + delete{}: Erases a word ahead of the text cursor. All other {}delete{} rules are inherited.":"{}ctrl/OPT + delete{}：擦除文本光标前面的单词。所有其他 {} 删除{} 规则均会继承。",
    "{}delete{}: Deletes the next character ahead of the text cursor. When at the end of a line, the next newline character is deleted, and the contents of the next line are joined into the current line.":"{}delete{}：删除文本光标前面的下一个字符。当到达行尾时，删除下一​​个换行符，并将下一行的内容连接到当前行。",
    "{}enter{}: Inserts a newline at the text cursor\u0027s position.&nbsp;{}If enabled by preference, and the text cursor is inside of a multiline comment ({}{}{}///{}{}{}&nbsp;or{}&nbsp;{}{}{}{}/*{}{}{}), then the comment is extended to match the comment style on the next line.{}":"{}enter{}：在文本光标位置插入换行符。{} 如果按首选项启用，并且文本光标位于多行注释内 ({}{}{}///{}{}{} 或 {}{}{}{}{}/*{}{}{})，然后扩展注释以匹配下一行的注释样式。{}",
    "{}insert{}:&nbsp;{}Toggles between Overwrite and Insert modes, if the preference is enabled. Otherwise nothing happens.{}":"{}insert{}：{} 在覆盖和插入模式之间切换 (如果启用了首选项)。否则什么也不会发生。{}",
    "{}shift + tab{}: Untabs the current line or the selected lines.":"{}Shift + Tab{}：取消当前行或所选行的 Tab 键。",
    "{}tab{}: Inserts a tab at the text cursor. When text is selected, all selected lines are tabbed.":"{} 制表符 {}：在文本光标处插入制表符。选择文本后，所有选定的行都会被标记。",
    "{}{{} {}({} {}[{} {}\"{}&nbsp;or&nbsp;{}begin{}:&nbsp;{}If enabled via preference, then the associated terminating brace is auto-inserted.{}":"{}{{}{}({}{}[{}{}\"{} 或 {}begin{}：{} 如果通过首选项启用，则会自动插入关联的终止大括号。{}",
    "{}{}ALT/OPT + M{}{}: Fold the currently active document (the one where your text cursor is present).":"{}{}ALT/OPT + M{}{}：折叠当前活动文档 (文本光标所在的文档)。",
    "{}{}ALT/OPT + SHIFT + M{}{}: Fold all documents. Useful for navigating between events if you have a lot of them.":"{}{}ALT/OPT + SHIFT + M{}{}：折叠所有文档。如果您有很多事件，则对于在事件之间导航很有用。",
    "{}{}ALT/OPT + SHIFT + U{}{}: Unfold all documents.":"{}{}ALT/OPT + SHIFT + U{}{}：展开所有文档。",
    "{}{}ALT/OPT + UP/DOWN{}{}: Go to the previous (up) or next (down) document. The text cursor position is preserved from when you last left a document.":"{}{}ALT/OPT + 向上 / 向下 {}{}：转到上一个 (上) 或下一个 (下) 文档。文本光标位置将保留您上次离开文档时的位置。",
    "{}{}Alt/Opt + LMB{} - Click and drag{}: Select a rectangular part of your code (column selection, as opposed to row selection). Each row selected will get a text cursor, allowing you to edit multiple lines at once.":"{}{}Alt/Opt + LMB{}- 点击并拖动 {}：选择代码的矩形部分 (列选择，而不是行选择)。选择的每一行都会有一个文本光标，允许您一次编辑多行。",
    "{}{}Ctrl/CMD + A{}{}: Select all text in the active document (other visible documents are {}not{} selected).":"{}{}Ctrl/CMD + A{}{}：选择活动文档中的所有文本 (其他可见文档 {} 未 {} 选择)。",
    "{}{}Escape{}{}: Deselect all text in the active document (if no tooltips or other dialogs are open).":"{}{}Escape{}{}：取消选择活动文档中的所有文本 (如果没有打开工具提示或其他对话框)。",
    "{}{}LMB{} - Click and drag{}: Select a row (or rows) of code":"{}{}LMB{}- 点击并拖动 {}：选择一行 (或多行) 代码",
    "{}{}LMB{} - Click on Gutter line number{}: Select the whole line":"{}{}LMB{}- 点击装订线行号 {}：选择整行",
    "{}{}LMB{} - Double-click{}: Select the word underneath the mouse cursor. Continues selecting on word boundaries if held and dragged.":"{}{}LMB{}- 双击 {}：选择鼠标光标下方的单词。如果按住并拖动，则继续选择单词边界。",
    "{}{}LMB{} - Triple-click{}: Select the line underneath the mouse cursor. Continues selecting on line boundaries if held and dragged.":"{}{}LMB{}- 三击 {}：选择鼠标光标下方的行。如果按住并拖动，则继续选择线条边界。",
    "{}{}NOTE{}{}&nbsp;Shortcuts can be modified through the&nbsp;{}Redefine Keys Preferences{}.":"{}{} 注意{}{} 可以通过 {} 重新定义键首选项 {} 修改快捷键。",
    "{}{}Shift + lmb{}{}: Select text from the text cursor to the mouse cursor. Continues selecting if held and dragged.":"{}{}Shift + lmb{}{}：选择从文本光标到鼠标光标的文本。如果按住并拖动则继续选择。",
    "{}}{} {}){} {}]{}&nbsp;or&nbsp;{}\"{}:&nbsp;{}If an associated initiating brace is found then the text cursor overwrites/skips past this symbol.{}":"{}}{}{}){}{}]{} 或 {}\"{}：{} 如果找到关联的起始大括号，则文本光标将覆盖 / 跳过该符号。{}"
}