{
    "\"{}buffer_id{}\" - the buffer that is no longer being played from":"\"{}buffer_id{}\"不再播放的缓冲区",
    "\"{}queue_id{}\" - the queue that has finished playing data":"\"{}queue_id{}\"已完成播放数据的队列",
    "\"{}queue_shutdown{}\" - this is set to 0 during normal playback and 1 when the event is received because you have freed the queue with this function. When this is set to 1, you don\u0027t want to queue up any further data.":"\"{}queue_shutdown{}\"在正常播放期间设置为 0，当收到事件时设置为 1，因为您已使用此函数释放队列。将其设置为 1 时，您不想将任何进一步数据排队。",
    "The above code would go in the asynchronous {}Audio Playback{} event and checks to see if the audio that has finished playing is from the \"audio_queue\" and if it is it frees the queue and the buffer associated with it.":"上述代码将在异步{}音频回放{}事件中进行，并检查以查看已完成播放的音频是否来自\"audio_queue\"，如果是，则释放队列和与其关联的缓冲区。",
    "The index of the queue to free.":"要释放的队列的索引。",
    "This function is used to free up the memory associated with the given audio queue. The queue index is the value returned when you created the queue using the function {}{}audio_create_play_queue(){}{}, and this function should be called when the queue is no longer required to prevent memory leaks. Freeing the queue will stop any sound that is be playing, and you cannot delete the buffer that a sound is being streamed from until the queue it is assigned to has been freed.":"此函数用于释放与给定音频队列关联的内存。队列索引是使用函数{}{}audio_create_play_queue(){}{}创建队列时返回的值，当不再需要队列时应调用此函数以防止内存泄漏。释放队列将停止正在播放的任何声音，并且在释放声音所分配到的队列之前，您无法删除正在传输声音的缓冲区。",
    "This function is used to free up the memory associated with the given audio queue. The queue index is the value returned when you created the queue using the function {}{}audio_create_play_queue(){}{}, and this function should be called when the queue is no longer required to prevent memory leaks. Freeing the queue will stop any sound that is be playing, and you cannot delete the buffer that a sound is being streamed from until the queue it is assigned to has been freed. This function will trigger an {}Audio Playback Asynchronous Event{}, and in this event a special {}DS map{}&nbsp;will be created in the variable {}{}async_load{}{} with the following key/value pairs:":"此函数用于释放与给定音频队列相关的内存。队列索引是使用函数{}{}audio_create_play_queue(){}{}创建队列时返回的值，当不再需要队列以防止内存泄漏时，应调用此函数。释放队列将停止任何正在播放的声音，并且您不能删除正在流播放的声音的缓冲区，直到分配给它的队列被释放为止。此函数将触发{}音频回放异步事件{}，在这种情况下，将在变量{}async_load{}中创建具有以下键/值对的特殊{}{}DS map{}{}：",
    "This function will trigger an {}Audio Playback Asynchronous Event{}, and in this event a special {}DS map{}&nbsp;will be created in the variable {}{}async_load{}{} with the following key/value pairs:":"此函数将触发{}音频播放异步事件{}，在此事件中，将使用以下键/值对在变量{}{}async_load{}{}中创建一个特殊的{2}DS 映射{3}："
}