{
    "IDE Error Reporting":"IDE 错误报告",
    "On Windows - {}C:\\ProgramData\\GameMaker{}":"在 Windows - {}C:\\ProgramData\\GameMaker{}",
    "On very rare occasions, if the error is severe, then the product may crash without giving the above mentioned warning, and if this happens then you will be shown the following window:":"在极少数情况下，如果错误很严重，则产品可能会在不发出上述警告的情况下崩溃，如果发生这种情况，您将看到以下窗口：",
    "While great care has been taken when creating {}GameMaker{} to ensure that it is a stable and reliable tool, there is always the possibility that an issue could occur given the nature of the software and the operating systems it runs on. In most cases any errors will be caught by {}GameMaker{} and you may be prompted to save your projects and then close and restart the program. If this happens then we would request that you file a bug with the Helpdesk. You can do this using the {}Report A Bug{} option from the {}Help Menu{}&nbsp;and, we ask that when doing so you give as much information as possible and also supply a link to the {}GameMaker{} {}ui.log{} file, which can be found in the following locations, depending on the OS:":"虽然在创建 {}GameMaker{} 以确保它是一个稳定可靠的工具时非常小心，但考虑到软件及其运行的操作系统的性质，始终存在出现问题的可能性。在大多数情况下，任何错误都会被 {}GameMaker{} 捕获，系统可能会提示您保存项目，然后关闭并重新启动程序。如果发生这种情况，我们会要求您向帮助台提交错误。您可以使用 {} 帮助菜单 {} 中的 {} 报告错误 {} 选项来执行此操作，我们要求您在执行此操作时提供尽可能多的信息，并提供指向 {}GameMaker{} {}ui.log{} 文件的链接，该文件可在以下位置找到，具体取决于操作系统：",
    "{}This window will show you some of the crash report data that has been compiled by {}GameMaker{} and gives you the option to send it to YoYo Games so they can see what happened and fix the issue if possible in future updates. If you\u0027d like to know exactly what data is being sent, then please see {}this article{} on the GameMaker&nbsp;Helpdesk.":"{}此窗口将显示一些由 {}GameMaker{} 编制的崩溃报告数据，并允许您选择将其发送到 YoYo Games，以便他们可以看到发生了什么，如果可能的话，在未来的更新中修复问题。如果您想确切了解正在发送的数据，请参阅 GameMaker 帮助台上的 {} 这篇文章 {}。",
    "{}{}O{}n macOS - {}/Users/Shared/GameMaker/ (Macintosh HD &gt; Users &gt; Shared &gt; GameMaker){}{}":"{}{}{}在 macOS - {}/Users/Shared/GameMaker/ (Macintosh HD &gt; 用户 &gt; 共享 &gt; GameMaker){}{}"
}