{
    "Crash Detected Window":"检测到碰撞的窗口",
    "IDE Error Reporting":"IDE 错误报告",
    "If this happens, or you suspect that either the&nbsp;{}Runtime{}&nbsp;or the IDE contains a bug, then we would request that you file a bug report using the&nbsp;{}Report A GameMaker Bug{} option from&nbsp;{}The Help Menu{}. Please always give as much information as possible and ensure you fill in every field as best you can.":"如果发生这种情况，或者您怀疑 {} 运行时 {} 或 IDE 包含错误，那么我们会要求您使用 {} 帮助菜单 {}中的 {} 报告 GameMaker 错误 {} 选项提交错误报告}。请始终提供尽可能多的信息，并确保尽可能填写每个字段。",
    "If this happens, then we would request that you file a bug report using the&nbsp;{}Report A Bug{} option from&nbsp;{}The Help Menu{}. Please always give as much information as possible and ensure you fill in every field as best you can.":"如果发生这种情况，我们将要求您使用{}帮助菜单{}中的{}报告错误{}选项提交错误报告。请始终给予尽可能多的信息，并确保您尽可能填写每个字段。",
    "In extreme cases where&nbsp;{}GameMaker{} crashes entirely, you may see on your next startup that the IDE bug reporter tells you that an earlier crash was detected and it will ask you to send us a bug report. Please do this.":"在 {}GameMaker{} 完全崩溃的极端情况下，您可能会在下次启动时看到 IDE 错误报告器告诉您检测到较早的崩溃，并要求您向我们发送错误报告。请这样做。",
    "In most cases any errors will be caught by {}GameMaker{} and you may&nbsp;see an error that&nbsp;{}GameMaker{} has gone \"unstable\", which also prompts you to save your projects and then close and restart the program.":"在大多数情况下，任何错误都将被 {}GameMaker{} 捕获，您可能会看到 {}GameMaker{} 已变得 \" 不稳定 \" 的错误，这也会提示您保存项目，然后关闭并重新启动程序。",
    "Most IDE errors will be caught by {}GameMaker{} and you may&nbsp;see an error that&nbsp;{}GameMaker{} has gone \"unstable\", which also prompts you to save your projects and then close and restart the program.":"大多数 IDE 错误都会被 {}GameMaker{} 捕获，您可能会看到 {}GameMaker{} 变得 \" 不稳定 \" 的错误，这也会提示您保存项目，然后关闭并重新启动程序。",
    "On Windows - {}C:\\ProgramData\\GameMaker{}":"在 Windows - {}C:\\ProgramData\\GameMaker{}",
    "On very rare occasions, if the error is severe, then the product may crash without giving the above mentioned warning, and if this happens then you will be shown the following window:":"在极少数情况下，如果错误很严重，则产品可能会在不发出上述警告的情况下崩溃，如果发生这种情况，您将看到以下窗口：",
    "Please also strongly consider allowing the bug reporter to send us a copy of your project, as this may be essential to reproducing your problem and so we may be unable to help if you do not provide the project. Your files are always attached privately when you send them from the IDE bug reporter.":"还请强烈考虑允许错误报告者向我们发送您的项目副本，因为这对于重现您的问题可能至关重要，因此如果您不提供该项目，我们可能无法提供帮助。当您从 IDE Bug Reporter 发送文件时，您的文件始终会被私下附加。",
    "Please also strongly consider allowing the bug-reporter to send us a copy of your project, as this may be essential to reproducing your problem and so we may be unable to help if you do not provide the project. Your files are always attached privately if you send them from the IDE bug reporter.":"同时，请考虑允许bug报告者将您的项目副本发送给我们，因为这对于重现您的问题可能是必不可少的，因此如果您不提供项目，我们可能无法提供帮助。如果您从IDE bug报告者发送文件，您的文件将始终作为私下附件。",
    "Report A Bug Window":"报告错误窗口",
    "Similarly, in extreme cases where&nbsp;{}GameMaker{} crashes entirely, you may see on your next startup that the IDE bug reporter tells you that an earlier crash was detected and it will ask you to send us a bug report. Please do this.":"同样，在{}GameMaker{}完全崩溃的极端情况下，您可能会在下次启动时看到IDE错误报告器告诉您检测到早期崩溃，并要求您向我们发送错误报告。请执行此操作。",
    "The&nbsp;{}Help{} -&gt; {}Report a GameMaker Bug{} option will open a window where you can create a bug report from within the IDE.&nbsp;If you\u0027re not signed in, a message is shown to ask you to {}Sign In/Register{}. It\u0027s also possible to {}Continue Anonymously{}.{} {}If you are using a {}GameMaker{}&nbsp;account, it is recommended to connect your GitHub account to your GM account via the {}GameMaker Account Dashboard{}. This will ensure your submitted reports are tied to your account so you can post updates and receive notifications from our team. ":"{} 帮助 {}-&gt;{} 报告 GameMaker Bug{} 选项将打开一个窗口，您可以在其中从 IDE 中创建错误报告。如果您尚未登录，则会显示一条消息，要求您 {} 登录 / 注册 {}。也可以 {} 匿名继续 {}。{}{} 如果您使用的是 {}GameMaker{} 帐户，建议通过 {}GameMaker 帐户仪表板 {} 将您的 GitHub 帐户连接到您的 GM 帐户。这将确保您提交的报告与您的帐户绑定，以便您可以发布更新并接收我们团队的通知。",
    "To know exactly what data is being sent, then please see {}this article{} on the GameMaker&nbsp;Helpdesk.":"要准确了解发送的数据，请参阅 GameMaker 帮助台上的 {} 这篇文章 {}。",
    "While great care has been taken when creating {}GameMaker{} to ensure that it is a stable and reliable tool, there is always the possibility that an issue could occur given the nature of the software and the multiple operating systems it runs on.":"虽然我们在创建{}GameMaker{}时非常小心，以确保它是一个稳定可靠的工具，但考虑到软件的性质及其运行的多个操作系统，始终存在发生问题的可能性。",
    "While great care has been taken when creating {}GameMaker{} to ensure that it is a stable and reliable tool, there is always the possibility that an issue could occur given the nature of the software and the operating systems it runs on. In most cases any errors will be caught by {}GameMaker{} and you may be prompted to save your projects and then close and restart the program. If this happens then we would request that you file a bug with the Helpdesk. You can do this using the {}Report A Bug{} option from the {}Help Menu{}&nbsp;and, we ask that when doing so you give as much information as possible and also supply a link to the {}GameMaker{} {}ui.log{} file, which can be found in the following locations, depending on the OS:":"虽然在创建 {}GameMaker{} 以确保它是一个稳定可靠的工具时非常小心，但考虑到软件及其运行的操作系统的性质，始终存在出现问题的可能性。在大多数情况下，任何错误都会被 {}GameMaker{} 捕获，系统可能会提示您保存项目，然后关闭并重新启动程序。如果发生这种情况，我们会要求您向帮助台提交错误。您可以使用 {} 帮助菜单 {} 中的 {} 报告错误 {} 选项来执行此操作，我们要求您在执行此操作时提供尽可能多的信息，并提供指向 {}GameMaker{} {}ui.log{} 文件的链接，该文件可在以下位置找到，具体取决于操作系统：",
    "You also have the option to {}Privately attach this project{}, which is generally required for many kinds of bug reports. You can also attach additional files.&nbsp;Finally, you should set the issue {}Visibility{}, either {}Public{} or {}Private{}&nbsp;(which does not affect your attached project and files, which are always private and only accessible by {}GameMaker{} staff).{} {} As mentioned in the window, you should first check the list of&nbsp;{}Known Issues{}&nbsp;before submitting. You also have the possibility to report a {}security vulnerability{}. ":"您还可以选择 {} 私下附加此项目 {}，这通常是多种错误报告所必需的。您还可以附加其他文件。最后，您应该将问题设置为 {} 可见性 {}，可以是 {} 公开 {} 或 {} 私有 {}( 这不会影响您附加的项目和文件，这些项目和文件始终是私有的，并且只能由 {}GameMaker{} 员工访问)。{}{} 如窗口中所述，您应在提交之前首先检查 {} 已知问题 {} 列表。您还可以报告 {} 安全漏洞 {}。",
    "You can choose to include the current project by ticking the&nbsp;{}Include project{}&nbsp;checkbox. It is highly recommended that you provide a sample project that shows the issue as it provides important information to the {}GameMaker{}&nbsp;team about your issue.&nbsp;A message will be shown asking to include the current package&nbsp;when you select a category related to the&nbsp;runner and the checkbox isn\u0027t ticked.{} {} Finally you can submit the report by clicking the {}Submit{} button. ":"您可以通过勾选 {} 包含项目 {} 复选框来选择包含当前项目。强烈建议您提供一个显示问题的示例项目，因为它可以向 {}GameMaker{} 团队提供有关您的问题的重要信息。当您选择与跑步者相关的类别并且未勾选复选框时，将会显示一条消息，要求包含当前包。{}{} 最后，您可以通过点击 {}Submit{} 按钮提交报告。",
    "{}Clicking on {}Report{} will open the {}Report a Bug{} window described above.":"{} 点击 {} 报告 {} 将打开上述的 {} 报告错误 {} 窗口。",
    "{}IDE Error Reporting{}":"{}IDE错误报告{}",
    "{}If you\u0027d like to know exactly what data is being sent, then please see {}this article{} on the GameMaker&nbsp;Helpdesk.":"{}如果您想确切了解正在发送的数据，请参阅GameMaker帮助台上的{}本文{}。",
    "{}In the {}Report a Bug{} window you fill in a {}Title{} and {}Description{} and optionally the {}Steps To Reproduce{} the issue as well as assign the&nbsp;{}Issue Category{}.":"{} 在 {} 报告错误 {} 窗口中，您可以填写 {} 标题 {} 和 {} 描述 {}，还可以选择 {} 重现问题的步骤 {}，并指定 {} 问题类别 {}。",
    "{}Reporting Errors{}":"{} 报告错误 {}",
    "{}This window will show you some of the crash report data that has been compiled by {}GameMaker{} and gives you the option to send it to YoYo Games so they can see what happened and fix the issue if possible in future updates. If you\u0027d like to know exactly what data is being sent, then please see {}this article{} on the GameMaker&nbsp;Helpdesk.":"{}此窗口将显示一些由 {}GameMaker{} 编制的崩溃报告数据，并允许您选择将其发送到 YoYo Games，以便他们可以看到发生了什么，如果可能的话，在未来的更新中修复问题。如果您想确切了解正在发送的数据，请参阅 GameMaker 帮助台上的 {} 这篇文章 {}。",
    "{}{}NOTE{}{}&nbsp;Any files attached via the Bug Reporter are uploaded privately, only accessible by the {}GameMaker{}&nbsp;team, even when the bug is public.":"{}{} 注意{}{} 通过 Bug Reporter 附加的任何文件都是私下上传的，只有 {}GameMaker{} 团队可以访问，即使 Bug 是公开的也是如此。",
    "{}{}O{}n macOS - {}/Users/Shared/GameMaker/ (Macintosh HD &gt; Users &gt; Shared &gt; GameMaker){}{}":"{}{}{}在 macOS - {}/Users/Shared/GameMaker/ (Macintosh HD &gt; 用户 &gt; 共享 &gt; GameMaker){}{}"
}