{
    "After any updates have been installed, you will be able to use the IDE, and optionally {}log in{} (required for creating executables).":"安装任何更新后，您将能够使用 IDE，并可以选择 {} 登录 {}( 创建可执行文件时需要)。",
    "After any updates have been installed, you will be required to supply the licence details for your YoYo Games Account (see the&nbsp;{}Licencing Information{}&nbsp;page) before being able to use the product, meaning that the first time you use {}GameMaker{} {}you must have an internet connection{}. After the initial login, you should be able to use the product offline, however it will periodically require that you connect to verify the login account.":"安装任何更新后，您需要提供您的 YoYo 游戏账户的许可详细信息 (请参阅 {} 许可信息 {} 页面) 才能使用该产品，这意味着您第一次使用 {}GameMaker{}{} 时必须连接到互联网 {}。初次登录后，您应该能够脱机使用该产品，但它会定期要求您连接以验证登录账户。",
    "Before installing a new runtime you will then be shown this dialog:&nbsp;":"在安装新的运行时之前，您将看到以下对话框： ",
    "Checking the \"Remember Selection\" checkbox in this dialog will ensure you don\u0027t see it again. The selection of modules you choose here will then also be used when installing new runtimes&nbsp;and&nbsp;the&nbsp;{}Remember last selection of modules{}&nbsp;option will be set to \"OK\".":"选中此对话框中的\"记住选择\"复选框可确保您不会再次看到它。然后，您在此处选择的模块也将在安装新的运行时使用，并且 的 {}记住上次选择的模块{} 选项将设置为 \"OK\"。",
    "Every runtime in&nbsp;{}GameMaker{}&nbsp;consists of a set of modules. As you might not need all of them on your system you can select which ones to download and install, for those cases where you e.g. are working on a machine with a limited amount of disk&nbsp;space or have a slow internet connection.":"{}GameMaker{} 中的每个运行时都由一组模块组成。由于您可能不需要在系统上安装所有这些应用程序，因此您可以选择要下载和安装的应用程序，例如，在磁盘空间有限或互联网连接速度较慢的计算机上工作。",
    "Installation Guide":"安装指南",
    "It is worth noting that - depending on the licence type that you have - you may be required to install additional components or follow addition steps to set up and use {}GameMaker{} for specific platforms. For full information on what each platform requires, please see this article on the YoYo Games Helpdesk: {}{}GameMaker{} Required SDKs{}.":"值得注意的是，根据您所拥有的许可类型，您可能需要安装额外的组件，或者遵循额外的步骤为特定平台设置和使用{}GameMaker{}。关于每个平台要求的完整信息，请参阅YoYo Games 帮助台 上的这篇文章:{}{}GameMaker{} 需求 sdk{}。",
    "It is worth noting that - depending on the licence type that you have - you may be required to install additional components or follow additional steps to set up and use {}GameMaker{} for specific platforms. For full information on what each platform requires, please see this article on the GameMaker&nbsp;Helpdesk: {}Required SDKs{}.":"值得注意的是，根据您拥有的许可证类型，您可能需要安装其他组件或执行其他步骤，以针对特定平台设置和使用 {}GameMaker{}。有关每个平台所需内容的完整信息，请参阅 GameMaker 帮助台上的这篇文章：{} 所需 SDK{}。",
    "It is worth noting that - depending on the licence type that you have - you may be required to install additional components or follow additional steps to set up and use {}GameMaker{} for specific platforms. For full information on what each platform requires, please see this article on the YoYo Games Helpdesk: {}{}GameMaker{} Required SDKs{}.":"值得注意的是，根据您拥有的许可证类型，您可能需要安装其他组件或执行其他步骤，才能为特定平台设置和使用 {}GameMaker{}。有关每个平台需要什么的完整信息，请参阅 YoYo 游戏帮助台上的这篇文章：{}{}GameMaker {}Required SDK{}。",
    "Note that, depending on the selected modules, downloading and installing a runtime can take a few minutes, but you can see a progress bar for the download at the top right of the IDE:":"请注意，根据所选模块的不同，下载和安装运行时可能需要几分钟时间，但您可以在 IDE 的右上角看到下载进度条：",
    "Runtime Modules Dialog":"运行时模块对话框",
    "Stable And Beta Versions":"稳定版和测试版",
    "Stable, Beta and LTS":"Stable, Beta and LTS (稳定,测试,长期)",
    "The above is the default selection of modules on Windows. The {}base{} module and the module {}for the OS that you\u0027re currently developing on{} are {}always{} included. They are the minimum {}required{} modules for&nbsp;{}GameMaker{}&nbsp;to be able to build your game.&nbsp;All other modules are {}optional{}.":"以上是Windows上默认选择的模块。您当前在其上开发的操作系统{2}的{}基本{}模块和模块{4}始终{5}包含在{3}中。它们是{}GameMaker{}构建游戏所需的{}最基本{}模块。所有其他模块都是{}可选的{}。",
    "The full version details are as follows:":"完整版本详情如下：",
    "The version you download from the YoYo Games web page should be the current {}Stable {}version of {}GameMaker{}, but there may also be another \" {}Beta{}\" version available which is used to showcase or test new functionality before it goes into a final stable build. The full version details are as follows:":"你从YoYo Games网页下载的版本应该是{}GameMaker{}的当前{}稳定(Stable){}版本，但也可能存在另一个“{}测试版(Beta){}”版本，用于在进入最终稳定构建之前展示或测试新功能。完整版本详情如下:",
    "The version you download from the {}Download page{}&nbsp;should be the current {}Stable {}version of {}GameMaker{}. The page also has a \"{}Beta{}\" version available which is used to showcase or test new functionality before it goes into a final stable build, as well as an \"{}LTS{}\" version that gets only bug fixes.":"您从 {} 下载页面 {} 下载的版本应该是 {4}GameMaker{5} 当前的 {} 稳定 {} 版本。该页面还提供了一个 {}Beta{} 版本，用于在进入最终稳定版本之前展示或测试新功能，以及一个 {}LTS{} 版本，仅修复错误。",
    "The version you download from the {}GameMaker{}&nbsp;web page should be the current {}Stable {}version of {}GameMaker{}, but there may also be another \"{}Beta{}\" version available which is used to showcase or test new functionality before it goes into a final stable build. The full version details are as follows:":"您从 {}GameMaker{} 网页下载的版本应该是当前的{}稳定版{} {}GameMaker{}，但也可能有另一个 \"{}Beta{}\" 版本，用于在新功能进入最终稳定版本之前对其进行展示或测试。完整版本详细信息如下：",
    "You can download the {}GameMaker{} installer from your Account page on the {}GameMaker Website{}&nbsp;and install it. Once installed, the first time you run {}GameMaker{}&nbsp;you may be prompted to update before being able to use the product. You will be shown the&nbsp;{}Runtime Modules Dialog{}&nbsp;which allows you to select the runtime modules that you\u0027d like to install.":"您可以从您的账户页面下载{2}GameMaker网站{3}的{}GameMaker{}安装程序并进行安装。安装后，首次运行{}GameMaker{}时，系统可能会提示您进行更新，然后才能使用该产品。您将看到{}运行时模块对话框{}，该对话框允许您选择要安装的运行时模块。",
    "You can download the {}GameMaker{} installer from your YoYo Account page on the {}YoYo Games Website{}. Once installed, the first time you run {}GameMaker{}&nbsp;you may be prompted to update before being able to use the product. After any updates have been installed, you will be required to supply the licence details for your YoYo Games Account (see {}here{} for more information) before being able to use the product, meaning that the first time you use {}GameMaker{} {}you must have an internet connection{}. After the initial login, you should be able to use the product offline, however it will periodically require that you connect to verify the login account.":"你可以从{2}YoYo Games网站{3}的YoYo账户页面下载{}GameMaker{}安装程序。安装完成后，第一次运行{}GameMaker{}可能会提示您在能够使用该产品之前进行更新。在安装任何更新后，您需要提供您YoYo Games账户的许可证细节(参见{}这里{}的更多信息)，然后才能使用该产品，这意味着您第一次使用{}GameMaker{}{}您必须有一个互联网连接{}。在初次登录后，您应该能够离线使用该产品，但是它会定期要求您连接以验证登录账户。",
    "You can download the {}GameMaker{} installer on the {}GameMaker Website{}&nbsp;and install it. Once installed, the first time you run {}GameMaker{}&nbsp;you may be prompted to update before being able to use the product. You will be shown the {}Runtime Modules Dialog{}&nbsp;which allows you to select the runtime modules that you\u0027d like to install.":"您可以在 {}GameMaker 网站 {} 上下载 {}GameMaker{} 安装程序并进行安装。安装后，第一次运行 {}GameMaker{} 时，系统可能会提示您进行更新，然后才能使用该产品。系统将显示 {} 安装模块对话框 {}，您可以从中选择要安装的运行时模块。",
    "You can quickly change this by clicking the {}Required only{} button:&nbsp;":"您可以通过单击{}仅需{}按钮快速更改此设置：",
    "{}Beta{}: The Beta version of {}GameMaker{} is for those that wish to try out new features before they get added to the Stable build, or for those that require a coming fix for an issue. It is not recommended that you use the Beta build for final game production unless it contains an important fix for a bug that is holding up your project. You can get a Beta build of {}GameMaker{} from the {}GameMaker Website{}, and it can be installed and run side-by-side with the Stable build. Please note that if you are running {}GameMaker{} through {}Steam {}then you will not have access to the Beta build of the product using Steam itself, although you can still download and use the desktop version.":"{}Beta{}：{}GameMaker{} 的 Beta 版本是为那些希望在添加到稳定版本之前尝试新功能的人准备的，或者那些需要对问题进行修复的人。不建议您将 Beta 版本用于最终游戏制作，除非它包含对阻碍您项目的错误的重要修复。您可以从 {}GameMaker{} 网站获得 {}GameMaker{} 的 Beta 版本，请注意，如果您通过 {10}Steam{11} 运行 {}GameMaker{}，那么您将无法使用 Steam 本身访问该产品的 Beta 版本，尽管您仍然可以下载并使用桌面版本。",
    "{}Beta{}: The Beta version of {}GameMaker{} is for those that wish to try out new features before they get added to the Stable build, or for those that require a coming fix for an issue. It is not recommended that you use the Beta build for final game production unless it contains an important fix for a bug that is holding up your project. You can get the Beta build of {}GameMaker{} from your YoYo Account \"Downloads\" page, and it can be installed and run side-by-side with the Stable build. Please note that if you are running {}GameMaker{} through {}Steam {}then you will not have access to the Beta build of the product using Steam itself, although you can still download and use the desktop version.":"{}Beta{}: {}GameMaker{}的Beta版本是为那些希望在添加到稳定版本之前尝试新功能的人准备的，或者是为那些需要对某个问题进行修复的人准备的。不建议你在最终的游戏制作中使用Beta版本，除非它包含了一个重要的补丁，可以修复阻碍你项目的bug。你可以从你的YoYo账户“下载”页面获得{}GameMaker{}的Beta版本，它可以与稳定版本一起安装和运行。请注意，如果你通过{}Steam{}运行{}GameMaker{}，那么你将无法使用Steam本身访问该产品的Beta版本，尽管你仍然可以下载和使用桌面版本。",
    "{}GameMaker{} is designed for use on {}macOS {}and {}Windows {}desktop computers with the minimum specifications mentioned on the&nbsp;{}subscription comparison page{}.":"{}GameMaker{} 专为在 {}macOS{} 和 {}Windows{} 台式计算机上使用而设计，其最低规格在 {} 订阅比较页面 {} 中提到。",
    "{}GameMaker{} is designed for use on {}macOS {}and {}Windows {}desktop computers with the minimum specifications mentioned {}here{}.":"{}GameMaker{}设计用于{}macOS{}和{}Windows{}桌面计算机，其最低要求在这里{}提到{}。",
    "{}GameMaker{} is designed for use on {}macOS {}and {}Windows {}desktop computers.":"{}GameMaker{} 专为在 {}macOS{} 和 {}Windows{} 桌面计算机上使用而设计。",
    "{}If you want to download and install the full list of modules that is available then you can click \"Select All\" instead:&nbsp;":"{}如果要下载并安装可用模块的完整列表，则可以改为单击\"全选\"：",
    "{}Installation Guide{}":"{}安装指南{}",
    "{}LTS{}: Long-Term Support gives you a fixed version of GameMaker that only receives bug fixes and no feature updates. This is useful for long-term commercial projects that want to avoid the changes that come with major feature additions, and only require fixes to engine bugs.":"{}LTS{}：长期支持为您提供一个固定版本的GameMaker，只接收错误修复，没有功能更新。这对于希望避免主要功能添加带来的更改，并且只需要修复引擎错误的长期商业项目非常有用。",
    "{}Stable{}: This version is the one you would be using for general development and is recommended for use with any commercial product. It may lack certain features available in the Beta versions, but this is because they haven\u0027t been fully tested or require additional work.":"{}Stable{}: 此版本是您将用于一般开发的版本，建议与任何商业产品一起使用。它可能缺少Beta版本中的某些功能，但这是因为它们还没有经过完全测试或需要额外的工作。",
    "{}{}NOTE{}{}&nbsp;This dialog will always be shown to you the first time you install any version of&nbsp;{}GameMaker{} starting with 2022.11. The default setting is to remember your choices and not show the dialog again in the future, but you can set the {}{}{}Remember last selection of modules{}&nbsp;option in the {}Runtime Feeds Preferences{}&nbsp;to \"Show Message\" to make the dialog show again each time.":"{}{}注意{}{} 从 2022.11 开始，第一次安装任何版本的 {}GameMaker{} 时，此对话框将始终显示给您。默认设置是记住您的选择，并且以后不会再次显示该对话框，但您可以将{}运行时源首选项{}中的{6}{7}{8}记住上次选择的模块{9}选项设置为\"显示消息\"，以便每次再次显示该对话框。"
}