{
    "Installation Guide":"安装指南",
    "It is worth noting that - depending on the licence type that you have - you may be required to install additional components or follow addition steps to set up and use {}GameMaker{} for specific platforms. For full information on what each platform requires, please see this article on the YoYo Games Helpdesk: {}{}GameMaker{} Required SDKs{}.":"值得注意的是，根据您所拥有的许可类型，您可能需要安装额外的组件，或者遵循额外的步骤为特定平台设置和使用{}GameMaker{}。关于每个平台要求的完整信息，请参阅YoYo Games 帮助台 上的这篇文章:{}{}GameMaker{} 需求 sdk{}。",
    "Stable And Beta Versions":"稳定版和测试版",
    "The version you download from the YoYo Games web page should be the current {}Stable {}version of {}GameMaker{}, but there may also be another \" {}Beta{}\" version available which is used to showcase or test new functionality before it goes into a final stable build. The full version details are as follows:":"你从YoYo Games网页下载的版本应该是{}GameMaker{}的当前{}稳定(Stable){}版本，但也可能存在另一个“{}测试版(Beta){}”版本，用于在进入最终稳定构建之前展示或测试新功能。完整版本详情如下:",
    "You can download the {}GameMaker{} installer from your YoYo Account page on the {}YoYo Games Website{}. Once installed, the first time you run {}GameMaker{}&nbsp;you may be prompted to update before being able to use the product. After any updates have been installed, you will be required to supply the licence details for your YoYo Games Account (see {}here{} for more information) before being able to use the product, meaning that the first time you use {}GameMaker{} {}you must have an internet connection{}. After the initial login, you should be able to use the product offline, however it will periodically require that you connect to verify the login account.":"你可以从{2}YoYo Games网站{3}的YoYo帐户页面下载{}GameMaker{}安装程序。安装完成后，第一次运行{}GameMaker{}可能会提示您在能够使用该产品之前进行更新。在安装任何更新后，您需要提供您YoYo Games帐户的许可证细节(参见{}这里{}的更多信息)，然后才能使用该产品，这意味着您第一次使用{}GameMaker{}{}您必须有一个互联网连接{}。在初次登录后，您应该能够离线使用该产品，但是它会定期要求您连接以验证登录帐户。",
    "{}Beta{}: The Beta version of {}GameMaker{} is for those that wish to try out new features before they get added to the Stable build, or for those that require a coming fix for an issue. It is not recommended that you use the Beta build for final game production unless it contains an important fix for a bug that is holding up your project. You can get the Beta build of {}GameMaker{} from your YoYo Account \"Downloads\" page, and it can be installed and run side-by-side with the Stable build. Please note that if you are running {}GameMaker{} through {}Steam {}then you will not have access to the Beta build of the product using Steam itself, although you can still download and use the desktop version.":"{}Beta{}: {}GameMaker{}的Beta版本是为那些希望在添加到稳定版本之前尝试新功能的人准备的，或者是为那些需要对某个问题进行修复的人准备的。不建议你在最终的游戏制作中使用Beta版本，除非它包含了一个重要的补丁，可以修复阻碍你项目的bug。你可以从你的YoYo帐户“下载”页面获得{}GameMaker{}的Beta版本，它可以与稳定版本一起安装和运行。请注意，如果你通过{}Steam{}运行{}GameMaker{}，那么你将无法使用Steam本身访问该产品的Beta版本，尽管你仍然可以下载和使用桌面版本。",
    "{}GameMaker{} is designed for use on {}macOS {}and {}Windows {}desktop computers with the minimum specifications mentioned {}here{}.":"{}GameMaker{}设计用于{}macOS{}和{}Windows{}桌面计算机，其最低要求在这里{}提到{}。",
    "{}Stable{}: This version is the one you would be using for general development and is recommended for use with any commercial product. It may lack certain features available in the Beta versions, but this is because they haven\u0027t been fully tested or require additional work.":"{}Stable{}: 此版本是您将用于一般开发的版本，建议与任何商业产品一起使用。它可能缺少Beta版本中的某些功能，但这是因为它们还没有经过完全测试或需要额外的工作。"
}