{
    "All changes for GameMaker versions are listed on&nbsp;{}GitHub{}. The linked page lists all major releases for GameMaker.":"GameMaker 版本的所有更改都在 {}GitHub{} 上列出。链接页面列出了 GameMaker 的所有主要版本。",
    "Click on \"{}X Closed{}\" to see the released versions:":"点击 \"{}X Closed{}\" 查看已发布的版本：",
    "Each release of {}GameMaker{} comes with it\u0027s own set of release notes. These contain detailed information on the changes that have been made as well as a complete list of all the bugs that have been fixed. This is an invaluable tool for deciding whether to update your current version, or when you find something that may be a bug after a release.":"{}GameMaker{}的每个版本都自带一组发行说明。这些包含了关于所做更改的详细信息，以及已修复的所有错误的完整列表。这是一个非常宝贵的工具，可以用来决定是否更新当前版本，或者在发布后发现可能是bug的东西。",
    "GitHub only contains changes for GameMaker 2023.8 and above. Release notes for older versions are available here: {}IDE{} / {}Runtime{}":"GitHub 仅包含 GameMaker 2023.8 及更高版本的更改。旧版本的发行说明可在此处获得：{}IDE{}/{} 运行时 {}",
    "IDE Release Notes":"IDE 发布说明",
    "If a version is in its beta period, the Closed issues have likely made their way into the latest beta release, or will go in the next beta update.":"如果一个版本处于测试阶段，则关闭的问题可能已经进入最新的测试版本，或者将在下一个测试更新中进行。",
    "Older Release Notes":"旧版本说明",
    "Release Notes":"发行说明",
    "Runtime Release Notes":"Runtime 发布说明",
    "The GitHub issue lists are always up-to-date, so it\u0027s a good place to check for known issues before reporting something.":"GitHub 问题列表总是最新的，所以在报告之前检查已知问题是一个很好的地方。",
    "The release notes are split into two different sets due to the fact that both the IDE and the actual Runtimes can be updated independently. You can find the current release notes for the IDE from the link below:":"由于IDE和实际运行时都可以独立更新，所以发布说明被分为两个不同的集合。你可以从下面的链接找到IDE的当前版本说明:",
    "There are two categories of releases: {}Open{} (in-progress or future release) and {}Closed{} (released to public).":"发布分为两类：{}Open{}( 正在进行或未来发布) 和 {}Closed{}( 已公开发布)。",
    "You can find the current release notes for the Runtimes from the link below:":"你可以在下面的链接中找到 运行时 的当前版本说明:",
    "{}Click on a release to see all issues within it, which can either be {}Open{} (meaning they are in-progress for that release) or {}Closed{} (meaning they are done).":"{} 单击某个版本可查看其中的所有问题，这些问题可以是 {}Open{}( 表示该版本正在处理中) 或 {}Closed{}( 表示已完成)。",
    "{}GameMaker Changelog{}":"{}GameMaker更新日志{}"
}