{
    " {}Allowed Web Server IPs / CIDR IP Ranges{}: Set the allowed web server, hostnames and CIDR IP ranges as required. ":"{}允许的 Web 服务器 IP/CIDR IP范围{}：根据需要设置允许的 Web 服务器、主机名和 CIDR IP 范围。",
    " {}Before you can set up your iOS devices, you must have set up your Mac device and tested it\u0027s connection (see below for details). Once that is done you can select the Mac that you want to target from the drop down menu at the top of the window and then click the {}Detect Device{} button to have {}GameMaker{} automatically find any connected iOS devices, including simulators. Once connected, the device details will be shown in the list in this window, and you can edit the device name to make it more user friendly (this change only affects how the device is presented in the Target Manager and nothing else). ":"{}在设置 iOS 设备之前，您必须先设置 Mac 设备并测试其连接 (有关详细信息，请参阅以下内容)。完成后，您可以从窗口顶部的下拉菜单中选择您要瞄准的 Mac，然后单击 {} 检测设备 {} 按钮，让 {}GameMaker{} 自动查找任何连接的 iOS 设备，包括模拟器。连接后，设备详细信息将显示在此窗口的列表中，您可以编辑设备名称以使其更加友好 (此更改仅影响设备在目标管理器中的显示方式，而不影响其他任何内容)。",
    " {}Before you can set up your tvOS devices, you must have set up your Mac device and tested it\u0027s connection (see below for details). Once that is done you can select the Mac that you want to target from the drop down menu at the top of the window and then click the {}Detect Device{} button to have {}GameMaker{} automatically find any connected tvOS devices, including simulators. Once connected, the device details will be shown in the list in this window, and you can edit the device name to make it more user friendly (this change only affects how the device is presented in the Target Manager and nothing else). ":"{}您必须先设置 Mac 设备并测试其连接 (有关详细信息，请参阅下面的内容)，然后才能设置 tvOS 设备。完成此操作后，您可以从窗口顶部的下拉菜单中选择您要瞄准的 Mac，然后单击 {} 检测设备 {} 按钮，让 {}GameMaker{} 自动查找任何连接的 tvOS 设备，包括模拟器。连接后，设备详细信息将显示在此窗口的列表中，您可以编辑设备名称以使其更加友好 (此更改仅影响设备在目标管理器中的显示方式，而不影响其他任何内容)。",
    " {}Browser Command Line Arguments{}: Here you can add in any command line arguments to be appended to the browser path. You can find a list of these from the following links to the main popular browsers: {} {} {}Chromium (Chrome){} {} {} {}Firefox{} {} {} {}Internet Explorer{} {} {} ":" {}浏览器命令行参数{}：您可以在此处添加要附加到浏览器路径的任何命令行参数。您可以从以下主要流行浏览器的链接中找到这些浏览器的列表： {} {} {}Chromium (Chrome){} {} {} {}Firefox{} {} {} {}Internet Explorer{} {} {} ",
    " {}Here you can click on the {}Add New Device{} button to add a new Android device to the list manually, or you can click the {}Detect Device{} button to have {}GameMaker{} automatically detect any devices connected through a wired connection. You can also set up an {}Android Virtual Device{} by clicking the button marked {}Run AVD{}. This will open up the Android Virtual Device manager where you can create a new AVD (see {}here{} for more information). Once you have one created, you need to launch it from the AVD manager and then in {}GameMaker{} click on the {}Detect Device{} button and it should be added automatically to the device list: {} ":"{}您可以在此处单击 {} 添加新设备 {} 按钮以手动将新的 Android 设备添加到列表中，也可以单击 {} 检测设备 {} 按钮让 {}GameMaker{} 自动检测通过有线连接连接的设备。您还可以通过单击标记为 {} 运行 AVD{} 的按钮来设置 {}Android 虚拟设备 {}。这将打开 Android 虚拟设备管理器，您可以在其中创建新的 AVD(有关更多信息，请参阅 {} 此处 {})。一旦您创建了一个，您需要从 AVD 管理器启动它，然后在 {}GameMaker{} 中单击 {} 检测设备 {} 按钮，它应该会自动添加到设备列表中：{}",
    " {}NOTE{}: If you are developing for iOS then you must have done this first and have established a working connection to the Mac you wish to use for development. {} ":"{}注意{}：如果您正在为 iOS 进行开发，则必须先完成此操作，并已建立与您希望用于开发的 Mac 的正常连接。{}",
    " {}NOTE{}: You {}must {}have enabled {}Remote Login{} on the target mac. This can be done by going to {}Preferences {}-&gt; {}Sharing{} and {}Enable Remote Login{} for the user you want to be able to login. ":"{}注意{}：您{}必须{}已在目标 Mac 上启用了{}远程登录{}。这可以通过转到{}首选项{}->{}共享{}和为您希望能够登录的用户{}启用远程登录{}来完成。",
    " {}Once you have a device (physical or virtual) added, you can then check the connection using the {}Test Connection{} button or remove it from the list again by clicking the {} Remove Device{} button. ":"{}添加设备(物理或虚拟机)后，您可以使用{}测试连接{}按钮检查连接，或通过单击{}删除设备{}按钮再次将其从列表中删除。",
    " {}The HTML5 device manager is for adding different browsers to the device list for targeting when running. To start with, you should click the {}Detect Browsers{} button, which should create devices for each of the installed browsers on your machine. If your browser is not listed, you can also click the {}Add New Browser{} button and then give the device a name and point {}GameMaker{} to the path for the browser executable. ":"{}HTML5 设备管理器用于在运行时将不同的浏览器添加到设备列表中进行定位。首先，您应该单击{}检测浏览器{}按钮，这应该会为您计算机上安装的每个浏览器创建设备。如果您的浏览器未列出，您也可以单击{}添加新浏览器{}按钮，然后为设备命名，并将 {}GameMaker{} 指向浏览器可执行文件的路径。",
    " {}To add a Mac device to the manager, you must first click on the button labelled {}Add New device{} which will add the device and create some blank fields which you will need to fill in to enable the connection. {} ":"{}要将 Mac 设备添加到管理器，您必须首先单击标记为{}添加新设备{}的按钮，该按钮将添加设备并创建一些空白字段，您需要填写这些字段才能启用连接。{}",
    " {}Web Server Address{}: The address of the web {}server{} to target (default is 127.0.0.1). You may need to change this depending on the specifications of different APIs, for example, Facebook would require this to&nbsp;be set to {}http://localhost{} (and then have that whitelisted on their app console). ":"{}Web 服务器地址{}：目标 Web{} 服务器 {} 的地址 (默认为 127.0.0.1)。您可能需要根据不同 API 的规范来更改此设置，例如，Facebook 会要求将其设置为 {}http://localhost{} (然后将其列入其应用程序控制台的白名单)。",
    " {}Web Server Port{}: Set the {}port number{} for the web server (default is 51264). ":"{}Web 服务器端口{}：设置 Web 服务器的{}端口号{}(默认为 51264)。",
    "All the different device windows have an option at the bottom to {}Clear Devices{} which, when clicked, will remove all the connected devices from the list.":"所有不同的设备窗口底部都有一个选项，用于{}清除设备{}，当点击该选项时，将从列表中删除所有连接的设备。",
    "First you need to {}name {}the device so that you can identify it in the target list and then give the {}host name{} (or IP) of the Mac. You must then give the {}username {}of the user that you wish to link to, and the {}password {}that they used. If you wish, you can also change the {}Install Folder{} on the Mac to wherever you would prefer {}GameMaker{} to store the build files for your projects. ":"首先，您需要为设备{}命名{}，以便您可以在目标列表中识别它，然后给出 Mac 的{}主机名{}(或IP)。然后，您必须提供要链接到的用户的{}用户名{}，以及他们使用的{}密码{}。如果您愿意，您还可以将 Mac 上的{}安装文件夹{}更改为您希望 {}GameMaker{} 存储项目构建文件的位置。",
    "First you need to {}name {}the device so that you can identify it in the target list and then give the {}host name{} (or IP) of the Ubuntu machine (or VM). You must then give the {}username {}of the user that you wish to link to, and the {}password {}that they used. You are also required to give an {}install folder {}on the Ubuntu machine that you want to use for installing your projects. When that is all done, you can click on the {}Test Connection{} button to make sure that {}GameMaker{} can communicate with the Ubuntu machine.":"首先，您需要为设备{}命名{}，以便您可以在目标列表中识别它，然后给出Ubuntu 机器(或 VM )的{}主机名{}(或 IP)。然后，您必须提供要链接到的用户的{}用户名{}，以及他们使用的{}密码{}。您还需要在要用于安装项目的 Ubuntu 机器上提供一个{}安装文件夹{}。当所有这些都完成后，您可以点击{}测试连接{}按钮，以确保 {}GameMaker{} 可以与 Ubuntu 机器通信。",
    "Note that the final executable created by GameMaker&nbsp;{}will depend on the architecture of the device being targetted{}, which can be either {}x64{} or {}ARM{}. For example, if you connect a Raspberry Pi 3 or 4, the executable created will be a 32bit ARM executable, and if you connect a Linux PC it will be 64bit x64 executable.":"请注意，GameMaker {}创建的最终可执行文件将取决于目标设备的体系结构{}，它可以是 {}x64{} 或 {}ARM{}。例如，如果连接的是 Raspberry Pi 3 或 4，创建的可执行文件将是 32 位 ARM 可执行文件，如果连接的是 Linux PC，则创建的可执行文件将是 64 位 x64 可执行文件。",
    "Once you have set up your devices, you can then connect to any one of them from the Target options at the top of the {}GameMaker{} IDE and testing/building your game will push the project to that device:":"设置好设备后，您可以从 {}GameMaker{}IDE 顶部的目标选项连接到其中任何一个设备，测试 / 构建您的游戏会将项目推送到该设备：",
    "The Device Manager":"设备管理器",
    "The additional available fields can be set up to help control how the browser runs your projects, with the following options available:":"可以设置附加的可用字段，以帮助控制浏览器运行项目的方式，并提供以下选项：",
    "The {}Device Manager{} is accessed by clicking {}&nbsp;on the pencil button {}&nbsp;within the {}Target List{}:":"通过在{}目标列表{}中的铅笔按钮{}上单击{}来访问{}设备管理器{}：",
    "When that is all done, you can click on the {}Test Connection{} button to make sure that {}GameMaker{} can communicate with the Mac. ":"当所有这些都完成后，您可以单击{}测试连接{}按钮以确保 {}GameMaker{} 可以与 Mac 进行通信。",
    "{}Clicking this button will open the {}Device Manager{} where you can configure different devices for the target platforms that you wish to compile and test on (note that the platforms available will depend on the {}Licence{}&nbsp;that you have and not all of them may be visible). Below you can find details on configuring devices for each of the target platforms:":"{}单击此按钮将打开{}设备管理器{}，您可以在其中为要编译和测试的目标平台配置不同的设备(请注意，可用的平台将取决于您拥有的{}许可证{} ，并不是所有的许可证都可见)。您可以在下面找到有关为每个目标平台配置设备的详细信息：",
    "{}To add an Ubuntu (Linux) device to the manager, you must first click on the button labelled {}Add New Device {}which will add the device and create some blank fields which you will need to fill in to enable the connection.":"{}要将 Ubuntu(Linux) 设备添加到管理器，您必须首先单击标记为{}添加新设备{}的按钮，该按钮将添加设备并创建一些空白字段，您需要填写这些字段才能启用连接。"
}