{
    "Before installing a new runtime you will then be shown this dialog:&nbsp;":"在安装新的运行时之前，将显示此对话框：",
    "Checking the \"Remember Selection\" checkbox in this dialog will ensure you don\u0027t see it again. The selection of modules you choose here will then also be used when installing new runtimes&nbsp;and&nbsp;the&nbsp;{}Remember last selection of modules{}&nbsp;option will be set to \"OK\".":"选中此对话框中的\"记住选择\"复选框可确保您不会再次看到它。然后，您在此处选择的模块也将在安装新的运行时使用，并且{}记住上次选择的模块{}选项将设置为\"OK\"。",
    "Every runtime in&nbsp;{}GameMaker{}&nbsp;consists of a set of modules. As you might not need all of them on your system you can select which ones to download and install, for those cases where you e.g. are working on a machine with a limited amount of disk&nbsp;space or have a slow internet connection.":"{}GameMaker{} 中的每个运行时都由一组模块组成。由于您可能不需要系统上的所有磁盘空间，因此您可以选择要下载和安装的磁盘空间，例如，在磁盘空间有限的计算机上工作或 Internet 连接速度慢的情况下。",
    "Note that downloading and installing a runtime can take a few minutes, but you can see a progress bar for the download at the top right of the IDE:":"注意，下载和安装运行时可能需要几分钟，但是你可以在IDE的右上角看到下载的进度条:",
    "Note that, depending on the selected modules, downloading and installing a runtime can take a few minutes, but you can see a progress bar for the download at the top right of the IDE:":"请注意，根据所选模块的不同，下载和安装运行时可能需要几分钟，但您可以在 IDE 的右上角看到下载进度条：",
    "Runtime Modules Dialog":"运行时模块对话框",
    "The above is the default selection of modules on Windows. The {}base{} module and the module {}for the OS that you\u0027re currently developing on{} are {}always{} included. They are the minimum {}required{} modules for&nbsp;{}GameMaker{}&nbsp;to be able to build your game.&nbsp;All other modules are {}optional{}.":"以上是 Windows 上默认选择的模块。{4}始终包括{5}{}基础{}模块和您当前正在开发的{}操作系统{}的模块。{}GameMaker{} 至少需要{}这些{}模块才能构建您的游戏。所有其他模块都是{}可选{}。",
    "The {}GameMaker{} IDE will periodically check for updates and then download them automatically. Some of these updates will be optional and you can choose not to install them if you don\u0027t wish to or think that some of the changes may break a project that you are about to publish. However there are some updates that include important fixes or improvements that cannot be skipped and {}GameMaker{} will force an update in these cases.":"{}GameMaker{} IDE将定期检查更新，然后自动下载它们。其中一些更新是可选的，如果您不希望或认为某些更改可能会破坏您即将发布的项目，您可以选择不安装它们。然而，有些更新包含重要的修复或改进，不能跳过，{}GameMaker{} 将在这些情况下强制更新。",
    "These tools will automatically update when there is a new version available, but you can then use the&nbsp;{}Runtime Feeds Preferences{}{} {}to select which ones you actually want to use.":"当有新版本可用时，这些工具将自动更新，但您可以使用{}运行时源首选项{}{}{}来选择实际要使用的工具。",
    "Uncheck the \"Remember Selection\" checkbox in this dialog to not show it again. The selection of modules you choose here will then also be used when installing new runtimes&nbsp;and&nbsp;the&nbsp;{}Remember last selection of modules{}&nbsp;option will be set to \"Yes\".":"取消选中此对话框中的\"记住所选内容\"复选框以不再显示它。然后，在安装新的运行时也将使用您在此处选择的模块，{}记住上次选择的模块{}选项将设置为\"是\"。",
    "Updating&nbsp;Guide":"更新指引",
    "You can quickly change this by clicking the {}Required only{} button:&nbsp;":"您可以通过单击{}仅需要{}按钮来快速更改此设置：",
    "{}GameMaker{} is more than just an IDE and has a number of different runtime tools that it uses behind the scenes to build you games for the different target platforms available. These tools are mainly the different runners and compilers that each platform requires, and you can actually have several of each at any one time. What this means is that you can \"pick and choose\" which compiler version and which runner version to use should you have found any issues with the current one or are aiming at a very specific target version or platform. Tools will automatically update when there is a new version available, but you can then use the {}Runtime Feeds Preferences{} to select which ones you actually want to use. For more information on runtime updates please see {}Preferences - Runtime Feeds{}.":"{}GameMaker{}不仅仅是一个IDE，它还有许多不同的运行时工具，它可以在幕后为不同的目标平台制作游戏。这些工具主要是每个平台需要的不同的运行器和编译器，实际上您可以同时拥有多个。这意味着，如果您发现当前的编译器版本有任何问题，或者正在瞄准一个非常特定的目标版本或平台，那么您可以“选择”使用哪个编译器版本和哪个运行器版本。当有新版本可用时，工具将自动更新，但是您可以使用{}运行时 首选项{}来选择您实际想使用的版本。有关运行时更新的更多信息，请参见{}首选项-运行时{}。",
    "{}GameMaker{} is more than just an IDE and has a number of different runtime tools that it uses behind the scenes to build your games for the different target platforms available. These tools are mainly the different runners and compilers that each platform requires, and you can actually have several of each at any one time. What this means is that you can \"pick and choose\" which compiler version and which runner version to use should you have found any issues with the current one or are aiming at a very specific target version or platform.":"{}GameMaker{}不仅仅是一个 IDE，它还有许多不同的运行时工具，可以在幕后为可用的不同目标平台构建游戏。这些工具主要是每个平台所需要的不同的运行者和编译器，实际上你可以在任何时候拥有其中的几个。这意味着，您可以\"选择并选择\"要使用的编译器版本和运行器版本，您应该已经发现当前版本存在任何问题，或者正在瞄准非常特定的目标版本或平台。",
    "{}If you want to download and install the full list of modules that is available then you can click \"Select All\" instead:&nbsp;":"{}如果要下载并安装可用模块的完整列表，可以改为单击\"全选\"：",
    "{}Updating Guide{}":"{}更新指引{}",
    "{}{}NOTE{}{}&nbsp;This dialog will always be shown to you the first time you install any version of&nbsp;{}GameMaker{} starting with 2022.11. The default setting is to remember your choices and not show the dialog again in future, but you can set the {}{}{}Remember last selection of modules{}&nbsp;option in the {}Runtime Feeds Preferences{}&nbsp;to \"No\" or to \"Show Message\" to make the dialog show again each time.":"{}{}注意{}{} 从 2022.11 开始，第一次安装任何版本的 {}GameMaker{} 时，此对话框将始终显示给您。默认设置是记住您的选择，以后不再显示该对话框，但您可以将 {10}Runtime Feeds 首选项{11} 中的 {}{}{} 记住上次选择的模块 {} 选项设置为 \"否\" 或设置为 \"显示信息\"，以便每次再次显示该对话框。",
    "{}{}NOTE{}{}&nbsp;This dialog will always be shown to you the first time you install any version of&nbsp;{}GameMaker{} starting with 2022.11. The default setting is to remember your choices and not show the dialog again in the future, but you can set the {}{}{}Remember last selection of modules{}&nbsp;option in the {}Runtime Feeds Preferences{}&nbsp;to \"Show Message\" to make the dialog show again each time.":"{}{}注意{}{} 从2022.11开始，第一次安装任何版本的{}GameMaker{}时，此对话框将始终显示给您。默认设置是记住您的选择，并且以后不会再次显示该对话框，但您可以将{10}运行时源首选项{11}中的{}{}{}记住上次选择的模块{}选项设置为\"显示消息\"，以便每次再次显示该对话框。",
    "{}{}NOTE{}{}&nbsp;This dialog will be shown a first time when you install a new version of {}GameMaker{}. It will no longer be shown after that, unless you&nbsp;set the&nbsp;{}Remember last selection of modules{}&nbsp;option in the&nbsp;{}Runtime Feeds Preferences{}&nbsp;to \"No\" or to \"Show Message\".":"{}{}注意{}{} 第一次安装 {}GameMaker{} 的新版本时将显示此对话框。此后将不再显示此对话框，除非您将{}运行时源首选项{}中的{}记住上次选择的模块{}选项设置为\"否\"或\"显示消息\"。"
}