{
    "Sometimes when making a game you may wish one key to do the same as another. For example many people use the keys WASD for movement, but then many people {}also{} use the arrow keys! So, what to do? Well, you {}could{} code the movement system twice, but that is a bit complicated and thankfully redundant as this function permits you to \"map\" one key to another and so any input from either key will be interpreted as the same. To do this you choose a key that you want to map (key2 - this will be the key that you write the code for) and a key that you want it to be mapped {}to{} (key1). After that, keypresses to either key will be interpreted by {}GameMaker{} as coming from key2. You can also use this function to design a system where the user can define their own keys for playing by simply mapping the user input key to the key that you have coded into the game.":"有时，在制作游戏时，您可能希望一个键与另一个键执行相同的操作。例如，许多人使用WASD键移动，但许多人{}也{}使用箭头键！那么，该怎么办？嗯，你{}可以{}编程移动系统两次，但这有点复杂，而且谢天谢地，这是多余的，因为此函数允许您将一个键“映射”到另一个键，因此来自任何一个键的任何输入都将被解释为相同。要执行此操作，请选择要映射的键（键2-这将是您为其编写代码的键）和您希望将其{}映射到{}的键（key1）。之后，对任何一个键的按键都将被{}GameMaker{}解释为来自Key2。您也可以使用此功能进行设计在该系统中，用户可以通过简单地将用户输入键映射到您已编码到游戏中的键来定义他们自己的游戏键。",
    "The above example code will map the \"A\" key to the left arrow key. This means that the player can use either the \"A\" {}or{} the left arrow key, and that all code written for the left arrow will also respond to the \"A\" key being used instead.":"上面的示例代码将 “A” 键映射到左箭头键。这意味着玩家可以使用 “A”{}或{}左箭头键，并且为左箭头编写的所有代码也将响应 “A”正在使用的键。",
    "The function takes a keycode value as returned by the function {}{}ord(){}{} (only {}capital{} letters from A-Z or numbers from 0-9), or any of the {}vk_*{} constants listed on the main {}Keyboard Input{} page.":"该函数采用函数{}{}ord(){}{}返回的键码值 (仅{}a-Z的大写字母{}或0- 9的数字)，或在主{}键盘输入{}页面上列出的{}vk_ *{}常量中的任何一个。",
    "This is the key that is to be mapped":"这是要映射的键",
    "This is the key that key1 is to be mapped to":"这是key1要映射到的键",
    "{}IMPORTANT!{} The key you are mapping to (key1) will no longer be usable as it\u0027s actual key symbol once you use this function. For example, if you map the up-arrow to \"W\" then you will no longer be able to detect the press of the \"W\" key as a \"W\", it will always be considered as the up-arrow. To undo this, either map the key to itself - so both key1 and key2 would be {}ord(\"W\"){}&nbsp;- or use the function {}{}keyboard_unset_map(){}{}.":"{}重要!{}您要映射到 (key1) 的键将不再可用，因为它是实际的键符号，一旦您使用此功能。例如，如果将向上箭头映射到 “W”，则您将不再能够检测到按下将 “W” 键视为 “W”，它将始终被视为上箭头。要撤消此操作，请将键映射到自身-因此key1和key2均为{}ord(\"W\"){}-或使用函数{}{}keyboard_unset_map(){}{}。"
}