{
    "Array containing weak references to the structs that you want to check.":"包含对要检查的结构的弱引用的数组。",
    "Note that the function also takes two optional arguments, where the first permits you to supply an initial index into the array to check from, as well as an argument to set the number of positions (length) from that index to check. If specified, only the array indices within those parameters will be checked.":"请注意，该函数还采用两个可选参数，其中第一个允许您提供一个初始索引到数组中进行检查，以及一个参数来设置该索引要检查的位置(长度) 的数量。如果指定，将仅检查这些参数中的数组索引。",
    "The above code checks an array of&nbsp;weak references and if any are&nbsp;still alive then an instance is destroyed.":"上面的代码检查弱引用数组，如果仍然存在，则实例将被销毁。",
    "With this function you can check the&nbsp;{}weak reference{}&nbsp;to various&nbsp;structs to see if it they are still \"alive\" or not. You supply an array of weak references to check (each weak reference should have been created using the function {}{}weak_ref_create(){}{}), and the function will return {}true{} if {}{}any {}{}of the structs&nbsp;are&nbsp;still being referenced somewhere or {}false{} if they are not and have&nbsp;been garbage collected. Note that if you supply an array where any of the values are not a weak references,&nbsp;the function will return {}undefined{}.":"使用此函数，您可以检查对各种结构的{}弱引用{}，以查看它们是否仍处于\"活动\"状态。您提供了一个要检查的弱引用数组(每个弱引用应该已使用函数{}{}weak_ref_create(){}{}创建)，如果{}{}任何{}结构仍在某处被引用，则该函数将{}返回{}真{};如果没有并且已被垃圾收集，则返回{}假{}。请注意，如果提供的数组中有任何值不是弱引用，则函数将返回{}undefined{}的。",
    "With this function you can check the&nbsp;{}weak reference{}&nbsp;to various&nbsp;{}structs{} to see if it they are still \"alive\" or not. You supply an array of weak references to check (each weak reference should have been created using the function {}{}weak_ref_create{}{}), and the function will return {}true{} if {}{}any {}{}of the structs&nbsp;are&nbsp;still being referenced somewhere or {}false{}&nbsp;if they are not and have&nbsp;been garbage collected. Note that if you supply an array where any of the values are not a weak references,&nbsp;the function will return {}undefined{}.":"使用此函数，您可以检查对各种 {2} 结构 {3} 的 {} 弱引用 {}，以查看它们是否仍处于\"活动\"状态。您提供了一个要检查的弱引用数组 (每个弱引用应该已使用函数 {}{}weak_ref_create(){}{} 创建)，如果 {}{} 任何 {} 结构仍在某处被引用，则该函数将 {} 返回 {} 真 {}; 如果没有并且已被垃圾收集，则返回 {} 假 {}。请注意，如果提供的数组中有任何值不是弱引用，则函数将返回 {}undefined{} 的。",
    "{}OPTIONAL{} The index into the array to start checking from":"{}可选{} 要开始检查的数组中的索引",
    "{}OPTIONAL{} The number of positions, starting from the given index, to check for":"{}可选{} 从给定的索引开始，要检查的头寸数量",
    "{}{}OPTIONAL{}{}&nbsp;The index into the array to start checking from":"{}{}可选{}{} 要开始检查的数组中的索引",
    "{}{}OPTIONAL{}{}&nbsp;The number of positions, starting from the given index, to check for":"{}{}可选{}{} 从给定的索引开始，要检查的头寸数量"
}