{
    "Another important thing to do know is how to set the {}collision mask{} for the sprite. The collision mask is the area that {}GameMaker{} will check to see if there has been a collision with any other instance of an object in the game, and by default this is set to rectangle (which is also the fastest to resolve). Note that you can set the detection mode for the {} {}bounding box{}{} to be either automatic (the default value) or manual. If you choose manual you will be able to set the bounding box values left, right, top and bottom.":"另一件需要了解的重要事情是如何为精灵设置{}碰撞遮罩{}。碰撞遮罩是 {}GameMaker{} 将检查是否与游戏中的任何其他对象实例发生碰撞的区域，默认情况下设置为矩形(这也是解决速度最快的)。请注意，您可以将{}{}边界框{}{}的检测模式设置为自动(默认值)或手动。如果您选择手动，您将能够设置边界框值左侧、右侧、顶部和底部。",
    "Any type of collision mask other than rectangle will be slower to resolve, but when making a small, simple game it\u0027s not usually an issue. Note that you can also import sprites made in other software by clicking the {}Import {}button in the sprite editor, and you can also drag image files onto the {}GameMaker{} IDE to add them as sprites to the Asset Browser. You can also drag sprites from the Asset Browser to add them to things directly, in which case the IDE will highlight the places you can add the sprite to:":"除矩形之外的任何类型的冲突遮罩都会比较慢，但在制作一个小而简单的游戏时，这通常不是问题。请注意，您也可以通过单击精灵编辑器中的 {} 导入 {} 按钮来导入在其他软件中制作的精灵，也可以将图像文件拖动到 {}GameMaker{} IDE 中，以将它们作为精灵添加到资源浏览器中。也可以从资源浏览器拖动精灵以将其直接添加到对象中，在这种情况下，IDE 将高亮显示可以将精灵添加到的位置：",
    "At the bottom right we have the {}layers view{} - like many other drawing tools out there, you can create different layers to draw onto, permitting you to experiment with position and colour etc... without having to worry about destroying what\u0027s underneath.":"在右下角我们有{}图层视图{} - 就像许多其他的绘图工具一样，你可以创建不同的图层来绘制，允许你尝试位置和颜色等。而不必担心破坏地下的东西。",
    "At the middle right we have the {}colour picker{} - here we can choose the colour to use for the left and/or right mouse button, since you can draw on the canvas with one or the other buttons at the same time.":"在右中我们有{}颜色选择器{} - 在这里我们可以选择鼠标左键和/或右键所使用的颜色，因为您可以同时使用一个或另一个按钮在画布上绘制。",
    "At the top left, the {}frame view{} - this shows the frame(s) of your sprite and can be resized using the magnifying glass icons.":"在左上角，{}帧视图{} - 这显示了精灵的帧，并且可以使用放大镜图标来调整大小。",
    "At the top right we have the basic {}brushes{} - here you can pick the brush for drawing, and any custom brushes will also be added here.":"在右上角我们有基本的{}画笔{} - 在这里你可以选择画笔，任何自定义的画笔也将被添加到这里。",
    "Creating Sprites":"创建精灵",
    "Draw something into the image editor and take some time to play with the options, then when you are ready close the image editor workspace (which will save the image) to take you back to the main workspace with the sprite editor in it. We\u0027ll discuss a few other features of the sprite editor that are important to know when just getting started...":"在图像编辑器中绘制一些内容，并花一些时间处理选项，然后当您准备好时，关闭图像编辑器工作区(这将保存图像)，将您带回到包含精灵编辑器的主工作区。我们将讨论精灵编辑器的其他几个功能，这些功能在刚开始使用时需要知道这些功能很重要……",
    "Editors: The Image Editor":"编辑器：图像编辑器",
    "Editors: The Sprite Editor":"编辑器：精灵编辑器",
    "In the centre we have the drawing {}canvas{} - this shows the currently selected frame ready for drawing and you can use the middle mouse button {} to pan around and the mouse wheel {} to zoom in and out.":"在中间我们有绘图{}画布{} - 这显示了当前选定的框架已准备好绘制，您可以使用鼠标中键{}平移，并使用鼠标滚轮{}进行放大和缩小。",
    "Just below the colour picker we have our {}tools {}- these are the different drawing tools, including the brush, flood fill, masking and shape tools. Note that some of the tools are split diagonally and will draw either outlined or filled shapes depending on which side of the line you click on to select them.":"就在颜色选择器下面，我们有我们的{}工具{} - 这些是不同的绘制工具，包括画笔、填充、蒙版和形状工具。请注意，有些工具是对角线拆分的，它们将绘制轮廓形状或填充形状，具体取决于您单击线条的哪一侧来选择它们。",
    "Now that you {}know what a program is{}, it\u0027s time to look at some of the different {}assets {}that can be used in {}GameMaker{} to make your game. To start with, we\u0027ll look at {}sprites{}, which are generally one of the first things you\u0027ll need when making any project. As explained in the section on {}The Asset Browser{}, a sprite is an image that can be animated (although it doesn\u0027t have to be) and then drawn to the screen. In general a sprite will be associated with an object, but you can draw sprites on their own, either from code or in the room editor {}Asset Layer{} (we\u0027ll talk about this in more detail later, in the section on {}rooms{}). You can also create a sprite to be used as a {}tile sets{}, but we\u0027ll explore that option in a later section too.":"现在，您已经{}了解了程序是什么{}，接下来来看看可以在 {}GameMaker{} 中使用的一些不同的{}资源{}来制作您的游戏。首先，我们将查看{}精灵{}，它们通常是您在进行任何项目时首先需要做的事情之一。如{}资源浏览器{}一节中所述，精灵是一种可以设置动画(尽管不必设置)然后绘制到屏幕上的图像。一般来说，精灵会与对象相关联，但你可以自己绘制精灵，可以从代码中绘制，也可以在房间编辑器中绘制{}资源层{}(我们将在后面关于{}房间{}的小节中更详细地讨论这一点)。您也可以创建一个精灵作为一个{}平铺集{}，但我们将在后面的部分探索该选项。",
    "So we click {} on the from down menu for setting the origin and select \"middle centre\":":"因此，我们在设置原点的下拉菜单上点击{}，然后选择\"居中\"：",
    "The first thing you need know is how to set the {}origin {}for the sprite. The origin is simply the point that will be used to \"anchor\" our sprite within the room, and in this case we want to set it to the centre.":"您需要知道的第一件事是如何设置精灵的{}原点{}。原点只是一个点，它将被用来在房间内“锚定”我们的精灵，在本例中，我们希望将它设置在中心。",
    "The other features of the sprite editor we\u0027ll discuss at the end of this section, but first we need to explain how to draw a sprite. This is done in the {}{}Image Editor{}{}. The image editor is a very powerful tool for creating the graphics in your game and is opened by clicking the {}Edit Image {}button.":"我们将在本节结束时讨论精灵编辑器的其他功能，但首先我们需要解释如何绘制精灵。此操作在{}{}图像编辑器{}{}中完成。图像编辑器是在游戏中创建图形的一个非常强大的工具，可通过单击{}编辑图像{}按钮打开。",
    "We won\u0027t go into too much depth about the tools available here - for that we have the Image Editor section of the manual - but briefly you have:":"我们不会太深入地介绍这里提供的工具 -- 因为我们有手册的图像编辑器部分 -- 但简要地说，您有：",
    "When you create a new project from the {}Start Page{}, the asset browser will only contain empty folders for the resources you may need, so you need to right-click {} on the sprite asset folder and then select the option {}Create{}&nbsp;(if you don\u0027t have a sprite asset folder you can make one from the right-click menu and then create the sprite, or you can simply right-click anywhere in the asset browser and create it). This will create a new sprite asset and open the {}{}sprite editor{}{} for you (if the sprite editor does not open, simply double-click {} on the new asset):":"从{}开始页{}创建新项目时，资源浏览器将只包含您可能需要的资源的空文件夹，因此需要在精灵资源文件夹上单击鼠标右键{}，然后选择选项{}Create{} ；(如果没有精灵资源文件夹，则可以从右键单击菜单中创建一个精灵资源文件夹，然后创建精灵，或者只需在资源浏览器中的任意位置单击鼠标右键并创建它)。这将创建一个新的精灵资源，并为您打开{}{}精灵编辑器{}{}(如果精灵编辑器没有打开，只需在新资源上双击{})：",
    "You can close the sprite editor now as we are going to move on to discuss {} Tile Sets{}.":"您现在可以关闭精灵编辑器，因为我们将继续讨论{}平铺集{}。",
    "You\u0027ll see the blue origin marker in the preview image move to the center of the sprite. Note that you can place the origin anywhere you wish by simply clicking {} on the preview image, and you can also manually input the origin position by adding values into the x/y fields at the top.":"您将看到预览图像中的蓝色原点标记移动到精灵的中心。请注意，您只需在预览图像上单击 {} 即可将原点放置在您想要的任何位置，也可以通过在顶部的 X/Y 字段中添加值来手动输入原点位置。",
    "{}As you can see, the top left of the window has a field for the {}Name {}of the sprite. All sprites (and all other assets) must have a name given to them so that you (and {}GameMaker{}) can identify them easily, although you should note that this name is really just a {} {}variable{}{}&nbsp;which holds an ID value that \"points\" to the resource, in this case a sprite. It\u0027s best to give each sprite a descriptive name so that you can identify at a glance whether a particular asset is a sprite or an object or something else, and many people do this by prefixing or suffixing the resource with the letters \" {}spr{}\" - for example, \" {}spr_Ball{}\". Note that resource names are limited to using only letters, digits and the underscore symbol \"_\", and the name of all assets must start with a letter, not a number.":"{}如您所见，窗口左上角有一个字段，用于表示精灵的{}名称{}。所有精灵 (和所有其他资源) 都必须有一个名称，这样你 (和 {}GameMaker{}) 才能很容易地识别它们，尽管你应该注意到这个名称实际上只是一个{}{}变量{}{}，它保存了一个 ID 值，在本例中是一个指向资源的 ID 值。最好为每个精灵指定一个描述性名称，以便您可以一目了然地识别特定资源是精灵、对象还是其他东西，许多人通过在资源前缀或后缀字母 \"{}spr{}\" 来做到这一点-例如，\"{}spr_ball{}\"。请注意，资源名称仅限于使用字母、数字和下划线符号 \"_\"，并且所有资源的名称必须以字母开头，而不能以数字开头。",
    "{}If you\u0027d like more detailed information on the Sprite Editor and the Image Editor, please see the following sections of the manual:":"{}如果您想了解有关精灵编辑器和图像编辑器的更多详细信息，请参阅手册的以下部分："
}