{
    "Adding a sound is as simple as clicking the add sound button {}&nbsp;and then browsing in the file explorer that opens to the file you want to use (you can also drag and release sound files onto the {}GameMaker{} IDE and they will be added as a new sound asset). Once you have selected one and loaded it in, you can then preview it using the playback controls shown as well as change certain attributes for how the file should be exported. If you aren\u0027t sure about this, then simply leave everything \"as-is\", although if you are adding music or {}MP3{} / {}OGG{} format sounds you should probably change to the {}Compressed - Not Streamed{} format.":"添加声音非常简单，只需单击添加声音按钮 {}，然后在打开的文件资源管理器中浏览您要使用的文件 (您也可以将声音文件拖放到 {}GameMaker{} IDE 中，它们将作为新的声音资源添加)。一旦选择了一个文件并将其加载到中，就可以使用显示的播放控件预览它，并更改文件应如何导出的某些属性。如果你不确定这一点，那么简单地让一切保持原样，尽管如果你正在添加音乐或 {}MP3{}/{}Ogg{} 格式的声音，你可能应该改为 {} 压缩的-而不是流的 {} 格式。",
    "All games have to have sound effects - and most also have music - which means that you need to be able to add them to your game in {}GameMaker{}. This is done through the {}{}Sound Editor{}{}, which is opened whenever you create a new Sound asset in the Asset Browser:":"所有游戏都必须有音效，而且大多数游戏都有音乐，这意味着你需要能够将它们添加到 {}GameMaker{} 中的游戏中。这是通过 {}{} 声音编辑器 {}{} 完成的，每当您在资源浏览器中创建新的声音资源时都会打开该编辑器：",
    "Creating Sound Effects":"创建声音效果",
    "Editors: The Sound Editor":"编辑器：声音编辑器",
    "Note that sounds take up a lot of space on disk, so you should be careful when creating them for your game projects. Do you really need a 48KHz sound effect that only plays for a fraction of a second? Probably not! So, think about reducing the {}sample rate{} here to 11025 or 22050 for effects, and for longer things like music or for looping effects think also about using a compressed format. Note too that if you plan on using 3D positional audio effects, then the initial sound file must be {}mono{}.":"请注意，声音会占用大量磁盘空间，因此在为游戏项目创建声音时应小心。你真的需要 48 khz 的音效，只播放一小部分时间吗？可能不会！因此，考虑将这里的{}采样率{}降低到 11025 或 22050 以获得效果，对于较长的内容，如音乐或循环效果，也可以考虑使用压缩格式。还请注意，如果您计划使用 3D 位置音频效果，则初始声音文件必须是 {} 单声道 {}。",
    "Sounds in {}GameMaker{} can be {}uncompressed {}or {}compressed{}, with compressed sounds having additional options on how to deal with them at run time. Uncompressed sounds are those that have been saved as {}WAV{} format files, while compressed sounds can be either {}MP3{} or {}OGG{} format. In general you\u0027ll want small sound effects to be {}WAV{} - like shooting sounds, or button sounds, etc... - and larger effects or music to be {}MP3{} or {}OGG{}. As with the other different resources, it is recommended that you name your sounds using an appropriate prefix like \" {}snd_{}\" so you can easily identify it later.":"在 {}GameMaker{} 中的声音可以是 {} 未压缩的 {} 或 {} 压缩的 {}，压缩的声音在运行时有额外的处理选项。未压缩声音是指已保存为 {}wav{} 格式文件的声音，而压缩声音可以是 {}mp3{} 或 {}ogg{} 格式。一般来说，你会希望小的音效是 {}wav{} -- 像射击的声音，或者按钮的声音，等等。- 更大的效果或音乐将是 {}MP3{} 或 {}Ogg{}。与其他不同的资源一样，建议您使用适当的前缀来命名您的声音，如 \"{}nd_{}\"，这样您以后就可以轻松地识别它。",
    "You can close the sound editor now and we can move on to looking at {}Objects And Instances{}...":"您现在可以关闭声音编辑器，我们可以继续查看{}对象和实例{}...",
    "You can find further information on the sound editor on the page linked below:":"您可以在下面链接的页面上找到有关声音编辑器的更多信息：",
    "{}NOTE{}: An uncompressed sound simply means that it has not had any type of compression {} {}algorithm{}{}&nbsp;applied to it. Applying {}compression{}&nbsp;to a sound means that it will require less storage space, but will also mean that it needs to be decompressed before playing, and since small sound effects are generally used a lot and very quickly - and don\u0027t take up much storage space - you don\u0027t want the extra CPU cost of decompressing it when it\u0027s being played. However, since things like music files can generally be very large files, you do want them to be compressed, as they will take up less storage space that way, and the extra CPU cost of decompressing is negligible, since they are only generally being played one at a time.":"{}注意{}：未压缩的声音只是表示它没有应用任何类型的压缩 {}{} 算法 {}{}。对声音应用 {} 压缩 {} 意味着它将需要较少的存储空间，但也意味着在播放之前需要解压缩，而且由于小音效通常使用得很多且非常快-并且不会占用太多存储空间-你不希望在播放时解压缩它需要额外的 CPU 成本。然而，由于音乐文件通常是非常大的文件，您确实希望压缩它们，因为这样会占用更少的存储空间，而解压缩的额外 CPU 成本可以忽略不计，因为它们通常一次只播放一个。"
}