{
    "Editors: The Tile Set Editor":"编辑器：平铺集编辑器",
    "Let\u0027s take a look at a simple example of a tile set - some square wall tiles for a top down game:":"让我们来看一个简单的瓷砖集示例 - 一些用于自上而下游戏的方形墙壁瓷砖：",
    "Now to move on to talk about adding {}sound effects{} to your project...":"现在继续讨论如何在项目中添加{}音效{}...",
    "To make processing tiles so fast, they do have certain restrictions, with the most basic one being that they can {}only be rectangular or square{} (if you want anything other than this, then you\u0027ll need to create a regular sprite and use the {}Asset Layer{} in the room editor, but we\u0027ll discuss that in the later section on {}rooms{}). Other restrictions include the fact that they can only be rotated by 90°, or mirrored or flipped, and they can only be animated with frames that number a {}power of 2{} (ie: 2, 4, 8, 16, etc...).":"要如此快速地处理瓷砖，它们确实有一定的限制，最基本的限制是它们只能是{}长方形或正方形{}(如果你想要其他的东西，那么你需要创建一个常规的精灵，并在房间编辑器中使用{}资源层{}，但我们将在后面的{}房间{}一节中讨论这一点)。其他限制包括它们只能旋转90°，或镜像或翻转，并且只能使用编号为2{}的{}次方(即：2、4、8、16等)的帧来设置动画。",
    "To start with, we need to make this into a tile set {}sprite{}, which would be done in the {}Sprite Editor{}/{}Image Editor{} (or an external image editor and then imported as a sprite). The final sprite should look something like this:":"首先，我们需要将其设置为平铺集{}精灵{}，这将在{}精灵编辑器{}/{}图像编辑器{}中完成(或外部图像编辑器，然后作为精灵导入)。最终的精灵应该如下所示：",
    "We have set the tile set size to 64px, and we have left the rest of the options at their default values, since we have no need for offsets or anything like that (the offset values are useful for any tile set sprite that has spaces around each of the tiles). You\u0027ll want to name the tile set asset using an appropriate prefix like \" {}ts_{}\" so you can easily identify it later, and note that the same restrictions apply as for sprites, ie: the name cannot start with a number, and can only use the underscore \"_\" symbol and alpha-numeric characters.":"我们已将平铺集大小设置为 64px，并将其余选项保留为其缺省值，因为我们不需要偏移或类似的东西 (对于每个平铺周围有空格的任何平铺集精灵来说，偏移值都很有用)。您将希望使用适当的前缀命名瓷砖集资源，如 \"{}ts_{}\"，以便以后可以轻松地识别它，并注意与精灵相同的限制，即：名称不能以数字开头，并且只能使用下划线 \"_\" 符号和字母数字字符。",
    "With the sprite created, we can go ahead and define the tile set itself, which means you have to first create a new tile set resource by right clicking {} the Tile Set asset folder and selecting {}Create{}. This will open the {}Tile Set Editor{} where you can then add the sprite and set its properties:":"创建精灵后，我们可以继续定义磁贴集本身，这意味着您必须首先通过右键单击{}磁贴集资源文件夹并选择{}创建{}来创建新的磁贴集资源。这将打开{}平铺集编辑器{}，然后您可以在其中添加精灵并设置其属性：",
    "You can now close the tile set editor, as you can use the tile set \"as is\" to create tile map layers in the room editor, however if you want to know more about the advanced functions of the Tile Set Editor, then see the following section of the manual:":"现在，您可以关闭瓷砖集编辑器，因为您可以使用瓷砖集在房间编辑器中按原样创建瓷砖贴图层，但是，如果您想了解有关瓷砖集编辑器高级功能的更多信息，请参阅手册的以下部分：",
    "{} {}Notice that the very first tile is blank in that image{}. The way that the tile map for the room is stored in {}GameMaker{} means that first tile will always need to be blank as it\u0027s essentially the \"delete\" tile or the \"empty space\" tile (this \"blank\" tile will have an {}index {}value of 0 - tiles are indexed with a value that starts at 0 and counts up from left to right, top to bottom). So, when creating your tile sets, the top left corner tile will always need to be empty in this way. Also note that while the image above shows a full wall tile set with 47 tiles, you may not need so many as you can rotate and flip tiles when placing them in the room editor later.":"{}{} 请注意，该图像中的第一个磁贴是空白的 {}。房间的磁贴地图存储在 {}GameMaker{} 中的方式意味着第一个磁贴需要始终为空，因为它本质上是“删除”磁贴或“空白”磁贴 (这个“空白”磁贴的 {} 索引 {} 值为 0 -- 磁贴的索引从 0 开始，从左到右，从上到下依次递增)。因此，在创建分片集时，左上角的分片始终需要以这种方式为空。另请注意，虽然上图显示了包含 47 个瓷砖的完整墙面瓷砖，但您可能不需要这么多瓷砖，因为稍后将它们放置在房间编辑器中时，您可以旋转和翻转瓷砖。",
    "{}Creating Tile Sets{}":"{}创建 Tilesets{}",
    "{}Tile Sets{} are created from sprites, but they are also classified as a separate asset type since the way that {}GameMaker{} handles them is a bit different to both sprites and objects. So, a tile set is a collection of tiles created together in one sprite, and a tile is simply a graphical resource that gets added to a {}GameMaker{} room as part of a {} {}tile map{}{}. These tile maps are then drawn to the screen with very little CPU/GPU processing, making them ideal for designing any static items in levels.":"{}瓷砖集{}是从精灵创建的，但它们也被归类为单独的资源类型，因为{}GameMaker{}处理它们的方式与精灵和对象略有不同。因此，磁贴集是在一个精灵中一起创建的磁贴的集合，磁贴只是添加到{}GameMaker{}房间中的图形资源，作为{}{}磁贴地图{}{}的一部分。这些瓷砖地图随后被绘制到屏幕上，只需很少的CPU/GPU处理，使它们成为设计关卡中任何静态项目的理想选择。"
}