{
    "All games that you make in {}GameMaker{} need at least one room to run (but can have many, many more) , and a room is just a space where you place instances of the objects that make up your game as well as tiles and any other graphical resources. When you first create a room in the {}Asset Browser{}&nbsp;you will be presented with a new {}{}Room Editor{}{} workspace with which to edit its properties, something like this:":"您在 {}GameMaker{} 中制作的所有游戏都需要至少一个空间来运行(但可以有很多很多空间)，而空间就是一个空间，您可以在其中放置组成游戏的对象的实例以及图块和任何其他图形资源。首次在{}资源浏览器{} 中创建房间时，您将看到一个新的{}{}房间编辑器{}{}工作区，可用来编辑其属性，如下所示：",
    "By default the room tools will be placed on the left, with two main sections:":"默认情况下，房间工具将放置在左侧，有两个主要部分：",
    "Editors: The Room Editor":"编辑器：房间编辑器",
    "For more detailed information on the Room Editor, you can see the following section of the manual:":"有关房间编辑器的更多详细信息，请参阅手册的以下部分：",
    "If you want to place multiple instances in the room, then you can select an object from the resource tree and then press and hold {} to preview the resource, and if you additionally click the left mouse button&nbsp;{} you can then \"paint\" it into the room layer.":"如果您要在房间中放置多个实例，则可以从资源树中选择一个对象，然后按住{}以预览资源，如果您另外单击鼠标左键{}，则可以将其绘制到房间层中。",
    "Note that assets are given a position when they are added into the room editor based on their X and Y axis positions relative to the room {}origin{}. The room origin is the (0, 0) position, which in {}GameMaker{} is the top left corner, and to the right is +X and down is +Y, e.g.:":"请注意，在将资源添加到房间编辑器中时，会根据其相对于房间原点的 X 轴和 Y 轴位置为其指定一个位置。房间{}原点{}为 (0, 0) 位置，在{}GameMaker{}中为左上角，右侧为 +X，向下为 +Y，例如：",
    "Rooms":"房间",
    "Sometimes you want a nice graphical effect but don\u0027t want the overhead of using an instance or don\u0027t need it to do anything other than draw itself. You could use a tile map, but given that tile maps are restricted to using a grid and only a single image per grid cell, they can be a bit restrictive. This is when you would use the asset layer. The asset layer simply takes a sprite resource and draws it using the parameters that you set when you add it into the room. Sprites and sequences can be added to this layer the same way that instances of objects are added to the instance layer, ie: you click {} on the sprite in the asset browser and then drag it into the room editor workspace.":"有时，您想要一个很好的图形效果，但不想要使用实例的开销，或者除了绘制自己之外不需要它做任何事情。您可以使用平铺地图，但由于平铺地图被限制为只能使用网格，并且每个网格单元只能使用一幅图像，因此它们可能会有一些限制。此时您将使用资源层。资源层只获取一个精灵资源，并使用您在将其添加到房间时设置的参数来绘制它。可以将精灵和序列添加到此层，方法与将对象实例添加到实例层的方式相同，即：在资源浏览器中的精灵上单击{}，然后将其拖动到房间编辑器工作区。",
    "That wraps it up for the Room Editor in this Quick Start Guide, and you should now know enough to actually get started creating sprites and objects and designing rooms for them. The next sections of this guide are going to cover some of the programming fundamentals to help you on your way, starting with actually {}Drawing {}things to the screen.":"这就是本快速入门指南中的房间编辑器的总结，您现在应该知道足够多的知识来实际开始创建精灵和对象并为它们设计房间。本指南的下一节将介绍一些编程基础知识，以帮助您上路，从实际将东西{}绘制{}到屏幕开始。",
    "The background layer is a layer that can be filled with a {}single {}colour or a {}single {}image. It can be moved and positioned within the room, and you can have multiple background layers. Generally this is used, as the name suggests, to generate a constant background for all the other layers in the room. By Default a new room will always contain a background layer, but you can remove it if you don\u0027t need it.":"背景层是可以用{}单个{}颜色或{}单个{}图像填充的层。它可以在房间内移动和定位，并且可以有多个背景层。顾名思义，这通常用于为房间中的所有其他层生成恒定的背景。默认情况下，新房间将始终包含背景层，但如果不需要，可以将其删除。",
    "The instance layer is where you place all the instances of the objects that you require for the game. To add an instance to a layer, simply click {} on the object in the asset browser and then drag it into the room editor workspace. When you release the mouse button, an instance of that object will have been added to the room. By Default a new room will always contain an instance layer, but you can remove it if you don\u0027t need it.":"实例层是放置游戏所需对象的所有实例的位置。要将实例添加到层，只需在资源浏览器中的对象上单击{}，然后将其拖动到房间编辑器工作区。当您释放鼠标按钮时，该对象的一个实例将添加到房间中。默认情况下，新房间将始终包含实例层，但如果不需要，可以将其移除。",
    "To add an instance to the room editor, you must first select an Instance Layer from the Layer Editor on the left (or create one if none exist). You can then go to the Asset Browser and simply click {}&nbsp;and drag an object that you want&nbsp;from there and drop it into the room at the position you want, which will add a single instance of that object to your game:":"若要将实例添加到房间编辑器，必须首先从左侧的层编辑器中选择实例层(如果不存在实例层，则创建实例层)。然后，您可以转到资源浏览器，只需单击{}并从那里拖动所需的对象并将其放入房间中所需的位置，即可将该对象的单个实例添加到您的游戏中：",
    "We won\u0027t go into much more details about the room editor here (for that we have {}this section{} of the manual), but we will briefly explain how to add instances to an Instance Layer, as you\u0027ll need to know that for the next section of the Quick Start Guide.":"我们不会在这里深入讨论房间编辑器的更多细节(因为我们有手册的{}这一节{})，但我们将简要解释如何将实例添加到实例层，因为在快速入门指南的下一节中，您需要了解这一点。",
    "We\u0027ve mentioned that there are different layer types, so let\u0027s just go over what they are and how they can be used when building your games:":"我们已经提到过有不同的层类型，所以让我们来看看它们是什么，以及在构建游戏时如何使用它们：",
    "{}After having created a {}tile sets{}, you need to add the tiles to your room, which is done by creating a {}tile map{} layer. A tile map layer is a layer that permits you to add tiles from any of the tile set assets that you have created and will be set up automatically to use a grid the size of the tile set cells. You can only add a single tile to each grid cell, so if you require multiple tiles to occupy the same space, then you should be using multiple tile map layers.{}":"{}在创建了{}磁贴集{}之后，您需要将磁贴添加到您的房间，这是通过创建一个{}磁贴地图{}层来完成的。切片地图图层允许您从已创建的任何切片集资源添加切片，并且将自动设置为使用切片集单元格大小的栅格。您只能向每个网格单元格添加单个切片，因此，如果需要多个切片占据同一空间，则应使用多个切片地图层。{}",
    "{}Asset Layer{}":"{}资产层{}",
    "{}Background Layer{}":"{}背景层{}",
    "{}In the above example the instance is placed in the middle of the room at position (X:512, Y:384). It\u0027s also possible to go outside of the room bounds and have positions that are greater than the room axis lengths, or even less than than the room origin - in which case the X/Y coordinates will be negative values.":"{} 在上例中，实例放置在房间中间的位置 (X：512，Y：384)。也可以超出房间边界，其位置大于房间轴线长度，甚至小于房间原点，在这种情况下，X/Y 坐标将为负值。",
    "{}Instance Layer{}":"{}实例层{}",
    "{}Layer Editor{}: Everything in a room is placed on {}layers{}, and there are different layer types that you can choose from (more on this later). Layers are ordered by {}depth {}and this depth is what defines the order in which the layer contents will be rendered to the screen when the game runs. Depth ordering is from highest to lowest, so that the lower the depth the nearer the \"camera\" and the higher the depth the further away. For example, a layer with a depth of -300 will render over a layer with a depth of -100, and a layer with a depth of 1000 will render under everything with a depth less than this. Note that by default, {}GameMaker{} will order layer depths for you according to the position in the Layer Editor, and you can drag around layers using the mouse to re-order them and {}GameMaker{} will re-order the depths to match.":"{}图层编辑器{}：房间里的所有东西都放在{}层{}上，有不同的层类型可供选择 (后面会有更多介绍)。层按 {} 深度 {} 排序，此深度定义了在游戏运行时将层内容呈现到屏幕上的顺序。深度排序是从最高到最低，所以深度越低，离相机越近，深度越高，距离越远。例如，深度为 -300 的层将在深度为 -100 的层上渲染，深度为 1000 的层将在深度小于此深度的所有对象下渲染。请注意，默认情况下，{}GameMaker{} 将根据层编辑器中的位置为您排序层深度，您可以使用鼠标拖动层来重新排序它们，而 {}GameMaker{} 将重新排序以匹配深度。",
    "{}Path Layer{}":"{}路径层{}",
    "{}The path layer is the only one that does not actually get rendered when you run your game. This layer is more of a \"convenience\" layer for helping you to create or edit {}Path {}assets, since it permits you to add or edit paths within the actual room space.{}":"{}路径层是唯一一个在运行游戏时不会实际渲染的层。该层更像是帮助您创建或编辑{}路径{}资源的“便利”层，因为它允许您在实际房间空间内添加或编辑路径。{}",
    "{}Tile Map Layer{}":"{}切片地图层{}",
    "{}{}Inspector{}{}: When you open a room its properties such as room size and camera view ports are shown here. You can set them here as well.{} When you click a layer in the Layer Editor its properties, that depend on the layer type, are shown and can be changed here. This window permits you to change those properties and edit how the layer will be {}rendered{}.":"{}{}检查器{}{}：打开房间时，房间大小、摄像头端口等属性都会在这里显示。您也可以在这里设置它们。{}当您在层编辑器中单击层时，它的属性将显示出来，并可以在此处更改，这些属性取决于层类型。此窗口允许您更改这些属性并编辑层的{}渲染{}方式。"
}