{
    "Now we can move on to talk about the&nbsp; {}Room Editor{}, which is where all these parts of your game come together...":"现在我们可以继续讨论{}房间编辑器{}，游戏的所有这些部分都集中在这里……",
    "Sequences":"序列",
    "Sequences are created through the&nbsp;{}{}Sequence Editor{}{}&nbsp;which is opened whenever you create a new sequence asset in the {}Asset Browser{}:":"序列是通过{}{}序列编辑器{}{}创建的，每当您在{}资源浏览器{}中创建新的序列资源时，该编辑器都会打开：",
    "So, you would position the asset and set its scale and colour and other properties at frame 0 of the sequence. You would then record the parameter keys for the asset and move the playhead to the frame where you want to set the next asset state (position, colour, etc....). On this frame you would again change the different parameters and record keys for them, then repeat this process as required for the length of the sequence. When you press play on the sequence, the asset will be animated, with the sequence {}linear interpolation{}&nbsp;between the different parameter states, giving an end result something like this:&nbsp;":"因此，您可以在序列的第0帧定位资源并设置其比例、颜色和其他属性。然后记录资源的参数关键点，并将播放头移动到要设置下一个资源状态(位置、颜色等)的帧。在此帧上，您将再次更改不同的参数并记录它们的关键点，然后根据序列长度的需要重复此过程。当您在序列上按下播放时，资源将被设置动画，不同参数状态之间的序列{}线性插值{} ，最终结果类似于： ",
    "The Sequences Editor":"序列编辑器",
    "The final asset we\u0027ll discuss in this guide before moving on to discuss how it all comes together in the&nbsp;{}Room Editor{}, is the&nbsp;{}Sequences{}&nbsp;asset. A sequence is essentially a collection of other assets that are collected in one place and then animated together. The final animation (sequence) can then be added to rooms in your game much like instances.":"我们将在本指南中讨论的最后一个资源是{}序列{}资源，然后再继续讨论{}房间编辑器{}中的所有资源。序列本质上是在一个位置收集的其他资源的集合，然后一起设置动画。最终的动画(序列)随后可以添加到游戏中的房间，就像实例一样。",
    "The page linked below gives you all the details on how to use sequences in your games:":"下面链接的页面提供了如何在游戏中使用序列的所有详细信息：",
    "Time for the sequence is in frames (which is the same as steps for instances, ie: one frame is the same as one game step), and you can see what will happen at any given frame by moving the sequence&nbsp;{}{}playhead{}{}&nbsp;in the dope sheet. The playhead position is also used for adding in {}keyframes&nbsp;{}which are the frames where you want some state to change to begin or end. Parameter keys are stored on&nbsp;{}{}parameter tracks{}{}&nbsp;for the given asset.":"序列的时间以帧为单位(这与实例的步数相同，即：一帧等同于一个游戏步骤)，您可以通过在摄影表中移动序列{}{}播放头{}{}来查看在任何给定的帧上会发生什么。播放头位置还用于添加{}关键帧{}，这些关键帧是您希望将某些状态更改为开始或结束的帧。参数密钥存储在给定资源的{}{}参数轨道{}{}上。",
    "{}To create a basic sequence you add either a sound, a sprite or an instance into the sequence&nbsp;{}canvas{}&nbsp;and then position it to where you want it to be at the start of the sequence. This creates an&nbsp;{}{}asset track{}{}&nbsp;in the&nbsp;{}Track Panel{} {}{}&nbsp;and also adds&nbsp;{}{}a&nbsp;{}{}keyframe{}{}&nbsp;into the&nbsp;{}Dope Sheet{}&nbsp;to show the duration that the asset will be visible for.":"{}要创建基本序列，请将声音、子画面或实例添加到序列中{}画布{}然后将其定位到序列开始时希望的位置。这将创建一个{}{}资源跟踪{}{}在{}跟踪面板{}{}{}，还增加了{}{}{}{}关键帧{}{}进入{}关键帧表{}显示资源可见的持续时间。",
    "{}We won\u0027t go into more details about how sequences work here, but suffice to say that they are an incredibly powerful tool for doing anything from cut-scenes, to menus, to character states and much more.":"{}我们不会在这里更详细地讨论序列是如何工作的，但足以说它们是一个令人难以置信的强大工具，可以做任何事情，从切换场景，到菜单，到角色状态等等。"
}