{
    "All target platforms":"所有目标平台",
    "As an extra check you can also call the function {}{}shaders_are_supported(){}{}&nbsp;to see if the hardware even supports shaders. In general you\u0027d do these checks on game start and store the results as a {}global variable{} to then check later.":"作为额外检查，您还可以调用函数{}{}shaders_are_supported(){}{}来查看硬件是否甚至支持着色器。通常，您会在游戏开始时执行这些检查，并将结果存储为{}全局变量{}，然后进行检查。",
    "As you can see, they are used in a similar manner to blend modes and surfaces, where you first select (set) the shader, draw what you want using it, then reset the draw target again afterwards. If you wish to render the full screen through a shader, and not just a single sprite or background, you will need to set up a surface to catch the current view, and then pass that through to the shader (see {}Surfaces{}&nbsp;for more information).":"正如您所看到的，它们以类似的方式用于混合模式和曲面，其中您首先选择(设置)着色器，使用它绘制您想要的，然后之后再次重置绘制目标。如果您希望通过着色器而不是单个精灵或背景来渲染整个屏幕，则需要设置一个表面来捕捉当前视图，然后将其传递到着色器(有关详细信息，请参阅{}Surfaces{})。",
    "Finally, {}GameMaker{} permits you to define your own {}Vertex Formats{} from which you can create your own custom primitives. This can greatly speed up shader operations or can be used to extend their capabilities and create surprising effects. You can find information on this in the following sections:":"最后，{}GameMaker{}允许您定义自己的{}顶点格式{}，从中可以创建自己的自定义基元。这可以大大加快着色器操作，或用于扩展其功能并创建出人意料的效果。您可以在以下章节中找到这方面的信息：",
    "For a complete overview of the available GLSL ES functions and variables that you can use to program the shaders themselves, please refer to the {}OpenGL ES Shading Language (GLSL ES) Reference Pages{}. The following link is also useful as it contains some quick reference cards for the OpenGL ES API (note that only the last two cards shown are applicable to {}GameMaker{}): {}OpenGL ES Reference Cards{}.":"有关可用于对着色器本身编程的可用GLSL ES函数和变量的完整概述，请参阅{}OpenGL ES着色语言(GLSL ES)参考页{}。 以下链接也很有用，因为它包含一些用于OpenGL ES API的快速参考卡(请注意，仅显示的最后两张卡适用于{}GameMaker{})：{}OpenGL ES参考卡{}。",
    "Guide To Using Shaders":"着色器使用指南",
    "If the shader you are using has input values, these are set using the {}uniform{} functions. You would first get the uniform {}handle{} (which is essentially an ID value for the uniform to be set) using the function {}{}shader_get_uniform(){}{}&nbsp;in the {}Create Event{} of the instance using the shader, and then store these handles in variables, something like this:":"如果使用的着色器具有输入值，则使用{}统一{}函数设置这些值。首先使用着色器在实例的{}创建事件{}中使用函数{}{}shader_get_uniform(){}{}获取统一{}句柄{}(本质上是要设置制服的ID值)，然后将这些句柄存储在变量中，如下所示：",
    "If you are new to shaders or want a more complete guide to creating and use them using {}GameMaker{}, then please see the following page of the manual:":"如果您是着色器的新手，或者想要使用{}GameMaker{}创建和使用着色器的更完整指南，请参阅手册的以下页面：",
    "It is important to note that {}GameMaker{} also supports some conditional compile {}Macros{} which can be used within GLSL ES shaders so they can perform alternative code on specific supported platforms. The macros and the platforms they will be generated on are shown in the table below:":"需要注意的是，{}GameMaker{}还支持一些条件编译{}宏{}，这些宏可以在GLSL ES着色器中使用，因此它们可以在特定的支持平台上执行替代代码。下表显示了宏及其生成的平台：",
    "Mac and Ubuntu (Linux)":"Mac和Ubuntu(Linux)",
    "Once you have the uniform handles, they can then be set in the shader code for the {}Draw Event{} like this:":"有了统一的句柄后，可以在{}绘制事件{}的着色器代码中设置它们，如下所示：",
    "One final thing to note is that although shaders are accepted across all platforms, they are still device specific and if the hardware or software of the device cannot use shaders then you will get an error. Therefore you are recommended to check that the shader has been compiled before setting uniforms or using the shader itself, like this:":"最后要注意的一点是，尽管着色器在所有平台上都被接受，但它们仍然是特定于设备的，如果设备的硬件或软件不能使用着色器，则会出现错误。因此，建议您在设置统一或使用着色器本身之前检查着色器是否已编译，如下所示：",
    "Shaders are an incredibly powerful tool for manipulating what and how things are {}rendered{} to the screen by the graphics card. Since these tiny programs are actually run on the graphics card itself, this means that they are extremely fast to process, freeing up valuable CPU cycles for more game logic.":"着色器是一个非常强大的工具，用于操纵图形卡向屏幕呈现{}内容和方式{}。由于这些小程序实际上运行在显卡上，这意味着它们处理速度极快，为更多的游戏逻辑释放了宝贵的CPU周期。",
    "The following functions are available for drawing and setting shaders:":"以下函数可用于绘制与设置着色器：",
    "To create a shader you will need to have written both a {}Vertex Shader{} and a {}Fragment Shader{} (also know as a {}Pixel Shader{}) using the {}Shader Editor{}, and even if (for example) you only wish to change the vertex positions for an instance being drawn, or if you only want to change the colour values for the pixels, you will still need {}both{} programs for a complete shader to work.":"要创建着色器，需要使用{}着色器编辑器{}编写{}顶点着色器{}和{}碎片着色器{}(也称为{}像素着色器{})，并且即使(例如)仅希望更改正在绘制的实例的顶点位置，或者如果只想更改像素的颜色值，仍需要{}两个{}程序才能使完整着色器工作。",
    "Using a shader in your projects is very simple, and only requires a couple of lines of code to get the most basic of use from it:":"在项目中使用着色器非常简单，只需几行代码即可从中获得最基本的用途：",
    "We also have a special function which defines a global state for all shaders:":"我们还有一个特殊的函数，它定义了所有着色器的全局状态：",
    "When working with texture samplers in shaders you will need information about the texture being used, in which case you can use the following functions:":"在着色器中使用纹理采样器时，您将需要有关正在使用的纹理的信息，在这种情况下，您可以使用以下函数：",
    "When you compile your {}GameMaker{} project on any one of the listed platforms using a GLSL ES format shader, {}one{} of the above macros will be generated which can then be used checked in the shader code like this:":"当您使用GLSL ES格式着色器在任何一个列出的平台上编译{}GameMaker{}项目时，将生成{}上述宏之一{}，然后可以在着色器代码中使用这些宏，如下所示：",
    "While this manual will {}not{} cover any of the Open GL shader functions and variables, it does contain a list of the ones that are unique to {}GameMaker{}. These constants are not part of the Open GL specification for shaders and are supplied to simplify the integration of shaders within your projects.":"虽然本手册{}不{}涵盖任何 Open GL 着色器函数和变量，但它确实包含{}GameMaker{}独有的函数和变量列表。 这些常量不是用于着色器的Open GL规范的一部分，而是为了简化项目中着色器的集成。",
    "Windows, XboxOne":"Windows, XboxOne",
    "{}NOTE{}&nbsp;Shaders do {}not{} permit you to change the value of any variables that you pass into them, and so these will be called {}shader constants{} in all the documentation that refers to them.":"{}注意{}着色器不允许{}更改传入变量的任何变量的值，因此在引用这些变量的所有文档中，这些变量称为{}着色器常量{}。",
    "{}NOTE{}: Shaders, like anything related to drawing, can {}only be used in the draw event{}. It is also worth noting that if you are trying to use a colour value in a shader and the object has no texture, the results will turn out black.":"{}注意{}：着色器，像任何与绘制相关的东西一样，只能在绘制事件{}中使用。同样值得注意的是，如果尝试在着色器中使用颜色值，并且对象没有纹理，则结果将变为黑色。"
}