{
    "Finally, you can choose to have the orientation relative or not, which means that while the particle has a direction (and speed) the particle sprite will be orientated around that vector. Bear in mind that if you have the particle speed set to reduce and it reaches 0, the lack of speed sets the direction to the default value of 0° and so a relative orientation will cause the particle sprite to \"jump\" to a different angle.":"最后，可以选择相对于或不相对于方向，这意味着当粒子具有方向(和速度)时，粒子子画面将围绕该向量定向。请记住，如果将粒子速度设置为减小，并且粒子速度达到0，则缺少速度会将方向设置为默认值0 °，因此相对方向将导致粒子精灵\"跳转\"到不同的角度。",
    "The above code will set various particle values including the orientation which will be random value between 0º&nbsp;and 359º. It will also have a random amount added to it of anywhere between 0 and 20 each step too, and the orientation is relative to the direction of motion.":"上述代码将设置各种粒子值，包括0 º到359 º之间的随机值的方向。每个步骤还将具有0到20之间的任意随机数量，并且方向是相对于运动方向的。",
    "The amount the angle wiggles clockwise/counterclockwise per step.":"角度每步顺时针/逆时针摆动的量。",
    "The increase (or decrease if set negative) of the angle in degrees per step.":"每步角度的增加(如果设置为负值，则为减少)(以度为单位)。",
    "The index of the particle type to change.":"要更改的粒子类型的索引。",
    "The maximum starting angle of the particles.":"粒子的最大起始角度。",
    "The minimum starting angle of the particles.":"粒子的最小起始角度。",
    "This function is used to determine the orientation of the particle sprite when it is created and can also be used to make the particle orientation increase or decrease over its lifetime. The minimum and maximum orientation values default at 0 but these values can be changed to randomise the orientation following the standard {}GameMaker{} directions of 0 degrees being right, 90 degrees being up, 180 degrees being left and 270 degrees being down. If you set them to the same value the particles will all be created with the same orientation.":"此函数用于确定粒子子画面在创建时的方向，也可用于使粒子方向在其寿命期间增加或减少。最小方向值和最大方向值默认为0，但这些值可以更改为沿标准{}GameMaker{}方向随机设置方向，0度为右，90度为上，180度为左，270度为下。如果将它们设定为相同的值，则将使用相同的方向创建所有粒子。",
    "Whether to set its angle relative to the direction of the particle\u0027s motion (true) or not (false).":"是否设置其相对于粒子运动方向的角度(真)或不(假)。",
    "You can also set an increment value which will add (if a positive number) or subtract (if a negative number) an amount of degrees to the orientation over its lifetime. This value can be a minimum of (+/-) 0.01.":"您还可以设置一个增量值，该值将在其整个生命周期内向方向添加(如果为正数)或减去(如果为负数)度数。此值最小可为(+/-) 0.01。",
    "You can set the \"wiggle\" factor too, the same as other particle functions. This is a value that will be added or subtracted randomly to the orientation each step of the particles lifetime. Obviously larger values are more pronounced than smaller ones, and this value can even be a negative with the maximum range being between -20 and 20.":"也可以设置\"摆动\"因子，与其他粒子函数相同。该值将随机添加或减去到粒子生存期的每个步骤的方向。显然，较大的值比较小的值更明显，此值甚至可以是负值，最大范围在-20和20之间。"
}