{
    "The code above creates a new particle type and stores its index in an instance variable {}pt{}. It then configures&nbsp;the particle type&nbsp;using&nbsp;{}{}part_type_sprite{}{} to use a custom sprite asset&nbsp;{}spr_cards{} that won\u0027t play its animation and doesn\u0027t use a random sub-image. Finally, the sub-image to use is set to 2 in the call to&nbsp;{}{}part_type_subimage{}{}. As a result, all particles&nbsp;of this type will display sub-image 2&nbsp;of {}spr_cards{} for their entire lifetime.":"上面的代码创建了一个新的粒子类型，并将其索引存储在实例变量{}pt{}中。然后，它使用{}{}part_type_sprite{}{}配置粒子类型，以使用不播放其动画且不使用随机子图像的自定义sprite资源{}spr_cards{}。最后，要使用的子图像在调用{}{}part_type_subimage{}{}时被设置为2。因此，此类型的所有粒子将在其整个生命周期内显示{}spr_cards{}的子图像2。",
    "The code above creates a new particle type and stores the index in an instance variable {}pt{}. It&nbsp;then configures&nbsp;the particle type&nbsp;using&nbsp;{}{}part_type_sprite{}{} to use a custom sprite asset&nbsp;{}spr_cards{} that will play its animation. Since the {}random{} argument set to {}false{},&nbsp;a random sub-image isn\u0027t chosen for the sprite. Instead, the sub-image provided in the call to&nbsp;{}{}part_type_subimage{}{}&nbsp;is used instead. As a result, all particles of this particle type will use the sprite {}spr_cards{}, animated all starting the animation at sub-image (or frame) 2.":"上面的代码创建了一个新的粒子类型，并将索引存储在实例变量{}pt{}中。然后，它使用{}{}part_type_sprite{}{}配置粒子类型，以使用将播放其动画的自定义sprite资源{}spr_cards{}。由于{}random{}参数设置为{}false{}，因此不会为精灵选择随机子图像。相反，使用调用{}{}part_type_subimage{}{}中提供的子图像。因此，此粒子类型的所有粒子都将使用精灵{}spr_cards{}，所有动画都从子图像(或帧)2开始。",
    "The effect of this function depends on the arguments passed to&nbsp;{}{}part_type_sprite{}{}:&nbsp; {} {}This function will have no effect if the particle type\u0027s sprite is set to use a random sub-image.{} {}If the sprite isn\u0027t set to random: {} {}When animate is set to {}true{}, the sprite animation will loop, starting at the sub-image set by this function.{} {}When animate is set to {}false{}, the particle will use the sub-image as set by this function during its lifetime.{} {} {} {} ":"此函数的效果取决于传递给{}{}part_type_sprite{}{}的参数：{}{}如果粒子类型的精灵设置为使用随机子图像，则此函数将无效。{}{}如果精灵未设置为随机：{}{}当animate设置为{}true{}时，精灵动画将循环，从该函数设置的子图像开始。{}{}当animate设置为{}false{}时，粒子将在其生命周期内使用该函数设置的子图像。{}{}{}{}",
    "The index&nbsp;of the particle type":"粒子类型的索引",
    "The sub-image (frame) to use":"要使用的子图像(帧)",
    "This function sets the sub-image (or frame) to use for the given particle type, if it uses a custom sprite set using {}{}part_type_sprite{}{}.":"如果使用{}{}part_type_sprite{}{}设置的自定义精灵，则此函数设置用于给定粒子类型的子图像(或帧)。",
    "Usage Notes":"用法注释"
}