{
    "As you can see&nbsp;in the above visual, {}Between&nbsp;{}applies the curve preset to each pair of points, and inserts any new points that are needed. {}Overwrite{}&nbsp;removes any points between the starting and ending points and then\n      applies the preset.":"正如您可以在上面的视图中看到的，{} Between {}将曲线预设置应用于每对点，并插入所需的任何新点。{} Overwrite {}移除起始点和结束点之间的任何点，然后应用预设置。",
    "A{} C{}{}urve Preset{} changes the shape of your curve. {}&nbsp;Left-clicking on a preset in the Presets menu will apply that preset to your\n      selected channel, and clicking on {}Reset {}will revert the channel to how it was before the Animation Curve Library window was opened.":"{}{}{}曲线预设{}将改变你的曲线的形状。{}&nbsp;左键点击预设菜单中的预设，将把该预设应用到你所选择的通道，然后点击{}重置{}将使该通道恢复到打开动画曲线库窗口前的状态。",
    "The Animation Curve Library":"动画曲线库",
    "The following visual shows the {}Quart&nbsp;{}curve preset in all three easing modes:":"下图显示了在所有三种缓动模式下预设的{}Quart{}曲线:",
    "The following visual shows the&nbsp;{}&nbsp;{}Expo {}curve preset applied to a channel using the {}Between {}and {}Overwrite {}apply modes:":"下面的视觉效果显示了{}{}Expo {}曲线预设使用{}Between {}和{}Overwrite {}应用模式应用到一个通道。",
    "The {}Curve Type{} controls how a channel flows from point to point, which can be set to one of the following options:":"{}曲线类型{}控制通道如何从一个点流向另一个点，可以将其设置为下列选项之一:",
    "There are also three {}Easing Modes&nbsp;{}that you can choose from, which controls how a curve accelerates or decelerates. The default easing mode is {}Ease Out{}.":"还有三种缓解模式可供选择，它们控制曲线的加速或减速方式。默认的宽松模式是{} EaseOut {}。",
    "There are two {}Apply Modes{}&nbsp;that you can choose from, which affects how a preset is applied to your channel (or to your selection within that channel):":"有两种{}应用模式{}你可以选择，这影响到预设如何应用到你的通道（或该通道内的选择）。",
    "{}Between:{}&nbsp;This is the default when the window is opened by&nbsp;{} right-clicking anywhere in the Channel Editor. It applies the preset between each pair of selected points,\n        and adds any new points that are needed without removing any existing points.":"{}Between: {}当通过{}右键单击通道编辑器中的任何位置打开窗口时，这是默认值。它在每对选定的点之间应用预设置，并在不删除任何现有点的情况下添加所需的任何新点。",
    "{}Bezier{}: This will use Bezier curve mathematics to create a smooth progression between points on the channel, where you can control how the curve looks by manipulating \"handles\" on the points":"{}Bezier{} : 这将使用 Bezier 曲线数学来创建通道上各点之间的平滑级数，在这里您可以通过操纵各点上的“手柄”来控制曲线的外观",
    "{}By default, a preset is applied to the whole channel. You can select a section of your channel by&nbsp;dragging with the {}&nbsp;left mouse button in the {}Channel Editor{}, and then open the Animation Curve Library window through the {}&nbsp;button or by {}&nbsp;right-clicking, which will apply any presets to the selected section only.":"{}默认情况下，一个预设是应用于整个通道的。你可以在{}通道编辑器{}中用{}鼠标左键拖动选择通道的一个部分，然后通过{}&nbsp;按钮打开动画曲线库窗口，或者通过{}&nbsp;右键单击，这将只对所选部分应用任何预置。",
    "{}Curve Presets{}{}Curve Presets{}":"{}曲线预设{}{}曲线预设{}",
    "{}Curve Type{}{}Curve Type{}":"{}曲线类型{}{}曲线类型{}",
    "{}Ease In-Out:{}&nbsp;The curve starts with&nbsp;slower acceleration, accelerates over time and then decelerates":"{}Ease In-Out: {}曲线从较慢的加速度开始，随着时间的推移加速，然后减速",
    "{}Ease In:{}&nbsp;The curve starts with faster acceleration, and then decelerates":"{}Ease In: {}曲线以较快的加速度开始，然后减速",
    "{}Ease Out{}: The curve starts with&nbsp;slower acceleration, and then accelerates over time":"{}Ease Out{} : 曲线从较慢的加速度开始，然后随着时间的推移加速",
    "{}Linear{}:&nbsp;This wll create a linear progression between points on the channel":"{}线性{} : 这将在通道上的点之间创建一个线性级数",
    "{}Note that changing the Curve Type will apply that type to&nbsp;{}all{}&nbsp;channels in the Animation Curve.":"{}注意，更改曲线类型将对动画曲线中的{}所有{}通道应用该类型。",
    "{}Note that your curve channel (or selection within that channel) needs to have a slope for a preset to have any effect, as any applied\n      interpolation is based on the vertical difference between the starting and ending points. A flat curve has no such&nbsp;difference between the two points, so you will not see any results after applying a preset to such a curve.":"{}注意你的曲线通道(或通道内的选择)需要有一个斜率才能产生任何效果，因为任何应用的插值都是基于起点和终点之间的垂直差异。一条平坦的曲线在两点之间没有这样的差异，因此在对这样的曲线应用预设置之后，您将不会看到任何结果。",
    "{}Overwrite:{}&nbsp;This is the default&nbsp;when the window is opened through the&nbsp;{} button in the Animation Curve Editor or the Sequence Dope Sheet. It overwrites\n        any points between the beginning and ending points of your channel or selection.":"{}覆盖: {}当窗口通过动画曲线编辑器或序列涂料工作表中的{}按钮打开时，这是默认值。它覆盖通道或选定内容的开始点和结束点之间的任何点。",
    "{}Smooth{}: This will use {}catmull-rom interpolation{}&nbsp;to create a smooth progression between points on the channel":"{}平滑{} : 这将使用{} catmull-rom 插值{}来创建通道上各点之间的平滑级数",
    "{}The {}Animation Curve Library{} window allows you to change the Curve Type for the Animation Curve, and apply\n    a preset to the selected channel. It can be opened by&nbsp;{} left-clicking on the&nbsp;{}&nbsp;button in the {}Animation Curve Editor{} or {}Sequence Dope Sheet{}, or by&nbsp;{}&nbsp;right-clicking\n    anywhere in the Channel Editor.":"{}{}动画曲线库{}窗口允许你改变动画曲线的曲线类型，并将预设值应用到所选通道。\n    预设到选定的通道上。它可以通过在{}动画曲线编辑器{}或{}序列表{}{3}中左键点击{4}按钮来打开，或者通过{}右键点击通道编辑器中的任何地方。",
    "{}{}NOTE{}: Presets&nbsp;can only be applied if the Curve Type is set to {}Bezier{}.{}":"{}{}注意{} : 只有当曲线类型设置为{}Bezier{}时，才能应用预设。{}"
}