{
    "Flags the sound as looping or not.":"标记声音是否循环。",
    "Optional Properties":"可选属性",
    "Set the channel priority for the sound.":"设置声音的通道优先级。",
    "The above code checks the global variable \"SFX\" and if it returns {}true{} then the sound indexed in the variable \"snd_Waterfall\" will be looped at its room position using the given falloff settings and no change in gain. The sound immediately starts playing from second 2.":"上述代码检查全局变量\"SFX\"，如果它返回{}true{}，则变量\"snd_Waterfall\"中索引的声音将使用给定衰减设置在其房间位置循环，且增益没有变化。声音从第二秒立即开始播放。",
    "The above code checks the global variable \"SFX\" and if it returns {}true{} then the sound indexed in the variable \"snd_Waterfall\" will be looped at its room position, with a fall-off reference of 100, a falloff distance of 300, a falloff factor of 1 and a low priority.":"上面的代码检查全局变量\"SFX\"，如果它返回{}真{}，变量\"snd_Waterfall\"中索引的声音将在其房间位置循环，衰减参考为100，衰减距离为300，衰减因子为1，优先级较低。",
    "The falloff factor (default 1).":"衰减系数(默认值1)。",
    "The falloff reference relative to the listener (clamp).":"相对于监听器(钳位)的衰减参考。",
    "The index of the sound to play.":"播放声音的索引。",
    "The maximum falloff distance relative to the listener.":"相对于侦听器的最大衰减距离。",
    "The next two arguments are to set the sound is to loop or not and for assigning a priority to the sound. This priority is then used to determine how sounds are dealt with when the number of sounds playing is over the limit set by the function {}{}audio_channel_num(){}{}. Lower priority sounds will be stopped in favour of higher priority sounds, and the priority value can be any real number (the actual value is arbitrary, and can be from 0 to 1 or 0 to 100, as {}GameMaker{} will prioritise them the same). Note that when dealing with priority, the {}higher{} the number the {}higher{} the priority, such that a sound with priority 100 will be favoured over a sound with priority 1.":"接下来的两个参数是设置声音是否循环，并为声音分配优先级。当播放的声音数超过函数{}{}audio_channel_num(){}{}设置的限制时，此优先级用于确定如何处理声音。 优先级较低的声音将停止，以支持优先级较高的声音，并且优先级值可以是任何实数(实际值是任意的，可以是 0 到 1 或 0 到 100，因为{}GameMaker{}会以相同的优先级排列它们)。请注意，当处理优先级时，{}越高{}的数字{}优先级越高{}，这样优先级 100 的声音将优于优先级为 1 的声音。",
    "The x position.":"X 位置",
    "The y position.":"Y 位置",
    "The z position.":"Z 位置",
    "There are four optional arguments that allow you to change the properties of the sound being played:":"有四个可选参数允许您更改正在播放的声音的属性：",
    "These parameters are applied to the sound immediately. This fixes the issues you would face when calling a separate function to change any of these values, which could cause an undesired delay in the change.":"这些参数立即应用于声音。这可以修复您在调用单独的函数来更改这些值时遇到的问题，这些问题可能会导致更改出现不希望的延迟。",
    "This function will also return a unique index for the sound being played, which can be stored in a variable so you can later&nbsp;{}pause it{} or {}stop it{}. This means that if you have multiple instances of the same sound playing at any one time, you can target just one instance of that sound using the {}audio functions{}.":"此函数还将返回正在播放的声音的唯一索引，该索引可以存储在变量中，以便以后{}暂停{}或{}停止{}。 这意味着，如果在同一时间播放同一声音的多个实例，则可以使用{}音频函数{}只瞄准该声音的一个实例。",
    "With this function you can play any sound asset at a given position within the audio space.":"使用此函数，您可以在音频空间内的给定位置播放任何声音资源。",
    "You can also set a fall-off distance (0 will make the sound silent, default is 100) which will make the sound fade out as it gets further from the listener position. How the fade itself is heard will depend on the falloff reference (which is the distance under which the volume for the source would normally drop by half) and the roll off factor (which affects the sound past the falloff reference distance only). The default factor is normally 1, and the effect of the different falloff values will depend on the model chosen (for a complete guide to the different falloff models and how these values are used, please see the function {}{}audio_falloff_set_model(){}{}).":"您还可以设置衰减距离(0 将使声音静音，默认值为 100)，使声音在远离收听者位置时逐渐衰减。如何听到衰减本身将取决于衰减参考(即源音量通常下降一半的距离)和滚降因子(仅影响经过衰减参考距离的声音)。默认因子通常为1，不同衰减值的效果将取决于所选模型(有关不同衰减模型的完整指南以及这些值的使用，请参见函数{}{}audio_falloff_set_model(){}{})。",
    "You provide the sound index and then assign it a position within the 3D space. The default listener position is {}(0, 0, 0){} so this means that if the listener has not been moved and you want the sound to come from the left (for example), you should set the x position to a negative value (for more information on setting the listener position see {}{}audio_listener_position(){}{}).":"提供声音索引，然后在 3D 空间中为其指定一个位置。默认收听者位置是{}( 0， 0， 0){}，因此这意味着如果收听者没有被移动，并且希望声音从左边来(例如)，您应该将x位置设置为负值(有关设置收听者位置的详细信息，请参见{}{}audio_listener_position(){}{})。",
    "{}OPTIONAL{}&nbsp;The bitmask data to set for the sound. On the HTML5 target&nbsp; this will have no effect as the target does not support more than one listener.":"{}OPTIONAL{}为声音设置的位掩码数据。在HTML5目标上，由于目标不支持多个侦听器，这将没有效果。",
    "{}OPTIONAL{}&nbsp;The pitch multiplier (default 1).":"{}可选{}音高乘数(默认值1)。",
    "{}OPTIONAL{}&nbsp;The time (in seconds) to set the start point to. Values beyond the end of the sound are clamped to its length.":"{}可选{}设置起始点的时间(以秒为单位)。超出声音末端的值被限制到其长度。",
    "{}OPTIONAL{}&nbsp;The time (in seconds) to set the start point to. Values longer than the length of the given sound are ignored.":"{}OPTIONAL{}设置起点的时间(秒)。长于给定声音长度的值将被忽略。",
    "{}OPTIONAL{}&nbsp;Value for the gain.":"{}可选{}增益值。",
    "{}{}NOTE{}{}&nbsp;To change the value of any of these properties after playback of a sound has been started, see&nbsp;{}audio_sound_gain{}&nbsp;for gain,&nbsp;{}audio_sound_set_track_position{}&nbsp;for offset,&nbsp;{}audio_sound_pitch{}&nbsp;for pitch and&nbsp;{}audio_sound_set_listener_mask{}&nbsp;for listener mask.":"{}{}注释{}{}要在开始播放声音后更改这些属性中任意属性的值，请参见{}audio_sound_gain{}获取增益，{}audio_sound_set_track_position{}了解偏移，{}audio_sound_pitch{}表示音调，{}audio_sound_set_listener_mask{}表示收听者掩码。"
}