{
    "Path to the file (OGG only) to stream the audio from.":"流传输音频的文件路径(仅限 OGG)。",
    "The above code creates a new sound index in the variable \"snd\" from the given file, then plays this sound.":"上面的代码在变量\"snd\"中创建一个新的声音索引，然后播放这个声音。",
    "The above code creates a new sound index in the variable {}snd{}&nbsp;from the given file, then plays this sound.":"上述代码在给定文件的变量{}snd{}中创建一个新的声音索引，然后播放该声音。",
    "The function requires the filename (which can be an included file, for example) and will return the new sound index for use.":"该函数需要文件名(例如，该文件可以是包含的文件)，并将返回新的声音索引以供使用。",
    "The function requires the path to the file (which can be an included file, for example) and will return the new sound for use.":"该函数需要文件的路径(例如，可以是包含的文件)并将返回新的声音以供使用。",
    "With this function you can create a new sound index which can then be used in the regular audio functions to stream audio directly from an external OGG file source.":"使用此函数，您可以创建新的声音索引，然后可以在常规音频函数中使用，直接从外部 OGG 文件源传输音频。",
    "With this function you can create a new sound index which can then be used in the regular audio functions to stream audio directly from an external OGG file source. The function requires the filename (which can be an included file, for example) and will return the new sound index for use. Note that after you no longer need the sound you should call the function {}{}audio_destroy_stream(){}{} with the sound index to remove it from memory otherwise you may get a memory leak which will slow down and eventually crash your game.":"使用此函数，您可以创建新的声音索引，然后可以在常规音频函数中使用，直接从外部 OGG 文件源传输音频。该函数需要文件名(例如，该文件可以是包含的文件)，并将返回新的声音索引以供使用。请注意，在您不再需要声音后，应调用带有声音索引的函数{}{}audio_destroy_stream(){}{}将其从内存中移除，否则可能会出现内存泄漏，这会减慢并最终导致游戏崩溃。",
    "With this function you can create a new sound which can then be used in the regular audio functions to stream audio directly from an external OGG file source.":"使用此功能，您可以创建新的声音，然后可以在常规音频功能中使用该声音，以直接从外部 OGG 文件源流式传输音频。",
    "{}NOTE{}: This functionality is not available for the HTML5 target platform.":"{}注意{}： 此函数不适用于 HTML5 目标平台。",
    "{}{}NOTE{}{}&nbsp;After you no longer need the sound you should call the function&nbsp;{}{}audio_destroy_stream{}{} with the sound index to remove it from memory otherwise you may get a memory leak. This will slow down and eventually crash your game.":"{}{}注意{}{} 在您不再需要声音后，应调用带有声音索引的函数{}{}audio_destroy_stream(){}{}将其从内存中移除，否则可能会出现内存泄漏，这会减慢并最终导致游戏崩溃。",
    "{}{}NOTE{}{}&nbsp;This functionality is not available for the HTML5 target platform.":"{}{}注意{}{} 此函数不适用于 HTML5 目标平台。"
}