{
    "Audio Falloff Constant":"",
    "The \"{}_scaled{}\" models are scaled in such a way that sounds are guaranteed to fall off entirely by the maximum distance.":"\"{}_scaled{}\"模型的缩放方式确保声音以最大距离完全脱落。",
    "The above code sets the falloff model and then plays the sound indexed in the variable \"snd_Waterfall\", which will be looped at its room position, with a fall-off reference of 100, a falloff distance of 300, a falloff factor of 1 and a low priority.":"上述代码设置衰减模型，然后播放在变量\"snd_Waterfall\"中索引的声音，该声音将在其房间位置循环，衰减参考值为100，衰减距离为300，衰减因子为1，优先级较低。",
    "The default falloff model is {}audio_falloff_none{}, meaning there is no falloff when using emitters or positioned audio unless you change the falloff model.":"默认衰减模型为{}audio_falloff_none{}，这意味着使用发射器或定位音频时没有衰减，除非您更改衰减模型。",
    "The falloff models that are affected by these arguments are represented in&nbsp;{}GameMaker{}&nbsp;by the following constants (the table shows the exact calculations used too):":"受这些参数影响的衰减模型在{}GameMaker{}中由以下常量表示(该表也显示了使用的精确计算)：",
    "The following graphs are visual representations of how some of the above constants work and affect the sound being played:":"下图是上述一些常数如何工作和影响正在播放的声音的视觉表示：",
    "The {}constant{} used to set the falloff model.":"用于设置衰减模型的{}常量{}。",
    "To add more versatility to the audio engine, {}GameMaker{} permits you to select the falloff model that suits your game. This model will be used for {}all{} the audio functions in the game or app, and so you should make sure that the model you choose is the correct one, as each one will affect how the listener perceives the sounds you play through emitters or with the function {}{}audio_play_sound_at(){}{}.":"要为音频引擎添加更多函数，{}GameMaker{}允许您选择适合您的游戏的衰减模型。此模型将用于{}游戏或应用程序中的所有{}音频函数，因此，您应确保选择的模型是正确的，因为每个模型都会影响收听者通过发射器或使用函数{}{}audio_play_sound_at(){}{}来感知您播放的声音。",
    "When playing audio through {}{}audio_play_sound_at(){}{} or setting the {}falloff for an emitter{}, there are three arguments that you will need to set, and each one is appropriate to a specific&nbsp;model and will affect the way the final sound is heard&nbsp;by the player depending on the distance that the listener is from the source. The three arguments are:":"当通过{}{}audio_play_sound_at(){}{}播放音频或为发射器{}设置{}衰减时，需要设置三个参数，每个参数都适合特定模型，并且将影响播放器听到最终声音的方式，这取决于收听者与源之间的距离。三个论点是：",
    "{}Falloff factor{}: The falloff factor is used in distance attenuation based on the inverse distance model and sets the final minimum threshold for a sound with falloff.":"{}衰减系数{}：衰减系数用于距离衰减中，基于反距离模型，为具有衰减的声音设置最终最小阈值。",
    "{}Maximum distance{}: this sets the distance where there will no longer be any attenuation of the source sound. This can be the point at which the sound is no longer heard {}or{} the point at which the sound volume no longer decreases below the minimum threshold defined by the model chosen.{}{}":"{}最大距离{}：设置不再衰减源声音的距离。这可能是不再听到声音的点{}或{}音量不再降至所选模型定义的最小阈值以下的点。{}{}",
    "{}Reference distance{}: this is the distance from the listener under which the volume for the sound playing would normally drop by half before being influenced by roll-off factor or the specified maximum distance.{}{}":"{}参考距离{}：此距离是与收听者的距离，在此距离下，播放声音的音量在受到滚降系数或指定最大距离影响之前通常会下降一半。{}{}"
}