{
    "The above code checks a variable and if it returns {}true{} it will then assign the index of a sound to be played to the local variable \"snd\". This variable is then used to reduce the volume of that specific sound to 0 and fade up to full volume over 5 seconds.":"上面的代码检查一个变量，如果它返回{}true{}，它将把要播放的声音的索引赋给局部变量snd。然后，此变量用于将特定声音的音量减小到 0，并在 5 秒内衰减至全音量。",
    "The above code checks a variable {}val{}. If it returns {}true{} it will then assign the index of a sound to be played to the local variable {}snd{}. This variable is then used to reduce the volume of that specific sound to 0 and fade up to full volume over 5 seconds.":"上面的代码检查变量 {}val{}。如果它返回 {}true{}，则会将要播放的声音的索引分配给本地变量 {}snd{}。然后使用该变量将该特定声音的音量降低到 0，并在 5 秒内减弱到最大音量。",
    "The above code first sets the gain of the sound asset \"snd_fountain\" to 0.5. It then plays this sound using&nbsp;{}{}audio_play_sound{}{}&nbsp;and sets the gain of this new sound instance to 2 (using the optional \"gain\" parameter of the function)":"上面的代码首先将声音资源 \"snd_fintain\" 的增益设置为 0.5。然后，它使用 {}{}audio_play_sound{}{} 播放此声音，并将此新声音实例的增益设置为 2 (使用函数的可选 \"gain\" 参数)",
    "The above code first sets the gain of the sound asset \"snd_fountain\" to 0.5. It then plays this sound using&nbsp;{}{}audio_play_sound{}{}&nbsp;and sets the gain of this new sound instance to 2 (using the optional \"gain\" parameter of the function).":"上面的代码首先将声音资源 \"snd_fintain\" 的增益设置为 0.5。然后，它使用 {}{}audio_play_sound{}{} 播放此声音，并将此新声音实例的增益设置为 2 (使用函数的可选 \"gain\" 参数)",
    "The default asset-level gain is the value of the \"Volume\" slider in {}The Sound Editor{}:&nbsp;":"默认资源级增益是{}声音编辑器{}中\"音量\"滑块的值：",
    "The default value for the sound {}asset{} gain is taken from the \"Volume\" slider in the Sound Editor:&nbsp;":"声音{}资源{}增益的默认值取自声音编辑器中的\"音量\"滑块： ",
    "The index of the sound to set the gain for.":"设置增益的声音索引。",
    "The length for the change in gain in milliseconds.":"增益变化的长度，单位为毫秒。",
    "The time is measured in milliseconds, and the function requires that you input a final level of gain for the sound to have reached by the end of that time. This gain can be between 0 (silent) and any value greater than 0, although normally you\u0027d consider the maximum volume as 1. Anything over 1 can be used but, depending on the sound used and the platform being compiled to, you may get distortion or clipping when the sound is played back. Note that the gain scale is linear, and to instantly change the gain, simply set the time argument to 0.":"时间以毫秒为单位测量，函数要求您输入最终增益水平，以使声音在该时间结束时达到。此增益可以在 0(静默)和大于 0 的任何值之间，但通常将最大音量视为 1。可以使用超过1的任何内容，但根据使用的声音和正在编译的平台，播放声音时可能会失真或削波。注意，增益范围是线性的，若要立即改变增益，只需将时间参数设置为0即可。",
    "This function will affect {}all{} instances of the sound that are playing currently in the room if the index is a sound asset, and the final volume will be the volume at which all further instances of the sound will be played. However, if you have used the index returned from a function like&nbsp;{}{}audio_play_sound{}{} it will only affect that one instance of the sound.":"如果索引是声音资源，则此函数将影响当前在房间中播放的{}所有{}声音实例，并且最终音量将是播放该声音的所有其他实例时的音量。但是，如果您使用了从{}{}audio_play_sound{}{}等函数返回的索引，它只会影响该声音的一个实例。",
    "This function will affect {}all{} instances of the sound that are playing currently in the room if the index is a sound resource, and the final volume will be the volume at which all further instances of the sound will be played. However if you have used the index returned from a function like {}{}audio_play_sound(){}{} it will only affect that one instance of the sound.":"如果索引是声音资源，则此函数将影响当前在房间中播放的声音的{}所有{}实例，并且最终音量将是播放该声音的所有其他实例的音量。但是，如果您使用了从函数(如{}{}audio_play_sound(){}{}返回的索引，则只会影响声音的一个实例。",
    "This function will affect {}all{} instances of the sound that are playing currently in the room if the index is a sound resource, and the final volume will be the volume at which all further instances of the sound will be played. However if you have used the index returned from a function like&nbsp;{}{}audio_play_sound{}{} it will only affect that one instance of the sound.":"如果索引是声音资源，则此函数将影响当前在房间中播放的声音的 {} 所有 {} 个实例，并且最终音量将是播放该声音的所有其他实例的音量。但是，如果您使用了从函数 (如 {}{}audio_play_sound(){}{} 返回的索引，则只会影响声音的一个实例。",
    "Value for the music volume.":"音乐音量的值。",
    "With this function you can fade a sound asset or instance in or out over a given length of time, or it can be used to set the sound gain instantly.":"使用此函数，您可以在给定的时间长度内淡入或淡出声音资源或实例，也可以用于立即设置声音增益。",
    "With this function you can fade a sound in or out over a given length of time, or it can be used to set the sound gain instantly.":"使用此函数，您可以在给定时间长度内将声音淡入或淡出，或用于立即设置声音增益。",
    "{}{}NOTE{}{}&nbsp;Use&nbsp;{}{}db_to_lin{}{}&nbsp;and&nbsp;{}{}lin_to_db{}{}&nbsp;to convert back and forth between linear gains and gains expressed in decibels (dB).":"{}{}注意{}{}使用{}{}db_to_lin{}{}和{}{}lin_to_db{}{}在线性增益和以分贝(dB) 表示的增益之间来回转换。"
}