{
    "The above code gets the length (in seconds) of the sound indexed in the variable \"snd_Beam\", then plays the sound and sets an alarm to go off when the sound has finished playing using the length of the sound to calculate the time needed for the alarm.":"上述代码获取变量\"snd_Beam\"中索引的声音长度(以秒为单位)，然后播放声音，并使用声音长度计算报警所需时间，在声音播放完成后将发出报警。",
    "The above code gets the length (in seconds) of the sound indexed in the variable {}snd_Beam{}, then plays the sound and sets an alarm to go off when the sound has finished playing using the length of the sound to calculate the time needed for the alarm.":"上述代码获取变量{}snd_Beam{}中索引的声音长度(以秒为单位)，然后播放声音并设置闹钟，以便在声音播放完毕时使用声音长度计算时间来响起需要报警。",
    "The index of the sound to check.":"检查声音的索引。",
    "The sound can either be a referenced from index for an individual sound instance being played which has been stored in a variable when using any of the {}audio_play_sound_{} functions, or an actual sound asset from {}The Asset Browser{}.":"声音可以是使用任何 {}audio_play_sound_{} 函数时存储在变量中的正在播放的单个声音实例的引用起始索引，也可以是来自资源浏览器的实际声音资源。",
    "This function returns the length of the given sound in seconds.":"此函数返回给定声音的长度(以秒为单位)。",
    "This function will return the length of the given sound in seconds. The sound can either be a referenced from index for an individual sound being played which has been stored in a variable when using the {}{}audio_play_sound(){}{} or {}{}audio_play_sound_at(){}{} functions, or an actual sound asset from the Asset Browser.":"此函数将以秒为单位返回给定声音的长度。当使用{}{}audio_play_sound(){}{}或{}{}audio_play_sound_at(){}{}函数时，声音可以是正在播放的单个声音的索引引用，也可以是资源浏览器中的实际声音资源。",
    "{}{}NOTE{}{}&nbsp;For {}audio streams{} created at runtime on HTML5 and {}GX.games{}, this function may return {}-1{} if called before the runtime is able to retrieve the length of the audio stream.":"{}{} 注意{}{} 对于在 HTML5 和 {}GX.games{} 上运行时创建的 {} 音频流 {}，如果在运行时能够检索音频流之前调用此函数，则可能会返回 {}-1{} 音频流的长度。",
    "{}{}NOTE{}{}&nbsp;The alarm will trigger at around the same time the sound stops playing. You can also use the&nbsp;{}Audio Playback Ended{}&nbsp;event if you need to execute some code at the exact time that playback of the audio ends.":"{}{}注意{}{}闹钟将在声音停止播放的同时触发。如果您需要在音频播放结束的确切时间执行某些代码，您还可以使用{}音频播放结束{}事件。"
}