{
    "It is based on a linear scale from 0 (silent) to any value greater than 0, although normally you\u0027d consider the maximum volume as 1. Anything over 1 can be used but, depending on the sound used and the platform being compiled to, you may get distortion or clipping when the sound is played back. This function will affect the relative volume of all sounds and music played from within your game.":"它基于从0(无声)到大于0的任何值的线性标度，尽管通常将最大音量视为1。可以使用超过1的任何内容，但根据使用的声音和正在编译的平台，播放声音时可能会失真或削波。此函数将影响游戏中播放的所有声音和音乐的相对音量。",
    "The above code checks for key-presses of the up and down arrow keys, which then increase or decrease the variable \"vol\". This variable is then used to set the global gain of all sound and music in the game.":"上述代码检查向上和向下箭头键的按键，然后增加或减少变量\"vol\"。然后，此变量用于设置游戏中所有声音和音乐的全局增益。",
    "Value for the global volume (0 to 1)":"全局卷的值 (0 到 1)",
    "Value for the global volume (0 to 1).":"全局卷的值(0 到 1)。",
    "With this function you can set the absolute value for the global volume of all sounds and music.":"使用此函数，您可以设置所有声音和音乐的全局音量的绝对值。",
    "With this function you can set the absolute value for the global volume of all sounds and music. It is based on a linear scale from 0 (silent) to any value greater than 0, although normally you\u0027d consider the maximum volume as 1. Anything over 1 can be used but, depending on the sound used and the platform being compiled to, you may get distortion or clipping when the sound is played back. This function will affect the relative volume of all sounds and music played from within your game.":"使用此函数，您可以设置所有声音和音乐的全局音量的绝对值。它基于从0(无声)到大于0的任何值的线性标度，尽管通常将最大音量视为1。可以使用超过1的任何内容，但根据使用的声音和正在编译的平台，播放声音时可能会失真或削波。此函数将影响游戏中播放的所有声音和音乐的相对音量。",
    "{}{}NOTE{}{}&nbsp;A{}udio devices and/or operating systems can sometimes attempt to change the audio\u0027s amplitude&nbsp;{}in order to protect the user from what would otherwise be very loud sounds{}, for example by&nbsp;{}normalising&nbsp;{}the audio stream or by clipping the amplitude to 1.&nbsp;How this is handled is specific to the audio device or OS that\u0027s handling your game\u0027s audio. As a result, increasing gains might have an inconsistent effect.{}":"{}{} 注意{}{} 音频设备和 / 或操作系统有时会尝试更改音频的幅度 {} 以保护用户免受非常大的声音的影响 {}，例如，{ } 标准化 {} 音频流或将幅度削波为 1。处理方式取决于处理游戏音频的音频设备或操作系统。因此，增加增益可能会产生不一致的效果。{}",
    "{}{}NOTE{}{}&nbsp;This function sets the master gain of the {}default{} listener. Use&nbsp;{}{}audio_set_master_gain{}{}&nbsp;to set the master gain for a specific listener.":"{}{}注意{}{} 此函数设置{}默认{}监听器的主增益。使用 {}{}audio_set_master_gain{}{} 到设置特定监听器的主增益。",
    "{}{}NOTE{}{}&nbsp;Use&nbsp;{}{}db_to_lin{}{}&nbsp;and&nbsp;{}{}lin_to_db{}{}&nbsp;to convert back and forth between linear gains and gains expressed in decibels (dB).":"{}{}注意{}{} 使用 {}{}db_to_lin{}{} 和 {}{}lin_to_db{}{} 在线性增益和以分贝 (dB) 表示的增益之间来回转换。"
}