{
    "Set the channel priority for the sound.":"设置声音的通道优先级。",
    "Sets the sound to loop or not.":"是否将声音设置为循环。",
    "The above code checks if the instance is past the right bound of the room and plays a sound with a gain of 1.1 and a pitch of 2 (twice the normal pitch).":"上面的代码检查实例是否超过了房间的右边界，并播放增益为1.1和音调为2(正常音调的两倍)的声音。",
    "The above code checks the \"health\" global variable and if it is less than or equal to 0, it will remove 1 from the \"lives\" global variable and play a sound.":"上述代码检查\"健康\"全局变量，如果它小于或等于0，它将从\"生活\"全局变量中移除1并播放声音。",
    "The index of the sound to play.":"播放声音的索引。",
    "The third argument is for making the sound loop and setting it to {}true{} will make the sound repeat until it\u0027s stopped manually, and setting it to {}false{} will play the sound once only.":"第三个参数是创建声音循环并将其设置为{}true{}将使声音重复，直到手动停止，而将其设置为{}false{}将只播放一次声音。",
    "There are four optional arguments that allow you to change the properties of the sound being played:":"有四个可选参数允许您更改正在播放的声音的属性：",
    "These parameters are applied to the sound immediately. This fixes the issues you would face when calling a separate function to change any of these values, which could cause an undesired delay in the change.":"这些参数立即应用于声音。这可以修复您在调用单独的函数来更改这些值时遇到的问题，这些问题可能会导致更改出现不希望的延迟。",
    "This function will also return a unique index for the sound being played, which can be stored in a variable so you can later&nbsp;{}pause it{} or {}stop it{}. This means that if you have multiple instances of the same sound playing at any one time, you can target just one instance of that sound using the {}audio functions{}.":"此函数还将返回正在播放的声音的唯一索引，该索引可以存储在变量中，以便以后{}暂停{}或{}停止{}。 这意味着，如果在同一时间播放同一声音的多个实例，则可以使用{}音频函数{}只瞄准该声音的一个实例。",
    "You provide the sound asset and assign it a priority, which is then used to determine how sounds are dealt with when the number of sounds playing is over the limit set by the function {}{}audio_channel_num(){}{}. Lower priority sounds will be stopped in favour of higher priority sounds, and the priority value can be any real number (the actual value is arbitrary, and can be from 0 to 1 or 0 to 100, as {}GameMaker{} will prioritize them the same). The {}higher{} the number the {}higher{} the priority, so a sound with priority 100 will be favoured over a sound with priority 1.":"您可以提供声音资源并为其分配一个优先级，然后该优先级用于确定当播放的声音数超过函数{}{}audio_channel_num(){}{}设置的限制时如何处理声音。 优先级较低的声音将停止，以支持优先级较高的声音，并且优先级值可以是任何实数(实际值是任意的，可以是 0 到 1 或 0 到 100，因为{}GameMaker{}会以相同的优先级排列它们)。{}数字越高{}优先级越高{}，那么优先级为100的声音将优于优先级为1的声音。",
    "{}OPTIONAL{}&nbsp;The bitmask data to set for the sound. On the HTML5 target&nbsp; this will have no effect as the target does not support more than one listener.":"{}OPTIONAL{}为声音设置的位掩码数据。在HTML5目标上，由于目标不支持多个侦听器，这将没有效果。",
    "{}OPTIONAL{}&nbsp;The pitch multiplier (default 1).":"{}可选{}音高乘数(默认值1)。",
    "{}OPTIONAL{}&nbsp;The time (in seconds) to set the start point to. Values longer than the length of the given sound are ignored.":"{}OPTIONAL{}设置起点的时间(秒)。长于给定声音长度的值将被忽略。",
    "{}OPTIONAL{}&nbsp;Value for the gain.":"{}可选{}增益值。",
    "{}{}NOTE{}{}&nbsp;To change the value of any of these properties after playback of a sound has been started, see&nbsp;{}audio_sound_gain{}&nbsp;for gain,&nbsp;{}audio_sound_set_track_position{}&nbsp;for offset,&nbsp;{}audio_sound_pitch{}&nbsp;for pitch and&nbsp;{}audio_sound_set_listener_mask{}&nbsp;for listener mask.":"{}{}注释{}{}要在开始播放声音后更改这些属性中任意属性的值，请参见{}audio_sound_gain{}获取增益，{}audio_sound_set_track_position{}了解偏移，{}audio_sound_pitch{}表示音调，{}audio_sound_set_listener_mask{}表示收听者掩码。"
}