{
    "If the number exceeds this value, those sounds with a lower {}priority{} are stopped to free up a channel for the sounds with a higher {}priority{}.":"如果该数字超过此值，则会停止{}优先级{}较低的声音，以便为{}优先级{}较高的声音释放通道。",
    "Number of available audio channels (default is 128).":"可用音频通道数(默认为128个)。",
    "Number of available audio channels (default is {}128{})":"可用音频声道数量 (默认为 {}128{})",
    "The above code checks the platform that the game is running on and changes the number of available sound channels to increase performance.":"上面的代码检查游戏运行的平台，并改变可用声音通道的数量以提高性能。",
    "This basically means the number of sounds (or&nbsp;{}sound instances{} or {}voices{}) that can be played {}simultaneously{}. Or, put differently, the number of calls to any of the {}audio_play_sound_{} functions that you can make before sounds may be lost.":"这基本上是指可以{4}同时{5}播放的声音(或{}声音实例{}或{}声音{})的数量。或者，换句话说，在声音可能丢失之前，您可以调用任何 {}audio_play_sound_{} 函数的次数。",
    "With this function you can set how many audio channels are available for playing audio in {}GameMaker{}.":"使用此函数，您可以设置在{}GameMaker{}中播放音频的音频通道数。 ",
    "With this function you can set how many audio channels are available for playing audio in {}GameMaker{}. What this basically means is that you give the number of simultaneous sounds that can be played at any one time, and if the number exceeds the amount, those sounds with a lower {}priority{} are stopped to free up a channel for the sounds with a higher {}priority{}. You can use this function to optimise your game for devices as the lower the number of channels for audio the better the performance, but bear in mind that this may also cause noticeable cut off of certain sounds if many are played at once.":"使用此函数，您可以设置在{}GameMaker{}中播放音频的音频通道数。 这基本上意味着，您可以给出可在任何时间播放的同时播放声音的数量，如果该数量超过该数量，则那些具有较低{}优先级{}的声音将被停止，以便为优先级较高的声音释放一个频道{}。 您可以使用此函数来优化设备游戏，因为音频通道数越少，性能越好，但请记住，如果同时播放许多声音，这也可能导致某些声音明显中断。",
    "{}{}TIP{}{}&nbsp;You can use this function to optimise your game for devices as the lower the number of channels for audio the better the performance, but bear in mind that this may also cause noticeable cutoff of certain sounds if many are played at once.":"{}{}提示{}{} 您可以使用此函数来优化设备游戏，因为音频通道数越少，性能越好，但请记住，如果同时播放许多声音，这也可能导致某些声音明显中断。"
}