{
    "Audio":"音频",
    "Further advanced functionality, like effects, listeners, recording, or synchronising multiple audio tracks over time can all be found from the sub-sections listed below:":"更多高级函数，如效果、侦听器、录制或随时间同步多个音轨，都可以从以下小节中找到：",
    "The Asynchronous System Event":"异步系统事件",
    "The following functions are designed to give more control over how the audio engine works, and how the sounds played through it will be \"heard\" by the listener. As such it is recommended that you have a good working knowledge of how the rest of the&nbsp;{}GameMaker{}&nbsp;audio engine works before using any of the following functions:":"以下函数旨在更好地控制音频引擎的工作方式，以及收听者如何\"听到\"通过它播放的声音。因此，建议您在使用以下任何函数之前，了解{}GameMaker{}音频引擎的其余部分是如何工作的：",
    "The following functions are for dealing with audio in the most straightforward and simple way possible, avoiding the use of emitters and permitting the user to generate sounds and play music easily as these sounds are always generated at the {}listener position{} (see the section linked below for more details on the {}listener{}) and so are generally not affected by any changes to the {}listener{}:":"下列函数用于以最直接、最简单的方式处理音频，避免使用发射器，并允许用户轻松生成声音和播放音乐，因为这些声音总是在{}收听者位置产生{}(有关{}收听者{}的更多详细信息，请参见以下链接部分)，因此通常不受{}收听者{}的任何更改影响：",
    "To help with this issue, {}GameMaker{} has two separate ways to detect the change in Web Audio context status, either using the following function:":"为了帮助解决这个问题，{}GameMaker{}有两种不同的方法来检测Web音频上下文状态的变化，使用以下函数：",
    "Web Audio":"Web 音频",
    "When creating games for the HTML5 target platform, the audio engine requires {}Web Audio{} support, and this in turn means that sometimes your audio won\u0027t play when or how you expect it. This is because the Web Audio context may not be running or may stop running when your game is being played. What causes this varies greatly between browsers, and even between different versions of the same browser, and so detecting when the web audio context status changes is very important, e.g.: to detect when the context changes and pause/start looping audio like background music.":"在为 HTML5 目标平台创建游戏时，音频引擎需要{}Web 音频{}支持，这反过来意味着有时您的音频不会在您期望的时间或方式播放。这是因为在玩游戏时，Web 音频上下文可能未运行或停止运行。导致这种情况的原因在浏览器之间，甚至在同一浏览器的不同版本之间差异很大，因此检测网络音频上下文状态何时改变是非常重要的，例如：检测上下文何时改变，并暂停/开始循环音频，如背景音乐。",
    "You may also use the {}Asynchronous System Event{}, which will be triggered whenever the Web Audio status changes. In this event you will get the built in {}{}async_load{}{}{}&nbsp;DS map{} populated with the key \"{}event_type{}\" which in turn will hold the string \"{}audio_system_status{}\" if it is an audio event. When this key exists, there will also be a further \"{}status{}\" key which will be either \"{}available{}\" or \"{}unavailable{}\". Note that this event will be triggered on {}all{} platforms, but on everything except HTML5 it will only be triggered once on Game Start when the audio engine is first initialised. For more information please see the section:":"您也可以使用{}异步系统事件{}，只要 Web 音频状态更改，就会触发该事件。在此事件中，您将获得内置的{}{}async_load{}{}{}DS map{}，其中填充了键\"{}event_type{}\"，如果是音频事件，则该映射将保存字符串\"{}audio_system_status{}\"。当此键值存在时，还会有另一个\"{}status{}\"键值，该键值为\"{}available{}\"或\"{}unavailable{}\"。 请注意，此事件将在{}所有{}平台上触发，但在除HTML5以外的所有平台上，当音频引擎首次初始化时，该事件仅在GameStart上触发一次。有关更多信息，请参见以下部分：",
    "{}GameMaker{} has a complete audio engine that is based on the {}*.ogg{}, {}*.mp3{} and {}*.wav{} sound formats. Sounds of these types added to the IDE can then be used in your game using the basic audio functions shown below. For things more complex than basic sound effects or playing a single piece of music you can refer to the advanced audio functions which let you modify how a sound is played. There are also a selection of more specialised functions dedicated to streaming audio, positioning audio - to give 3D sound - and grouping audio.":"{}GameMaker{}拥有基于{}*.ogg{} 的完整音频引擎，{}*. mp3{}和{}*. wav{}声音格式。这些类型的声音添加到IDE中，然后可以使用下面显示的基本音频函数在游戏中使用。对于比基本音效或播放单曲更复杂的内容，您可以参考高级音频函数，通过这些函数可以修改声音的播放方式。还有一些更专业的函数，专门用于流式音频、定位音频以提供3D声音和分组音频。",
    "{}IMPORTANT!{} When using audio on the HTML5 target, you should be aware that not all browsers support Web Audio and so may not play any sound for your project when run. You can get a general idea of Web Audio support from the following link: {}Can I Use Web Audio?{}.":"{}重要提示！{}在 HTML5 目标上使用音频时，您应该知道并非所有浏览器都支持 Web 音频，因此在运行时可能不会为项目播放任何声音。您可以通过以下链接了解 Web 音频支持的一般情况：{}我能使用网络音频吗?{}。"
}