{
    "* {}{}NOTE{}{}&nbsp;The {}mb_side1{} and {}mb_side2 {}buttons are only for use on Windows, macOS, Ubuntu and HTML5.":"*{}{}注意{}{}{}mb_side1{}和{}mb_side2{}按钮仅用于Windows，macOS，Ubuntu和html5。",
    "Any of the mouse buttons":"任何鼠标按钮",
    "Mouse Button Constant":"鼠标按钮常数",
    "Mouse side button 1":"鼠标侧按钮1",
    "Mouse side button 2":"鼠标侧按钮2",
    "No mouse button":"没有鼠标按钮",
    "The above code will check to see if the left mouse button has been pressed and if it has it will add 50 to the score.":"上面的代码将检查鼠标左键是否被按下，如果有，它将在分数上加50。",
    "The left mouse button":"鼠标左键",
    "The middle mouse button (this may not be valid for all target platforms)":"鼠标中键 (这可能不适用于所有目标平台)",
    "The right mouse button":"鼠标右键",
    "This function will only return {}true{}&nbsp;{}once{} for any mouse button when it is first pressed and in order for it to return {}true{} again the button will need to have been released and pressed again. Note that it will be considered pressed for the duration of the step, and for all instances that have any mouse events or that use this same function.":"此函数只会在第一次按下任何鼠标按钮时返回 {}true{} {}一次{}，要使其再次返回 {}true{}，则需要释放并再次按下按钮。请注意，在该步骤的持续时间内，以及具有任何鼠标事件或使用此相同函数的所有实例，都将认为按下了该按钮。",
    "This function will return {}true{} if the mouse button being checked has been pressed or {}false{} if it has not.":"如果正在检查的鼠标按钮已按下，此函数将返回{}true{}，如果未按下，则返回{}false{}。",
    "This function will return {}true{} if the mouse button being checked has been pressed or {}false{} if it has not. This function will only be triggered {}once{} for any mouse button when it is first pressed and to trigger it again the button will need to have been released and pressed again. Note that it will be considered triggered for the duration of the step, and for all instances that have any mouse events or that use this same function.":"如果正在检查的鼠标按钮已按下，此函数将返回{}true{}，如果未按下，则返回{}false{}。首次按下任何鼠标按钮时，此函数仅会触发{}一次{}，并且要再次触发该函数，该按钮需要已释放并再次按下。请注意，它将被视为在步骤的持续时间内触发，并且对于具有任何鼠标事件或使用此相同函数的所有实例。",
    "Which mouse button constant to check for.":"要检查哪个鼠标按钮常数。",
    "You supply the mouse button to check from one of the following constants:":"您提供鼠标按钮以从以下常量之一进行检查:"
}