{
    "\"{}float{}\": a float value associated with the event (as defined in the animation program, default is 0.0)":"\"{}float{}\"：与事件关联的浮点值 (动画程序中定义，默认为 0.0)",
    "\"{}integer{}\": an integer value associated with the event (as defined in the animation program, default is 0)":"\"{}integer{}\"：与事件关联的整数值(动画程序中定义，默认为0)",
    "\"{}name{}\": the name of the event (as defined in the animation program)":"\"{}name{}\"：事件的名称(在动画程序中定义)",
    "\"{}string{}\": a string value associated with the event (as defined in the animation program, default is an empty string \"\")":"\"{}string{}\"：与事件关联的字符串值 (如动画程序中定义，默认为空字符串 \"\")",
    "\"{}track{}\": the index of the track the animation is playing on (default is 0)":"\"{}track{}\"：动画正在播放的轨道的索引(默认为0)",
    "Camera views are normally defined in the room editor and used to show only a small area of a large room at any one time. This event category has two seperate sub-categories ({}Outside View{} and {}Intersect Boundary{}), with eight different events in each corresponding to the eight available view ports. These two categories function exactly the same as the respective room events, only taking the boundary of the camera view as the thing for the instance to check against rather than the room.":"相机视图通常在房间编辑器中定义，用于在任何时候只显示大房间的一小块区域。此事件类别有两个独立的子类别 ({} 外部视图 {} 和 {} 交叉边界 {})，其中八个不同的事件中的每一个对应于八个可用的视图端口。这两个类别的功能与各自的房间事件完全相同，仅将摄像机视图的边界作为实例检查的对象而不是房间。",
    "In {}GameMaker{} sprites are not static things as they can have sub-images and be animated at different speeds. Each frame of an animation (called a sub-image) has its own number, starting at 0, which can be checked in code or through actions, but sometimes all you really need to know is when the animation has ended. That\u0027s when this event is triggered, right at the end of the animation when the sub image index shows that the last frame has been reached. This event is really useful for many things, for example an explosion object where you can set the instance to destroy itself when the last frame of the animation is reached.":"在 {}GameMaker{} 中，精灵不是静态的东西，因为它们可以有子图像，并以不同的速度进行动画制作。动画的每一帧 (称为子图像) 都有自己的编号，从 0 开始，可以在代码中或通过操作进行检查，但是有时候你真正需要知道的是动画什么时候结束。此时触发此事件，就在动画结束时，当子图像索引显示已到达最后一帧时。这个活动真的很有用对于许多事情，例如爆炸对象，您可以将实例设置为在到达动画的最后一帧时销毁自己。",
    "Similar to the above mentioned Game Start event, this event is only triggered once in the whole game and that is just before the game window actually closes. Again, for an instance with this event to actually do anything it has to be in the room as the game is closed. Please note that this event in really only viable for {}Windows{}, {}Ubuntu {}(Linux) and {}macOS{} games as mobile devices may just close the game without giving {}GameMaker{} the chance to call this event. For browser games made with the HTML5 module, this event should work when the game tab or browser is closed, but not all browsers support this feature (Firefox, Chrome and Safari do at the time of writing) so care must be taken when using it. Typically you would use this event to save data.":"与上面提到的游戏开始事件类似，这个事件在整个游戏中只触发一次，也就是在游戏窗口实际关闭之前。同样，对于一个有这个事件的例子，要实际做任何事情，它必须在房间里游戏已关闭。请注意，此事件实际上仅适用于{}Windows{}、{}Ubuntu{}(Linux)和{}macOS{}游戏，因为移动设备可能会关闭游戏，而不会给{}GameMaker{}有机会称之为这个事件。对于使用HTML5模块制作的浏览器游戏，当游戏选项卡或浏览器关闭时，此事件应该有效，但并非所有浏览器都支持此功能(Firefox、Chrome和Safari在撰写本文时支持此功能)，因此必须小心使用时服用。通常，您会使用此事件来保存数据。",
    "The Other&nbsp;Events":"其他事件",
    "These are special events that are not triggered by {}GameMaker{} automatically, but have to be {}implicitly {}called by you using code or actions while the game is running. There are 12 user events in total and they can contain code or actions and they can be called at any time in the game loop, making them very useful for creating your own events that happen when {}you {}decide.":"这些特殊事件不是由 {}GameMaker{} 自动触发的，而是必须由您在游戏运行时使用代码或操作 {} 隐式 {} 调用的。总共有 12 个用户事件，它们可以包含代码或操作它们可以在游戏循环中随时调用，这使得它们对于创建你自己的事件非常有用，这些事件发生在 {} 你 {} 决定的时候。",
    "This event happens for all instances initially in a room when the room starts. Please note that it happens {}after {}the creation event and so can depend on variables and things defined previously in that event.":"当房间开始时，最初在房间中的所有实例都会发生此事件。请注意，它发生在创建事件 {} 之后 {}，因此可能取决于之前在该事件中定义的变量和事物。",
    "This event happens to all instances that are in the room when the room ends. This event is very useful for \"cleaning up\" after a level has ended, for example you can delete loaded resources here, or remove a particle system to prevent memory leaks etc...":"当房间结束时，房间中的所有实例都会发生此事件。此事件对于关卡结束后的 \" 清理 \" 非常有用，例如您可以在此处删除加载的资源，或者删除粒子系统以防止内存泄漏等…",
    "This event is designed only for use with the {}Skeletal Animation Functions{}. It is a special event that is triggered every step in an instance that uses a skeletal animation sprite, and is designed to \"intercept\" the bone data after the orientation of the bones has been calculated for the current animation state but before this data is committed to use for drawing. This allows you to make modifications to the bone data using the appropriate functions.":"此事件仅设计用于 {} 骨骼动画功能 {}。这是一个特殊事件，在使用骨骼动画精灵的实例，旨在 \" 拦截 \" 骨骼数据，在计算出当前动画状态的骨骼方向后，但在此数据用于绘图之前。这允许您使用适当的函数对骨骼数据进行修改。",
    "This event is triggered when an instance \"touches\" the inside edge of the room, and, like the outside room event, is based on a check done against the assigned sprite of the instance, so that even if you have set the image x or y scale to a value other than one, this event still be triggered the moment a part of the sprite intersects the room boundary. If the instance has {}no {}sprite, then the position of the instance is used and the moment its x or y position intersects the room boundary then it will trigger the event too. You can use this event to do things like tell an instance to \"bounce\" back in towards the room again rather than go outside.":"当实例 \" 触摸 \" 房间的内部边缘时触发此事件，并且与外部房间事件一样，基于对实例的分配精灵所做的检查，因此即使您已将图像 x 或 y 比例设置为除 1 以外的值，当精灵的一部分与房间边界相交时仍会触发此事件。如果实例 {} 没有 {} 精灵，则使用实例的位置，并且其 x 或 y 位置与房间边界然后它也会触发事件。您可以使用这个事件来做一些事情，比如告诉一个实例再次 \" 反弹 \" 回房间，而不是出去。",
    "This event is triggered when an instance goes outside the room, and is based on a check done against the assigned sprite (and its properties) of the instance, so that even if you have set the image x or y scale to a value other than one, this event will only be triggered when the whole sprite would be out the screen. If the instance has no sprite, then the position of the instance is used and the moment its x or y position is outside of the room then it will trigger the event too. This event is typically used for things like bullets, where they are destroyed once they leave the room so you don\u0027t end up with millions of bullets flying away infinitely and causing your game to slow down. Note that this event is only triggered once when the instance leaves the room initially.":"此事件在实例离开房间时触发，并基于对该实例的指定精灵(及其属性)所做的检查，因此，即使您已将图像X或Y比例设置为除1以外的值，此事件只有当整个精灵离开屏幕时才会被触发。如果实例没有精灵，则使用实例的位置，并且当它的X或y位置在房间外时，它也将触发事件。这个事件通常用于像子弹这样的东西，一旦它们离开房间，它们就会被摧毁，这样你就不会有数百万颗子弹无限飞走，导致你的游戏变慢。请注意，此事件仅触发一次当实例最初离开房间时。",
    "This event is triggered whenever a sprite or a sequence generates a broadcast message string. For more information please see the page on {}Broadcast Messages{}.":"每当精灵或序列生成广播消息字符串时，都会触发此事件。有关详细信息，请参阅 {} 广播消息 {} 上的页面。",
    "This page explains each of the different events that are collected under the&nbsp;{}Other{}&nbsp;events category in the Object Editor:":"本页介绍了在对象编辑器中的 {} 其他 {} 事件类别下收集的每个不同事件：",
    "This special event is triggered only once in the whole game and only for those instances with actions or code placed in the event. These instances must be present in the first room of the game and have been placed there in the room editor, rather than have been created dynamically using code or actions. It should be noted that this event happens {}after {}the create event of all instances and so can contain code or actions with variables that have been previously defined in that event. This event is typically defined in only one \"controller\" object and is typically used to initialize global variables, start music, read from files and any other thing that is usually only done once at the start of a game.":"此特殊事件在整个游戏中仅触发一次，并且仅适用于事件中放置了操作或代码的实例。这些实例必须出现在游戏的第一个房间，并且已经放置在房间编辑器中，而不是比使用代码或操作动态创建的要多。应该注意的是，此事件发生在所有实例的创建事件之后{}，因此可以包含具有先前在该事件中定义的变量的代码或操作。此事件通常仅在一个\"控制器\"对象中定义，通常用于初始化全局变量、启动音乐、从文件中读取以及通常仅在游戏开始时完成一次的任何其他事情。",
    "When the Animation Event is triggered, a special {}DS Map{}&nbsp;will be created called the event_data map (much the same as we have the async_load map for an async event). This map will have all of the following key/value pairs that you can parse to get information about the event:":"当动画事件被触发时，一个特殊的 {}DS Map{} 将被创建，称为 event_data 映射 (与异步事件的 async_load 映射非常相似)。此映射将具有以下所有键 / 值对，您可以解析这些键 / 值对以获取有关事件的信息：",
    "{}Animation End{}{}Animation End{}":"{} 动画结束 {}{} 动画结束 {}",
    "{}Animation Event{}{}Animation Event{}":"{}动画事件{}{}动画事件{}",
    "{}Animation Update{}{}Animation Update{}":"{}动画更新{}{}动画更新{}",
    "{}Broadcast Message{}{}Broadcast Message{}":"{} 广播消息 {}{} 广播消息 {}",
    "{}Game End{}{}Game End{}":"{}游戏结束{}{}游戏结束{}",
    "{}Game Start{}{}Game Start{}":"{}游戏开始{}{}游戏开始{}",
    "{}Intersect Boundary{}{}Intersect Boundary{}":"{}相交边界{}{}相交边界{}",
    "{}Outside Room{}{}Outside Room{}":"{}房间外{}{}房间外{}",
    "{}Path Ended{}{}Path Ended{}":"{} 路径结束 {}{} 路径结束 {}",
    "{}Paths{}&nbsp;can be an important part of making any game, whether it is for a tower defence type game, or a shoot-em-up or whatever, and it\u0027s often really important that an instance does some particular action when it reaches the end of its path. This event detects this and is triggered when it happens allowing you to add in code or actions to deal with the circumstances, for example in a tower defence game you would use this to destroy the instance and remove a health point from the goal object.":"{} 路径 {} 可以是制作任何游戏的重要组成部分，无论是塔防类型的游戏，还是枪战或其他游戏，当一个实例到达时，它通常非常重要它道路的尽头。此事件检测到这一点，并在它发生时触发，允许您添加代码或操作来处理情况，例如在塔防游戏中，您将使用它来破坏实例并删除生命值从目标对象指向。",
    "{}Room End{}{}Room End{}":"{}房间结束{}{}房间结束{}",
    "{}Room Start{}{}Room Start{}":"{}房间开始{}{}房间开始{}",
    "{}This event list also contains the&nbsp;{}Rollback Events{}.{}":"{} 此事件列表还包含 {} 回滚事件 {}。{}",
    "{}User Events{}{}User Events{}":"{} 用户事件 {}{} 用户事件 {}",
    "{}{}This event is designed only for use with the {}Skeletal Animation Functions{}. This event is triggered in an object which has a skeletal animation sprite assigned to it, and where the object is using the default draw for the assigned sprite, or the sprite is being drawn via draw_self(). It currently won\u0027t trigger on skeleton animation sprites drawn any other way. The event is designed to capture and transmit data that has been assigned to particular events in the sprite animation as defined in the editor used to make them.":"{}{} 此事件仅设计用于 {} 骨骼动画功能 {}。此事件在对象中触发它有一个分配给它的骨骼动画精灵，并且对象使用分配的精灵的默认绘制，或者精灵是通过 draw_self() 绘制的。它目前不会在绘制任何其他骨骼动画精灵时触发方式。该事件旨在捕获和传输已分配给精灵动画中特定事件的数据，如用于制作它们的编辑器中定义的那样。",
    "{}{}Views{}{}Views{}{}":"{}{}视图{}{}视图{}{}"
}