{
    "Below is a brief example of how this event can be checked:":"以下是如何检查此事件的简单示例：",
    "Both {}Sequences{} and {}Sprites{}&nbsp;can generate what are called {}broadcast messages{} at any point along their length. These messages are simple strings that are added to specific frames along the animation timeline, and when that point in the timeline is reached, then the string will be broadcast out to all instances that listen for it. Any instance that has a {}Broadcast Message Event{} (found in the \"{}Other{}\" event category) will receive the message string when it is reached in the timeline, at which point it\u0027s up to you to have some code that will parse it and react accordingly. Note too that sequences can also listen for broadcast messages, but this requires you to first set up the listener method using code (see the GML section on {}Sequence Events And Moments{}&nbsp;for more information).":"{}序列{}和{}精灵{}可以在其长度的任何点生成所谓的{}广播消息{}。这些消息是简单的字符串，添加到动画时间线的特定帧中，当到达时间线中的那个点时，该字符串将广播给所有侦听它的实例。任何具有{}广播消息事件{}的实例（在\"{}其他{}\"事件类别中找到）将在时间线中到达消息字符串时接收该消息字符串，此时，您需要有一些代码来解析它并做出相应的反应。还要注意，序列也可以侦听广播消息，但这需要您首先使用代码设置侦听器方法（有关详细信息，请参阅GML中的{}序列事件和时刻{}一节）。",
    "Broadcast Messages":"广播消息",
    "Message Event Struct":"消息事件结构",
    "Note that the broadcast message event of an instance will receive multiple strings for each of the times a broadcast message is sent. You do not need to act on all of them, and can have different instances listening for different broadcast strings. However, you may have an instance that is listening for messages that may be received at the same time.&nbsp;When this happens, the event will be triggered multiple times - {}once for each message string{}.":"注意，实例的广播消息事件将在每次发送广播消息时接收多个字符串。您不需要对所有广播进行操作，并且可以让不同的实例监听不同的广播字符串。但是，您可能有一个实例正在侦听可能同时收到的消息&nbsp当发生这种情况时，事件将被多次触发-{}每个消息字符串一次{}。",
    "Once added, the message will be shown in the Dope Sheet (or in the sprite frame view). To edit it, you must&nbsp;click the right mouse button {}&nbsp;on the message icon&nbsp;to open a list of all the messages that overlap the frame (there can only be one message on a frame, but placing multiple messages on consecutive frames will cause them to overlap visually, making it harder to select the one you want and you can have a message and a&nbsp;{}moment{}&nbsp;on the same frame too), and then selecting one from this list will open the message dialog where you can edit it or remove it.":"添加后，消息将显示在\"关键帧表\"（或精灵帧视图）中。要编辑它，您必须单击鼠标右键{}在消息图标上打开与帧重叠的所有消息的列表（一个帧上只能有一条消息，但将多条消息放置在连续帧上会导致它们在视觉上重叠，从而使您更难选择所需的消息，您也可以在同一帧上看到一条消息和一个{}时刻{}），然后从列表中选择一个将打开消息对话框，您可以在其中编辑或删除它。",
    "This contains the ID of the layer element (sequence/sprite/instance) that fired the message. You can then use this ID value to find out what kind of element generated the message using the function {}{}layer_get_element_type(){}{}&nbsp;and to use the other relevant functions to target it, or perform an action like play a sound, as required.":"这包含触发消息的层元素（序列 / 精灵 / 实例）的 ID。然后，您可以使用此 ID 值来确定使用函数 {}{}layer_get_element_type(){}{} 生成消息的元素类型并根据需要使用其他相关功能来瞄准它，或执行诸如播放声音之类的动作。",
    "This contains the message string that has been received.":"这包含已接收的消息字符串。",
    "This will be the string \"{}sequence event{}\" for a message sent from a Sequence and \"{}sprite event{}\" for a message sent from a Sprite.":"对于从序列发送的消息，这将是字符串\"{}sequence event{}\"，对于从精灵发送的消息则是字符串\"{}sprite event{}\"。",
    "To add a Broadcast Message&nbsp;to the sequence or sprite timeline you simply click the&nbsp;{}&nbsp;button. This&nbsp;will open a dialog where you can add the message to be broadcast:":"添加广播消息到序列或精灵时间线，只需单击{}按钮这一点将打开一个对话框，您可以在其中添加要广播的消息：",
    "When a Broadcast Message event is triggered, there will be a special {}DS Map{}&nbsp;created and stored in the built-in variable {}event_data{}. This variable ID is a built-in {}global {}scope variable, but will only contain DS map data in the event that triggered it -&nbsp;in this case the Broadcast Message event - and will return -1 at all other times. The keys that the event will have are as follows:":"当触发广播消息事件时，将有一个特殊的{}DS映射{}创建并存储在内置变量{}event_data{}中。此变量ID是一个内置的{}全局{}范围变量，但仅在触发它的事件中包含DS映射数据-在这种情况下，广播消息事件将在所有其他时间返回-1。事件将具有的键如下：",
    "{}{}NOTE{}{}&nbsp;Setting the {}image_index {}of an instance directly to a frame will&nbsp;{}not{} trigger any Broadcast Messages that may be present on that frame of the object\u0027s sprite.":"{}{}注意{}{} 将实例的 {}image_index{} 直接设置为帧将{}不{}触发对象精灵的该帧上可能存在的任何广播消息。"
}