{
    "As mentioned in the {}Track Panel{} page, there is an action to create what is called a {}clipping mask group {}in the track editor. This is accessed by clicking on the&nbsp;{}&nbsp;button at the bottom of the Track Panel:":"正如在{}轨道面板{}页中所提到的，有一个操作可以在轨道编辑器中创建所谓的{}剪切蒙版组{}。通过单击\"轨道面板\"{}底部的按钮：",
    "Clipping Masks":"剪切蒙版",
    "Note that clipping mask groups can be treated as a single item in the track list and dope sheet, and you can add rotation and position parameter tracks to the group {}as a whole{}. You can also apply clipping mask groups to group folders of assets or even to&nbsp;{}other{}&nbsp;clipping mask groups, making them a very powerful tool.":"请注意，剪切蒙版组可以被视为轨道列表和关键帧表中的单个项目，您可以将旋转和位置参数轨道作为{}一个整体{}添加到组。您还可以将剪切蒙版组应用于资源的组文件夹，甚至应用于{}其他{}裁剪遮罩组，使其成为非常强大的工具。",
    "The mask sprite {}alpha {}will be used to \"hide\" whatever subject is underneath it, where a value of 100% alpha (opaque) will mask completely and a value of 0% alpha (transparent) will show it. For example, we have this sprite for masking:":"精灵遮罩 {}alpha{} 将用于\"隐藏\"其下的任何对象，其中 100% alpha（不透明）将完全遮罩，0% alpha（透明）将显示它。例如，我们有一个用于遮罩的精灵：",
    "To add a subject and mask, simply drag the sprite, object or sequence from the Asset Browser over the folder that you want to add it to:":"要添加主题和遮罩，只需将精灵、对象或序列从“资源浏览器”拖动到要添加到的文件夹上：",
    "{}Clicking this will create a clipping mask group that is comprised of two sub-sets of assets that can be used as either the {}subject {}or the {}mask {}of the group. Basically the subject is the asset that is going to be masked, and the mask is the asset that is going to do the masking:":"{}单击此按钮将创建一个剪切蒙版组，该组由两个子资源集组成，这些资源集可以用作组的{}主题{}或{}蒙版{}。基本上，主题是要被屏蔽的资源，而屏蔽是要进行屏蔽的资源：",
    "{}In the above example \"{}Sprite_2{}\" is simply a static sprite asset that is the base icon, and then over that we\u0027ve created a clipping mask group with a greyscale version of the sprite, as well as a mask (using the example sprite shown above). When combined and the sequence is played, the clipping mask group reveals the base sprite underneath, creating our cooldown effect.":"{}在上面的示例中，\"{}Sprite_2{}\" 只是一个静态的精灵资源，它是基础图标，然后我们创建了一个剪切蒙版组，其中包含精灵的灰度版本以及掩码（使用上面显示的示例精灵）。当组合在一起并播放序列时，剪切蒙版组会显示下面的基础精灵，从而产生冷却效果。",
    "{}The idea behind using a clipping mask is that you add a subject sprite, and then a mask sprite, and the mask sprite will \"hide\" (mask) the subject. You can then use the mask sprite animation, or move or scale the mask sprite to change the visibility of the subject (or parts of the subject). Each group (mask and subject) can contain multiple assets, and each of the assets can have multiple parameter tracks.":"{}使用剪切蒙版背后的想法是添加一个主题精灵，然后添加一个蒙版精灵，蒙版子图形将\"隐藏\"（蒙版）主题。然后可以使用遮罩精灵动画，或移动或缩放遮罩精灵以更改对象（或对象的部分）的可见性。每个组（蒙版和主题）可以包含多个资源，每个资源可以有多个参数轨道。",
    "{}We can then apply this as a clipping mask to icons to create a \"cooldown\" effect, like this:":"{}然后我们可以将其作为剪切蒙版应用于图标以创建\"冷却\"效果，如下所示："
}