{
    "Adding Sounds":"添加声音",
    "All audio effects that you add to an audio track are processed on an audio bus created for that track. You can configure the audio bus itself by adding it as a parameter track and changing the properties of that track.":"您添加到音轨的所有音频效果都在为该音轨创建的音频总线上处理。您可以通过将其添加为参数音轨并更改该音轨的属性来配置音频总线本身。",
    "An audio bus track can be added only once to an audio track, while effect tracks can be added multiple times.":"音频总线轨道只能添加到音频轨道一次，而效果轨道可以添加多次。",
    "An audio emitter is shown on the sequence canvas using the emitter icon:&nbsp;":"音频发射器使用发射器图标显示在序列画布上：",
    "Audio Effects":"音频效果",
    "Audio Emitters in Sequence Instances":"序列实例中的音频发射器",
    "Audio effects on an audio bus are applied {}in order{}&nbsp;and therefore the order of the tracks is important. The effect track at the top corresponds to the first audio effect to be applied to the bus and the effect tracks below the subsequent ones.":"音频总线上的音频效果是按顺序{}应用的，因此轨道的顺序很重要。顶部的效果轨道对应于要应用到总线的第一个音频效果，效果轨道位于后续效果轨道之下。",
    "By adding the sequence position (and possibly also rotation) to the emitter position it is moved from \"local\" space (its position defined relative to the sequence) into \"global\" space (its position defined relative to the room origin).":"通过将序列位置(以及可能的旋转)添加到发射器位置，将其从\"局部\"空间(其位置相对于序列定义)移动到\"全局\"空间(其位置相对于房间原点定义)。",
    "Contents":"内容",
    "Emitters":"发射器",
    "Every sound track in a sequence gets an audio emitter as well as an audio bus. You can move the audio emitter around on the sequence canvas to {}Position{} it.":"序列中的每个音轨都有一个音频发射器和一个音频总线。您可以在序列画布上移动音频发射器，以{}定位{}它。",
    "For example, if you added an audio emitter to your sequence at position (0, 0) and you add an instance of that sequence to a room at a position (100, 200) then&nbsp;{}GameMaker{}&nbsp;will place the audio emitter at (100, 200), or (100 + 0, 200 + 0). If you have another audio emitter in another sequence at position (10, -30) and you add an instance of this sequence at (400, 50),&nbsp;this emitter will end up at the position (410, 20), or (400 + 10, 50 + (-30)). If you animated the emitter\u0027s position in the sequence,&nbsp;{}GameMaker{}&nbsp;will update its final position accordingly.":"例如，如果将音频发射器添加到序列的位置(0，0)，并将该序列的实例添加到房间的位置(100，200)然后{}GameMaker{}将音频发射器放置在(100，200)，或(100 + 0，200 + 0).如果你有另一个音频发射器在另一个序列中的位置(10，-30)，你添加一个这个序列的实例在(400，50)，此发射器将在位置(410，20)或(400 + 10，50 +(-30))处结束。如果您在序列中设置了发射器位置的动画，{}GameMaker{}将相应地更新其最终位置。",
    "In&nbsp;{}The Inspector{}&nbsp;you can edit all general sound and emitter properties of a sound track as well as the settings of all its effects.":"在{}检查器{}中，您可以编辑音轨的所有常规声音和发射器属性，以及其所有效果的设置。",
    "Inspector":"检查器",
    "Once your sequence is finished, you can add it to an asset layer in&nbsp;{}The Room Editor{}, creating one or more {}instances{} of it. A sequence instance will include an audio emitter for each sound track in the sequence, positioned relative to the instance\u0027s position.":"序列完成后，您可以将其添加到{}房间编辑器{}中的资源层，创建一个或多个{}实例{}。序列实例将包括序列中每个音轨的音频发射器，其位置相对于实例的位置。",
    "Reordering Audio Effects":"重新排序音频效果",
    "So you can place two instances of the same sequence in a room and the audio emitter in one will be heard on one side and the other one on the other side (despite the two emitters both having the same \"local\" position).":"因此，您可以在房间中放置相同序列的两个实例，其中一个中的音频发射器将在一侧听到，另一个将在另一侧听到(尽管两个发射器都具有相同的\"本地\"位置)。",
    "Sound tracks can be added to sequences, together with audio effects on that track. The simplest way to do this is by dragging a sound asset into the Canvas at the position where you want the sound to play.":"可以将声音轨道添加到序列中，并在该轨道上添加音频效果。最简单的方法是将声音资源拖到画布中希望播放声音的位置。",
    "This page covers the following topics:&nbsp;":"本页涵盖以下主题：",
    "To reorder audio effects, click and hold the left mouse button on an effect track to drag it to its new position:&nbsp;":"若要重新排序音频效果，请在效果轨道上单击并按住鼠标左键，将其拖到新位置：",
    "You add all&nbsp;{}Audio Effects{}, except for the equaliser effect,&nbsp;as parameter tracks to audio asset tracks.":"您可以将所有{}音频效果{}(均衡器效果除外)作为参数轨道添加到音频资源轨道。",
    "You can add a sound track to a sequence in the following ways:&nbsp;":"您可以通过以下方式将音轨添加到序列中：",
    "You can also change the {}Volume{} and {}Pitch{}. The volume and pitch are that of the emitter (see&nbsp;{}Audio Properties Overview{}).":"您还可以更改{}音量{}和{}音高{}。音量和音高是发射器的音量和音高(请参阅{}音频属性概述{})。",
    "You can make changes to the {}Rotation{}&nbsp;here but it has no effect in-game as this isn\u0027t a property that can be set for an emitter.":"你可以在这里对{}旋转{}进行更改，但它在游戏中没有效果，因为这不是一个可以为发射器设置的属性。",
    "{}All effects that you add to the audio track are listed&nbsp;under \"{}Audio Effects\" in the Inspector{}. You can change their parameters here, however their order can only be changed in the Track Panel.":"{} 您添加到音轨的所有效果都列 {} 在检查器中的“音频效果”下 {}。 您可以在此处更改它们的参数，但是它们的顺序只能在轨迹面板中更改。",
    "{}Drag a sound asset from&nbsp;{}The Asset Browser{}&nbsp;onto the sequence canvas.{}&nbsp;This creates a positioned audio emitter for the sound where you drop it.":"{}将声音资源从{}资源浏览器{}拖到序列画布上。这会在您放置声音的位置创建一个定位的音频发射器。{}",
    "{}Drag a sound asset onto&nbsp;{}The Track Panel{}.{}&nbsp;This creates an emitter for the sound at the sequence\u0027s centre.":"{}将声音资源拖到{}\"轨道面板\"{}。{}这将在序列的中心为声音创建一个发射器。",
    "{}Select a sound asset in the Asset Explorer when adding a track.{}&nbsp;This creates an emitter for the sound at the sequence\u0027s centre.":"{}添加轨道时在 资产浏览器 中选择一个声音资源。{}这会在序列的中心创建一个声音发射器。",
    "{}Sound in Sequences{}":"{}声音序列{}",
    "{}{}NOTE{}{}&nbsp;All properties shown above apply to the emitter except the {}Loop Mode{}, which is a property of the {}sound instance{}.":"{}{}注意{}{}上面显示的所有属性都适用于发射器，但{}循环模式{}除外，它是{}声音实例{}的属性。",
    "{}{}NOTE{}{}&nbsp;Dragging parameter tracks only works for audio effect parameter tracks, not the bus track or any other type of parameter track.":"{}{}注意{}{}拖动参数轨道仅适用于音频效果参数轨道，而不适用于总线轨道或任何其他类型的参数轨道。",
    "{}{}NOTE{}{}&nbsp;The position will influence how loud and from which direction the sound is heard. For this to work correctly, you also need to set an appropriate audio falloff model and update the listener position and orientation to where you want the sound to be heard. See&nbsp;{}Audio Emitters{} for more details.":"{}{}注意{}{}位置会影响声音的大小和方向。要使其正常工作，您还需要设置适当的音频衰减模型，并将收听者的位置和方向更新到您希望听到声音的位置。有关详细信息，请参阅{}音频发射器{}。",
    "{}{}NOTE{}{}&nbsp;You can add a maximum number of&nbsp;{}8{} audio effect tracks, as limited by the number of effect slots of the&nbsp;{}AudioBus Struct{}.":"{}{}注意{}{}您最多可以添加{}8{}个音频效果轨道，这受{}AudioBus Struct{}的效果插槽数量限制。"
}