{
    "At the top it shows you the font asset that is selected. You can use this option to select an existing font asset, or create a new one and assign it to the selected text track.":"在顶部，它显示所选的字体资源。您可以使用此选项选择现有字体资源，或创建新字体资源并将其分配给选定的文本轨道。",
    "Contents: ":"内容包括：",
    "Creating Text":"创建文本",
    "Font Assets":"字体资源",
    "General":"通常",
    "If the font doesn\u0027t have SDF enabled, you\u0027ll be asked to&nbsp;enable it first:&nbsp;{}":"如果字体未启用SDF，系统将要求您首先启用它：{}",
    "Inspector":"检查器",
    "Modifying Text":"修改文本",
    "Parameters":"参数",
    "Resize Behaviour":"调整大小特性",
    "Resizing your text track in the Canvas will work differently depending on whether your text track is {}wrapped{} or {}unwrapped{}.{} {} If unwrapped, your text track will be scaled, similar to how you scale sprites and objects. However, resizing a {}wrapped{} text track modifies its {}frame size{}&nbsp;instead of modifying its scale values.{} {}To scale a wrapped text track, use {}Gizmos{} instead, or edit the values in the Scale parameter track manually. ":"在画布中调整文本轨道的大小将根据文本轨道是{0}包裹的{1}还是{2}展开的{3}而有所不同。{4}{5}如果展开，文本轨道将被缩放，类似于缩放精灵和对象的方式。然而，调整{}包裹的{}文本轨道的大小会修改其{}帧大小{}而不是修改其比例值。{}{}要缩放换行文本轨道，请改用{}小工具{}，或手动编辑\"缩放\"参数轨道中的值。",
    "SDF Effects":"SDF效果",
    "Some of the parameter tracks (such as {}Colour{},&nbsp;{}Character Spacing{}, {}Line Spacing{}, etc.) are included here, and changing them will create a keyframe at the playhead if&nbsp;{} {}Automatically record changes{} is enabled, or modify the selected keyframe. The rest of the options are \"static\" (as they cannot be animated) and are as follows:":"此处包含一些参数轨道（例如{}颜色{}}、{}字符间距{}、{}行距{}等），如果发生以下情况，则更改这些轨道将在播放头创建关键帧：{}{}已启用自动记录更改{}，或修改所选关键帧。其余选项为\"静态\"（因为它们不能设置动画），如下所示：",
    "Text in Sequences":"序列文本",
    "Text tracks are tied to {}Font assets{}. When you create a new text track, it will look for a font asset within your project, and use the one that was last added. If your project has no fonts, it will automatically create a new font asset.":"文本轨道与{}字体资源{}。当您创建新的文本轨道时，它将在项目中查找字体资源，并使用上次添加的字体资源。如果您的项目没有字体，它将自动创建一个新的字体资源。",
    "Text tracks can be added to a Sequence through the editor. This is done by selecting the&nbsp;{} {}Add a Text Track{} button from the Canvas Toolbox, and then clicking (and optionally dragging) in the Canvas to create a text track.":"文本轨道可以通过编辑器添加到序列中。通过选择 {} 从 \" 画布工具箱 \" 中{}添加 \" 文本轨道 \"{} 按钮，然后在 \" 画布 \" 中单击（或拖动）以创建文本轨道。",
    "Text-specific":"特定文本",
    "The Inspector also lists SDF effect parameters. When the {}Enable Effects{} checkbox is enabled the text&nbsp;will be drawn with a different shader.":"检查器还列出SDF效果参数。当{}启用效果{}复选框被启用时，文本将使用不同的着色器绘制。",
    "The Inspector shows you the following properties when a text track is selected:":"选中文本轨道时，检查器将显示以下属性：",
    "There are some properties that can only be changed through the Inspector. Such properties cannot be animated as they are not parameter tracks, but simple options that apply to the whole track.":"有些属性只能通过检查器进行更改。此类属性不能设置动画，因为它们不是参数轨道，而是应用于整个轨道的简单选项。",
    "There are some properties that can only be changed through {}The Inspector{}. Such properties cannot be animated as they are not parameter tracks, but simple options that apply to the whole track.":"有一些属性只能通过{}检查器{}更改。这些属性不能设置动画，因为它们不是参数轨迹，而是应用于整个轨迹的简单选项。",
    "There are some text-specific parameters provided as well, which can also be animated:{}":"还提供了一些特定于文本的参数，也可以设置动画：{}",
    "There are two ways of creating a text track. After selecting the&nbsp;{}&nbsp;{}Text{} tool from the Toolbox, you can:":"创建文本轨道有两种方法。选择{}{}文本{}工具，您可以：",
    "This page covers the following topics:":"本页包含以下主题：",
    "This page covers the following topics:&nbsp;":"本页涵盖以下主题：",
    "When the font asset used by a text track has&nbsp;{}SDF Rendering{}&nbsp;enabled, the text can have effects applied to it. The following effects are supported:&nbsp;":"当文本轨道使用的字体资源启用了{}SDF渲染{}时，文本可以应用效果。支持以下效果：",
    "When you create a new text track, GameMaker opens the&nbsp;{}Inspector{} and automatically selects the {}Text{} field, allowing you to start writing your text.":"当您创建新的文字轨道时，GameMaker会打开{}检查器{}并自动选择{}文本{}字段，允许您开始编写文字。",
    "When you create a new text track,&nbsp;{}GameMaker{} opens {}The Inspector{}&nbsp;and automatically selects the {}Text{} field, allowing you to start writing your text.":"当您创建新的文本轨道时，{}GameMaker{}会打开{}检查器{}并自动选择{}文本{}字段，允许您开始编写文本。",
    "When you delete a font, all text tracks that use that font are deleted as well, so ensure you don\u0027t accidentally delete font assets that are used in Sequences.":"删除字体时，使用该字体的所有文本轨道也会被删除，因此请确保不会意外删除序列中使用的字体资源。",
    "You can also modify parameters&nbsp;for&nbsp;SDF effects:&nbsp;":"也可以修改SDF效果的参数：",
    "You can modify and animate all the usual parameters that are provided for a sprite track, like Position, Rotation, Scale, Origin and Colour Multiply. Using these parameters you can move and rotate your text, make it bigger or smaller, and change its colour and alpha.":"您可以修改和设置为精灵轨道提供的所有常用参数的动画，如\"位置\"、\"旋转\"、\"比例\"、\"原点\"和\"颜色倍增\"。使用这些参数，您可以移动和旋转文本，使其变大或变小，并更改其颜色和 alpha。",
    "{}Alignment{}: Here you can change how your text is aligned within the frame horizontally (left, centre, right, justified) and vertically (bottom, top, middle). This only applies when the {}Wrap{} option is enabled.":"{}对齐方式{}：在这里，您可以更改文本在框架内的水平对齐方式（左、中、右、对齐）和垂直对齐方式（下、上、中）。这仅在启用{}包裹{}选项时适用。",
    "{}Character Spacing{}: This is the space between each character (in pixels).{} {} ":"{}字符间距{}：这是每个字符之间的间距（以像素为单位）。{} {}",
    "{}Click and drag in the canvas{}: This creates a \"wrapped\" text track, meaning the text only displays inside a frame. The size of this frame is set by dragging while creating the text track. Its size can also be changed later via parameter tracks or the Inspector. {}{} It is recommended to use wrapped text tracks as it makes it much easier to align your text and get consistent results while animating.":"{}在画布中单击并拖动{}：这将创建一个\"环绕\"文本轨道，这意味着文本只显示在框架内。此框架的大小是通过在创建文本轨道时拖动来设置的。它的大小也可以在以后通过参数轨道或检查器进行更改。{}{}建议使用换行文字轨道，因为这样可以更轻松地对齐文本，并在制作动画时获得一致的结果。",
    "{}Click once in the canvas{}: This creates an \"unwrapped\" text track. This means the text can be as long as you want and it will stay on one line. Wrapping can easily be enabled later through the {}Inspector{}.{} {}{} ":"{}在画布中单击一次{}：这将创建一个\"展开\"的文本轨道。这意味着文本可以是您想要的长度，并且将保持在一行上。以后可以通过{}检查器{}轻松启用换行。{} {}{}",
    "{}Click once in the canvas{}: This creates an \"unwrapped\" text track. This means the text can be as long as you want and it will stay on one line. Wrapping can easily be enabled later through {}The Inspector{}.{} {}{} ":"{}在画布中单击一次{}：这将创建一个\"未换行\"的文本轨道。这意味着文本可以任意长，并且将保持在一行上。稍后可以通过{}检查器{}轻松启用换行。{}{}",
    "{}Core Colour{}: This is the colour&nbsp;of the \u0027core\u0027 part&nbsp;of the glyph.":"{}核心颜色 (Core Colour){}：这是字形“核心”部分的颜色。",
    "{}Drop Shadow{}":"{}投影 Drop Shadow{}",
    "{}Frame Size{}: This is the size of the text\u0027s frame, and is only used when {}Wrap{} is enabled in the Inspector (see its section below for more information).":"{}帧大小{}：这是文本帧的大小，仅在检查器中启用{}}换行{}时使用（有关详细信息，请参阅下面的部分）。",
    "{}Glow Colour{}: This is the glow colour.":"{}发光颜色 (Glow Colour){}：这是发光颜色。",
    "{}Glow End{}: This is the distance in pixels the glow effect ends (i.e. fades to fully transparent). It can range from 0 to 64.":"{}发光结束 (Glow End){}：这是发光效果结束(即淡入到完全透明)的距离(以像素为单位)。范围为0到64。",
    "{}Glow Start{}: This is the distance in pixels the glow effect starts from the edge&nbsp;of each glyph. It can range from 0 to 64.":"{}发光开始 (Glow Start){}：这是发光效果从每个像素的边缘开始的距离。范围可以从0到64。",
    "{}Glow{}":"{}发光 Glow{}",
    "{}Line Spacing{}: This is the space between each line of text (in pixels).{} {} ":"{}行距{}：这是每行文本之间的间距（以像素为单位）。{} {}",
    "{}NOTE{} The Inspector should open automatically when you create or select a text track, but if your Inspector is closed, you can open it manually from the {}Windows{} menu at the top.":"{}注意{}当您创建或选择文本轨时，检查器应自动打开，但如果检查器已关闭，则可以从顶部的 {}Windows{} 菜单手动打开它。",
    "{}Outline Colour{}: This is the colour&nbsp;of the&nbsp;outline.":"{}轮廓颜色 (Outline Colour){}：这是轮廓的颜色。",
    "{}Outline Distance{}: This is the distance in pixels that the outline extends from the edge&nbsp;of each glyph. It can range from 0 to 64.":"{}轮廓距离 (Outline Distance){}：这是轮廓从每个边框的边缘延伸的距离(以像素为单位)。范围为0到64。",
    "{}Outline{}":"{}轮廓 Outline{}",
    "{}Paragraph Scaling{}: This is the space between each paragraph of text (in pixels). A new paragraph starts when you add a line break manually by pressing {}.{} {} ":"{}段落缩放{}：这是文本的每个段落之间的间距（以像素为单位）。按{}手动添加换行符时，新段落开始。{} {}",
    "{}Shadow Colour{}: This is the colour&nbsp;of the drop shadow.":"{}阴影颜色 (Shadow Colour){}：这是投影的颜色。",
    "{}Shadow Offset{}: This is the&nbsp;offset in pixels&nbsp;on the x and y axis of the drop shadow.":"{}阴影偏移 (Shadow Offset){}：这是投影的x轴和y轴上的偏移(以像素为单位)。",
    "{}Shadow Softness{}: This is the width of the drop shadow penumbra, which determines its \"softness\". It can range from 0 to 64.":"{}阴影柔和度 (Shadow Softness){}：这是投影半影的宽度，它决定了它的\"柔和度\"。它的范围可以从0到64。",
    "{}Text{}: This is the text that is displayed on your text track. You can enter multiple lines here, however empty lines will not be displayed.":"{}文本{}：这是显示在文本轨道上的文本。您可以在此处输入多行，但不会显示空行。",
    "{}Thickness{}: This is the number of pixels to modify the thickness&nbsp;of each {}glyph{}&nbsp;in the text. It can range from -32 to 32.":"{}粗细 (Thickness){}：这是修改文本中每个{}边框{}粗细的像素数。范围为-32到32。",
    "{}To edit the text for a track at any time, simply select that track, go into the Inspector and modify the {}Text{} field again.":"{}要随时编辑轨道的文本，只需选择该轨道，进入检查器，然后再次修改{}文本{}字段。",
    "{}When SDF is enabled, add parameter tracks to use and animate these effects. These parameters are listed in the {}Parameters{} section below.":"{}启用SDF后，添加参数轨迹以使用这些效果并设置其动画。这些参数在下面的{}参数{}部分中列出。",
    "{}Wrap{}: This controls whether the text should automatically wrap within the defined frame. When this is enabled, your text will automatically move to the next line when it hits the end of the frame, and will always be cut off if the text happens to be longer than the height of the frame. When this is disabled, all of your text will be displayed on a single line, and the frame will not be displayed in the canvas anymore.":"{}换行{}：这控制文本是否应在定义的框架内自动换行。启用此选项后，当文本到达框架的末尾时，文本将自动移动到下一行，如果文本恰好长于框架的高度，文本将始终被截断。禁用此选项后，所有文本都将显示在一行上，并且框架将不再显示在画布中。",
    "{}{}NOTE{}{}&nbsp;The Inspector should open automatically when you create or select a text track, but if your Inspector is closed, you can open it manually from&nbsp;{}The Windows Menu{}&nbsp;at the top.":"{}{}注意{}{}当您创建或选择文本轨道时，检查器应自动打开，但如果检查器已关闭，您可以从顶部的{}Windows菜单{}手动打开它。"
}