{
    "By moving the mouse to the edges of the asset in the canvas and clicking {}&nbsp;and dragging (note that the cursor will change to show the different transforms that will be changed):{} {} ":"通过将鼠标移动到画布中资源的边缘并单击{}并拖动(请注意，光标将更改以显示将更改的不同变换)：{}{}",
    "By using the transform gizmo at the origin of the asset, which you can change from the canvas Toolbox:{} {} ":"通过在资源原点使用变换小工具，您可以从画布工具箱进行更改：{}{}",
    "Gizmos":"小工具",
    "If you have multiple assets that are overlapping and wish to select a specific one without disturbing the rest, then you can hover the mouse over them to bring up the {}Item Toolbox{} which will show a list of icons for each item under the mouse. You can then click on one of these items to select it and edit it:":"如果您有多个重叠的资产，并且希望在不干扰其余资产的情况下选择特定资产，则可以将鼠标悬停在这些资产上以调出{}项目工具箱{}，其中将在鼠标下方显示每个项目的图标列表。然后，您可以单击以下项目之一将其选中并进行编辑：",
    "Note that when multiple assets are selected in the canvas, there will be a {}bounding box{} shown for each asset, and a larger bounding box shown for all of them combined. You can change how this bounding box behaves from the icons at the top left corner:":"请注意，当在画布中选择多个资产时，将为每个资产显示一个{}边界框{}，并为所有资产组合显示一个较大的边界框。您可以通过左上角的图标更改此边界框的行为方式：",
    "Objects":"对象",
    "Once you have added the assets that are required, they can be placed at their initial positions for the animation, and can also be transformed using the various different {}Transform Control Gizmos{}. These are accessed in two different ways:":"一旦添加了所需的资源，就可以将它们放置在动画的初始位置，也可以使用各种不同的{}变换控制小工具{}进行变换。可以通过两种不同的方式访问它们：",
    "Once you have the canvas set up how you want you can start to add assets to it. This is done simply by dragging them from the {}Asset Browser{} into the canvas, which will create an {}asset track{} in the {}Track Panel{}:":"设置好画布后，就可以开始向其中添加资源了。只需将它们从{}资源浏览器{}拖到画布中即可完成，这将在{}轨迹面板{}中创建一个{}资源轨迹{}：",
    "One final point worth mentioning is that the canvas permits you to use and add {}smart guides{}, which are guidelines that can be added to the canvas so that assets can be aligned against them. By default the canvas will show horizontal and vertical guides around the center point, as well as a rectangular guide around the \"edge\" of the sequence canvas, based on the size of the canvas. These guides will not be rendered in the final sequence when added to a room and are just there to help you get an idea of space and to help position things. You can also add your own guides by clicking {}&nbsp;on a ruler and then dragging into the canvas:":"最后值得一提的是，画布允许您使用和添加{}智能辅助线{}，这些辅助线是可以添加到画布的指导原则，以便资产可以与其对齐。默认情况下，画布将根据画布的大小显示中心点周围的水平和垂直辅助线，以及序列画布“边缘”周围的矩形辅助线。当添加到房间中时，这些向导不会以最终顺序呈现，只是为了帮助您了解空间并帮助定位物品。您也可以添加自己的辅助线，方法是单击{}标尺，然后将其拖到画布上：",
    "Parameter Keys":"参数键",
    "RMB Menu And Navigation":"右键菜单和导航",
    "Sequences":"序列",
    "Smart Guides":"智能辅助器",
    "Sounds":"声音",
    "Sprites":"精灵",
    "The Sequence Canvas":"序列画布",
    "The frame is also used to house any {}reference images{} that you want to use to guide the positioning of assets within the sequence. A reference image can be added from the same {}Canvas Options{} menu where you set the size of the canvas frame, and will be used as a background image for the sequence canvas. This permits you to position things according to - for example - a UI mock-up from a project artist:":"该框架还用于容纳要用于指导序列中资源定位的任何{}参考图像{}。可以从设置画布框大小的相同{}画布选项{}菜单中添加参考图像，并将其用作序列画布的背景图像。这允许您根据项目艺术家的UI模型来定位事物：",
    "To navigate around the canvas view, you can use the same basic controls as the for a regular Workspace, ie: Use the middle mouse button {}&nbsp;and drag to pan the canvas (or alternatively use the {}&nbsp;+ {}), and you can scroll horizontally with the mouse wheel {}&nbsp;or zoom in and out using the {}&nbsp;/ {} key and the mouse wheel {}.":"要在画布视图中导航，您可以使用与常规工作区相同的基本控件，即：使用鼠标中键{}并拖动以平移画布(或者使用{}+{})，您可以使用鼠标滚轮{}水平滚动，或者使用{}/{}键和鼠标滚轮{}进行放大和缩小。",
    "To select an asset, simply click the left mouse button {}&nbsp;on it, or you can select multiple assets using&nbsp;{}&nbsp;/ {} &nbsp;and {}&nbsp;to click on each asset. You can also select multiple assets using {}&nbsp;and then clicking {}&nbsp;and dragging. This will create a \"box\" in the canvas and any asset that touches the box area will be selected.":"要选择资产，只需在其上单击鼠标左键{}，也可以使用{}/{}和{}来选择多个资产。您也可以使用{}选择多个资源，然后单击{}并拖动。这将在画布中创建一个“长方体”，任何触及该长方体区域的资源都将被选中。",
    "When creating sequences for your projects a large part of the work will be done in the {}canvas{} of the {}Sequence Editor{}. The canvas is simply the area that will be used to contain the sequence elements, and it also defines what will be shown when the sequence is added to a room to be displayed. When you first create a sequence, the canvas will be set to the default size of 1366px by 768px, but this can be changed from the {}Toolbox {}by clicking the {}&nbsp;beside the {}Canvas Frame Toggle{} {}&nbsp;button:":"为项目创建序列时，大部分工作将在 {} 序列编辑器 {} 的 {} 画布 {} 中完成。画布只是用于包含序列元素的区域，它还定义了将序列添加到要显示的房间时将显示的内容。首次创建序列时，画布将设置为默认大小 1366px * 768px，但是可以通过单击 {} 画布框架切换按钮 {}{} 旁边的 {} 从 {} 工具箱 {} 中进行更改：",
    "When you have an asset or assets selected, you can cut, copy and paste them using the&nbsp;{}&nbsp;/ {}&nbsp;+\"{}X{}\", &nbsp;{}&nbsp;/ {}&nbsp;+ \"{}C{}\" and &nbsp;{}&nbsp;/ {} + \"{}V{}\" key combinations.":"当您选择了一个或多个资产时，可以使用{}/{}+\"{}X{}\"、{}/{}+\"{}C{}\"和{}/{}+\"{}V{}\"组合键剪切、复制和粘贴它们。",
    "When you have set the initial transforms for the asset (if required) you can then use the canvas to add {}parameter key{}{}s{} to the asset track in the {}Track Panel{}. A simple example of how this works would be a basic position transform, where you would place the asset at it\u0027s start position, then move the {}playhead{} in the {}Dope Sheet{} to the frame you want the movement to end, and then move the asset again:":"设置资源的初始变换后(如果需要)，可以使用画布将{}参数键{}{}{}添加到{}轨迹面板{}中的资源轨迹。其工作原理的一个简单示例是基本位置变换，即将资源放置在其开始位置，然后将{}摄影表{}中的{}播放头{}移动到希望移动结束的帧，然后再次移动资源：",
    "You can also use the&nbsp;{} {}Text{} tool in the Toolbox to create a text track. Read&nbsp;{}Text in Sequences{} for more information.":"您还可以使用工具箱中的{}{}文本{}工具创建字幕。有关详细信息，请参阅{}序列中的文本{}。",
    "{}As you can see in the image above, the new positions are automatically being recorded on the track as we have enabled \"{}Automatically Record Changes{}\" {}&nbsp;in the Track Panel. You can also see that a dotted line has been added to the canvas view to indicate the movement through time of the asset. If you do not have the automatic recording enabled, you can still add points by moving the asset, then setting the playhead and then finally clicking the \"{}Record a new key{}\" {}&nbsp;button.":"{}如上图所示，新位置将自动记录在轨道上，因为我们已在轨道面板中启用了“{}自动记录更改{}”{} ；。您还可以看到，画布视图中添加了一条虚线，以指示资产随时间的移动。如果您没有启用自动录制功能，您仍然可以通过移动资源、设置播放头、最后单击“{}录制新帧{}”{} ；按钮来添加点数。",
    "{}Clicking on the circle icon will change the transform control gizmo to the origin of the full bounding box for all assets selected, while clicking the box icon will show an individual control widget for each asset in the selection. You can move grouped assets around and copy/paste them etc... just as you would for a single asset.":"{}单击圆形图标会将变换控件小工具更改为所有选定资源的完整边界框的原点，而单击框图标将显示所选资源中每个资源的单独控件小工具。您可以移动已分组的资源，并复制/粘贴它们等。就像你对单一资产所做的那样。",
    "{}Note that reference images are not stored with the project and will not be rendered when the sequence is added to a room.":"{}请注意，参考图像不会与项目一起存储，并且在将序列添加到房间时不会呈现。",
    "{}The assets that can be added to a sequence are as follows:":"{}可以添加到序列中的资产如下：",
    "{}The canvas size defines a visual area within which to place the assets that make up the sequence, but the frame is simply a guide to size and will not affect how things are rendered, ie: if you place a sprite asset outside the frame and add the sequence to a room, the asset will still be rendered.":"{}画布大小定义了一个可视区域，在该区域中放置构成序列的资源，但框架只是一个大小指南，不会影响渲染内容的方式，即：如果将精灵资源放置在框架外并将序列添加到文件室，则仍会渲染资源。",
    "{}To remove a guide, simply click on it and then drag it back towards the rulers again. When you have guides added to a sequence, moving an asset around will then \"snap\" to the guide when the bounding box or origin is near enough, and extra smart guides will be shown to mark the distances between assets as well as to mark assets that are all on the same guide or at the same position (these are coloured differently):":"{}要删除辅助线，只需单击该辅助线，然后再次将其拖回尺子。将辅助线添加到序列中后，当边界框或原点足够近时，四处移动资源就会与辅助线“对齐”，并且会显示额外的智能辅助线，以标记资源之间的距离以及标记位于相同辅助线或相同位置的资源(这些资源的颜色不同)："
}