{
    "An important feature of asset and parameter tracks is the ability to {}parent {}tracks and groups. If you drag an asset track onto another one in the track panel, the first asset becomes a {}child {}of the asset it was dropped on, which in turn becomes the {}parent{}. All parameter tracks assigned to the parent asset track will then automatically be applied to the child asset tracks, so you can have multiple sprites (for example) all using a single position asset track to move:{}The same can be done using groups. You can create a group folder by clicking the button at the bottom of the track panel and then GML Visual the asset tracks you want to be grouped together on the group folder. These assets will still retain their own parameter tracks, but you can then give additional parameter tracks to the group and all the assets in the group will be affected by these parameter tracks as well as their own individual parameter tracks.":"资源和参数轨道的一个重要特性是{}父{}轨道和组的能力。如果您将一个资源轨道拖动到轨道面板中的另一个资源轨道上，第一个资源将成为它被拖放到的资源的{}子资源{}，而这个子资源又将成为{}父资源{}。分配给父资源轨道的所有参数轨道将自动应用于子资源轨道，因此您可以使用单个位置资源轨道来移动多个精灵(例如) : {}使用组也可以完成同样的操作。您可以通过单击轨道面板底部的按钮创建一个组文件夹，然后 GML 可视化您希望在组文件夹上组合在一起的资源轨道。这些资源仍然保留它们自己的参数轨道，但是您可以为组提供额外的参数轨道，组中的所有资源都将受到这些参数轨道以及它们自己的参数轨道的影响。",
    "Both asset tracks and parameter tracks have a button to toggle track visibility {}&nbsp;and to lock the track {}. If you disable the visibility of the track, then it will not be shown when the sequence is run in a room, nor will it be shown in the sequence canvas while testing, and toggling the visibility of an asset track will also toggle the visibility of its parameter tracks. Locking a track simply means that this track will no longer be able to be edited in any way. Note that tracks that are invisible will be drawn faded on the dope sheet, while tracks that are locked will be drawn with an overlay, so you can immediately see what state each track is in:":"资源轨道和参数轨道都有一个按钮来切换轨道可见性 {} 并锁定轨道 {}。如果禁用轨道的可见性，则在房间中运行序列时不会显示该轨道，测试时也不会显示在序列画布中，切换资源轨道的可见性也会切换其参数轨道的可见性。锁定轨道只意味着该轨道将无法再以任何方式编辑。请注意，不可见的轨道将在涂料表上淡入淡出，而锁定的轨道将使用覆盖绘制，因此您可以立即看到每个轨道的状态：",
    "Clipping Masks":"剪切蒙版",
    "Each asset in the track editor can also have a set of {}parameter tracks{} added to it. These tracks are what control the various different properties (parameters) that can be modified for the track over time. The different parameters available are covered in depth in the section on \"{}Adding Parameter Tracks{}\" further down this page, but to give you an idea of what\u0027s available here is a brief list:":"轨道编辑器中的每个资源还可以添加一组{}参数轨道{}。这些轨道控制可以随时间为轨道修改的各种不同属性(参数)。在本页下面的“{}添加参数轨道{}”一节中，详细介绍了可用的不同参数，但为了让您对此处提供的参数有一个简单的了解，下面是一个简短的列表：",
    "Each asset that is added to a sequence will be given its own track, and these are listed here. If the asset track has any parameters set for it, then these will also be shown underneath as parameter tracks. You can expand or contract the parameter tracks by clicking {}&nbsp;on the arrow icon to the left of the track name, and you can edit the track name by using a slow double click {}&nbsp;on the track and then giving it the name of your choice. Note that there are no restrictions on the name you give and you can use spaces, non alpha-numeric characters and start them with a number if you wish.":"添加到序列中的每个资源都将被赋予其自己的轨道，以下列出了这些轨道。如果资源轨道设置了任何参数，则这些参数也将显示在下面的参数轨道中。您可以通过单击{}来扩展或收缩参数轨道在轨道名称左侧的箭头图标上，您可以通过缓慢双击{}编辑轨道名称在轨道上，然后给它你选择的名字。请注意，您的名字没有任何限制，如果您愿意，可以使用空格、非字母数字字符并以数字开头。",
    "Each asset track you create will be assigned a random colour by the IDE to make it easier to identify on the Dope Sheet. This colour can be changed at any time by simply clicking the colour bar for the track and then selecting the colour you want to use from the Colour Picker window that opens. Any colour selected for an asset track will automatically be applied to all the parameter tracks associated, however you can then edit the colour of each parameter track individually so it is different if required. Note that if you then change the asset track colour again, this will override any changes made to the parameter tracks.":"IDE 将为您创建的每个资源轨道指定一种随机颜色，以便于在 \" 关键帧表 \" 上进行识别。只需单击轨道的颜色栏，然后从打开的颜色选择器窗口中选择要使用的颜色，即可随时更改此颜色。为资源轨道选择的任何颜色都将自动应用于所有关联的参数轨道，但是您可以单独编辑每个参数轨道的颜色，以便根据需要进行不同。请注意，如果随后再次更改资源轨道颜色，这将覆盖对参数轨道所做的任何更改。",
    "Each event can be assigned a single function which will be called when the event is triggered. You can assign the function using the input box for the vent, and clicking the arrow button &nbsp;will open the script editor for the function to be edited. You can also click the Create New button at the bottom to create a new script resource with \"boilerplate\" functions already defined and ready to be filled in. Note that you can change the function names to anything you require and do not have to use the predefined names, and you can also remove any function definitions that you don\u0027t need. It is important note that functions used for sequence events cannot take any arguments.":"可以为每个事件分配一个函数，该函数将在事件触发时调用。您可以使用通风口的输入框并单击箭头按钮来分配功能将打开要编辑的函数的脚本编辑器。您还可以单击底部的\"新建\"按钮，创建一个新的脚本资源，其中包含已定义并准备好填充的\"样板\"函数。请注意，您可以将函数名称更改为所需的任何名称，而不必使用预定义的名称，也可以删除任何不需要的函数定义。重要的是，用于序列事件的函数不能接受任何参数。",
    "Events are added by clicking the {}Add Event{} button {}&nbsp;which will open the following window:":"通过单击{}添加事件{}按钮{}添加活动这将打开以下窗口：",
    "In a similar way to regular objects, sequences can have events that can run some code assigned to them. The code is assigned in the form of a {}scripted function{} which can take no arguments and will be called when the event is triggered.":"以与常规对象类似的方式，序列可以具有可以运行分配给它们的某些代码的事件。代码是以{}脚本函数{}的形式分配的，该函数可以不带参数，并且在事件触发时将被调用。",
    "Note that for all parameter tracks you can disable the default linear interpolation between different keys from the right mouse button {}&nbsp;menu on the parameter track, which means that transitions between parameter values will occur {}instantly {}on the given frame rather than gradually over time:":"请注意，对于所有参数轨道，您可以从参数轨道上的鼠标右键{} ；菜单禁用不同关键帧之间的默认线性插补，这意味着参数值之间的过渡将在给定帧上{}立即发生{}，而不是随着时间的推移逐渐发生：",
    "Note that some parameter tracks may have a \"link\" icon {}&nbsp;next to their values, which means they can be linked together. This is done by clicking the icon to enable/disable linking, and when enabled, editing one value will also set the other.":"请注意，某些参数轨道可能具有\"链接\"图标{}这意味着它们可以链接在一起。这是通过单击图标启用/禁用链接来完成的，启用后，编辑一个值也会设置另一个值。",
    "Once you have added a parameter track, you can add and remove parameter keys to specific frames to set the value for that parameter. This can be done using the \"{}Record Key{}\" {}&nbsp;or \"{}Delete key{}\" {}{}&nbsp;{}button (see the section on \"{}Track Key Controls{}\" for more information), or you can do it using the {}Key Controls{} on the parameter itself. To use these controls, you need to position the playhead in the Dope Sheet to the frame you want to edit, and then you can click the circular \"key\" icon on the left of the parameter track. If the frame has no key assigned to it the circle will be \"empty\" and clicking it will add a new key and allow you to edit the parameter value. If the frame has a key already, then the circle will be \"filled\" and clicking it will instead remove the key from the frame:":"添加参数轨道后，可以向特定帧添加和删除参数关键帧，以设置该参数的值。这可以使用\"{}记录关键点{}\"{}或\"{}删除关键点{}\"{}{}{}按钮（有关详细信息，请参阅\"{}轨道关键帧控件{}\"一节），也可以使用参数本身上的{}关键点控件{}来执行此操作。要使用这些控件，需要将\"关键帧表\"中的播放头定位到要编辑的帧，然后可以单击参数轨道左侧的圆形\"关键帧\"图标。如果框架没有指定关键帧，则圆将为\"空\"，单击它将添加一个新的关键帧，并允许您编辑参数值。如果框架已经有一个关键帧，那么圆圈将被\"填充\"，单击它将从框架中移除关键帧：",
    "Regardless of the method you choose, a new {}asset track{} will be made for the asset. This track is the main track for the asset in the sequence and will have a corresponding {}asset key{} track created for the asset in the Dope Sheet at the {}playhead{} position:":"无论您选择哪种方法，都将为资源创建新的{}资源轨道{}。此轨道是序列中资源的主轨道，并将在关键帧表中的{}播放头{}位置为资源创建相应的{}资源关键帧{}轨道：",
    "Sequence events can also be added and edited using code. For more information please see {}here{}.":"也可以使用代码添加和编辑序列事件。有关详细信息，请参阅{}此处{}。",
    "That\u0027s the basics of using the track editor, but below we go into a bit more detail on what each of the different sections are for and how to use them:":"这是使用轨道编辑器的基本知识，但是下面我们将更详细地介绍每个不同部分的用途以及如何使用它们:",
    "The Add Parameter {}&nbsp;button can be used to add a single parameter track to the selected asset track. As mentioned earlier on this page, parameter tracks can be of various different types depending on the asset that it is related to. Below is a list of all the different parameter tracks available and what they refer to, as well as the assets that they can be applied to:":"添加参数 {} 按钮可用于将单个参数轨道添加到所选资源轨道。如本页前面所述，参数轨道可以是各种不同的类型，具体取决于与之相关的资源。下面列出了所有可用的不同参数轨道以及它们所指的内容，以及它们可以应用的资源：",
    "The Track Panel":"轨道面板",
    "The buttons at the bottom of the track editor are the different track actions and can be used for the following purposes:":"轨道编辑器底部的按钮是不同的轨道操作，可用于以下目的：",
    "The change orientation button&nbsp;{}&nbsp;can be used to change the way the Sequence Editor displays the different sections. By default you will have the Cnavas View at the top and the Track Editor and Dopesheet at the bottom, but this can be changed by clicking the button to cycle through the different layouts, or by clicking the Options button&nbsp;{}&nbsp;to open a menu and select the layout that you want. The following layouts are available:":"更改方向按钮{}可以用于更改序列编辑器显示不同部分的方式。默认情况下，您将在顶部显示\"画布视图\"，在底部显示\"轨道编辑器\"和\"关键帧表\"，但这可以通过单击按钮在不同的布局中循环或单击\"选项\"按钮进行更改{}打开菜单并选择所需的布局。以下布局可用：",
    "The different types of parameter tracks available are explained in more detail in the section on \"{}Adding Parameter Tracks{}\" further down this page.":"在本页后面的\"{}添加参数轨道{}\"一节中更详细地解释了可用的不同类型的参数轨道。",
    "The events listed here are as follows:":"此处列出的事件如下：",
    "The keyframe control buttons are one of the ways that you can add, remove or edit specific keys in the dope sheet. The buttons are as follows:":"关键帧控制按钮是可以在关键帧表中添加、删除或编辑特定关键帧的方法之一。按钮如下：",
    "There are some additional parameters only available to Text Tracks. Please read&nbsp;{}Text in Sequences{}&nbsp;for information on them.":"有些附加参数仅适用于文本轨道。有关它们的信息请阅读{}序列文本{}。",
    "There are two further pages with information relating to tracks and parameters that are also of interest, the first is about using {}Animation Curve{} assets to generate parameter tracks, and the second outlines how to create {}Clipping Masks{}:":"还有两个页面包含与轨道和参数相关的信息，第一个页面是关于使用{}动画曲线{}资源来生成参数轨道的，第二个页面概述了如何创建{}剪切蒙版{}：",
    "This last method will open the Asset Explorer for you where you can choose the asset to add.":"最后一种方法将打开资源浏览器，您可以在其中选择要添加的资源。",
    "This option snaps the Track Editor and Dopesheet to the bottom of the IDE (this is the default view.":"该选项将\"轨道编辑器\"和\"关键帧表\"置于 IDE 的底部（这是默认视图）。",
    "This option snaps the Track Editor and Dopesheet to the left of the IDE.":"该选项将\"轨道编辑器\"和\"关键帧表\"置于 IDE 的左侧。",
    "This option snaps the Track Editor and Dopesheet to the right of the IDE.":"该选项将\"轨道编辑器\"和\"关键帧表\"置于 IDE 的右侧。",
    "This option snaps the Track Editor and Dopesheet to the top of the IDE.":"该选项将\"轨道编辑器\"和\"关键帧表\"置于 IDE 的顶部。",
    "This search box permits you to quickly search through the various tracks of the sequence to find the one you wish to edit. Typing any text here will tell you how many asset tracks have been found with that string in them, and also highlight the arrows to the side of the search box. Clicking these arrows will skip to the first and consecutive assets that fulfill the search criteria.":"此搜索框允许您快速搜索序列的各个轨道，以找到要编辑的轨道。在此处键入任何文本都会告诉您找到了多少带有该字符串的资源轨道，并突出显示搜索框一侧的箭头。单击这些箭头将跳到满足搜索条件的第一个和连续资源。",
    "To add a parameter track in the editor you can enable \"{}Automatically Record Changes{}\" {}&nbsp;in the Track Panel, which will then add parameter keys for any changes you make to an asset in the Canvas at the current playhead position, as shown here:":"要在编辑器中添加参数轨道，您可以在轨道面板中启用“{}自动记录更改{}”{} ；，这将为您在画布中当前播放头位置对资源所做的任何更改添加参数键，如下所示：",
    "Using Animation Curves":"使用动画曲线",
    "When a parameter track has been added, you can edit the values for some of them by simply setting the playhead in the Dope Sheet to the frame with the key you want to change and then use the different canvas widgets to edit the position, rotation, scale or origin of the asset. These changes will be reflected in the key value for that frame. However not all parameters can be edited this way, or it may not be precise enough for your needs, and in those cases you can edit the parameter value directly by clicking on it in the track and setting it to the required value for the parameter type.":"添加参数轨道后，只需使用要更改的关键帧将\"关键帧表\"中的播放头设置为帧，然后使用不同的画布小部件编辑资源的位置、旋转、缩放或原点，即可编辑其中一些值。这些更改将反映在该帧的关键值中。但是，并非所有参数都可以这样编辑，或者可能不够精确，无法满足您的需要，在这些情况下，您可以通过单击轨道中的参数值并将其设置为参数类型所需的值来直接编辑参数值。",
    "When working with the track panel the usual keyboard shortcuts can be used too, ie: {}&nbsp;/ {}&nbsp;and the left mouse button {}&nbsp;to select one or more tracks in any order, {}&nbsp;and the left mouse button {}&nbsp;to select consecutive tracks, and you can also&nbsp;cut, copy and paste them using the&nbsp;{}&nbsp;/ {}&nbsp;+\"{}X{}\", &nbsp;{}&nbsp;/ {}&nbsp;+ \"{}C{}\" and &nbsp;{}&nbsp;/ {} + \"{}V{}\" key combinations.":"当使用轨道面板时，也可以使用通常的键盘快捷键，例如 :{}/{} 和鼠标左键 {} 以任意顺序选择一个或多个轨道，{} 和鼠标左键 {} 来选择连续的轨道，还可以使用 {}/{}\"{}X{}\"，{}/{} 来剪切、复制和粘贴它们 \"{}C{}\" 和 {}/{}\"{}V{}\" 组合键。",
    "With this option the Sequence Editor will be split into two seperate windows, where the main IDE window will show the Canvas view in the full desktop and the new window will show the Dope Sheet and Track Editor. Clicking the button again will change the layout again and remove the extra window.":"使用此选项，序列编辑器将被拆分为两个单独的窗口，其中主 IDE 窗口将在整个桌面中显示画布视图，新窗口将显示关键帧表和轨道编辑器。再次单击该按钮将再次更改布局并删除额外的窗口。",
    "You can also reset the Sequence Editor layout at any time by clicking the Reset option&nbsp;{}. This will restore the editor to it\u0027s default state and re-open any sections that had been closed.":"您还可以随时通过单击重置选项重置序列编辑器布局{}. 这将使编辑器恢复到默认状态，并重新打开所有已关闭的部分。",
    "by clicking the \"Add Asset\" {}&nbsp;button at the bottom of the Track Panel.":"通过单击轨道面板底部的\"添加资源\"{} 按钮。",
    "dragging an asset into the Track Panel itself":"将资源拖动到轨道面板本身",
    "dragging an asset into the sequence {}Canvas{}":"将资源拖到序列{}画布{}",
    "{}&nbsp;- As you might expect, clicking this will delete the selected track(s). If this is an asset track, then all parameter tracks it contains will also be deleted, although you can use it on selected parameter tracks to delete them on their own without removing the asset tracks they are associated with. If you use this on an empty group folder then the folder will be deleted, however if there are any tracks in the folder you will be shown a warning, as deleting a folder will remove all tracks that are inside of it too.":"{}- 如您所料，单击此按钮将删除所选轨道。如果这是一个资源轨道，那么它包含的所有参数轨道也将被删除，尽管您可以在选定的参数轨道上使用它来单独删除它们，而不删除与它们关联的资源轨道。如果在空的组文件夹中使用此选项，则该文件夹将被删除，但如果文件夹中有任何轨道，则会显示警告，因为删除文件夹也会删除其中的所有轨道。",
    "{}&nbsp;- Clicking this will add a new group folder to the track editor, which can then be used to better organise tracks. You can add a track t a group by dragging the track onto the group folder and you can remove it again by dragging it out of the folder. Note that any asset that is added to a group folder will automatically be assigned the folder colour, although you can then edit the track colour for individual tracks so that it is different if required.":"{}- 单击此按钮将在轨道编辑器中添加一个新的组文件夹，然后可用于更好地组织轨道。您可以通过将轨道拖到组文件夹中来将轨道添加到组中，也可以通过将其拖出文件夹来再次将其删除。请注意，添加到组文件夹中的任何资源都将自动分配文件夹颜色，尽管您可以编辑各个轨道的轨道颜色，以便在需要时有所不同。",
    "{}&nbsp;- Clicking this will create a special {}clipping mask group{} where you can give sprites to use as masks and sprites to be masked. See {}here{} for more information.":"{}- 单击此按钮将创建一个特殊的 {} 剪切蒙版 {}，您可以在其中指定用作遮罩的精灵和要遮罩的精灵。有关详细信息，请参阅此处的 {}。",
    "{}&nbsp;- This button will open the Asset Explorer for you to pick an asset to use as a new track. Once selected the asset track will be created and frames added into the Dope Sheet at the current playhead position.":"{}- 此按钮将打开资源浏览器，以便您选择要用作新轨道的资源。选择后，将创建资源轨道，并将帧添加到当前播放头位置的 \" 关键帧表 \" 中。",
    "{}&nbsp;- This is the \"Automatically Record Changes\" button. When this is enabled, any changes made to the asset within the canvas will be automatically recorded and the appropriate parameter tracks and parameter keys added at the playhead position in the dope sheet. For example, if you move the playhead from frame 0 to frame 10 and then in the canvas move the asset 100 pixels to the right, a parameter track will be added for position, and the parameter keys will be added at frame 0 (the initial position) and at frame 10 (the playhead position) and when you press \"Play\" on the sequence, the asset will move 100px to the right over ten frames.{} {} ":"{}- 这是 \" 自动记录更改 \" 按钮。启用此选项后，将自动记录对画布中的资源所做的任何更改，并将适当的参数轨道和参数关键帧添加到关键帧表中的播放头位置。例如，如果您将播放头从第 0 帧移动到第 10 帧，然后在画布中将资源向右移动 100 像素，则将为位置添加一个参数轨道，并且将在第 0 帧（初始位置）和第 10 帧（播放头位置）添加参数关键帧，当您在序列上按 \" 播放 \" 时，资源将在 10 帧内向右移动 100 px。{} {}",
    "{}&nbsp;- This is the \"Delete selected keys\" button. When you have selected one or more parameter keys in the dope sheet, you can then click this button and they will be deleted:{} {} ":"{}- 这是 \" 删除选定关键帧 \" 按钮。当您在涂料表中选择了一个或多个参数键后，您可以单击此按钮，它们将被删除：{}{}",
    "{}&nbsp;- This is the \"Record a new key\" button. When you have selected an asset key in the dope sheet and press this button, new parameter keys will be added to the asset track as parameter tracks, and the parameter keys will be added as points in the dope sheet timeline at the playhead position:{} {} ":"{}- 这是 \" 录制新关键帧 \" 按钮。当您在关键帧表中选择了一个资源关键帧并按下此按钮后，新的参数关键帧将作为参数轨道添加到资源轨道中，并且参数关键帧将作为播放头位置的关键帧表时间线中的点添加：{}{}",
    "{}&nbsp;- This is the \"Split selected keys\" button. When you have selected one or more parameter keys in the dope sheet, you can then click this button and they will be split into two separate keys at the timeline playhead position:{} {} ":"{}- 这是 \" 分割选定关键帧 \" 按钮。当您在关键帧表中选择了一个或多个参数键后，您可以单击此按钮，它们将在时间轴播放头位置拆分为两个单独的键：{}{}",
    "{}&nbsp;- When you have selected one or more asset tracks in the track editor, clicking this button will duplicate them (along with any parameter tracks they may contain).":"{}- 在轨道编辑器中选择一个或多个资源轨道后，单击此按钮将复制它们（以及它们可能包含的任何参数轨道）。",
    "{}Adding Parameter Tracks{}{}Adding Parameter Tracks{}":"{}添加参数轨道{}{}添加参数轨道{}",
    "{}All Assets{}: {}Position {}and {}Rotation{}.":"{}所有资源{}：{}位置{}和{}旋转{}。",
    "{}Alternatively, you can click the \"{}Add Parameter Track{}\" {}&nbsp;button, which will open up a menu showing you the different options available:":"{}或者，您也可以单击“{}添加参数轨道{}”{} ；按钮，该按钮将打开一个菜单，显示可用不同选项：",
    "{}Apart from being able to choose the transition type for parameter tracks, the RMB menu also offers you the following options:":"{}除了可以选择参数轨道的过渡类型外，右键菜单还提供以下选项：",
    "{}Asset Tracks{}{}Asset Tracks{}":"{}资源追踪{}{}资源追踪{}",
    "{}Async Event{}: This is the equivalent of the object {}Asynchronous System Event{}. {}Important!{} If the sequence is paused then this event will {}not {}be triggered.":"{} 异步事件 {}：这相当于对象 {} 异步系统事件 {}。{} 重要！{} 如果序列暂停，则 {} 不会 {} 触发此事件。",
    "{}Begin Step{} / {}Step {}/ {}End Step{} - The Step Event is an event that is checked every single step (frame) of the game while the sequence instance exists, and is split into three parts: begin, step and end. For most things the standard step event will be fine to use, but sometimes you want a bit more control over what code runs and at what time, so for that you are provided with the Begin and End step events, and these events will always be triggered in the same order every step (frame) of the game. {}Important!{} If the sequence is paused then these events will {}not {}be triggered, and when play resumes they will be triggered the {}next frame after the sequence starts playing again{}. Also note that the order of events is not influenced by the playhead direction, and even if the sequence is playing backwards, the events will still be run as Begin, Step and End.":"{} 步开始 {}/{} 步 {}/}{} 步结束 {}- 步骤事件是在序列实例存在时对游戏的每一步（帧）进行检查的事件，分为三部分：开始、步骤和结束。对于大多数情况，标准步骤事件可以使用，但有时您需要对代码的运行和时间有更多的控制，因此您将获得开始和结束步骤事件，并且这些事件将始终以相同的顺序在游戏的每个步骤（帧）触发。{} 重要！{} 如果序列被暂停，那么这些事件将 {} 不会 {} 被触发，当播放恢复时，它们将在序列 {} 再次开始播放后的下一帧中 {} 被触发。还请注意，事件的顺序不受播放头方向的影响，即使顺序向后播放，事件仍将作为 \" 开始\"、\"步 \" 和 \" 结束 \" 运行。",
    "{}Change Orientation{}{}Change Orientation{}":"{}更改方向{}{}更改方向{}",
    "{}Clean Up{} - This event will be called after any event that removes an instance of the sequence from the room. So, it will be triggered if the sequence is destroyed, if the room ends, or if the game ends, and is designed to perform any task that you need performed once when the sequence instance is removed from the game for any reason. If you have destroyed the sequence instance using, for example, layer_sequence_destroy(), then this event will be called after the Destroy Event (see above).":"{} 清理 {}- 将在从文件室中删除序列实例的任何事件之后调用此事件。因此，如果序列被破坏，如果房间结束，或者游戏结束，它将被触发，并且被设计为在序列实例出于任何原因从游戏中移除时执行任何需要执行的任务。如果您使用例如 layer_sequence_destroy() 销毁了序列实例，那么将在销毁事件之后调用此事件（请参见上文）。",
    "{}Colour Multiply{}: This parameter is only available for {}sprite {}and {}object {}assets and can be used to change the current blend colour for the sprite being drawn. This is the equivalent of setting the {}image_blend{}&nbsp;value and any colours set here will be \"multiplied\" (ie, blended) with the colour of the sprite, and a value of white (#ffffffff) indicates that no blending should take place. Note that when working with this type of track, you can set the colour by manually typing in the hex value, or you can click the colour swatch to open the {}GameMaker{} Colour Picker. Note that colours are given in {}ARGB{} format, so you can set a value for alpha using this kind of parameter track (the Colour Picker also permits you to set the alpha value). This would be the equivalent of setting the {}image_alpha{}&nbsp;for the sprite.":"{} 颜色倍增{}：此参数仅适用于 {} 精灵 {} 和 {} 对象 {} 资源，可用于更改正在绘制的精灵的当前混合颜色。这相当于设置 {}image_blend{} 值和此处设置的任何颜色将与精灵的颜色 \" 相乘\"（即，混合），白色值（#ffffffff）表示不应进行混合。请注意，当使用这种类型的轨道时，您可以通过手动键入十六进制值来设置颜色，或者您可以单击色样打开 {}GameMaker{} 颜色选择器。请注意，颜色是以 {}ARGB{} 格式给出的，因此您可以使用这种参数轨道设置 alpha 值（颜色选择器也允许您设置 alpha 值）。这相当于设置 {}image_alpha{} 对于精灵。",
    "{}Create {}- This event happens when an instance of the sequence is first created, and is the very first thing that happens within a sequence placed in the room through the room editor when a room is entered.":"{} 创建 {}- 此事件发生在序列的实例首次创建时，并且是在输入文件室时通过文件室编辑器放置在文件室中的序列中发生的第一件事。",
    "{}Cut{}, {}Copy{}, and {}Paste{}: These options permit you to cut/copy/paste asset or parameter tracks.":"{}剪切{}、{}复制{}和{}粘贴{}：这些选项允许您剪切/复制/粘贴资源或参数轨道。",
    "{}Delete Track(s){}: This will delete the selected track or tracks. If you delete an asset track, then the parameter tracks associated with it will also be removed, however you can delete parameter tracks individually.":"{}删除轨道{}：这将删除选定的轨道。如果删除资源轨道，则与其关联的参数轨道也将被移除，但是您可以单独删除参数轨道。",
    "{}Destroy {}- This event is executed when an instance of the sequence is destroyed, and will be run before the Clean Up event (see below).":"{} 销毁 {}- 此事件在销毁序列的实例时执行，并将在清理事件之前运行（请参见下文）。",
    "{}Duplicate Track(s){}: This will create a duplicate of the currently selected track(s). If this is an asset track it will also duplicate the paramter tracks associated with it.":"{}复制轨道{}：这将创建当前所选轨道的副本。如果这是资源轨道，它还将复制与其关联的参数轨道。",
    "{}Events{}{}Events{}":"{}事件{}{}事件{}",
    "{}Falloff{}: The falloff parameter only applies to {}sound {}asset tracks and is currently not implemented.":"{}衰减{}：衰减参数仅适用于{}声音{}资源轨道，目前尚未实现。",
    "{}Group{}: Using this option on an empty space in the Track Panel will create a group folder which you can then use to help keep your assets in a more orderly format. You can add an asset to a group by simply clicking on it and dragging it onto the folder. If you have already selected a track or tracks, then using this option will not only create a group folder, but it will add the track(s) to it.":"{}组{} : 在轨道面板中的空白区域上使用此选项将创建一个组文件夹，然后您可以使用该文件夹来帮助将资源保持在更有序的格式中。只需单击一个资源并将其拖放到文件夹中，就可以向组中添加一个资源。如果您已经选择了一个或多个轨道，那么使用此选项不仅会创建一个组文件夹，而且还会将轨道添加到其中。",
    "{}Image Index{} and {}Image Speed{}: These parameters are only available for {}sprite {}and {}object {}assets and can be used to change the current animation frame (see the page on the {}image_index{}&nbsp;for more information) as well as the current animation speed, which is set using FPS and works the same way as the value you set for the sprite being used in the sprite editor.":"{} 图像索引 {} 和 {} 图像速度{}：这些参数仅适用于 {} 精灵 {} 和{}对象 {} 资源，可用于更改当前动画帧（有关详细信息，请参阅 {}image_index{} 上的页面）以及当前动画速度（使用 fps 设置），其工作方式与您为精灵编辑器中使用的精灵设置的值相同。",
    "{}Key Controls{}{}Key Controls{}":"{}关键点控制{}{}关键点控制{}",
    "{}Keyframe Controls{}{}Keyframe Controls{}":"{}关键帧控制{}{}关键帧控制{}",
    "{}Note that the colour of the Asset Key in the Dope Sheet can be set from the Track Panel by clicking the coloured bar at the end. This will open up the {}Colour Picker{} where you can choose which colour to use for the key tracks in the Dope Sheet.":"{}请注意，可以从轨道面板中通过单击末尾的彩色条来设置关键帧表中资源关键帧的颜色。这将打开{}拾色器{}，您可以在其中选择使用哪种颜色作为关键帧表中的关键轨道。",
    "{}Once you add a parameter track to your main asset track, the dope sheet will have a coloured bar to show the length of the asset track in frames, and there will be {}parameter keys {}(keyframes) added at the points where you want a change in the parameter to occur. These keys can be seen in the above image as simple \"dots\" on a frame. When a track has parameter keys like this, the parameter they refer to will be interpolated (using&nbsp;{}linear interpolation{}) by default between each of the points shown. For example, if you have a rotation parameter and at frame 0 it is set to 90° then at frame 30 it is 180°, then at frame 15 it will be 135°. You can actually see the change in values over time by selecting the parameter track and then \"scrubbing\" the playhead in the dope sheet:":"{} 将参数轨道添加到主资源轨道后，关键帧表将有一个彩色条来显示资源轨道的长度 (以帧为单位)，并且将在希望发生参数更改的点处添加 {} 参数关键帧 {}( 关键帧)。在上图中，这些关键帧可以看作是帧上的简单\"点\"。当轨道具有这样的参数关键帧时，默认情况下，它们引用的参数将在显示的每个点之间进行内插 (使用 {} 线性插值 {})。例如，如果您有一个旋转参数，并且在第 0 帧将其设置为 90°，则在第 30 帧将其设置为 180°，然后在第 15 帧将其设置为 135°。通过选择参数轨道，然后在关键帧表中拖动播放头，可以实际查看值随时间的变化：",
    "{}Origin{}: The origin parameter is available for {}sprite{}, {}object {}and {}sequence {}assets and can be used to set the X and Y position of the origin of the asset. Changing the origin will affect how the asset is positioned, rotated and scaled.":"{}原点{} : 原点参数可用于{}精灵{}、{}对象{}和{}序列{}资源，并可用于设置资源原点的 X 和 Y 位置。更改原点将影响资源的定位、旋转和缩放方式。",
    "{}Parameter Values{}{}Parameter Values{}":"{}参数值{}{}参数值{}",
    "{}Pitch{}: The pitch parameter only applies to {}sound {}asset tracks and can be used to set the pitch of the sound (as with volume, the actual sound asset gain won\u0027t be changed, as it\u0027s essentially an emitter that is used for the asset track in sequences). The pitch value is calculated as a percentage, 100% is the \"natural\" pitch of the sound, and less than 100% will lower it while greater than 100% will raise it.":"{} 音高{}：音高参数仅适用于 {} 声音 {} 资源音轨，可用于设置声音的音高（与音量一样，实际的声音资源增益不会改变，因为它本质上是用于资源音轨的发射器）。音高值以百分比计算，100% 是声音的\"自然\"音高，小于 100% 将降低音高，大于 100% 将提高音高。",
    "{}Position{}: This parameter track can be added to any of the four sequence asset types ({}sprites{}, {}objects{}, {}sounds {}or {}sequences{}) and is used to set the spacial position within the sequence for the asset. It takes an X and a Y value.":"{}位置{}：此参数轨道可以添加到四种序列资源类型（{}精灵{}、{}对象{}，{}声音{}或{}序列{}）中的任何一种，并用于设置资源序列中的空间位置。它采用X和Y值。",
    "{}Rename{}: You can use this option to rename any asset track or group folder.":"{}重命名{} : 可以使用此选项重命名任何资源轨道或组文件夹。",
    "{}Rotation{}: Like the position parameter, the rotation parameter is available for {}all {}sequence assets and can be used to set the rotation in degrees for the asset. Keep in mind that {}GameMaker{} calculates rotation {}anti-clockwise{}, starting with 0° on the right, so 90° is up, 180° is left and 270° is down.":"{} 旋转{}：与位置参数一样，旋转参数可用于 {} 所有 {} 序列资源，并可用于设置资源的旋转度。请记住，{}GameMaker{} 计算 {} 逆时针旋转 {}，从右侧 0°开始，因此 90°向上，180°向左，270°向下。",
    "{}Scale{}: The scale parameter is available for {}sprite{}, {}object {}and {}sequence {}assets and is used to set the horizontal and vertical scale of the asset. This will affect how the asset is rendered in the IDE and at runtime, and is calculated as a scalar value, where 100% is the default asset size, 50% would be half size, and 200% would be double the size. Note that you have the possibility of linking the horizontal and vertical scale values by clicking the \"link\" {}&nbsp;button. This means that changing one value will automatically change the other too.":"{} 比例{}：比例参数可用于 {} 精灵 {}、{} 对象 {} 和 {} 序列 {} 资源，用于设置资源的水平和垂直比例。这将影响资源在 IDE 中和运行时的呈现方式，并以标量值计算，其中 100% 是默认资源大小，50% 是一半大小，200% 是两倍大小。请注意，您可以通过单击 \" 链接 \"{} 链接水平和垂直比例值按钮这意味着更改一个值也会自动更改另一个值。",
    "{}Selecting any option from this menu, or recording directly from the IDE, will create one or more parameter tracks underneath the main asset track, and also add a {}parameter key{} to the Dope Sheet, coloured the same as the main asset track colour:":"{} 从此菜单中选择任何选项，或直接从 IDE 录制，将在主资源轨道下创建一个或多个参数轨道，还会向关键帧表添加一个 {} 参数键 {}，颜色与主资源轨道颜色相同：",
    "{}Sequences{}: {}Origin {}and {}Scale{}.":"{}序列{}：{}原点{}和{}标度{}。",
    "{}Snap Bottom{}":"{}置于底部{}",
    "{}Snap Left{}":"{}置于左侧{}",
    "{}Snap Right{}":"{}置于右侧{}",
    "{}Snap Top{}":"{}置于顶部{}",
    "{}Sounds{}: {}Pitch {}and {}Volume{}.":"{}声音{}：{}音高{}和{}音量{}。",
    "{}Split Window{}":"{}拆分窗口{}",
    "{}Sprites and Objects{}: {}Origin{}, {}Scale{}, {}Image Index{}, {}Image Speed{}, and {}Colour Multiply{}.":"{}精灵和对象{}：{}原点{}、{}比例{}、{}图像索引{}、{}图像速度{}和{}色彩倍增{}。",
    "{}Text{}: {}Origin, Scale, Colour Multiply, Character Spacing, Frame Size, Line Spacing, and Paragraph Spacing.{}":"{}文本{}：{}原点、比例、颜色倍增、字符间距、边框大小、行距和段落间距。{}",
    "{}Track Actions{}{}Track Actions{}":"{}轨道操作{}{}轨道操作{}",
    "{}Track Colour{}{}Track Colour{}":"{}轨道颜色{}{}轨道颜色{}",
    "{}Track Search{}{}Track Search{}":"{}轨道搜索{}{}轨道搜索{}",
    "{}Visible / Lock Toggles{}{}Visible / Lock Toggles{}":"{}可见/锁定开关{}{}可见/锁定开关{}",
    "{}Volume{}: The volume parameter only applies to {}sound {}asset tracks and can be used to set the gain of the sound (the actual sound asset gain won\u0027t be changed, as it\u0027s essentially an emitter that is used for the asset track in sequences). The volume value is calculated as a percentage, where 0% is no volume and 100% is full volume.":"{} 音量{}：音量参数仅适用于 {} 声音 {} 资源音轨，可用于设置声音的增益（实际的声音资源增益不会改变，因为它本质上是一个发射器，用于资源音轨的序列）。体积值以百分比计算，其中 0% 为无音量，100% 为满音量。",
    "{}What your sequences do are governed by the assets and parameters that have been added to the {}Track Panel{}. You can add a track to the editor by either:":"{}您的序列操作由已添加到{}轨道面板{}的资源和参数控制。您可以通过以下任一方式将轨道添加到编辑器：",
    "{}You\u0027ll notice too that in the image above you can use the arrow buttons on either side of the parameter key marker to quickly skip between key frames in the dope sheet too, without having to position the playhead manually.":"{}您也会注意到，在上面的图像中，您可以使用参数关键帧标记两侧的箭头按钮快速跳过关键帧表中的关键帧，而无需手动定位播放头。"
}