{
    "Asset tracks are represented on the dope sheet as \"keys\", which are coloured bars representing the position of the asset and the length of time it\u0027s active in the sequence. As mentioned above these can be moved around and lengthened and shortened as required. Note that an asset track key that is longer than the asset itself in duration - for example a sound might last 5 frames and you stretch its key to 15 frames - will be repeated for the entire duration of its key. Asset tracks and keys can be copied and pasted using the standard keyboard shortcuts or further modified using the right mouse button {}&nbsp;menu options (explained further down this page).":"资源轨道在关键帧表上表示为关键帧，这些关键点是彩色条形图，表示资源的位置和它在序列中处于活动状态的时间长度。如上所述，它们可以根据需要四处移动、加长和缩短。请注意，在持续时间上比资源本身长的资源轨道关键点-例如，声音可能持续5帧，而您将其关键点拉伸到15帧-将在其关键点的整个持续时间内重复。可以使用标准键盘快捷键复制和粘贴资源轨道和关键点，也可以使用鼠标右键{} ；菜单选项进一步修改资源轨道和关键点(本页下面将对此进行说明)。",
    "Clicking the right mouse button {}&nbsp;within the dope sheet on a {}parameter track{} will bring up the following menu options (note some options may not be visible depending on whether the part of the track clicked has a key frame or not and whether the track is using keyframes or parameter curves):":"在{}参数轨道{}上的关键帧表中单击鼠标右键{0} ；将调出以下菜单选项(请注意，某些选项可能不可见，具体取决于所单击的轨道部分是否包含关键帧，以及轨道是否使用关键帧或参数曲线)：",
    "Clicking the right mouse button {}&nbsp;within the dope sheet on an {}asset track{} will bring up the following menu options (note some options may not be visible depending on whether the part of the track clicked has a key or not):":"在{}资源轨道{}上的关键帧表中单击鼠标右键{0} 将调出以下菜单选项(请注意，某些选项可能不可见，具体取决于所单击的轨道部分是否有关键点)：",
    "If you delete an asset track key, this does not delete the track itself, nor does it delete any track parameters that have been added, it simply deletes the asset key from the dope sheet. If there are no further keys for this track, you can re-add them by dragging an asset from the Asset Browser into the dope sheet and it will be added as a new key, but note that you cannot add an asset that is distinct to the original asset (ie: if you delete&nbsp;a key for a sprite, you cannot then add a sound asset into that key position).":"如果删除资源轨道关键点，则不会删除轨道本身，也不会删除已添加的任何轨道参数，而只是从关键帧表中删除资源关键点。如果此轨道没有其他关键点，则可以通过将资源从资源浏览器拖动到关键帧表中来重新添加它们，它将作为新关键点添加，但请注意，您不能添加与原始资源不同的资源(即：如果删除精灵的关键点，则无法将声音资源添加到该关键点位置)。",
    "Note that any object tracks&nbsp;in a Sequence will have their instances&nbsp;created as soon as the Sequence element is created in a room, regardless of where their asset keys begin on the track. The Sequence controller simply toggles the {}visibility{} of the instance to hide and show it depending on the position and duration of the track\u0027s asset key and does {}not {}repeatedly create&nbsp;and destroy it. As a result, instances will run their Create events when the sequence element is created and not when their&nbsp;asset keys begin.":"请注意，在房间中创建序列元素后，序列中的任何对象轨道都将立即创建其实例，而不考虑其资源关键点在轨道上的开始位置。序列控制器只需切换实例的{}可见性{}，以根据轨道的资源关键点的位置和持续时间隐藏和显示它，而{}不会{}重复创建和销毁它。因此，实例将在创建序列元素时运行它们的创建事件，而不是在它们的 ；资源键开始时运行。",
    "Note too that you can zoom the dope sheet in or out using the {}&nbsp;/ {}&nbsp;key and the mouse wheel {}.":"还请注意，您可以使用{} /{} 键和鼠标滚轮{}来放大或缩小关键帧表。",
    "Parameter keys are the \"points\" shown on a parameter track wherever a change in that parameter has occurred. These points can be moved as required and expanded so that they last more than one frame (as explained further up this page), and you can edit their value either from the {}Track Panel{}, or by changing the asset on the {}canvas{} (if it is a scale, position or rotation parameter). Note that all parameter track keys will also be reflected as a point on the {}asset key {}track that the parameter belongs to, but these points cannot be edited and are there as an informational aid when you have collapsed the different parameter tracks in the track panel.{}":"参数关键点是在参数发生更改的位置显示在参数轨道上的点。这些点可以根据需要进行移动和扩展，以使其持续一个以上的帧(如本页后面所述)，您可以从{}轨道面板{}编辑它们的值，也可以通过更改{}画布{}上的资源(如果它是比例、位置或旋转参数)来编辑它们的值。请注意，所有参数轨道关键点也将反映为参数所属的{}资源关键点{}轨道上的一个点，但这些点不能编辑，当您在轨道面板中折叠不同的参数轨道时，这些点作为信息辅助存在。{}",
    "Parameter tracks are represented on the dope sheet as coloured bars underneath the main asset track they belong to. The bars of colour themselves cannot be edited and are purely a visual representation of the track that the parameter keys are being applied to, and it\u0027s the individial points on the parameter track that are edited (see {}Parameter Keys{}, below).":"参数轨道在关键帧表上表示为它们所属的主资源轨道下方的彩色条。颜色条本身不能编辑，它纯粹是参数关键点所应用到的轨道的视觉表示，编辑的是参数轨道上的各个点(请参阅下面的{}参数关键点{})。",
    "RMB Menu":"右键菜单",
    "That\u0027s the basics of using the dope sheet, but below we go into a bit more detail on what each of the different sections are for and how to use them:":"这是使用关键帧表的基础，但下面我们将更详细地介绍每个不同部分的用途以及如何使用它们：",
    "The dope sheet also permits you to use {}paremeter&nbsp;{}{}curves&nbsp;{}instead of keyframes in your parameter tracks to change the parameter values. These curves can either be&nbsp;{}embedded{}&nbsp;as part of the sequence asset, or can be external {}animation curve{} assets that are applied to a parameter track. See the section on {}{}Using Animation Curves{}{} for more information.":"关键帧表还允许您使用参数轨道中的{}参数{}{}曲线{}而不是关键帧来更改参数值。这些曲线既可以{}嵌入{}为序列资源的一部分，也可以是应用于参数轨道的外部{}动画曲线{}资源。有关详细信息，请参阅{}{}使用动画曲线{}{}部分。",
    "The playhead is the position in time at which the timeline is currently being previewed. This position is used when dropping assets into the {}Sequence Canvas{} to set the position where they have been added as well as a number of other things, like adding parameters, or splitting keys. When you press \"play\" on the sequence editor canvas, the playhead will move through the sequence, and you can also click {}&nbsp;on it and drag it to move to a specific frame within the sequence or to \"scrub\" over multiple frames and get a quick preview without playing the whole thing.":"播放头是当前预览时间轴的时间位置。此位置用于将资源拖放到{}序列画布{}中，以设置添加它们的位置以及许多其他操作，如添加参数或拆分关键点。当你在序列编辑器画布上按“播放”时，播放头将在序列中移动，你也可以在它上面点击{}并拖动它以移动到序列中的特定帧或在多个帧上“移动”并获得快速预览，而不是播放整个画面。",
    "There are also different options for keys available from the right mouse button {}&nbsp;menu, which are detailed below. Note that when pasting keys into the dope sheet using these commands, the keys will be pasted at the {}current {}position of the playhead.":"从鼠标右键菜单{}中也可以选择不同的按键选项，具体如下。请注意，使用这些命令将关键点粘贴到关键帧表中时，关键点将粘贴在播放头的{}当前{}位置。",
    "These markers are the {}clip region{} start and end points. These can be used to set a specific section of the sequence to be shown in the room when the game is run, and will also be used as the loop points when previewing the sequence in the editor. These points cannot be greater or less than the total sequence length as set in the Sequence Editor {}Sequence Controls{}. To change the position of a clip region marker, simply click {}&nbsp;and drag them to the desired frame.":"这些标记是{}剪辑区域{}起点和终点。它们可以用来设置游戏运行时要在房间中显示的序列的特定部分，也可以在编辑器中预览序列时用作循环点。这些点不能大于或小于序列编辑器中设置的总序列长度{}序列控制{}。要更改剪辑区域标记的位置，只需单击{} 并将其拖动到所需的帧。",
    "This bar is used to show the current zoom of the dope sheet and it can also be used to change this zoom level. You can click {}&nbsp;on the end widgets and then drag to change the level of zoom:":"此栏用于显示关键帧表的当前缩放，也可用于更改此缩放级别。您可以单击终端小工具上的{} ，然后拖动以更改缩放级别：",
    "Using The Dope Sheet":"使用关键帧表",
    "When you add a new asset to a sequence, an {}asset track{} will be created in the Track Panel and an {}asset key{}&nbsp;will be added to the dope sheet at the current {}playhead{} position. This key will reflect the play length of the asset in frames:":"将新资源添加到序列中时，将在轨道面板中创建一个{}资源轨道{}，并将一个{}资源关键点{} 添加到关键帧表的当前{}播放头{}位置。该关键点将以帧为单位反映资源的播放长度：",
    "{}Add Key In Place{}: This will add a new asset key to the asset track at the frame position nearest where the mouse was clicked,&nbsp;and {}not {}at the playhead position.":"{}在此添加关键点{}：这将在离鼠标单击位置最近的帧位置向资源轨道添加新的资源关键点，而{}不是{}在播放头位置添加新的资源关键点。",
    "{}Add Key In Place{}: This will add a new parameter key to the parameter track at the frame position nearest where the mouse was clicked,&nbsp;and {}not {}at the playhead position.":"{}在此添加关键点{}：这将在离鼠标单击最近的帧位置向参数轨道添加一个新的参数关键点，而{}不是{}在播放头位置添加一个新的参数关键点。",
    "{}Asset Tracks{}{}Asset Tracks{}":"{}资源轨道{}{}资源轨道{}",
    "{}Convert To Embedded Anim Curve{}: This option will convert all the keyframes for the selected parameter track(s) into an embedded animation curve&nbsp;(see the section on {}Using Animation Curves{} for more&nbsp;information). Alternatively, if used on a parameter curve that uses an Animation Curve asset, this will copy the curve asset into the track as an embedded parameter curve.":"{}转换为嵌入动画曲线{}：此选项会将所选参数轨道的所有关键帧转换为嵌入动画曲线(有关详细信息，请参阅{}使用动画曲线{}一节)。或者，如果在使用动画曲线资源的参数曲线上使用，则会将曲线资源作为嵌入的参数曲线复制到轨道中。",
    "{}Convert To Keys{}: With this option you can convert an animation curve to individual keyframes. Note that if the curve has used {}catmull-rom interpolation{} this will be lost and the keyframes will use {}linear interpolation{} between the points on the curve instead, and also note that keys generated from an animation curve {}must fall on a frame{}. This means that any curve with points that are between frames will be placed at the nearest integer frame value when converted into keys, potentially changing the behaviour of the curve.":"{} 转换为关键帧 {}：使用此选项可以将动画曲线转换为单个关键帧。请注意，如果曲线使用了 {}Catmull-rom 插值法 {}，这将丢失，并且关键帧将使用曲线上的点之间的 {} 线性插值法 {}，还请注意，从动画曲线生成的关键点必须落在帧 {} 上。这意味着，任何点在帧之间的曲线在转换为关键点时将被放置在最接近的整数帧值，这可能会更改曲线的行为。",
    "{}Copy To End{}: This option will copy the selected key(s) to the very end of the sequence ({}not {}the end of the clip region).":"{}复制到终点{}：此选项将所选关键点复制到序列的最末端(而不是剪辑区域的终点处)。",
    "{}Copy To End{}: This option will copy the selected keyframe(s) to the very end of the sequence ({}not {}the end of the clip region).":"{}复制到终点{}：此选项会将选定的关键帧复制到序列的末尾(而不是剪辑区域的终点处)。",
    "{}Copy To Start{}: This option will copy the selected key(s) to the very start of the sequence ({}not {}the start of the clip region).":"{}复制到起始点{}：此选项将所选关键点复制到序列的最开始处(而不是剪辑区域的起始处)。",
    "{}Copy To Start{}: This option will copy the selected keyframe(s) to the very start of the sequence ({}not {}the start of the clip region).":"{}复制到起始点{}：此选项将所选关键帧复制到序列的最开始处(而不是剪辑区域的起始处)。",
    "{}Cut{}, {}Copy{}, and {}Paste key(s){}: These options permit you to cut/copy/paste asset. Note that any keys pasted into the dope sheet using these options will be pasted at the position of the playhead.":"{}剪切{}、{}复制{}和{}粘贴关键点{}：这些选项允许您剪切/复制/粘贴资源。请注意，使用这些选项粘贴到关键帧表中的任何关键点都将粘贴在播放头的位置。",
    "{}Cut{}, {}Copy{}, and {}Paste key(s){}: These options permit you to cut/copy/paste parameter keys. Note that any keys pasted into the dope sheet using these options will be pasted at the position of the playhead.":"{}剪切{}、{}复制{}和{}粘贴关键点{}：这些选项允许您剪切/复制/粘贴参数键。请注意，使用这些选项粘贴到关键帧表中的任何关键点都将粘贴在播放头的位置。",
    "{}Delete Asset Key{}: When you use this, the asset key selected will be deleted and you can then add a new asset to the track by dragging it from the asset browser onto the dope sheet track that was deleted. This will create a new asset key which can then be edited, while maintaining any parameter tracks associated with the asset.":"{}删除资源关键点{}：使用此选项时，选定的资源关键点将被删除，然后可以通过将新资源从资源浏览器拖动到已删除的关键帧表轨道来将其添加到轨道。这将创建一个新的资源密钥，然后可以对其进行编辑，同时保留与该资源相关联的任何参数轨道。",
    "{}Delete Key(s){}: Selecting this will be delete the currently selected key or keys.":"{}删除关键点{}：选择此项将删除当前选定的一个或多个关键点。",
    "{}Delete Key(s){}: Selecting this will be delete the currently selected keyframe or keyframes.":"{}删除关键帧{}：选择此项将删除当前选定的一个或多个关键帧。",
    "{}Delete Parameter Key{}: When you use this, the parameter keyframe(s) selected will be deleted.":"{}删除参数关键点{}：使用此选项时，将删除所选的参数关键帧。",
    "{}Export Embedded Anim Curve{}: This option lets you take an embedded animation curve and convert it into an {}Animation Curve asset{}, which will be shown in the Asset Browser and can then be used elsewhere.":"{}导出嵌入的动画曲线{}：该选项允许您获取嵌入的动画曲线并将其转换为{}动画曲线资源{}，该资源将显示在资源浏览器中，然后可以在其他地方使用。",
    "{}Open Editor{}: This will open the dope sheet curve editor for editing embedded or external animation curves that have been applies to the paramter track. This is the same as using the&nbsp;{}Toggle Curve Mode{}&nbsp;{}&nbsp;button on the dope sheet.":"{}打开编辑器{}：这将打开关键帧表曲线编辑器，用于编辑已应用于参数轨道的嵌入或外部动画曲线。这与使用关键帧表上的{}切换曲线模式{} {} 按钮相同。",
    "{}Other than asset keys, the dope sheet will also show {}parameter key{} {}s{}. Parameter keys are initially \"points\" in time where you signal a change to a property for the asset they are related to, and the sequence will use the value for that point to change the asset. How this is done will depend on whether you have set the keys to {}linear interpolation{}&nbsp;or not in the {}Track Panel{}. Parameter keys, like track keys, can be moved by clicking {}&nbsp;and dragging them along the timeline to a new position, and you can also extend the key to more than a single frame using the {}&nbsp;key at the same time as dragging (the cursor will change to show this). This means that you can hold key values over time before continuing with any interpolation to the next key:":"{}除资源键外，关键帧表还将显示{}参数键{}{}{}。参数键最初是时间点，您在该时间点发出信号表示与其相关的资源的属性发生更改，序列将使用该点的值来更改资源。如何执行此操作将取决于您是否已在{}轨道面板{}中将关键点设置为{}线性插值{} 。与轨道关键点一样，可以通过单击{} 并将其沿时间轴拖动到新位置来移动参数关键点，您也可以在拖动的同时使用{} 键将关键点扩展到多个帧(光标将更改以显示此信息)。这意味着在继续对下一个关键点进行任何插补之前，可以随时间保持关键点的值：",
    "{}Parameter Curves{}{}Parameter Curves{}":"{}参数曲线{}{}参数曲线{}",
    "{}Parameter Keys{}{}Parameter Keys{}":"{}参数关键点{}{}参数关键点{}",
    "{}Parameter Tracks{}{}Parameter Tracks{}":"{}参数轨道{}{}参数轨道{}",
    "{}Paste Key(s) In Place{}: When you use this option, the copied or cut key(s) will be pasted at the frame position nearest where the right mouse button was clicked, and {}not {}at the playhead position.":"{}在此粘贴关键点{}：使用此选项时，复制或剪切的关键点将粘贴到离鼠标右键单击最近的帧位置，而{}不是{}粘贴在播放头位置。",
    "{}Paste Key(s) In Place{}: When you use this option, the copied or cut keyframe(s) will be pasted at the position where the right mouse button was clicked, and not at the playhead position.":"{}在此粘贴关键点{}：使用此选项时，复制或剪切的关键帧将粘贴到单击鼠标右键的位置，而不是播放头位置。",
    "{}Region Start / Region End{}{}Region Start / Region End{}":"{}区域开始/区域结束{}{}区域开始/区域结束{}",
    "{}Set To External Anim Curve{}: This option permits you to assign an Animation Curve asset to the parameter track (see the section on {}Using Animation Curves{}&nbsp;for more information).":"{}设置为外部动画曲线{}：该选项允许您将动画曲线资源指定给参数轨道(有关详细信息，请参阅{}使用动画曲线{} 一节)。",
    "{}Split Key In Place{}: When used, this will split the asset key under the mouse into two keys, with the split being created at the nearest frame to where the mouse was clicked, and&nbsp;{}not{}&nbsp;at the playhead position.":"{}在此拆分关键点{}：使用时，这会将鼠标下的资源关键点拆分为两个关键点，拆分在距离鼠标单击位置最近的帧创建，而{}不是{}在播放头位置创建。",
    "{}Split Key In Place{}: When used, this will split the parameter key under the mouse into two keyframes, with the split being created at the nearest frame to where the mouse was clicked, and&nbsp;{}not{}&nbsp;at the playhead position.":"{}在此拆分关键点{}：使用时，这会将鼠标下的参数关键点拆分为两个关键帧，拆分在距离鼠标单击位置最近的帧上创建，而{}不是{}在播放头位置创建。",
    "{}Stretch Asset Key{}: When you select this, the asset key selected will be stretched to the end of the sequence (not the end of the clip region), or stretched until the it meets the start of another asset key on the same track.":"{}拉伸资源关键点{}：选择此选项后，选定的资源关键点将被拉伸到序列的末尾(而不是剪辑区域的末尾)，或被拉伸到与同一轨道上另一个资源关键点的起点相交。",
    "{}Stretch Parameter Key{}: When you select this, the asset key selected will be stretched to the end of the sequence (not the end of the clip region) or until the next keyframe on the track. A stretched parameter key means that it will maintain it\u0027s value for as many frames as it\u0027s stretched over. If used on a parameter curve, the curve will be stretched to the end of the sequence, or until it meets another curve on the track.":"{}拉伸参数关键点{}：选择此选项后，选定的资源关键点将被拉伸到序列的末尾(而不是剪辑区域的末尾)或直到轨道上的下一个关键帧。拉伸的参数关键点意味着它将在拉伸的所有帧中保持其值。如果在参数曲线上使用，该曲线将被拉伸到序列的末尾，或直到它与轨道上的另一条曲线相遇。",
    "{}The Playhead{}{}The Playhead{}":"{}播放头{}{}播放头{}",
    "{}The asset key itself can then be edited by moving the mouse to either the start or the end of the key frame and when the cursor changes clicking {}&nbsp;and dragging. This will either move the start of the key or the end of the key, depending on which you have selected, but both will affect the length of the key. Note that you can also change an asset key position by simply clicking {}&nbsp;anywhere on it and dragging left or right:":"{}然后可以通过将鼠标移动到关键帧的开始或结束位置，并在光标发生变化时，单击{}并拖动来编辑资源键本身。这将移动关键点的开始或结束，具体取决于您选择的关键点，但两者都会影响关键点的长度。请注意，您还可以通过在资源关键点上的任意位置单击{}并向左或向右拖动来更改该位置：",
    "{}The {}Dope Sheet {}is where the data from the different tracks added to the sequence is displayed over time, giving you not just an overview of each track, but also a means to edit the position of them as well as the timings for changes in parameters, etc...":"{}{}关键帧表{}是一段时间内显示添加到序列中的不同轨道的数据的地方，它不仅为您提供了每个轨道的概述，还提供了编辑它们的位置以及参数更改的时间等的方法。。。",
    "{}When working with the dope sheet the usual keyboard shortcuts can be used too, ie: {}&nbsp;/ {}&nbsp;and the left mouse button {}&nbsp;to select one or more tracks in any order, {}&nbsp;and the left mouse button {}&nbsp;to select consecutive tracks, and you can also&nbsp;cut, copy and paste them using the&nbsp;{}&nbsp;/ {}&nbsp;+\"{}X{}\", &nbsp;{}&nbsp;/ {}&nbsp;+ \"{}C{}\" and &nbsp;{}&nbsp;/ {} + \"{}V{}\" key combinations.":"{}在处理关键帧表时，也可以使用常用的键盘快捷键，即：{} /{} 和鼠标左键{} 以任意顺序选择一个或多个轨道，使用{}和鼠标左键{} 选择连续的轨道，还可以使用 {} /{} \"{}X{}\"， {} /{} 剪切、复制和粘贴它们。\"{}C{}\"和 {} /{}\"{}V{}\"组合键。",
    "{}Zoom Controls{}{}Zoom Controls{}":"{}缩放控件{}{}缩放控件{}"
}