{
    "An important feature of the {}dope sheet{} is the ability to assign {}Animation Curves{} to parameter tracks within the sequence to create {}parameter curves{}&nbsp;instead of parameter keyframes. There are two types of curves that can be used for parameter tracks:":"{}关键帧表{}的一个重要功能是能够将{}动画曲线{}指定给序列中的参数轨道，以创建{}参数曲线{}而不是参数关键帧。有两种类型的曲线可用于参数轨道：",
    "Below is a list of the different parameter tracks and the channels that they will require in each curve asset (channels should be added in the order given for each parameter type):":"以下列出了不同的参数轨道及其在每个曲线资源中所需的通道（应按每个参数类型的给定顺序添加通道）：",
    "By default, the animation curve will be applied along the entire length of the asset key it is attached to, however, much like with keyframes, you can click {}&nbsp;on a curve and drag it to re-position it on the timeline, and you can also hold down the&nbsp;{}&nbsp;key and and drag to resize the length of the curve (this also applies to {}embedded curves{}):":"默认情况下，动画曲线将沿其附加到的资源关键帧的整个长度应用，但是，与关键帧非常类似，您可以单击{}在曲线上拖动它以在时间线上重新定位，您还可以按住{}按住键并拖动以调整曲线的长度（这也适用于{}嵌入的曲线{}）：",
    "Changing these values will change the way the data is represented in the Channel Editor section, permitting you to have higher/lower values along the channel curve than just -1 to 1.&nbsp;Note that this is purely visual and does not clamp the values for the channel.":"更改这些值将更改 \"通道编辑器\" 部分中数据的表示方式，从而允许您在通道曲线上具有比 -1 到 1 更高 / 更低的值请注意，这是纯视觉的，不会钳制通道的值。",
    "Here keyframes can be converted into parameter curves (as explained fiurther up this page) but there is also a button to convert parameter curves into keyframes. However, you should be aware that when doing this there are a couple of caveats.&nbsp;Keyframes cannot be \"between\" frames, and so some curve values will need to be rounded to the nearest frame, which in turn will change the way the parameter track behaves. Also, if the parameter curve uses catmull-rom or bezier interpolation, {}this will be lost {}and the interpolation between keyframes will be set to&nbsp;linear interpolation.":"这里可以将关键帧转换为参数曲线（如本页后面所述），但也有一个将参数曲线转换为关键帧的按钮。然而，您应该意识到，在执行此操作时，需要注意几点&nbsp关键帧不能在帧之间，因此某些曲线值需要舍入到最近的帧，这反过来会改变参数轨道的行为方式。此外，如果参数曲线使用 catmull-rom 或 bezier 插值，{}这将丢失{}并且关键帧之间的插值将设置为线性插值。",
    "If you import an animation curve that does not have enough channels for the parameter track, you will be prompted to choose whether any missing channels should&nbsp;be added into the animation curve:":"如果导入的动画曲线没有足够的通道用于参数轨道，则系统将提示您选择是否应删除任何缺失的通道；添加到动画曲线中：",
    "Once you are finished editing the parameter curves you can go back to the regular dope sheet view of the different tracks by clicking on the&nbsp;the&nbsp;{}Toggle Curve Mode{}&nbsp;{}&nbsp;button.":"编辑完参数曲线后，您可以通过单击 {}切换曲线模式{} {} 按钮返回到不同轨道的常规关键帧表视图。",
    "Shared curves can also be made invalid if any required channels are deleted in an external animation curve editor. In such a case the shared curve will appear as invalid in the dope sheet, and you can click on \"Add Channel(s)\" to create any missing channels&nbsp;which will make the curve valid again:":"如果在外部动画曲线编辑器中删除了任何所需的通道，则共享曲线也可能无效。在这种情况下，共享曲线将在涂料表中显示为无效，您可以单击\"添加通道\"以创建任何缺失的通道这将使曲线再次有效：",
    "The Channel Editor shows a visual representation of the different channels used in the parameter curve. By default, all channels will be shown here, but you can only edit the channel currently selected from the Channel List, which will be highlighted in the editor. You can change the position of any of the points along the channel curve by clicking {}&nbsp;on them and dragging them around within the editor, but&nbsp;note that the first and last point can only be changed along the vertical axis and their horizontal value will always be 0 and 1 respectively.":"通道编辑器显示参数曲线中使用的不同通道的直观表示。默认情况下，此处将显示所有频道，但您只能编辑当前从频道列表中选择的频道，该频道将在编辑器中突出显示。您可以更改通道曲线上任何点的位置，方法是单击这些点上的{} 并在编辑器中四处拖动它们，但请注意，第一个点和最后一个点只能沿垂直轴更改，它们的水平值始终分别为 0 和 1。",
    "The Channel Range button is used for setting the visual vertical range for the Channel Editor. By default this will be set from -1 to 1, but clicking this button will open the following window:":"\"通道范围\" 按钮用于设置通道编辑器的视觉垂直范围。默认情况下，此值将从 -1 设置为 1，但单击此按钮将打开以下窗口：",
    "The channel list is where you can edit the different channels that comprise your parameter curve. Each channel must have a unique name (using {}alphanumeric characters and the \"_\" underscore symbol only{}), and you can also set the colour for the channel by double clicking {}&nbsp;on the colour swatch to the left, which will open the colour picker to let you choose a new colour. To rename the channel, you can do a slow double click {}&nbsp;and rename, and you can also use the right mouse button {} to open a menu where you can choose to rename, change the colour or copy the channel. Channels can be expanded by clicking the arrow beside the name to show each of the points on the channel curve, and these points can be edited manually by clicking the current value and typing in the new value.&nbsp;You can also toggle the channel visibility in the dope sheet by clicking on the \"eye\" icon {}.":"在通道列表中，您可以编辑组成参数曲线的不同通道。每个通道必须有一个唯一的名称(使用{}字母数字字符和\"_\"下划线符号{})，您也可以通过双击左侧色样上的{} 来设置通道的颜色，这将打开颜色选择器，让您选择一种新的颜色。要重命名频道，您可以缓慢地双击{}，然后重命名，您也可以使用鼠标右键{}打开一个菜单，从中可以选择重命名、更改颜色或复制频道。可以通过单击名称旁边的箭头来展开通道，以显示通道曲线上的每个点，并且可以通过单击当前值并输入新值来手动编辑这些点。 您还可以通过单击\"眼睛\"图标{}来切换关键帧表中的通道可见性。",
    "The image above shows how the embedded animation curve editor looks, and it\u0027s very similar to&nbsp;the {}Animation Curve Editor{}. Expand each section below for more information on the different sections.":"上图显示了嵌入式动画曲线编辑器的外观，它与{}动画曲线编辑器{}。展开下面的每个部分，了解有关不同部分的更多信息。",
    "The&nbsp;{}&nbsp;button opens&nbsp;the&nbsp;{}{}Animation Curve Library{}{}&nbsp;window, which allows you to change the Curve Type of the embedded or shared curve, and apply a preset to the selected channel.":"使用 {} 按钮可以打开 {}{}动画曲线库{}{} 窗口，该窗口允许您更改嵌入或共享曲线的曲线类型，并将预设应用到所选通道。",
    "This menu contains options available elsewhere in the editor, but all in one place. The options are:":"此菜单包含编辑器中其他位置可用的选项，但都在一个位置。选项包括：",
    "This will be the name of the external animation curve asset or the name of the parameter track for an embedded curve.":"这将是外部动画曲线资源的名称或嵌入曲线的参数轨道的名称。",
    "Using Animation Curves":"使用动画曲线",
    "We\u0027ll start by explaining how to use an Animation Curve asset, which is&nbsp;simply a case of creating a new curve, setting up the channels in the Animation Curve Editor, and then dragging the curve asset into the dope sheet to apply it to a parameter track:":"我们将首先解释如何使用动画曲线资源简单地说，创建一条新曲线，在\"动画曲线编辑器\"中设置通道，然后将曲线资源拖动到关键帧表中以将其应用于参数轨道：",
    "You can also use the right mouse button {}&nbsp;menu option {}Assign Shared Curve (Import){}{}&nbsp;{}to add an animation curve asset to the selected parameter track. This will open the Asset Explorer where you can select the required curve from the ones presented to you:":"您还可以使用鼠标右键{}菜单选项{}分配共享曲线（导入）{}{}{}将动画曲线资源添加到选定的参数轨道。这将打开资源浏览器，您可以在其中从呈现给您的曲线中选择所需的曲线：",
    "You can edit multiple points at once by clicking {}&nbsp;and dragging within the editor to select all the points you want to edit or by using {}&nbsp;/ {}&nbsp;+ {}&nbsp;to add points to the selection individually. Releasing the mouse button and then clicking again on any of the points in the selection and dragging will move them all together:":"您可以一次编辑多个点，方法是单击{} 并在编辑器内拖动以选择要编辑的所有点，或使用{}/{} + {}将点逐个添加到所选内容中。松开鼠标按钮，然后再次单击选择中的任意点并拖动，将把它们全部移动到一起：",
    "{}Assigned Shared Curve (Import){}: Assign an Animation Curve asset to be used as a shared curve for the parameter track.":"{}分配的共享曲线（导入）{}：分配要用作参数轨道共享曲线的动画曲线资源。",
    "{}Channel Editor{}{}Channel Editor{}":"{}通道编辑器{}{}通道编辑器{}",
    "{}Channel List{}{}Channel List{}":"{}频道列表{}{}频道列表{}",
    "{}Channel Range{}{}Channel Range{}":"{}通道范围{}{}通道范围{}",
    "{}Colour Multiply{}: 4 channels, Alpha, Red, Green and Blue, and the range&nbsp;{}must{}&nbsp;be between 0 and 255.":"{}色彩倍增{}：4个通道，Alpha、红色、绿色和蓝色，以及范围{}必须{}介于0和255之间。",
    "{}Conversion Control{}{}Conversion Control{}":"{}转换控件{}{}转换控件{}",
    "{}Convert To Curve{}: Convert the selected parameter track using keyframes into a parameter curve.":"{}转换为曲线{}：使用关键帧将选定的参数轨道转换为参数曲线。",
    "{}Convert To Keys{}: Convert the selected parameter track using parameter curves into keyframes.":"{}转换为关键帧{}：使用参数曲线将选定的参数轨道转换为关键点。",
    "{}Curve Library{}{}Curve Library{}":"{}曲线库{}{}曲线库{}",
    "{}Curve Menu{}{}Curve Menu{}":"{}曲线菜单{}{}曲线菜单{}",
    "{}Curve Name{}{}Curve Name{}":"{}曲线名称{}{}曲线名称{}",
    "{}Embed Curve{}: Embed the shared curve asset being used by the parameter track&nbsp;into the track.":"{}嵌入曲线{}：嵌入参数轨道所使用的共享曲线资源进入轨道。",
    "{}Embedded Curves{}: These are curves that are embedded in the sequence and are unique to the parameter track they are used on.":"{}嵌入曲线{}：这些是嵌入在序列中的曲线，对于使用它们的参数轨道是唯一的。",
    "{}Export to Shared Curve{}: Convert the embedded curve into a shared curve asset.":"{}导出到共享曲线{}：将嵌入曲线转换为共享曲线资源。",
    "{}IMPORTANT{}: You can also edit animation curve assets that have been applied to parameter tracks in this way, however any changes you make&nbsp;{}will be applied to all tracks that use the animation curve{}, as you are editing the curve asset and not a single copy of it. To edit an animation curve asset that has been applied to a track&nbsp;{}only{}&nbsp;on that track, you must first use the right mouse menu&nbsp;{}&nbsp;on the parameter track and select {}Embed Curve{}. This will duplicate the animation curve asset and embed it in the pararmeter track as an independent curve only for that track. Conversely, you can convert an embedded animation curve into an Animation Curve asset using the right mouse button {}&nbsp;menu option {}Export To Shared Curve{}. This will convert the embedded curve into a new asset which can then be edited as normal as well as applied to other parameter tracks if required.":"{}重要{}：您还可以编辑以这种方式应用于参数轨道的动画曲线资源，但是您所做的任何更改{}将应用于使用动画曲线{}的所有轨道，因为您正在编辑曲线资源，而不是其单个副本。编辑已应用于轨道的动画曲线资源{}仅{}在该轨道上，必须首先使用鼠标右键菜单{}在参数轨道上选择{}嵌入曲线{}。这将复制动画曲线资源，并将其作为仅用于该轨道的独立曲线嵌入到参数轨道中。相反，您可以使用鼠标右键{}将嵌入的动画曲线转换为动画曲线资源菜单选项{}导出到共享曲线{}。这将将嵌入的曲线转换为一个新的资源，然后可以正常编辑该资源，并在需要时应用于其他参数轨道。",
    "{}Image Index{}: 1 channel.":"{}图像索引{}：1个频道。",
    "{}Image Speed{}: 1 channel.":"{}图像速度{}：1通道。",
    "{}It is important&nbsp;to note that the animation curve asset&nbsp;{}must have the correct number of channels for the track it is being applied to{}, as each type of parameter track will require a different number of channels in the animation curve. Any animation curves that do not have enough channels will be shown with a&nbsp;{} indicator in the asset browser.":"{}这很重要请注意，动画曲线资源{}必须为其应用到的轨道具有正确数量的通道{}，因为每种类型的参数轨道都需要动画曲线中不同数量的通道。任何没有足够通道的动画曲线将显示为{}指示器。",
    "{}Note that opening the {}Animation Curve Library{} window through the Channel Editor will have the {}\"Between\"{} Apply Mode selected by default.":"{}请注意，通过通道编辑器打开{}动画曲线库{}窗口时，默认情况下会选择{}\"介于\"{}应用模式。",
    "{}Once you have converted the parameter keyframe track to a curve it can be edited within the dope sheet, exactly the same way that you can edit {}animation curve assets{}, this includes adding or removing points, changing their position, changing the curve type (linear, smooth or bezier), applying presets, and renaming channels and the colours associated with them.":"{}将参数关键帧轨道转换为曲线后，可以在关键帧表中对其进行编辑，与编辑{}动画曲线资源{}的方式完全相同，这包括添加或删除点、更改其位置、更改曲线类型（线性、平滑或贝塞尔）、应用预设以及重命名通道及其关联的颜色。",
    "{}Origin{}: 2 channels, X and Y.":"{}原点{}：2个通道，X和Y。",
    "{}Pitch{}: 1 channel, which&nbsp;{}must{}&nbsp;be a minimum of 0, where 1 is the default pitch of the sound.":"{}音高{}：1个通道{}必须{}最小值为0，其中1是声音的默认音高。",
    "{}Position{}: 2 channels, X and Y.":"{}位置{}：2个通道，X和Y。",
    "{}Rotation{}: 1 channel.":"{}旋转{}：1个通道。",
    "{}Scale{}: 2 channels, X scale and Y scale, and note that the value is a multiplier, so the base value is 1 (no scale) and greater than one will make the image bigger, and less than 1 will make it smaller. Negative values will flip or mirror the image as well as apply scale.":"{}比例{}：2个通道，X比例和Y比例，请注意，该值是一个乘数，因此基本值为1（无比例），大于1将使图像变大，小于1将使其变小。负值将翻转或镜像图像以及应用缩放。",
    "{}See the section on {}Animation Curve Library{} for information on Curve Types and Presets.&nbsp;Note that opening the window through the&nbsp;{}&nbsp;button will have the {}\"Overwrite\"{} Apply Mode selected by default.":"{}有关曲线类型和预设的信息，请参阅{}动画曲线库{}一节。 请注意，通过 {} 按钮打开窗口时，默认情况下会选择{}\"覆盖\"{}应用模式。",
    "{}Set Range{}: Set the vertical range&nbsp;of the parameter curve (see {}Channel Range{}, below).":"{}设置范围{}：设置垂直范围（请参见下面的{}通道范围{}）。",
    "{}Shared Curves{}: These are curves that are created independently of the sequence using the {}Animation Curve Editor{}.":"{}共享曲线{}：这些曲线是使用{}动画曲线编辑器{}独立于序列创建的曲线。",
    "{}The other way to add a parameter curve to a track is to embed it. This can be done by either clicking the right mouse button {}&nbsp;on the parameter track and selecting \"{}Convert to Curve{}\", or by clicking on the&nbsp;{}Toggle Curve Mode{}&nbsp;{}&nbsp;button, which will show you the track as an animation curve in the full dope sheet area, and you can then click the {}Convert To Curve{}&nbsp;button:":"{}将参数曲线添加到轨道的另一种方法是嵌入它。这可以通过单击鼠标右键{}来完成在参数轨道上选择\"{}转换为曲线{}\"，或单击{}切换曲线模式{}{}按钮，它将在完整的关键帧表区域中将轨道显示为动画曲线，然后您可以单击{}转换为曲线{}按钮：",
    "{}Volume{}: 1 channel, which {}must {}be a minimum of 0 and a maximum of 1.":"{}音量{}：1个通道，其中{}必须{}为最小值0，最大值1。",
    "{}You can&nbsp;{} right-click anywhere in the Channel Editor to open the {}Animation Curve Library{} window (only when the selected Curve Type is {}Bezier{}).&nbsp;Applying a preset in this way will affect the whole channel. To modify only a part of the channel, you can {}&nbsp;right-click on an individual line to apply a preset to it, or select multiple lines by clicking&nbsp;{}&nbsp;and dragging, then {}&nbsp;right-click&nbsp;on the selection to apply a preset to the selected lines.":"{}您可以 {}在通道编辑器中的任意位置右击以打开{}动画曲线库{}窗口(仅当选定的曲线类型为{}贝塞尔曲线{}时)。 以这种方式应用预设将影响整个通道。要仅修改频道的一部分，您可以{} 右击单个行以对其应用预设，或通过单击 {} 并拖动来选择多个行，然后{} 在所选内容上右击 以将预设应用于选定行。"
}