{
    "Audio Groups":"音频组",
    "Audio Groups are also linked to the {}Configurations{} settings. When you select a configuration, you can then open the Audio Groups window and select the export targets from the right hand side for that configuration, and then changing configurations will change these output targets. Note that you cannot set sound resources to different groups on a per-configuration basis, only the export target for the given group.":"音频组也链接到{}配置{}设置。当您选择一个配置时，您可以打开音频组窗口，并从该配置的右侧选择导出目标，然后更改配置将更改这些输出目标。注意，不能根据每个配置为不同的组设置健全的资源，只能设置给定组的导出目标。",
    "Once you have a sound added to a custom audio group then you can use this window to selectively choose which platform to export that sound to. It may be that by default you have all your sounds at the highest quality, but that for HTML5 (for example) you want to use a lower quality sound file set to use less memory. In that case you add the lower quality files to {}GameMaker{} and then assign them to a new audio group. You would then select that audio group from the drop down menu and set it to export {}only {}to HTML5, and remove the HTML5 export from the higher quality audio group export options. It is important to note that you cannot change the export options for the \"default\" audio group and that it will always be exported to all available platforms when you build a final game package.":"将声音添加到自定义音频组后，可以使用此窗口有选择地选择将该声音导出到哪个平台。默认情况下，你可能拥有最高质量的所有声音，但是对于 HTML5(例如) ，你想使用一个低质量的声音文件集来使用更少的内存。在这种情况下，您将较低质量的文件添加到{}GameMaker{} ，然后将它们分配给一个新的音频组。然后从下拉菜单中选择该音频组，并将其设置为{}{}仅导出到 HTML5，并从高质量音频组导出选项中删除 HTML5导出。需要注意的是，您不能更改“默认”音频组的导出选项，并且在构建最终游戏包时，它将始终导出到所有可用平台。",
    "Once you have defined audio groups and assigned sounds to them you can see them in the list on the left when you select the group. There will always be a \"default\" audio group available and all the sounds that are within this group will always be included in the game package for all platforms and they will all be loaded into memory on start-up (unless flagged as \"streamed\" in the Sound Editor properties), but when you create a custom audio group, the files that are added to it {}will not be loaded into memory{} until you call the function {}{}audio_group_load(){}{}. In this way you can control what audio is resident in memory at any time. Note too that for all the {}audio group functions{}, you will need to supply the audio group ID value. This is simply the name that you have given the audio group.":"一旦您定义了音频组并为它们分配了声音，当您选择该组时，您可以在左边的列表中看到它们。总是有一个“默认”音频组可用，并且这个组中的所有声音将总是包含在所有平台的游戏包中，并且它们将在启动时全部加载到内存中(除非在声音编辑器属性中标记为“流”) ，但是当您创建一个自定义音频组时，添加到其中的文件{}将不会加载到内存中{} ，直到您调用函数{}{}audio_group_load(){}{}。通过这种方式，您可以随时控制哪些音频驻留在内存中。还要注意，对于所有{}音频组函数{} ，您将需要提供音频组 ID 值。这仅仅是您给音频组的名称。",
    "To add a sound to an audio group, you need to open the {}Sound Editor{} for that sound and then select the group from the option you will find there, or alternatively you can add assets to an audio group via the right mouse button {}&nbsp;menu in the {}Asset Browser{}. You can select one or more sound assets (or an entire asset group folder) and then use the RMB menu to add the sounds to any group. You can also click the&nbsp;{}Add Resource{}&nbsp;button at the bottom of the Audio Group Editor to add assets that way.":"要向音频组添加声音，您需要打开该声音的{}声音编辑器{} ，然后从您将在那里找到的选项中选择该组，或者您也可以通过在{}资源浏览器{}中的鼠标右键{2}菜单向音频组添加资源。您可以选择一个或多个声音资源(或整个资源组文件夹) ，然后使用RMB菜单将声音添加到任何组。还可以单击音频组编辑器底部的{} AddResource{}按钮来添加资源。",
    "To define an audio group you need to click {}&nbsp;on the {}Add New{} button which will create new group that you can then name. To change group, click {}&nbsp;on the drop-down menu and select the one you wish to edit.":"要定义音频组，您需要单击{}{}Add New按钮{}，该按钮将创建新组，然后可以命名该组。若要更改组，请在下拉菜单上单击{}并选择要编辑的组。",
    "{}NOTE{}: If you select streamed audio for a sound in the {}Sound Editor{}, you will not be able to assign the sound to an Audio Group as streamed sounds are not packaged in the same way as other sounds and you have full control over when they are loaded, played and unloaded using code.":"{}注意{}: 如果您在{}声音编辑器{}中为声音选择了流式声音，您将无法将声音分配给音频组，因为流式声音的打包方式与其他声音不同，您可以完全控制何时使用代码加载、播放和卸载它们。",
    "{}The {}Audio Group Manager{} is available from the {}Tools Menu{} in the IDE. Here you can {}add{}, {}delete {}and {}rename {}{}Audio Groups{}, as well as set their platform export options. {}GameMaker{} permits you to assign each of the audio resources (sound effects and music) to different audio groups to try and optimise the number of sounds that are being played at any one time, as well as give you further control over what platforms they are exported to.":"{}{}音频组管理器{}可从 IDE 中的{}工具菜单{}获得。您可以在这里{}添加{}、{}删除{}和{}重命名{}{}音频组{} ，以及设置它们的平台导出选项。{} GameMaker {}允许您将每个音频资源(音效和音乐)分配给不同的音频组，以尝试和优化在任何时候播放的声音数量，并让您进一步控制它们被导出到哪个平台。"
}