{
    "Build the projects through the IDE for the targets required, to make sure that they work fine":"通过IDE为所需目标构建项目，以确保它们工作正常",
    "Building via Command Line":"通过命令行构建",
    "Create a batch file that will do the build that you require within the task (test this from the command line)":"创建一个批处理文件，该文件将执行任务中所需的生成（从命令行测试）",
    "Here are the options that you can use while running the {}Igor {}executable:":"以下是运行{}Igor{}可执行文件时可以使用的选项：",
    "Hook the batch file into the CI task and test within the Jenkins environment":"将批处理文件挂接到CI任务并在Jenkins环境中进行测试",
    "Igor CI Building":"Igor 持续集成构建",
    "In addition to building your project through the IDE,&nbsp;{}GameMaker{}&nbsp;allows you to build your projects through a command-line interface using the many options and commands described below. You can use this to build your project, test it and deploy it to multiple platforms by running one batch file, and to set up continuous integration through an automation server such as {}Jenkins{}.":"{}GameMaker{}除了通过IDE{}构建项目外，还允许您使用下面介绍的许多选项和命令通过命令行界面构建项目。您可以通过运行一个批处理文件来生成项目、测试项目并将其部署到多个平台，以及通过自动化服务器（如{}Jenkins{}）设置连续集成。",
    "Install {}GameMaker{} and the runtimes needed":"安装{}GameMaker{}和所需的运行时",
    "Notes":"注意",
    "Options":"选项",
    "Set up a CI environment (this depends on how you are going to build your games); we suggest using {}Jenkins{}":"设置CI环境（这取决于您打算如何构建游戏）；我们建议使用{}Jenkins{}",
    "Set up your CI task&nbsp;and ensure that all the prerequisites are setup (i.e. source control sync to your project)":"设置您的CI任务并确保已设置所有先决条件(即源代码管理与项目同步)",
    "Setting Up":"设置",
    "Some platforms (notably Android) will automatically&nbsp;{}subst{} a drive while building, so you may need to manually clean this up in the event of an error":"有些平台（特别是安卓）会在构建时自动{}subst{}一个驱动器，所以你可能需要在出现错误时手动清理。",
    "Some platforms may have issues with the length of your file paths, in which case you will need to {}{}subst{}{}&nbsp;virtual drives on your PC (like the IDE does) before passing them into your commands":"某些平台可能会遇到文件路径长度问题，在这种情况下，您需要在PC上通过{}{}subst{}{}命令创建虚拟驱动器（如IDE所做的），然后才能将它们传递到您的命令中",
    "Test building from the command line (see examples below)":"从命令行进行构建测试（请参见下面的示例）",
    "The cache directory to use (defaults to {}\\cache{}&nbsp;in the current directory)":"要使用的缓存目录(默认为当前目录中的{}\\cache{})",
    "The full path to the project\u0027s {}.yyp{} file":"*{}.yyp{}文件的完整路径",
    "The root folder of the runtime":"Runtime的根目录",
    "The temporary directory to use (defaults to {}c:\\temp{})":"要使用的临时目录(默认为{}c:\\temp{})",
    "The user folder used for retrieving licence information\n            {}\n            {}\n            On Windows, this will be:&nbsp;{}{}%appdata%\\GameMaker\\&lt;user_name&gt;_&lt;number&gt;{}{}\n            {}\n            On macOS, this will be:&nbsp;{}{}~/.config/GameMaker/&lt;user_name&gt;_&lt;number&gt;{}{} ":"用于检索许可证信息的用户文件夹\n{}\n{}\n在Windows上，这将是：{}{}%appdata%\\GameMaker\\&lt;user_name&gt;_&lt;number&gt;{}{}\n{}\n在MacOS上，这将是：{}{}~/.config/GameMaker/&lt;user_name&gt;_&lt;number&gt;{}{} ",
    "This is done by running the {}Igor.exe{} executable present within your runtime folder and passing in the options and commands listed on this page. On Windows this will be present in the&nbsp;{}C:\\ProgramData\\GameMaker\\Cache\\runtimes\\runtime-[version]\\bin{}&nbsp;folder and on Mac under {}/Users/Shared/GameMaker/Cache/runtimes/runtime-[version]/bin{}.":"这是通过运行Runtime文件夹中存在的{}Igor.exe{}可执行文件并输入此页上列出的选项和命令来完成的。在Windows上，该文件在 {}C:\\ProgramData\\GameMaker\\Cache\\runtimes\\runtime-[版本号]\\bin{}文件夹和Mac上的{}/Users/Shared/GameMaker/Cache/runtimes/runtime-[版本号]/bin{}下。",
    "To set up CI&nbsp;building on a machine, you will need to do the following:":"要在计算机上设置CI构建，需要执行以下操作：",
    "{}GameMaker{}除了通过IDE{}构建项目外，还允许您使用下面介绍的许多选项和命令通过命令行界面构建项目。您可以通过运行一个批处理文件来生成项目、测试项目并将其部署到多个平台，以及通过自动化服务器（如{}Jenkins{}）设置连续集成。":"GameMaker{}除了通过IDE{}构建项目外，还允许您使用下面介绍的许多选项和命令通过命令行界面构建项目。您可以通过运行一个批处理文件来生成项目、测试项目并将其部署到多个平台，以及通过自动化服务器（如{}Jenkins{}）设置连续集成。",
    "{}{}NOTE{}{}&nbsp;Building executable packages via command line is only&nbsp;available on specific licences, so please look at {}this page{} to find out whether your licence supports that. For all other licences, you can run and debug your project through a command line without any restrictions.":"{}{}注意{}{}通过命令行生成可执行文件包仅在特定许可证上可用，因此请查看{}此页面{}以了解您的许可证是否支持此操作。对于所有其他许可证，您可以通过命令行运行和调试项目，而不受任何限制。",
    "某些平台可能会遇到文件路径长度问题，在这种情况下，您需要在PC上通过{}{}subst{}{}命令创建虚拟驱动器（如IDE所做的），然后才能将它们传递到您的命令中":"某些平台可能会遇到文件路径长度问题，在这种情况下，您需要在PC上通过{}{}subst{}{}命令创建虚拟驱动器（如IDE所做的），然后才能将它们传递到您的命令中"
}