{
    "Command Line Parameters":"命令行参数",
    "For further information on how to debug your game, please see the section of the manual on {}Debugging{}.":"有关如何调试游戏的详细信息，请参阅{}调试{}手册部分。",
    "It\u0027s worth noting that the {}&lt;{}filename{}&gt;{} in {}-output{} and {}-debugoutput{} can be the same one if desired, as the file is opened and closed on each write.":"值得注意的是，如果需要，{}-output{}和{}-debugoutput{}中的{0}<{1}filename{2}>{3}可以是相同的，因为在每次写入时都会打开和关闭该文件。",
    "Note that the runtime_version folder will depend on the runtimes you have installed currently. You will also need the path to the {}&lt;{}yourgame{}&gt;.win{} file, as this is what we are going to point the runner to. The easiest way to find this is to go to the {}Temp {}folder (typically located at {}%localappdata%\\Temp\\GameMakerStudio\\&lt;game_name&gt;\\{}) and just search for {}*.win{}, as that will show you all those available and you can simply pick that which you need to get the full path from.":"注意，runtime_version文件夹将取决于您当前安装的运行时。你还需要{}<{}yourgame{}>.Win{} 的路径文件，因为这是我们要将运行程序指向的对象。找到它的最简单的方法是进入{}Temp{}文件夹(通常位于{}%localappdata%\\Temp\\GameMakerStudio\\<game_name>\\{})，然后搜索 {}*.Win {}，因为它会显示所有可用的选项，你可以简单地选择你需要获得完整路径的选项。",
    "Now, create another text file and add the same line, only this time you point it to the path for the second version of the game that you want to do side-by-side testing with, and you would save this as \"{}GM_Test_2.bat{}\". You can double click {}&nbsp;either of them to bring up the different versions of your game, and having them as batch files means that you can easily open them again to edit them and change the game being tested.":"现在，创建另一个文本文件并添加同样的行，只是这次你要将其指向你想要进行并行测试的游戏的第二个版本的路径，你可以将其保存为“{}GM_Test_2.bat{}”。你可以双击{}它们中的任何一个来显示你的游戏的不同版本，将它们作为批处理文件意味着你可以很容易地再次打开它们来编辑它们并修改测试的游戏。",
    "Now, we could create a shortcut to the runner like we did for the executable, and then change the parameters as necessary, but that means having to open and edit it between tests, which defeats the purpose of our using this functionality for side-by-side testing. Instead we are going to create a couple of tiny \"batch\" files to handle this.":"现在，我们可以创建到运行器的快捷方式，就像为可执行文件所做的那样，然后根据需要更改参数，但这意味着必须在测试之间打开并编辑它，这违背了我们将此功能用于并行测试的目的。相反，我们将创建几个小的“批处理”文件来处理这个问题。",
    "Once you have made your shortcut you can then use any of the following parameters in the target path:":"一旦你制定了快捷方式，你就可以在目标路径中使用下列任何一个参数:",
    "The YoYo runner also benefits from a special command line parameter:":"YoYo运行器还得益于一个特殊的命令行参数:",
    "This will now create a file called \"{}debug.txt{}\" in the same location as the executable (not the shortcut location, but where the game is installed) with debug and compiler information from your finished game. Click on \"OK\" and then use the shortcut to run your game to have it use these parameters and help with your debugging.":"现在将在可执行文件的相同位置(不是快捷方式位置，而是安装游戏的位置)创建一个名为“{}debug.txt{}”的文件，其中包含完成的游戏的调试和编译信息。点击“确定”，然后使用快捷方式运行您的游戏，让它使用这些参数帮助您的调试。",
    "To do this, first create a new text document on your desktop and open it in Notepad (or any other text editor). Add the following: {} {} ":"为此，首先在桌面上创建一个新的文本文档，并在记事本(或任何其他文本编辑器)中打开它。添加以下内容: {} {} ",
    "To get this working you must first create a Windows executable of your game and have it installed on your test machine. Once you have that done, you need to create a {}Shortcut {}to the game on the desktop. This is where we will add in the parameters to be passed to the {}*.exe{} (to create a shortcut, right click {}&nbsp;the game executable and then select {}Send to{} &gt; {}Desktop (create shortcut){}) .":"要让这个工作，你必须首先创建一个 Windows 可执行文件的游戏，并有它安装在您的测试机。一旦你这样做了，你需要创建一个{}快捷方式{}到桌面上的游戏。在这里，我们将添加要传递给{}*.exe{}的参数(要创建快捷方式，请右击{}游戏可执行文件，然后选择{}发送到{} > {}桌面(创建快捷方式){})。",
    "To set this up, you will need to know a couple of things beforehand. To start with you will need the path to the Runner itself. This can be found in the {}Program Data{} folder of your Windows OS (this may be hidden by default so you will need to change the viewing properties to see it), with a typical format like this: {} {} ":"要设置这个，你需要事先知道几件事。首先，你需要找到通往运行器的路径。这可以在你的Windows操作系统的{}Program Data{}文件夹中找到(这可能在默认情况下是隐藏的，所以你需要改变查看属性来查看它)，典型的格式如下: {} {} ",
    "When creating games it is important that you play test the executable file to make sure that the final compile is correct and has no unforeseen errors or differences. However creating an executable means that, since you have no access to the debug console&nbsp;nor to the compiler window, it can be difficult to pin down and debug any problems that you may find. However there is a fix for this, and that is to use {}command line parameters{} to set certain properties when the executable version of the game is run, in turn permitting you to create output log files and test other special situations.":"在创建游戏时，一定要测试可执行文件，以确保最终编译是正确的，没有不可预见的错误或差异。但是，创建可执行文件意味着，由于无法访问调试控制台或编译器窗口，因此很难确定和调试可能发现的任何问题。但是有一个解决办法，那就是在游戏的可执行版本运行时，使用{}命令行参数{}来设置某些属性，从而允许您创建输出日志文件并测试其他特殊情况。",
    "Why would you use this? Well, normally you wouldn\u0027t, but if you wish to have more than one version of your game running at a time it can be done using this, making A/B comparative tests far easier. With this method you could focus test with someone else or, as the designer, get a better feel for things by doing side-by-side tests.":"你为什么要用这个?通常情况下你是不会这么做的，但如果你希望同时运行多个版本的游戏，你便可以使用这一方法，让 A/B 比较测试变得更加简单。使用这种方法，你可以和其他人一起进行重点测试，或者作为设计师，通过并行测试来获得更好的感觉。",
    "You need to to set the temp path to point to your game {}*.win{} file, and then save this as \"{}GM_Test_1.bat{}\" to your desktop (be aware that Notepad will save automatically as a {}*.txt{} file unless you choose \"all files\" from the save dialogue options). An example of how your final command should look would be: {} ":"你需要设置临时路径指向你的游戏{} *.win{}文件，然后将其保存为“{}GM_Test_1.bat{}”到您的桌面(注意记事本将自动保存为{}*.txt{}文件，除非您从保存对话框选项中选择“所有文件”)。最后的命令应该是这样的: {} ",
    "You should now go to where you created the shortcut to the game executable, and then right click on it and select Properties.":"您现在应该到创建游戏可执行文件快捷方式的位置，然后右键单击它并选择“属性”。",
    "{}-debugoutput &lt;{}filename{}&gt;{}: Sends console output to the filename, excluding any custom debug messages, but including extra information from the runner for bug reporting.":"{}-debugoutput <{}filename{}>{} : 将控制台输出发送到文件名，不包括任何自定义调试消息，但包括来自运行程序的用于 bug 报告的额外信息。",
    "{}-game &lt;{}filename{}&gt;{}: loads the given game file {} ":"{}-game &lt;{}filename{}&gt;{}: 加载给定的游戏文件 {} ",
    "{}-inawindow{}: Forces the game to start in a window, even when set to run in fullscreen mode.":"{}-inawindow{} : 强制游戏在窗口中启动，即使设置为在全屏模式下运行也是如此。",
    "{}-intel{}: This will switch on a fix for bad Intel drivers, no matter what GPU is being used. This work around for those bad drivers will slow things down, giving a noticeable performance hit for your game, so if you do not need the fix do not use it.":"{}-intel{} : 无论使用什么 GPU，都会打开对糟糕的 Intel 驱动程序的修复程序。这些垃圾驱动程序会拖累你的游戏，给你的游戏一个明显的性能打击，所以如果你不需要修复不使用它。",
    "{}-noaudio{}: This switches off all audio in your game.":"{}-noaudio {} : 这会关闭游戏中的所有音频。",
    "{}-output &lt;{}filename{}&gt;{}: Sends console output to the filename, including any debug messages that you have in your code base.":"{}-output <{}filename{}> {} : 将控制台输出发送到文件名，包括代码基中的所有调试消息。",
    "{}-software{}: Will force the game to use Software Vertex Processing instead of hardware for rendering the game graphics. This is especially useful for those PCs that are using an on-board Intel GFX chipset or show display issues on older machines.":"{}-software{} : 将强制游戏使用软件顶点处理代替硬件来呈现游戏图形。这对于那些使用英特尔 GFX 芯片组或显示老机器上显示问题的 PC 尤其有用。",
    "{}-vanillaGFX{}: Using this switches off any check for driver manufacturer, and can be very useful for testing your game \"as is\".":"{}-vanillaGFX{} : 关闭驱动程序制造商的任何检查，可以非常有用的测试您的游戏。",
    "{}A/B Testing Using The Command Line{}{}A/B Testing Using The Command Line{}":"{}使用命令行进行A/B测试{}{}使用命令行进行A/B测试{}",
    "{}This will open a window similar to the one above. Here you can add into the {}Target{} path your command line. Simply scroll along to the end of the given path, add a space, and then the parameter string. So, for example, to create a debug file output you would have something like:":"{}这将打开一个类似于上面的窗口。在这里，您可以将命令行添加到{}目标{}路径中。只需向前滚动到给定路径的末尾，添加一个空格，然后添加参数字符串。因此，例如，要创建一个调试文件输出，您需要这样的东西:",
    "{}{}NOTE{}{}&nbsp;This is available on the standard {}Windows {}target module {}only{}.":"{}{}注意{}{}这{6}仅能{7}在标准{}Windows{}目标模块上可用。"
}