{
    "Configurations":"配置",
    "Due to the demands of cross platform development and the need for one product to be available and customised for different clients or devices or platforms, {}GameMaker{} includes {}configurations{} to make things simpler. Using this system, you can quickly switch between different splash screens, icons and included files and test or export only those that are relevant to the target platform or client at any time, all from the same base code.":"由于跨平台开发的需求以及为不同的客户端、设备或平台提供和定制一个产品的需求，{}GameMaker{}的{}配置{}使事情变得更简单。使用这个系统，您可以在不同的启动画面、图标和包含的文件之间快速切换，并且在任何时候只测试或导出那些与目标平台或客户机相关的文件，所有这些都来自相同的基本代码。",
    "Further configurations can be added as either children of the default configuration, or children of the user defined configurations that you\u0027ve created, depending on which configuration has been highlighted in the editor when you created it. In the example image below, you can see we have three custom configs defined, two of which are children of the default config, and another that is the child of a user defined config:":"进一步的配置可以作为默认配置的子配置添加，也可以作为已创建的用户定义配置的子配置添加，这取决于您在创建配置时在编辑器中突出显示了哪个配置。在下面的示例图像中，您可以看到我们定义了三个自定义配置，其中两个是默认配置的子配置，另一个是用户定义配置的子配置:",
    "Once you have set a configuration to be used in this way, any time you compile to a target, either for testing or to create a final asset package, the chosen configuration will be used. For more information on the Targets Window, please see the section on {}Compiling{}.":"一旦您设置了以这种方式使用的配置，无论何时您编译到目标，无论是为了测试还是为了创建最终的资源包，所选择的配置都将被使用。有关“目标”窗口的详细信息，请参阅{}编译{}一节。",
    "Once you have set up the default configuration, you can then add a new one to the Configuration Editor by right clicking {}&nbsp;on the configurations folder and selecting {}Add Config{}, or by clicking the \"{}Create{}\" button at the bottom of the window. The new configuration will be shown as a \"child\" of the default config - all user defined configurations are children of the default - and you can give it an appropriate name.":"一旦设置了默认配置，您就可以通过右键单击{}配置文件夹并选择{} Add Config {} ，或者单击窗口底部的“{} Create {}”按钮，向配置编辑器添加一个新配置。新配置将显示为默认配置的“子配置”-所有用户定义的配置都是默认配置的子配置-您可以给它一个适当的名称。",
    "To be able to deal with the different demands from clients and platforms you can use the {}Configuration Editor{} which is accessible from the {}Extras {}menu on the {}Asset Browser{}:":"若要能够处理来自客户端和平台的不同需求，您可以使用{}配置编辑器{} ，该编辑器可从{}资源浏览器{}上的{}附加菜单{}访问:",
    "To edit the config, you must either double click {}&nbsp;on it or use the right mouse button {}&nbsp;menu option \"{}Set Config{}\", which will select the configuration in the editor and once that has been done, you can go ahead and customise it. This is done by simply going through the options listed above and changing them to the desired settings for the newly created configuration. {}GameMaker{} will store these values automatically for the config, and you can change between configs at any time by simply using the RMB {}&nbsp;menu option or double clicking {}.":"要编辑配置，您必须双击{}它，或者使用鼠标右键{}菜单选项“{} Set Config {}”，它将在编辑器中选择配置，完成之后，您可以继续并自定义它。这是通过浏览上面列出的选项并将它们更改为新创建的配置所需的设置来完成的。{} GameMaker {}将自动为配置存储这些值，您可以随时通过使用RMB{}菜单选项或双击{}在配置之间进行更改。",
    "You can use any given configuration with any given target platform when compiling or testing your projects. This is done by selecting the config you require from within the {}Config{}&nbsp;section of the {}Target Manager{}:":"在编译或测试项目时，您可以在任何给定的目标平台上使用任何给定的配置。这可以通过从{}目标管理器{}的{}配置{}部分中选择所需的配置来完成：",
    "{}A child configuration will inherit values for&nbsp;{}Macros{} that are set for its parent configuration (whichever closest parent has a macro override assigned). See:&nbsp;{}Configuration Override{}":"{}A子配置将继承为其父配置(最接近的父配置已分配宏覆盖)设置的{}宏{}的值。请参阅：{}配置文件{}",
    "{}All games made in {}GameMaker{} start with a \"Default\" configuration, which is listed in the editor when you first open it:":"{}{}GameMaker{} 中制作的所有游戏都以一个“默认”配置开始，当你第一次打开它时，编辑器中会列出这个配置:",
    "{}All games made in {}GameMaker{} start with a \"default\" configuration, which is listed in the editor when you first open it:":"{}GameMaker{}中制作的所有游戏都以一个“默认”配置开始，当你第一次打开它时，编辑器中会列出这个配置:",
    "{}Audio Group Manager{}: The sounds that are assigned to the different audio groups is configurable here..":"{}音频组管理器{}: 分配给不同音频组的声音在这里是可配置的。",
    "{}Audio Group Manager{}: The sounds that are assigned to the different audio groups is confiugurable here..":"{}音频组管理器{}: 分配给不同音频组的声音在这里是可配置的。",
    "{}Configurations{}":"{}配置{}",
    "{}Extension Options{}: Set the various \"Copy to...\" fields to the required platforms for the configuration. Any \"Proxy\" files created here will have their \"Target\" platform linked to the configuration too.":"{}扩展选项{}: 将各种“复制到...”字段设置为配置所需的平台。这里创建的任何“代理”文件都将其“目标”平台链接到配置。",
    "{}Font Editor{}: Set the texture group that you want the fonts to be added to.":"{}字体编辑器{}: 设置要添加字体的纹理组。",
    "{}Included Files{}: Set the \"Copy to...\" field to the required platforms for the configuration.":"{}包含文件{}: 将“复制到...”字段设置为配置所需的平台。",
    "{}It is worth noting that you can use any given configuration with any given target platform when compiling or testing your projects. This is done by selecting the config you require from within the {}Config{}&nbsp;section of the {}Target Manager{}:":"{}值得注意的是，在编译或测试项目时，您可以将任何给定的配置与任何给定的目标平台一起使用。这是通过从{}目标管理器{}的{}配置{}部分中选择所需的配置来完成的:",
    "{}Sprite Editor{}: Set the texture group that you want the sprites to be added to.":"{}精灵编辑器{}: 设置要添加精灵的纹理组。",
    "{}Texture Group Manager{}: Here you can set any of the properties on a per-configuration bases, including the parent group that a texture group belongs to.":"{}纹理组管理器{}: 在这里，您可以在每个配置基础上设置任何属性，包括纹理组所属的父组。",
    "{}Tileset Editor{}: Set the texture group that you want the tilesets to be added to.":"{}选项卡编辑器{}: 设置要添加选项卡的纹理组。",
    "{}To set up your configurations it is recommended that you first prepare this \"Default\" config by incorporating all the configurable assets for the project into it. To do this, simply go through the following list of options and set them to what is required by default:":"{}要设置您的配置，建议您首先通过将项目的所有可配置资源合并到该配置中来准备这个“默认”配置。要做到这一点，只需浏览以下选项列表，并将它们设置为默认情况下所需的选项:",
    "{}To set up your configurations it is recommended that you first prepare this \"default\" config by incorporating all the configurable assets for the project into it. To do this, simply go through the following list of options and set them to what is required by default:":"{}要设置您的配置，建议您首先通过将项目的所有可配置资源合并到该配置中来准备这个“默认”配置。要做到这一点，只需浏览以下选项列表，并将它们设置为默认情况下所需的选项:",
    "{}You can also open the Configuration Editor at any time from the Target Manager by clicking the menu button at the top right (as highlighted in the image above).":"{}您还可以通过单击右上角的菜单按钮(如上图中突出显示的那样) ，随时从目标管理器打开配置编辑器。",
    "{}You can also open the Configuration Editor at any tme from the Target Manager by clicking the menu button at the top right (as highlighted in the image above).":"{}您还可以通过单击右上角的菜单按钮(如上图中突出显示的那样) ，随时从目标管理器打开配置编辑器。"
}