{
    "Configurations":"配置",
    "Game Options":"游戏设置",
    "Game Settings":"游戏设置",
    "Platform Settings":"平台设置",
    "Some {}GameMaker{} projects may also show Game options for the&nbsp;{}Amazon Fire{}&nbsp;target. These are legacy, read-only options as {}GameMaker{} now supports the Fire platform directly using the&nbsp;{}Android{}&nbsp;game options. If your project still shows Amazon Fire, you can find out information about the options from the following page:":"一些{}GameMaker{}项目也可能显示{}Amazon Fire{}目标的游戏选项。这些是遗留的只读选项，因为{}GameMaker {}现在直接使用{}Android{}游戏选项来支持 Fire 平台。如果你的项目仍然显示 Amazon Fire，你可以在下面的页面中找到关于这些选项的信息:",
    "The Game Options are split into two sections, Main Options and the Platform Settings. The main options start with the&nbsp;{}General{}&nbsp;options, which&nbsp;is where you can set certain things that will affect the game regardless of the platform that it is being designed to run on.":"游戏设置分为两个部分——主选项和平台设置。主选项以{}常规{}选项卡开始，您可以在该选项中设置某些可以影响游戏大局的内容，而不用考虑游戏所在的平台。",
    "The Main Options section also contains a menu for {}Template Info{}.":"主选项部分还包含{}模板信息{}的菜单。",
    "The following platform specific game options exist:":"以下是一些特定平台的游戏选项:",
    "The {}Asset Browser{} will also have other Game Options available to you depending on the target platforms that are available for the {}licence{} that you have and not all of them may be available or visible.":"{}资源浏览器{}还将有其他的游戏选项可用，这将取决于您拥有的{}许可证{}，并非所有这些平台设置都可用或可见。",
    "{}Accept Spine Licence{}: Here you can check the box to be shown the Spine Runtime Licence and accept it. This will permit you to use Spine sprites in your game (this licence will also be shown the first time you try to add a Spine sprite to your project and haven\u0027t checked the licence here beforehand).":"{}允许 Spine 许可证{} : 在这里您可以勾选是否同意Spine运行时许可证。这将允许您在游戏中使用Spine精灵(这个许可证也将显示在您第一次尝试添加Spine精灵到您的项目时，在此之前该选项不会被勾选)",
    "{}Author{}: The name of the game author (or publisher or studio).":"{}作者 {} : 游戏作者 (个人或出版商或工作室) 的名称。",
    "{}Collision Compatibility Mode{}: This tells GameMaker to use the legacy collision system&nbsp;used before the 2022 versions (which used integer values instead of floats). Read&nbsp;{}Collision Compatibility Mode{} for more information. This is disabled by default and it is recommended to keep it disabled for new projects.":"{}碰撞兼容模式{} : 勾选后 GameMaker 将会使用2022版本之前的旧碰撞系统(使用整数值而不是浮点数)。有关更多信息，请阅读{}碰撞兼容模式{}。默认情况下禁用此选项，建议在新项目中保持禁用。",
    "{}Default Draw Colour Outside the room region{}: The default colour that will be used to clear the background of any area outside of the game room.":"{}房间区域外的默认绘制颜色{} : 用于填充游戏房间外，任何区域背景的默认颜色。",
    "{}Default Draw Colour{}: The default colour for drawing text or forums (and other things) when no colour has been set using code.":"{}默认绘制颜色{} : 当屏幕上什么都没有时的默认绘制颜色。",
    "{}Default scripting language{}: Choose whether Objects events and Scripts in the current project should use&nbsp;{}GML Code{}&nbsp;or&nbsp;{}GML Visual{}, or whether it should always ask on creating a new script.":"{}默认脚本语言{} : 选择当前项目中的程序编写是使用{} GML Code{} 还是{} GML Visual {} ，抑或是应该在创建脚本的时候始终询问。",
    "{}Enable Copy on Write Behaviour for Arrays{}: This enables the deprecated {}Copy on Write{}&nbsp;array behaviour for the currently opened project. Read&nbsp;{}Copy on Write{} for more information. This is disabled by default and it is recommended to keep it disabled for new projects.":"{}为数组启用写入行为复制{} : 这将为当前打开的项目启用不推荐的{}写入复制数组{}行为。有关更多信息，请阅读{}Copy on Write{}。默认情况下禁用此选项，建议在新项目中保持禁用。",
    "{}Enable Source Control{}: If you wish the project to be under SCM (Source Control Management) then you need to check this. It is off by default (see here for more information on source control).":"{}启用源码管理{} : 如果您希望项目通过 SCM (源代码管理系统) 管理，那么您需要看看这个。默认情况下它是关闭的(有关源码管理的更多信息，请参见此处)。",
    "{}Game Frames Per Second{}: This value sets the limit on the number of frames per-second that {}GameMaker{} should try to maintain your games when running. This value represents the number of times that the game loop will run in one second (a single game loop is considered a single \"frame\") and is set to a default value of 60, although 30 is often used too. There are many arguments about which room speed is the ideal, but the actual answer depends on what type of game you are making, the size of the room, the number of instances and how intensive the code is. For example, if you have a large room and a room speed of 30, the game may appear \"choppy\" as the larger the area you are looking at, the easier it is for the eye to perceive low room speeds, but if the game is intensive then setting the room speed to 120 may cause the game to \"lag\" as the fps drops due to the amount of processing being done. So take care with this value and try to always adjust it to what your game needs.":"{}游戏帧率{} : 这个值确定了Gamemaker在运行游戏时应该尝试维持的帧率。帧率表示游戏在一秒钟内所循环的次数(一个游戏循环通常被认为是一帧) ，默认值为60，尽管也有人经常使用30。关于理想的游戏帧率是多少有很多争论，但是最终的答案应取决于你制作的游戏类型、房间的大小、数量以及代码的密集程度。例如，如果你有一个大房间，房间速度设置成了30，那么游戏可能就会出现“不流畅”的情况。你看到的区域越大，你的眼睛就越容易感知到低的帧率。但如果游戏有十分密集的物体，那么设置房间速度为120可能会导致游戏“卡顿”，因为 fps 下降了，游戏有大量的处理要解决，已经无法在规定的帧率上维持。所以一定要注意这个值，并始终调整它，直到满足您的游戏需要为止。",
    "{}Generate Project Images{}: Clicking this will open the Project Image Generator tool.":"{}生成项目图像{} : 单击此项将打开项目图像生成器工具。",
    "{}Generate mipmaps for separate texture pages{}: This option will have {}GameMaker{} create mipmaps for those sprites that have flagged the Seperate Texture Page option in the Texture settings of the Sprite Editor. Enabling mipmapping means that the original texture page for the sprite is to be scaled and filtered into multiple resolutions within the texture file. This is normally off, but if you are using views to zoom in or out on large areas of the game room, or you are working with a 3D game, then you may want to enable this and then use the Mipmapping Functions to adjust how the game deals with the different mipmap levels. Note that if you are not flagging sprites as using individual texture pages, you can still enable mipmapping on a per-texture group basis from the Texture Group Manager. This option is off by default.":"{}为单独的纹理页面生成多级渐远纹理{} : 这个选项将会使{} GameMaker {}为那些在 Sprite 编辑器的纹理设置中标记了单独纹理页面选项的精灵创建多级渐远纹理。启用多级渐远纹理意味着要对精灵的原始纹理页面进行缩放，并将其过滤到纹理文件中的多个分辨率中。这通常是关闭的，但是如果你使用视图来放大或缩小游戏房间的面积区域，或者你正在处理一个3D 游戏，那么你可能需要启用这个功能，然后使用 Mipmap 函数来调整游戏处理不同的多级渐远纹理级别的方式。请注意，如果您没有将精灵标记为使用单独的纹理页面，您仍然可以从纹理组管理器启用每个纹理组的多级渐远纹理。默认情况下，此选项是关闭的。",
    "{}NOTE{}&nbsp;The various {}Console Game Options{} are not listed here due to the various legal restrictions maintained by the different companies. If you have a Console Licence, then you can get this information form the {}YoYo Games Helpdesk{}, but you must first contact YoYo Games with your console ID email and request permission to view the different sections.":"{}注意{}由于不同公司的不同法律限制，各种{}控制台游戏选项{}没有在此列出。如果你有控制台许可证，你可以从YoYo Games服务台获得这些信息，但是你必须首先用你的控制台 ID 电子邮件联系YoYo Games，并请求查看不同部分的权限。",
    "{}Project GUID{}: This is the unique identifier that is created for each project within {}GameMaker{}. If you wish to change this you can click the Create New GUID button to generate a new one.":"{} 项目 GUID {} : 这是{} GameMaker {}中的每一个项目的唯一标识符。如果您希望换一个 GUID，您可以单击 CreateNewGUID 按钮来生成一个新的 GUID 按钮。",
    "{}Project Last Changed{}: This section simply shows the date/time stamp for the last time that the project was changed (this is not editable).":"{}项目最后更改时间{}: 此部分只显示项目上次更改时的日期/时间戳(这是不可编辑的)。",
    "{}Project Start Date{}: The date that the project was initiated.":"{}项目开始日期{} : 该项目被创建时的日期。",
    "{}Project Use Time{}: The length of time that has passed since you initiated the project.":"{}项目使用时间{} : 自项目开始以来已经过去了多长时间。",
    "{}The window has the following sections:":"{}该窗口有以下几个部分:"
}