{
    "Adding Included Files":"添加包含文件",
    "Clicking on {}Open In Explorer/Finder{} will open the {}datafiles{} folder in your project directory, which contains all the Included Files. You can add and remove files in this directory as you wish, and the interface in GameMaker will automatically update to reflect the structure in your {}datafiles{} folder.":"单击{} Open In Explorer/Finder {}将打开项目目录中的{} datafiles {}文件夹，其中包含所有包含的文件。您可以根据需要在此目录中添加和删除文件，GameMaker 中的接口将自动更新，以反映您的{}数据文件{}文件夹中的结构。",
    "For further information on how Included Files are stored with your game and how they are accessed, please see&nbsp;{}File System{}.":"有关如何与游戏一起存储包含的文件以及如何访问这些文件的进一步信息，请参见{}文件系统{}。",
    "Included Files":"包含文件",
    "Included Files Window":"包含文件窗口",
    "Open the Asset Browser\u0027s&nbsp;{}Extras{}&nbsp;menu {}&nbsp;(Fig. 1), to manually open the {}Included Files{} window (Fig. 2):":"打开资产浏览器的{}额外项{}菜单{}(图1) ，手动打开{}包含文件{}窗口(图2) :",
    "The simplest way to add an Included File is to drag it from your Explorer/Finder into the IDE. You will be asked to confirm whether the dragged file should be added to {}Included Files{}. After pressing {}Yes{}, the {}Included Files{} window will open, containing the file you just added.":"添加“包含文件”的最简单方法是将其从 Explorer/Finder 中拖动到 IDE 中。将要求您确认是否应将拖动的文件添加到{}包含文件{}。按下{} Yes {}后，将打开{}包含文件{}窗口，其中包含您刚才添加的文件。",
    "This window only shows you the Included Files that are present in your project. To re-arrange or rename your files, you will need to edit the actual directory where these files are stored.":"此窗口只显示项目中存在的包含文件。要重新排列或重命名文件，您需要编辑存储这些文件的实际目录。",
    "What kinds of files you add will depend on what you want to do, but things like default {}*.ini{} files, sprites and background images, or spreadsheets are commonly used as Included Files.":"添加什么类型的文件取决于您想要做什么，但是诸如{}*.ini{}文件、精灵和背景图像或电子表格通常作为包含文件添加到项目。",
    "You can also include {}DLL{} (on Windows) or {}DyLib{} (on macOS) files as Included Files and then create your own custom functions to deal with them using {}{}external_define(){}{}. These can then be used calling the {}{}external_call(){}{}&nbsp;function.":"您还可以将{}DLL{}(Windows)或{}DyLib{}(macOS)文件包含为包含文件，然后创建自己的自定义函数，使用{}{}external_define(){}{}处理这些文件。然后可以调用{}{}external_call(){}{}函数。",
    "{}GameMaker{} is not just limited to the assets that you add in the Asset Browser, as you can also add files to the project as {}Included Files{} so that they can then be accessed while the game is running. These are simply files that are {}included{} with your game package, so you can do with them what you wish.":"{}GameMaker{}不仅限于您在资产浏览器中添加的资产，因为您还可以将文件作为{}包含文件{}添加到项目中，以便在游戏运行时可以访问它们。这些只是{}包含{}在游戏包中的文件，因此您可以使用它们做您想做的事情。",
    "{}IMPORTANT{}&nbsp;When including sound files, you should ensure that the files avoid names that clash with streaming sound assets. For example, a sound asset called \"{}main_music{}\" will cause an Included File called \"{}main_music.ogg{}\" to become undefined when the project runs. This is because streamed files are also stored outside of the main project bundle, so care must be taken in these situations.":"{}重点{}在包含声音文件时，应确保文件避免与流声音资产冲突的名称。例如，名为“{}main_music{}”的声音资产将导致名为“{}main_music.ogg{}”的包含文件变成undefined。当项目运行时，这是因为流文件也存储在主项目包之外，所以在这些情况下必须小心。",
    "{}NOTE{}&nbsp;Using Included Files to create extra functionality in this way is incompatible with the {}Extension{} system, as you cannot use use the {}{}external_*(){}{}&nbsp;functions with files added in an extension. Extensions assets already have a method of adding constants and functions.":"{}注意{}使用包含文件以这种方式创建额外的功能与{}扩展{}系统不兼容，因为您不能在扩展中添加文件时使用{}{}external_*(){}{}函数。扩展资产已经有了添加常量和函数的方法。",
    "{}Once you have added files to the editor, you can double-click {}&nbsp;on them to open up the {}File Properties{}:":"{}将文件添加到编辑器后，可以双击{}以打开{}文件属性{} :",
    "{}This window shows the name of the file, its size on disk, and also the platforms that it should be exported to when you compile/test your game. You have buttons to select \"All\" or \"None\", or you can go down the list and check/uncheck the targets that you want the file to be exported to.":"{}此窗口显示文件的名称、磁盘上的大小以及在编译/测试游戏时应该导出到的平台。您可以选择“全部”或“无”按钮，或者您可以沿着列表查看并选中/取消选中您想要导出文件的目标。"
}