{
    "A Texture Group is loaded into RAM when the game starts, unless it\u0027s a {}Dynamic Texture Group{}, which is loaded later.":"纹理组在游戏开始时被加载到 RAM（内存）中，除非它是以后加载的{}动态纹理组{}。",
    "A single {}texture group{} can have multiple {}texture pages{}&nbsp;-- they are not equivalent.":"单个{}纹理组{}可以具有多个{}纹理页面{}，这些页面不等价。",
    "Adding a Texture Group":"添加纹理组",
    "Before we dive into creating and editing Texture Groups, let\u0027s understand how Texture Groups are loaded.":"在我们深入创建和编辑纹理组之前，让我们了解一下纹理组是如何加载的。",
    "By default all images in your game will be added to the \"Default\" texture group, which always exists. You can click on the {}Add New{} button to create a new texture group, and if you select the name of the group you can change it something appropriate.":"默认情况下，游戏中的所有图像都将添加到“默认”纹理组，该组始终存在。您可以单击{} Add New {}按钮来创建一个新的纹理组，如果您选择该组的名称，您可以对其进行适当的更改。",
    "Dynamic Textures":"动态纹理",
    "Editing a Texture Group":"编辑纹理组",
    "Even though the assets are shown in the list as being separate, all Sprites, Tile Sets and Fonts will be added to the same texture page (or pages), and cannot get an individual page for each asset type. The only exception to this rule is when a sprite asset has been flagged as being for a&nbsp;\"{}Separate Texture Page{}\", in which case it will be given its own individual texture page (see the section on \"Texture Settings\" in the {}Sprite Editor{} for more details).":"即使资源在列表中显示为单独的，所有精灵, Tile Sets 和字体也将添加到同一纹理页，并且无法获得每个资源类型的单独页面。此规则的唯一例外是当精灵资源已标记为\"{}单独纹理页面{}\"，在这种情况下，将为其提供自己的单独纹理页面(有关详细信息，请参阅{}精灵编辑器{}中的\"纹理设置\"部分)。",
    "Finally, texture groups are only relevant to&nbsp;{}bitmap{}&nbsp;images, and non-bitmap sprites will not be assigned to texture groups. Some of them will already have their own unique texture page (skeleton animation sprites) while others just don\u0027t require textures as they are comprised of&nbsp;{}vector{}{}s{}. For more information please see the following section:":"最后，纹理组仅与{}位图{}图像相关，并且不会将非位图精灵指定给纹理组。其中一些已经具有自己的唯一纹理页面(骨架动画精灵)，而另一些则不需要纹理，因为它们由{}矢量{}{}{}组成。有关详细信息，请参阅以下部分：",
    "For that to work, you need to define the necessary texture groups from this window, and then go through the asset list and assign groups to them.":"为此，您需要从这个窗口定义必要的纹理组，然后遍历资源列表并为它们分配组。",
    "Group Settings":"组设置",
    "How Textures Work":"纹理是如何工作的",
    "If the images assigned to the group have multiple sub-images (i.e. they are animated), then only the first sub-image is shown in the preview window. You can also right click {}&nbsp;on an asset to open a small menu giving you the option to move it to another texture group or open the editor for that asset.":"如果分配给组的图像具有多个子图像(例如，已设置动画)，则在预览窗口中仅显示第一个子图像。也可以在资源上单击鼠标右键{}以打开一个小菜单，从中可以选择将其移动到另一个纹理组或打开该资源的编辑器。",
    "If the images assigned to the group have multiple sub-images (i.e.: they are animated), then only the first sub-image is shown in the preview window. You can also right click {}&nbsp;on an asset to open a small menu giving you the option to move it to another texture group or open the editor for that asset.":"如果分配给组的图像具有多个子图像(例如，已设置动画)，则在预览窗口中仅显示第一个子图像。也可以在资源上单击鼠标右键{}以打开一个小菜单，从中可以选择将其移动到另一个纹理组或打开该资源的编辑器。",
    "If your game has a lot of unique graphics for each level, then you may define a single texture {}group {}for each of the levels, but the group\u0027s graphics may require two&nbsp;or more texture {}pages{}. This depends on whether the selected texture page size (in the {}Game Options{} for your target) is able to fit all the graphics within a texture group.":"如果游戏中每个级别都有许多唯一的图形，则可以为每个级别定义一个纹理{}组{}，但该组的图形可能需要两个或更多纹理{}页面{}。这取决于选定的纹理页面大小(在目标的{}游戏选项{}中)是否能够适合纹理组中的所有图形。",
    "Non-Bitmap Sprites":"非位图精灵",
    "Once you have added assets into a Texture Group, you will see them listed on the left of the main Texture Group editor window, and clicking on any of the sprites in this list will show them in the image preview window on the right. This is particularly helpful when working on large projects and you need to be able to see which images have been assigned to which group.":"将资源添加到\"纹理组\"后，将在主\"纹理组\"编辑器窗口的左侧看到这些资源，单击此列表中的任何精灵将在右侧的图像预览窗口中显示这些资源。这在处理大型项目时尤其有用，因为您需要能够看到哪些图像已指定给哪个组。",
    "One use for this is, for example, that you could make an iPad configuration and for that create 2048x2048px texture pages (setting this up via the {}Game Options{}). You would then assign all the graphics assets to the appropriate texture group, and when finished, you would then change to a different configuration (for HTML5, for example) and from the Texture Group window, create new texture groups that are 512x512px, assigning the assets to these new groups. There is also a button at the bottom of the page that permits you to copy texture group settings from one configuration to another.":"这样做的一个用途是，例如，您可以为 iPad 配置并创建2048x2048px 的纹理页面(通过{} Game Options {}设置)。然后将所有的图形资源分配给相应的纹理组，完成后，您将切换到一个不同的配置(例如，对于 HTML5) ，并从纹理组窗口创建512x512px 的新纹理组，将资源分配给这些新组。页面底部还有一个按钮，允许您将纹理组设置从一个配置复制到另一个配置。",
    "See:&nbsp;{}Dynamic Textures{}":"请参阅：{}动态纹理{}",
    "See:&nbsp;{}Texture Pages{}":"请参阅：{}纹理页面{}",
    "Texture Group vs. Texture Page":"纹理组与纹理页",
    "Texture Groups":"纹理组",
    "Texture Groups are also linked to the {}Configurations{} settings. What this means is that you can define texture groups for each individual configuration of your game, and then set the sprite, tile set or font resource assignments to these different groups and it will be \"remembered\" when you change to a different configuration. The same will happen to any export options that you have chosen in the Texture Group window, so you can set the texture groups to export to specific platforms on a per-configuration basis.":"纹理组也链接到{}配置{}设置。这意味着，您可以为游戏的每个单独配置定义纹理组，然后将精灵、互动程序集或字体资源指定设置为这些不同的组，当您更改为不同的配置时，它将被\"记住\"。在\"纹理组\"(Texture Group)窗口中选择的任何导出选项也会发生同样的情况，因此可以将纹理组设置为按配置导出到特定平台。",
    "Texture Pages":"纹理页面",
    "Texture groups other than the \"Default\" one can also be deleted at any time, which will move their contents into the \"Default\" group (if you delete a group by mistake you can use {}&nbsp;/&nbsp;{} + \"{}Z{}\" to undo the action).":"也可以随时删除除\"默认\"以外的纹理组，这样会将其内容移动到\"默认\"组中(如果您错误地删除了组，则可以使用{}/{}+\"{}Z{}\"撤消操作)。",
    "The {}group settings{}&nbsp;in the Texture Group Editor are used to determine exactly how the texture pages for a given group should be created, with the following options available:":"\"纹理组编辑器\"(Texture Group Editor)中的{}组设置{}用于确定如何创建给定组的纹理页面，并提供以下选项：",
    "To start with the group will show \"{}This group is empty{}\" for each section of the group (Sprites, Tile Sets and Fonts). Add an asset using the {}Add Asset{} button at the bottom, or by selecting multiple assets in the list and right-clicking to move those assets into a different group:":"组的每个部分(Sprites, Tile Sets 和 Fonts)将会显示\"{}此组为空{}\"。使用底部的{}添加资源{}按钮或在列表中选择多个资源并右键单击以将这些资源移动到其他组，从而添加资源：",
    "When an image from a Texture Group is drawn, or one of the {}pre-fetch{} functions is run, then the Texture Group is decompressed and loaded into VRAM (video memory).":"当从纹理组中绘制图像时，或者运行{}预取{}函数时，纹理组将会被解压并加载到 VRAM (视频内存)中。",
    "While in the RAM, the Texture Group stays compressed, as it was on disk.":"在RAM中，纹理组保持压缩状态，就像在磁盘上一样。",
    "You can set up Dynamic Texture Groups, which can be loaded and unloaded at runtime to save memory.":"可以设置动态纹理组，可以在运行时加载和卸载动态纹理组以节省内存。",
    "You can {}flush{} a Texture Group to remove it from VRAM (this doesn\u0027t remove them from RAM).":"您可以{}刷新{}一个纹理组来从 VRAM 中删除它(这不会从 RAM 中删除它们)。",
    "{} Generate Mipmap {}-标记此选项(默认关闭)将告诉{} GameMaker {}原始纹理页将缩放并过滤到纹理文件中的多个分辨率中。这通常是{}关闭{} ，但是如果你正在使用摄像头放大或缩小游戏房间的大面积，或者你正在处理一个3D 游戏，那么你可能需要启用这个，然后使用{}映射函数{}来调整游戏如何处理不同的映射等级。标记此复选框时，“边框大小”值将被设置为8(如果最初设置为小于8)。这是因为，在使用 mipmap 时，需要在纹理页面上的图像之间添加更大的边框，否则它们会在更高的 mipmap 级别上开始流血。默认值8将允许图像在子图像开始流血之前减少到原始大小的八分之一左右，但是您可以将其更改为适合您需要的任何值。请注意，如果您使用“{}分离纹理页{}”选项为精灵，那么您不需要通过这里的每个纹理并标记它来生成 mipmap，但是您可以转到{}通用游戏选项{}并标记选项“{}为分离纹理页生成 mipmap {}”。":"{}Generate Mipmap {}-标记此选项(默认关闭)将告诉{} GameMaker {}原始纹理页将缩放并过滤到纹理文件中的多个分辨率中。这通常是{}关闭{} ，但是如果你正在使用摄像头放大或缩小游戏房间的大面积，或者你正在处理一个3D 游戏，那么你可能需要启用这个，然后使用{}映射函数{}来调整游戏如何处理不同的映射等级。标记此复选框时，“边框大小”值将被设置为8(如果最初设置为小于8)。这是因为，在使用 mipmap 时，需要在纹理页面上的图像之间添加更大的边框。默认值8将允许图像在子图像开始流血之前减少到原始大小的八分之一左右，但是您可以将其更改为适合您需要的任何值。请注意，如果您使用“{}分离纹理页{}”选项为精灵，那么您不需要通过这里的每个纹理并标记它来生成 mipmap，但是您可以转到{}通用游戏选项{}并标记选项“{}为分离纹理页生成 mipmap {}”。",
    "{}Allow Scaling{} - Unflagging this will force {}GameMaker{} to not scale the texture group under any circumstances. This can be useful, especially when dealing with universal apps, as it allows you to put specific resources like fonts in a group of its own to be used when the app is run on a specific device. For example, fonts can look great on a retina display, but when they are scaled down to draw on a normal display they can look terrible so you can assign them to a special non-scaling group - if developing for the iPhone,&nbsp;you may wish to have this checked, as apps have been rejected due to the images being blurred by texture scaling. This is flagged as {}on {}by default.":"{}允许缩放{}-取消标记将强制{}GameMaker{}在任何情况下都不缩放纹理组。这可能非常有用，尤其是在处理通用应用时，因为它允许您将特定资源(如字体)放入自己的组中，以便在特定设备上运行应用程序时使用。例如，字体在视网膜显示器上看起来很好，但是当字体缩小到普通显示器上时，它们看起来很糟糕，所以你可以将它们指定给一个特殊的非缩放组——如果是为iPhone开发的，你可能希望检查这个，因为应用程序由于图像被纹理缩放模糊而被拒绝。默认情况下，标记为{}启用{}。",
    "{}Alternatively you can add assets to a texture group via the right mouse button {}&nbsp;menu in the {}Asset Browser{}. You can select one or more Sprite/Tile Set/Font assets and then use the RMB menu to add the assets to any group, as shown below for Tile Sets:":"{}或者，您也可以通过资源浏览器中的鼠标右键菜单{}将资源添加到纹理组。您可以选择一个或多个Sprite/Tile Set/Font，然后使用RMB菜单将资源添加到任何组，如下面的Tile Sets所示：",
    "{}Automatically Crop{} - When you add images into {}GameMaker{} , if they have any \"space\" around them (ie 100% transparency) this is automatically cropped when it is added into the texture page and \"Automatically Crop\" is flagged. However, if, for example, you are using the image as a non-repeating texture for primitives or anything similar, this means that the UV coordinates for texture mapping are not going to be correctly represented. In these cases you can un-flag this option and the sprite will be added to the texture page \"as is\", maintaining any transparencies that it may have around the edges. This is flagged as {}on {}by default.":"{}自动裁剪{}-将图像添加到{}GameMaker{}时，如果图像周围有任何\"空格\"(即100%透明度)，则会在将图像添加到纹理页面时自动裁剪，并标记\"自动裁剪\"。但是，例如，如果将图像用作基本体的非重复纹理或任何类似的纹理，这意味着纹理贴图的UV坐标将无法正确表示。在这些情况下，您可以取消标记此选项，并且sprite将按\"原样\"添加到纹理页面中，从而保持其在边缘周围可能具有的任何透明度。默认情况下，这将标记为{}启动{}。",
    "{}Border Size{} - The border size will change the overlap (or \"pixel doubling\") amount around the edges of all assets on the pages generated for the texture group so that when the images are scaled, there are no gaps (or seams) visible between them. The default is 2 pixels, but in extreme cases where you are zooming the view in or out a great deal then you may need to increase this value. Note that the {}Tile Set Editor{} has an option to set the output border for tiles (and also provides an explanation of why this is necessary), and this is separate to the border setting here - basically, tiles are generated with an output border for each tile on a temporary texture, and this is then added to the texture page with the border given here around the outside edge. Also note that enabling Mipmaps will automatically set the default border size for the texture page to 8 to help prevent \"bleeding\" between textures at higher mip levels, but this can be changed.":"{}边框大小{}-边框大小将改变为纹理组生成的页面上所有资源的边缘周围的重叠(或“像素倍增”)数量，以便在缩放图像时，它们之间没有可见的间隙(或接缝)。默认值是2像素，但在极端情况下，如果您要大幅放大或缩小视图，那么您可能需要增加这个值。注意，{} Tile Set Editor {}有一个选项可以设置图块的输出边框(并且还提供了为什么需要这样做的解释) ，这个选项与边框设置是分开的——基本上，图块是用临时纹理上的每个图块的输出边框生成的，然后这个边框被添加到纹理页面中，在外边缘附近给出边框。还要注意，启用 Mipmap 会自动将纹理页面的默认边框大小设置为8，以帮助防止在较高 mip 级别的纹理之间“bleed”，但这可以更改。",
    "{}Dynamic Group Path{} - Here you can set the path within the final game package where the texture group will be stored. This only works if the group is Dynamic. If this is empty, exported textures are placed at the root of the game package.":"{}动态组路径{}-在此可以设置最终游戏包中将存储纹理组的路径。仅当组为\"动态\"时，此操作才起作用。如果为空，则导出的纹理将放置在游戏包的根目录中。",
    "{}GameMaker{} permits you to assign each of the graphics assets in your project (Sprites, Tile Sets, and Fonts) to different texture groups, to optimise the number of texture swaps that the hardware does at any given time in your game.":"{}GameMaker{}允许您将项目中的每个图形资源(Sprites、 Tile Set 和 Fonts)分配给不同的纹理组，以优化硬件在游戏中任何给定时间进行的纹理交换的数量。",
    "{}Generate Mipmaps{} - Flagging this option (it is off by default) will tell {}GameMaker{} that the original texture page is to be scaled and filtered into multiple resolutions within the texture file. This is normally {}off{}, but if you are using cameras to zoom in or out on large areas of the game room, or you are working with a 3D game, then you may want to enable this and then use the {}Mipmapping Functions{}&nbsp;to adjust how the game deals with the different mipmap levels. When you flag this check box the \"Border Size\" value will be set to 8 (if it was set to less than 8 originally). This is because, when using mipmaps, you need larger borders between images on the texture pages otherwise they start bleeding together at higher mip levels. The default value of 8 will allow the image to be reduced to about an eighth of its original size before the sub-images start bleeding together, but you can change this to any value that is required to suit your needs. Note that if you are using the \"{}Separate Texture Page{}\" option for sprites, then you do not need to go through each texture here and flag it to generate mipmaps, but instead you can go to the {}General Game Options{} and flag the option \"{}Generate mipmaps for separate texture pages{}\".":"{}生成Mipmaps{}-标记此选项(默认情况下处于关闭状态)将告知{}GameMaker{}原始纹理页面将被缩放并过滤为纹理文件中的多个分辨率。这通常是{}关闭{}，但是如果您正在使用相机放大或缩小游戏室的大面积，或者您正在使用3D游戏，则可能需要启用此功能，然后使用{}Mipmap函数{}来调整游戏如何处理不同的Mipmap级别。标记此复选框时，\"边框大小\"值将设置为8(如果最初设置为小于8)。这是因为，使用mipmap时，纹理页面上的图像之间需要更大的边界，否则它们会在更高的mip级别一起bleed。默认值8将允许在子图像一起开始bleed之前将图像缩小到原始大小的八分之一左右，但您可以将其更改为适合您需要的任何值。请注意，如果对Sprite使用\"{}单独纹理页面{}\"选项，则无需在此处浏览每个纹理并标记它以生成mipmap，而是可以转到{}常规游戏选项{}并标记选项\"{}为单独纹理页面生成mipmap{}\"。",
    "{}Other than those settings you can also choose to export (or not) any given texture group to any given platform by simply checking or un-checking the appropriate boxes from the {}Use Group On...{} section of the window. Note though that the {}&lt;Default&gt;{} texture group is {}always exported to every platform{}, and you can\u0027t check/un-check any of them (only custom texture groups permit this).":"{}除了这些设置之外，您还可以选择将任何给定的纹理组导出(或不导出)到任何给定的平台，只需从窗口的{}Use Group On...{}部分选中或取消选中相应的框即可。请注意，{}&lt;Default&gt;{}纹理组{}总是导出到每个平台{}，并且您不能选中/取消选中其中的任何一个(只有自定义纹理组允许这样做)。",
    "{}Parent Texture Group{} - Here you can choose any of the existing groups to be the \"parent\" group for the currently selected one. \"Child\" groups will inherit any changes made to the parent texture group and are primarily for resource management when working with cross platform games. A texture group with a parent is still a texture group in its own right and will generate texture pages the same as any other group, but assigning them a parent allows you to exclude large chunks for different platforms. For example, you can add a whole load of Android player sprites to a \"player\" group, and Android enemy sprites to an \"enemy\" group, then make them both use an \"android\" parent group. If you then exclude the \"android\" parent group from the Windows or other platform build, the child groups will be excluded too.":"{}父纹理组{}-在这里，您可以选择任何一个现有组作为当前选定组的“父”组。“子”组将继承对父纹理组所做的任何更改，并且在处理跨平台游戏时主要用于资源管理。具有父元素的纹理组本身仍然是一个纹理组，它将生成与其他任何组相同的纹理页面，但是为它们分配一个父元素允许您为不同的平台排除大块。例如，您可以将整个负载的 Android 播放器精灵添加到一个“播放器”组，并将 Android 敌人精灵添加到一个“敌人”组，然后使它们都使用一个“ Android”父组。如果您随后从 Windows 或其他平台构建中排除“ android”父组，那么子组也将被排除在外。",
    "{}Texture Group Format{} - Here you can choose the format for your texture page, between {}BZ2 + QOI{}, {}QOI{} and {}PNG{}. It is recommended to stick with the default option, {}BZ2 + QOI{}, as it offers the best compression while retaining quality.{} {} You can choose {}QOI{} if the BZ2 option affects speed on a target platform (e.g. Android), or&nbsp;{}PNG{} if you wish for the exported PNGs to be modified&nbsp;or use the {}PNGCrush option{}. ":"{}纹理组格式{}-您可以在{} BZ2 + QOI {}、{} QOI {}和{} PNG {}之间选择纹理页的格式。建议坚持使用默认选项{} BZ2 + QOI {} ，因为它在保持质量的同时提供了最佳的压缩。{}{}如果 BZ2选项影响目标平台(如 Android)上的速度，可以选择{} QOI {} ; 如果希望修改导出的 PNG 或使用{} PNGCrush 选项{} ，可以选择{} PNG {}。",
    "{}Texture Group Type{} - Here you can set whether this is a regular Texture Group or a {}Dynamic Texture Group{}.":"{}纹理组类型{}-在此可以设置这是常规纹理组还是{}动态纹理组{}。",
    "{}The {}Texture Group Manager{} is available from the {}Tools Menu{} in the IDE. Here you can add, delete and rename {}Texture Groups{}.":"{}{}纹理组管理器{}可以从 IDE 中的{}工具菜单{}中获得。这里可以添加、删除和重命名{}纹理组{}。",
    "{}{}NOTE{}{}&nbsp;Texture decompression is asynchronous on all platforms except GX.games, which might cause stutters as textures are decompressed in-game. To avoid this, ensure your textures are prefetched during loading screens or another inactive parts of your game.":"{}{}注意{}{} 除了 GX.game 之外，所有平台上的纹理解压都是异步的，这可能会在游戏中解压纹理时造成卡顿。为了避免这种情况，请确保在加载屏幕或游戏的其他非活动部分时预取纹理。"
}