{
    "Finally, the room manager has some extra tools to help you navigate and organise your rooms. At the top you have a&nbsp;{}Search Bar{}&nbsp;which enables you to add a search term and then quickly go to the rooms that have the search term in their names. Rooms that have the search term in them will be highlighted, and then you can navigate to&nbsp;them instantly using the up/down buttons on the side:":"最后，房间管理器还有一些额外的工具来帮助您导航和整理房间。在顶部有一个{}搜索栏{} ，它允许您添加一个搜索词，然后快速进入名称中包含搜索词的房间。有搜索词的房间会被突出显示，然后你可以使用侧面的上/下按钮立即导航到这些房间:",
    "Rooms can have multiple children, and each child can also be a parent and have their own children, for example:":"房间可以有多个孩子，每个孩子也可以是父母，有自己的孩子，例如:",
    "The Room Manager":"房间管理器",
    "You can change the order of rooms by simply clicking {}&nbsp;and dragging the room you want to move up or down the list, and you can use {}&nbsp;and/or&nbsp;{}&nbsp;/&nbsp;{} to select multiple rooms then click and drag them to move them altogether:":"你可以改变房间的顺序，只需点击{}并拖动你想要上移或下移的房间，你可以使用{}或{}/{}来选择多个房间，然后点击并拖动它们一起移动:",
    "You can open the room manager by clicking the \"Extras\" button {}&nbsp;at the top of the Asset Browser and selecting it from the menu that opens, or you can simply click {}&nbsp;the icon to the left of a room in the asset browser:":"您可以通过点击资源浏览器顶部的“额外”{}按钮并从打开的菜单中选择它来打开房间管理器，或者您也可以简单地点击资源浏览器中房间左侧的图标{} :",
    "You should also note that you can right click on any room in the Room Manager to bring up the following menu:":"您还应该注意到，您可以右键单击房间管理器中的任何房间，以显示以下菜单:",
    "{}Arrange{}:&nbsp; The arrange sub.menu can be used to move rooms up or down in the room manager, much the same as the buttons at the bottom of the manager window.":"{}安排{} : 安排可以用来在房间管理器中向上或向下移动房间的子菜单，这与管理器窗口底部的按钮非常相似。",
    "{}As with the Room Order tab, you can click {}&nbsp;and drag to reorder the rooms, but note that selecting a child room and moving it to a different parent will break the room inheritance with the original parent and it will instead inherit the properties of the new room. Note too that you can convert a child into a \"full\" room with no inheritance by dragging it to the left of the list (the list border will become highlighted), at which point it will simply become a room in its own right.":"{}和房间顺序选项卡一样，你可以点击{}并拖动来重新排列房间，但是请注意，选择一个子房间并将其移动到另一个父房间将破坏与原始父房间的房间继承，而是继承新房间的属性。还要注意的是，你可以通过将一个子元素拖到列表的左边(列表边框将会突出显示) ，将它转换成一个没有继承的“完整”房间，这时它将会变成一个单独的房间。",
    "{}Asset Colour{}: Here you can select a colour for the room (or rooms) to help identify them in the Room Manager. Note that this colour will also be used in the Asset Browser and override any colour that has been set previously.":"{}资源颜色{} : 在这里您可以为房间(或房间)选择一种颜色，以帮助在房间管理器中识别它们。请注意，这种颜色也将在资源浏览器中使用，并覆盖以前设置的任何颜色。",
    "{}Beside these buttons you also have a {}Create Group{} button which can be used to create a group folder. These folders can be used to better organise the rooms in your game (room order will still be respected), and you can click and drag rooms onto the folder to add them. You can also select multiple rooms by clicking while holding down {}&nbsp;and/or&nbsp;{}&nbsp;/&nbsp;{}, then click the Create Group button and all the selected rooms will be added to the group. Note that this&nbsp;{}will{}&nbsp;change the order of the rooms in your game, and also note that if you choose to delete the group folder later,&nbsp;{}any rooms within the folder will be deleted too{}&nbsp;(by default GameMaker will warn you about this).":"{}除了这些按钮之外，还有一个{} Create Group {}按钮，可用于创建组文件夹。这些文件夹可以用来更好地组织房间(房间顺序受影响) ，您可以点击并拖动房间到文件夹中添加它们。您还可以通过按住{}或{}/{}来选择多个房间，然后单击 Create Group 按钮，所有选定的房间都将添加到该组中。注意，这个{}将{}会改变游戏中房间的顺序，还要注意，如果你选择以后删除组文件夹，{}文件夹中的任何房间也会被删除{}(默认情况下，GameMaker 会提醒你这一点)。",
    "{}Collapse All{}: This option will collapse all folder groups.":"{}折叠所有{} : 此选项将折叠所有文件夹组。",
    "{}Create Child Room{}: This will create a new room as a child of the room that was clicked on, with the new room inheriting the parent room properties.":"{}创建子房间{} : 这将创建一个新房间作为被点击的房间的子房间，新房间继承父房间的属性。",
    "{}Delete{}: Clicking this will delete the room (or rooms) that have been selected. If used on a group folder, all rooms within the folder will be deleted along with the folder. If used on a parent room, only the parent will be deleted, and all child rooms will remain, although they will now be independent and no longer child rooms.":"{}删除{} : 单击此项将删除已选定的房间(或房间)。如果在组文件夹中使用，文件夹中的所有房间将随文件夹一起删除。如果在父房间使用，只有父房间将被删除，所有的子房间将保留，尽管它们现在将是独立的，不再是子房间。",
    "{}Duplicate{}: This will duplicate the selected room, placing the new room under the selected room.":"{}副本{} : 这将复制选定的房间，将新房间放在选定的房间下面。",
    "{}Edit Tags{}: This will open the {}Tag Editor{} so you can add tags to the room.":"{}编辑标签{} : 这将打开{}标签编辑器{} ，以便您可以向房间添加标签。",
    "{}Edit{}: This will open the {}Room Editor{} for the room.":"{}编辑{} : 这将打开该房间的{}房间编辑器{}。",
    "{}Expand All{}: This option will expand all folder groups.":"{}展开所有{} : 此选项将展开所有文件夹组。",
    "{}Expand Children{}: If a group folder is selected, this option will expand the contents of the folder.":"{}展开子项{} : 如果选择了组文件夹，此选项将展开该文件夹的内容。",
    "{}Favourite{}:&nbsp; This will add the selected room to the {}Asset Browser{} Favourites section.":"{}收藏夹{} : 这将把选定的房间添加到{}资源浏览器{}收藏夹部分。",
    "{}Here we have a parent room, \"{}rm_Level_1_Day{}\", which has two children \"{}rm_Level_1_Day_AfterBattle{}\" and \"{}rm_Level_1_Night{}\". We have also assigned another child room to \"{}rm_Level_1_Night{}\" called \" {}rm_Level_1_Night_AfterBattle{}\". In this way you can re-use resources and level design from one parent room, and then only change what is required to make it slightly different in the child room or rooms.":"{}这里我们有一个父房间，“{}rm_Level_1_Day{}”，它有两个孩子“{} rm_Level_1_Day_AfterBattle{}”和“{} rm_Level_1_Night{}”。我们还指定了另一个房间“{}rm_Level_1_Night{}”的子房间“{}rm_Level_1_Night_AfterBattle{}”。通过这种方式，您可以重用来自一个父房间的资源和级别设计，然后只更改所需的内容，使其在子房间或房间中略有不同。",
    "{}NOTE{}: For more information on room inheritance, please see {}here{}.":"{}注意{} : 有关房间继承的更多信息，请参见{}这里{}。",
    "{}Note{}: The IDs of your room assets will not be in the same order as defined in this list, and so you should not supply a number value directly to change the room at runtime.&nbsp;Always use the room&nbsp;{}constant{}&nbsp;for the asset you want to reference (which is simply its name) or retrieve it through a function.":"{}注意{} : 您的房间资源的 ID 不会按照列表中定义的顺序排列，因此您不应该直接提供一个数值来在运行时更改房间。始终使用房间{}常量{}作为要引用的资源(这只是它的名称)或通过函数检索它。",
    "{}Once open, the Room Manager presents you with two different tabs, one for {}Room Order{} and one for {}Room Inheritance{}. The room order defines the order in which rooms will be accessed if you are traversing the game literally, using the function {}{}room_goto_next(){}{}&nbsp;at the end of each room, and the very top room listed will always be flagged by the \"home\" icon {}, which shows you that this room is the designated {}start {}room for the game. This icon will also be shown in the Asset Browser so you can see clearly which room it is, regardless of the how you have filtered or set up your assets.":"{}打开后，房间管理器会显示两个不同的选项卡，一个用于{}房间顺序{} ，一个用于{}房间继承{}。房间顺序用每个房间末尾的函数{}{}room_goto_next(){}{}来定义房间访问的顺序，并且列出的最上面的房间总是由“ 家”的图标标记，这表明这个房间是指定的游戏开始房间。这个图标也将显示在资源浏览器，因此您可以清楚地看到它是哪个房间，无论您如何过滤或设置您的资源。",
    "{}Open In Explorer{}: This will open a OS file explorer on the asset in the game project.":"{}在资源管理器中打开{} : 这将在游戏项目中的资源上打开一个 OS 文件资源管理器。",
    "{}Rename{}: This permits you to rename the room asset (you can also do a slow double click&nbsp;{}&nbsp;on the room to rename it).":"{}重命名{} : 这允许您重命名房间资源(您也可以对房间执行缓慢的双击{}来重命名它)。",
    "{}The {}Room Inheritance{} tab is for setting up \"child\" rooms. A child room is one that has been copied from a \"parent\" room and set to inherit all of its properties. If you do nothing to this room, then this room will indeed be a copy of the original room, but you can then go into the {}Room Editor{} and toggle inheritance on or off for specific things like layers, or instances, as well as add new layers, instances and properties to the room.":"{}{}房间继承{}选项卡用于设置“子”房间。子房间是从“父”房间复制并设置为继承其所有属性的房间。如果你对这个房间什么都不做，那么这个房间确实是原始房间的一个副本，但是你可以进入{}房间编辑器{} ，为特定的事物如层或实例打开或关闭继承，以及为房间添加新的层、实例和属性。",
    "{}There are also some helpful buttons at the bottom of the Room Manager that permit you to move rooms up or down the room order list:":"{}在房间管理器的底部还有一些有用的按钮，它们允许你在房间顺序列表中向上或向下移动房间:",
    "{}This menu gives you the following options:":"{}此菜单提供以下选项:",
    "{}When using the {}Asset Browser{}, you can create your rooms and move them between the different folder groups to organise the project in a way that best suits you. However, games in {}GameMaker{} generally have rooms that follow a certain order, and at the very least must have a specific {}start room{} (after the game starts in this room you can use code or actions to go to any room in the game if you wish), which is where the {}Room Manager{} comes into play.":"{}当使用{}资源浏览器{}时，您可以创建您的房间，并在不同的文件夹组之间移动它们，以最适合您的方式组织项目。然而，{}GameMaker{}中的游戏通常都有一定顺序的房间，并且至少必须有一个特定的{}开始房间{}(游戏在这个房间开始后，你可以使用代码或操作去游戏中的任何房间，如果你愿意的话) ，这就是{}房间管理器{}发挥作用的地方。",
    "{}{}NOTE{}{}&nbsp;For more information on room inheritance, please see {}here{}.":"{}{}注意{}{}有关房间继承的详细信息，请参阅{}此处{}。",
    "{}{}NOTE{}{}&nbsp;The IDs of your room assets will not be in the same order as defined in this list, and so you should not supply a number value directly to change the room at runtime.&nbsp;Always use the room&nbsp;{}constant{}&nbsp;for the asset you want to reference (which is simply its name) or retrieve it through a function.":"{}{}注意{}{}您的房间资源的ID将与此列表中定义的顺序不同，因此您不应在运行时直接提供数字值来更改房间。始终为您要引用的资源使用房间{}常量{}(仅为其名称)或通过函数检索它。"
}