{
    "A sprite is made up of one or more {}sub-images{} which can make the sprite appear animated as they switch from one to the other, or can they can be switched between in code to give different \"states\", much like a button has in windows. If the sprite is animated, then you can get the current frame of the animation by checking the {}image_index{} variable, or if you want to change the state of a static sprite, you can select a new sub-image by setting this variable to the desired sub-image of the sprite.":"精灵由一个或多个{}子图像{}组成，这些子图像可以使精灵在从一个切换到另一个时显示为动画，或者可以在代码中切换以提供不同的“状态”，就像Windows中的按钮一样。如果精灵已设置动画，则可以通过检查{}image_index{}变量来获取动画的当前帧，或者如果要更改静态精灵的状态，则可以通过将此变量设置为精灵的所需子图像来选择新的子图像。",
    "A stretched frame will be returned as a fraction of one number. For example, if in the {}Sprite Editor{}&nbsp;you stretch {}frame 1{} to last 4 frames, instead of those 4 frames returning the values 1, 2, 3, 4, they will instead return 1.0, 1.25, 1.5, and 1.75. {} {}This means that if you add 1 to {}image_index{}, it will skip frames the same way regardless of their stretched length.{} {} ":"拉伸帧将作为一个数字的分数返回。例如，如果在{}精灵编辑器{}中将{}第1帧{}拉伸到最后4帧，则这4帧不会返回值1、2、3、4，而是返回1.0、1.25、1.5和1.75。{}{}这意味着，如果向{}image_index{}添加1，它将以相同的方式跳过帧，而不考虑其拉伸长度。{}{}",
    "For changes in this variable to be visible, the instance should have either {}no{} draw event (and so {}GameMaker{} will default draw the sprite) or be drawn using one of the drawing functions like {}{}draw_self(){}{}&nbsp;or {}{}draw_sprite_ext(){}{}&nbsp;(by supplying the image_index into the appropriate argument).":"要使此变量中的更改可见，该实例应该具有{}no{}draw事件(因此{}GameMaker{}将默认绘制精灵)，或者使用其中一个绘制函数绘制，如{}{}draw_self(){}{}或{}{}draw_sprite_ext(){}{} (通过将image_index提供给适当的参数)。",
    "Setting this variable directly to a frame will&nbsp;{}not{} trigger any Broadcast Messages that may be present on that frame.":"将此变量直接设置为帧将{}不会{}触发该帧上可能存在的任何广播消息。",
    "The above code checks to see if the sprite is animating, and if it is then it checks to see if the current image_index is at the last frame and in that case destroys the instance.":"上面的代码检查sprite是否正在设置动画，如果是，则检查当前image_index是否位于最后一帧，如果是，则销毁该实例。",
    "Usage Notes":"用法说明",
    "While using skeletal animation sprites, you can still get and set the {}image_index{} values - see the function {}{}skeleton_animation_get_duration(){}{}&nbsp;for examples of how to do this.":"使用骨骼动画精灵时，您仍然可以获取和设置 {}image_index{} 值-有关如何执行此操作的示例，请参见函数 {}{}skeleton_animation_get_duration(){}{}。"
}