{
    "A path is created from a series of defining points that are linked together and then used to plan the movements of an instance. They can be created with code, {}or{} in the Path Editor and they are assigned to an instance to use in the game. You would then use this function to tell your instance which path to follow, what speed to follow the path (measured in pixels per step), how to behave when it reaches the end of the path, and whether to follow the {}absolute{} or {}relative{} path position. This last part means that it either starts and follows the path exactly as you designed and placed it in the {}Path Editor{} (absolute), or it starts and follows the path from the position at which the instance was created (relative).":"路径由一系列链接在一起的定义点创建，然后用于规划实例的移动。可以在路径编辑器中使用代码、{}或{}创建它们，并将它们分配给一个实例以在游戏中使用。然后，您可以使用此函数告诉您的实例要遵循的路径、遵循路径的速度(以每步像素为单位)、到达路径末端时的行为以及是遵循{}绝对{}还是{}相对{}路径位置。这最后一部分意味着，它要么完全按照您在{}路径编辑器{}中设计并放置的路径开始并跟随该路径(绝对)，要么从创建实例的位置开始并跟随该路径(相对)。",
    "A path is created from a series of defining points that are linked together and then used to plan the movements of an instance. They can be created with code, {}or{} in&nbsp;{}The Path Editor{} and they are assigned to an instance to use in the game. You would then use this function to tell your instance which path to follow, what speed to follow the path (measured in pixels per step), how to behave when it reaches the end of the path, and whether to follow the {}absolute{} or {}relative{} path position. This last part means that it either starts and follows the path exactly as you designed and placed it in {}The Path Editor{}&nbsp;(absolute), or it starts and follows the path from the position at which the instance was created (relative).":"路径是由一系列链接在一​​起的定义点创建的，然后用于规划实例的移动。它们可以使用代码、{} 或 {} 在 {} 路径编辑器 {} 中创建，并将它们分配给一个实例以在游戏中使用。然后，您可以使用此函数告诉您的实例要遵循哪条路径、遵循该路径的速度 (以每步像素为单位测量)、到达路径末端时的行为方式以及是否遵循 {} 绝对 {} 或 {} 相对 {} 路径位置。最后一部分意味着它要么完全按照您设计并将其放置在 {} 路径编辑器 {} 中的路径开始并遵循路径 (绝对)，要么从创建实例的位置开始并遵循路径 (相对)。",
    "The constants used to define the behaviour of the instance when it reaches the end of the path are given {}on this page{}.":"{}本页{}给出了用于定义实例到达路径末尾时的行为的常量。",
    "The path index to start.":"要启动的路径索引。",
    "The speed of which to follow the path in pixels per step, negative meaning going backwards.":"以每步像素为单位跟踪路径的速度，负数表示后退。",
    "This function tells the calling instance to start the given path. The path started by the instance is stored in the variable&nbsp;{}{}path_index{}{}.":"该函数告诉调用实例启动给定的路径。实例启动的路径存储在变量{}{}path_index{}{}中。",
    "This will make the calling instance follow the path indexed in the variable \"path\" at a speed of 4 pixels per step. It will follow the path relative to its own position, and when it reaches the end it will reverse direction and go back the way it came.":"这将使调用实例以每步4个像素的速度跟随变量\" path \"中索引的路径。它会沿着相对于自己位置的路径前进，当它到达终点时，它会改变方向，回到它来的地方。",
    "What to do when the end of the path is reached (see the constants listed above).":"到达路径终点时要执行的操作(请参阅上面列出的常量)。",
    "What to do when the end of the path is reached.":"到达路径终点时该怎么办。",
    "Whether the calling instance should follow the absolute path as it is defined in&nbsp;{}The Path Editor{} ({}true{}) or a relative path to its current position ({}false{}).":"调用实例是否应遵循 {} 路径编辑器 {} 中定义的绝对路径 ({}true{})，或其当前位置的相对路径 ({}false{})。",
    "Whether the calling instance should follow the absolute path as it is in the editor (true) or a relative path to its current position (false).":"调用实例应遵循编辑器中的绝对路径(true)还是其当前位置的相对路径(false)。",
    "{}As you can see in the above image, the two instances are following the same path started with {}path_start(){}, but one of the instances is following the absolute path while the other is following the relative path. It should be noted that when relative is set to false (absolute) the instance will \"jump\" to the start of the path no matter where in the room it is placed.":"{}正如您在上图中所看到的，两个实例遵循以{}path_start(){}开头的相同路径，但是其中一个实例遵循绝对路径，而另一个则遵循相对路径。需要注意的是，当RELATIVE设置为FALSE(ABSOLUTE)时，实例将\"跳转\"到路径的起点，无论它位于房间中的哪个位置。",
    "{}As you can see in the above image, the two instances are following the same path started with {}{}path_start{}{}, but one of the instances is following the absolute path while the other is following the relative path. It should be noted that when {}absolute{} is set to {}false{}&nbsp;(i.e. relative) the instance will \"jump\" to the start of the path no matter where in the room it is placed.":"{}如上图所示，两个实例遵循以{}{}path_start{}{}开头的相同路径，但其中一个实例遵循绝对路径，而另一个实例遵循相对路径。应该注意的是，当{}absolute{}设置为{}false{}(即相对)时，无论实例放置在房间的哪个位置，都会\"跳转\"到路径的开头。",
    "{}{}NOTE{}{}&nbsp;When following a path, an instance\u0027s position is updated&nbsp;{}after&nbsp;the Step event{}, so during the Step event its&nbsp;{}x{} and {}y{} position will be the same as its&nbsp;{}xprevious{}&nbsp;and&nbsp;{}yprevious{}&nbsp;(unless manually modified in the Begin Step or Step events).":"{}{} 注意{}{} 沿着路径行驶时，实例的位置会在 {}Step 事件之后 {} 更新，因此在 Step 事件期间，其 {}x{} 和 {}y{} 位置将相同作为其 {}xprevious{} 和 {}yprevious{}( 除非在 Begin Step 或 Step 事件中手动修改)。",
    "{}{}WARNING{}{}&nbsp;This function should be called from the scope of an instance. An error will be thrown&nbsp;if it\u0027s not.":"{}{}警告{}{}应从实例的范围内调用此函数。如果不是，则会抛出错误。",
    "给出了用于定义实例到达路径末端时的行为的常量":"给出了实例定义到达路径结束时的行为的常量"
}