{
    "A debug message shows the contents&nbsp;of array {}_a{} after copying.":"一条调试消息显示复制后数组 {}_a{} 的内容。",
    "In the above example, first two temporary arrays {}_a{} and {}_b{} are initialised. Next two elements are copied from {}_b{} to {}_a{}. The src_index and length parameter are set to -1 and -2, respectively. This means that the last (-1) and the&nbsp;one before last array element are copied (2 elements, counting backwards because&nbsp;of the minus sign, from the end&nbsp;of array {}_b{}). This means the values of the&nbsp;last element and&nbsp;one before last element of {}_b{} are copied to positions 1 (the value of the dest_index parameter) and 2 in {}_a{} respectively.":"在上面的示例中，首先初始化两个临时数组 {}_a{} 和 {}_b{}。接下来，将两个元素从 {}_b{} 复制到 {}_a{}。src_index 和 length 参数分别设置为 -1 和 -2。这意味着将复制最后一个 (-1) 和最后一个数组元素之前的(2 个元素，因为减号从数组 {}_b{} 的结尾开始倒数)。这意味着将 {}_b{} 的最后一个元素和最后一个元素的值分别复制到 {}_a{} 中的位置 1(dest_index 参数的值) 和位置 2。",
    "The ID of the array to copy from.":"要从中复制的数组的ID。",
    "The ID of the array to copy to.":"要复制到的数组的ID。",
    "The above code checks two arrays using&nbsp;{}{}array_equals{}{} to see if they hold equivalent values. If they don\u0027t, the code will copy the entire contents of the array {}inventory_array{} into the array {}item_array{}.":"上面的代码使用 {}{}array_equals{}{} 检查两个数组，看它们是否包含相等的值。如果不这样做，代码将把数组 {}inventory_array{} 的全部内容复制到数组 {}item_array{} 中。",
    "The above code will check two arrays to see if they hold equivalent values, and if they do not then the code will copy the entire contents of the array \"inventory_array\" into the array \"item_array\".":"上面的代码将检查两个数组以查看它们是否保存等效值，如果它们不保存，则代码将把数组 “inventory_array” 的全部内容复制到数组 “item_array” 中。",
    "The index with the array to start copying from.":"从开始复制的具有数组的索引。",
    "The index within the array to copy to.":"要复制到的数组内的索引。",
    "The index within the array to copy to.&nbsp;Negative indices are supported and count from the end of the array. An offset of -1 refers to the last element of the array, an offset of -2 to the one before last element, etc. (see&nbsp;{}Offset And Length{})":"数组中要复制到的索引。支持负索引，从数组末尾开始计算。偏移量-1表示数组的最后一个元素，偏移量-2表示最后一个元素之前的一个元素，依此类推(参见{}偏移量和长度{})",
    "The index within the array to start copying from.&nbsp;Negative indices are supported and count from the end of the array. An offset of -1 refers to the last element of the array, an offset of -2 to the one before last element, etc. (see&nbsp;{}Offset And Length{})":"数组中开始复制的索引。支持负索引，从数组末尾开始计数。偏移量-1表示数组的最后一个元素，偏移量-2表示最后一个元素之前的一个元素，依此类推(参见{}偏移量和长度{})",
    "The length (number of array indices) to copy, starting with the value at src_index. A negative value&nbsp;can be provided for length; in this case copying also starts at index src_index, but the next elements that are copied are src_index-1, src_index-2, etc. I.e. elements are copied \"backwards\". Note that the first value is always written at dest_index, the second value at dest_index+1, etc.":"要复制的长度 (数组索引数)，从 src_index 处的值开始。可以为长度提供负值在这种情况下，复制也从索引 src_index 开始，但接下来被复制的元素是 src_index-1、src_index-2 等。即，向后复制元素。请注意，第一个值始终写入 dest_index，第二个值写入 dest_index+1，依此类推。",
    "The length (number of array indices) to copy.":"要复制的长度 (数组索引数)。",
    "The reference to the array to copy from.":"要从中复制的数组的引用。",
    "The reference to the array to copy to.":"对要复制到的数组的引用。",
    "This function can also be used for multi-dimension arrays, as long as you specify which dimension you want to copy when you supply the array index, following this pattern:":"该函数也可以用于多维数组，只要您在提供数组索引时指定要复制的维度，就可以遵循以下模式:",
    "This function can also be used for multidimensional arrays, as long as you specify which dimension you want to copy when you supply the array index, following this pattern:":"此函数也可用于多维数组，只要您指定在提供数组索引时要复制的维度，遵循以下模式：",
    "This function copies all or part of an array into another array at any position.":"此函数用于在任何位置将一个数组的全部或部分复制到另一个数组中。",
    "With this function you can copy all or part of an array into another array at any position. You need to supply both the source and the destination arrays (both need to have been created previously), as well as a position within the source array to copy from and a position within the destination array to copy to. Finally you need to specify the length of the array (or the length of the part that you want) to copy. If the data being copied exceeds the length of the destination array, the array will be extended to accept the data.":"使用此函数，您可以在任何位置将数组的全部或部分复制到另一个数组中。您需要提供源和目标数组 (两者都需要先前创建)，以及要从中复制的源数组中的位置和要复制到的目标数组中的位置。最后，您需要指定要复制的数组的长度 (或要复制的部分的长度)。如果复制的数据超过目标数组的长度，则数组将被扩展以接受数据。",
    "You supply both the source and the destination arrays (both created previously), as well as a position within the source array to copy from and a position within the destination array to copy to. Finally you need to specify the length of the array (or the length of the part that you want) to copy. If the data being copied exceeds the length of the destination array, the array will be extended to accept the data. The function supports specifying negative values for the index and number of elements, as described under&nbsp;{}Offset And Length{}.":"您可以同时提供源和目标数组(这两个数组都是先前创建的)，以及源数组中要复制的位置和目标数组中要复制到的位置。最后，您需要指定要复制的数组的长度(或要复制的部分的长度)。如果要复制的数据超过目标数组的长度，则该数组将被扩展以接受数据。该函数支持为索引和元素数量指定负值，如{}偏移量和长度{}中所述。"
}