{
    "Boolean&nbsp;(whether the condition checked in the {}function{} is {}true{} {}or{} {}false{})":"布尔值（在 {} 函数 {} 中检查的条件是 {} true {} {} 还是 {} {} false {}）",
    "Once a value is found the function stops execution so array elements that come after that will not be checked using the predicate function.":"一旦找到值，函数将停止执行，因此之后的数组元素将不会使用谓词函数进行检查。",
    "The above code first creates a function that takes an array element and its index as the input. The function returns {}true{} if the element is greater than 0 and {}false{} if not. An array with values is then created, some negative, others zero or positive.{}\n    Finally an index is found using&nbsp;{}array_find_index{}&nbsp;and stored in a temporary variable {}index{}. This variable will contain the value 5, as the first positive value in the array, 3, is at array index 5.":"上面的代码首先创建了一个以数组元素及其索引作为输入的函数。如果元素大于 0，则函数返回 {}true{}；如果不是，则返回 {}false{}。然后创建一个包含值的数组，一些为负值，另一些为零或正值。{}\n最后，使用 {} array_find_index{} 找到一个索引，并存储在临时变量 {}index{} 中。此变量将包含值 5，因为数组中的第一个正值 3 位于数组索引 5 处。",
    "The array to use":"要使用的数组",
    "The current array element":"当前数组元素",
    "The current array index":"当前数组索引",
    "The function to use for each element":"用于每个元素的函数",
    "{}This function returns the index of the {}first{} element {}in the input array or in a range of it&nbsp;{}for which the predicate function returns {}true{} or -1{}&nbsp;{}if no such element is found.{}":"{}此函数返回输入数组中或其范围{}中第一个{}元素{}的索引，如果找不到此类元素，则谓词函数返回{} true {}或-1 {}{}。{}",
    "{}{}OPTIONAL{}{}&nbsp;The number of elements to traverse. A negative value will traverse the array backwards (i.e. in descending order of indices, e.g. 2 &gt; 1 &gt; 0 instead of 0 &gt; 1 &gt; 2).":"{}{}可选{}{}要遍历的元素数。负值将反向遍历数组（即按索引的降序排列，例如2 &gt; 1 &gt; 0而不是0 &gt; 1 &gt; 2）。",
    "{}{}OPTIONAL{}{}&nbsp;The offset, or the starting index, in the array. Setting a negative value will count from the end of the array. The starting index will then be {}array_length(array) + offset{}.":"{}{}可选{}{}数组中的偏移量或起始索引。设置负值将从数组末尾开始计数。开始索引将为{}array_length(array)+偏移量{}。",
    "{}{}Real{}{}&nbsp;(the index of the first element found or -1 if nothing was found)":"{}{} Real{}{}(找到的第一个元素的索引，如果没有找到，则为-1 )"
}