{
    "It then uses&nbsp;{}{}array_create_ext{}{}&nbsp;with the {}_f{} function which creates an array filled with the integer numbers from 1 to 100.":"然后，它将 {}{}array_create_ext{}{} 与函数 {}_f{} 配合使用，该函数将创建一个填充了从 1 到 100 的整数的数组。",
    "The above code first creates a temporary function {}_f{} that takes in an index as an argument, and returns that index with 1 added to it.":"上面的代码首先创建一个临时函数 {}_f{}，该函数接受一个索引作为参数，并返回该索引并将其加 1。",
    "The above code first creates a temporary function {}f{} that takes in an index as the first and only argument and returns that index with 1 added to it. It then uses&nbsp;{}{}array_create_ext{}{}&nbsp;with this function which creates an array filled with the integer numbers from 1 to 100.":"上面的代码首先创建了一个临时函数 {} f{}，该函数将索引作为第一个也是唯一的参数，返回该index，并加了1。然后，它使用 {}{}array_create_ext{}{} 此函数创建一个数组，该数组填充了从1到100的整数。",
    "The current array index":"当前数组索引",
    "The function has to take 1 argument, which is the index, and return a value of type&nbsp;{}{}Any{}{}&nbsp;for that index, which is the value that is placed in the array at that index.":"函数必须采用1个参数，即索引，并为该索引返回一个类型为 {}{} Any {}{} 的值，该值是放置在该索引处的数组中的值。",
    "The function used to initialize each entry.":"用于初始化每个条目的函数。",
    "The size of the array":"数组的大小",
    "The {}callback{} function supplied in the second argument should take 1 argument, which is the index of the current array element. It can return any type of value, which is stored in the array at that index.":"第二个参数中提供的{}回调{}函数应采用 1 个参数，这是当前数组元素的索引。它可以返回任何类型的值，这些值存储在该索引处的数组中。",
    "The {}callback{} function used to initialise each entry":"用于初始化每个条目的{}回调{}函数",
    "Using this function you can initialise the array with values that change depending on the array index.":"使用此函数，您可以使用根据数组索引更改的值来初始化数组。",
    "Using this function you can initialise the array with values that depend on the array index.":"使用此函数，您可以使用依赖于数组索引的值初始化数组。",
    "{}Callback function{}{}Callback function{}":"{}回调函数{}{}回调函数{}",
    "{}This function creates an array of the given size and calls the function to initialise each entry.{}":"{} 此函数创建给定大小的数组，并调用该函数初始化每个条目。{}",
    "{}This function creates an array of the given size. For each element in the new array, it calls the given callback function, and applies the return value to that element.{}":"{}此函数创建给定大小的数组。对于新数组中的每个元素，它调用给定的回调函数，并将返回值应用于该元素。{}"
}