{
    "For a static struct: the parent static struct in the {}Static Chain{}.&nbsp;When using constructor inheritance, static structs are chained, i.e. you can get the static struct of a static struct, if the constructor has a parent constructor.":"对于静态结构：{}静态链{}中的父静态结构。当使用构造函数继承时，静态结构被链接，即如果构造函数有父构造函数，则可以获得静态结构的静态结构。",
    "For a struct created from a constructor using the {}{}new{}{}&nbsp;keyword: the static struct for the constructor that was used to create the struct (or a different struct if it was changed after creation using {}{}static_set{}{}).":"对于使用{}{}new{}{}关键字从构造函数创建的结构：用于创建该结构的构造函数的静态结构(如果在使用{}{}static_set{}{}创建后更改了该结构，则为不同的结构)。",
    "For any other struct: this struct\u0027s \"parent\" struct, which links the struct to the \"root\" struct.":"对于任何其他结构：此结构的\"父\"结构，它将结构链接到\"根\"结构。",
    "For the \"root\" struct: {}undefined{}":"对于\"root\"结构：{}undefined{}",
    "See:&nbsp;{}Static Struct{}":"请参阅：{}静态结构{}",
    "The above code creates a function {}counter(){} with a static variable. The function is called repeatedly so its static variable\u0027s value is increased.":"上面的代码创建了带有静态变量的函数 {}counter(){}。该函数被重复调用，因此其静态变量的值会增加。",
    "The above code first creates two constructors: a parent constructor {}item{}&nbsp;with a single static function {}hello{} and a child constructor {}potion{}. It then creates a new {}potion{}&nbsp;and stores it in a variable {}my_potion{}. Next, a call to&nbsp;{}{}static_get{}{}&nbsp;is made to get the static struct of {}my_potion{}. The returned static struct, stored in a temporary variable {}_static_potion{}, is part of the static chain. From this point, all further calls to&nbsp;{}{}static_get{}{}&nbsp;will move up in the static chain. Another call to&nbsp;{}{}static_get{}{}&nbsp;is made, which returns the static of {}item{} and stores it in another temporary variable&nbsp;{}_static_parent{}. Finally, this struct\u0027s {}hello{} method is called.":"上面的代码首先创建两个构造函数：带有单个静态函数 {}hello{} 的父构造函数 {}item{} 和子构造函数 {}potion{}。 然后，它创建一个新的 {}potion{} 并将其存储在变量 {}my_potion{} 中。 接下来，调用 {}{}static_get{}{} 以获取 {}my_potion{} 的静态结构。 返回的静态结构体存储在临时变量 {}_static_potion{} 中，是静态链的一部分。 从此时起，对 {}{}static_get{}{} 的所有进一步调用都将在静态链中向上移动。 再次调用 {}{}static_get{}{}，返回 {}item{} 的静态值并将其存储在另一个临时变量 {}_static_parent{} 中。 最后，调用该结构体的 {}hello{} 方法。",
    "The static struct for that function is then returned, and stored in a variable ({}_static_counter{}). Then it prints the static variable from the function, by first reading it from the function directly ({}counter.count{}) and then reading it from the static struct ({}_static_counter.count{}). Both print the same value, as they refer to the exact same variable.":"然后返回该函数的静态结构，并将其存储在变量 ({}_static_counter{}) 中。然后，它打印函数中的静态变量，方法是首先直接从函数中读取静态变量 ({}counter.count{})，然后从静态结构中读取它 ({}_static_counter.count{})。两者都打印相同的值，因为它们引用完全相同的变量。",
    "The struct or function for which to get the static struct":"要获取其静态结构的结构或函数",
    "The struct, function or method for which to get the static struct":"要获取静态结构体的结构体、函数或方法",
    "This function&nbsp;returns the static struct for the given function or struct.":"此函数返回给定函数或结构的静态结构。",
    "This function&nbsp;returns the static struct for the given function, or {}undefined{} if it has no static. The static struct is where all static variables for a function are stored.":"此函数 返回给定函数的静态结构，如果没有静态结构，则返回 {}undefined{}。静态结构是存储函数的所有静态变量的地方。",
    "This function&nbsp;returns the {}Static Struct{} for the given function or struct.":"该函数返回给定函数或结构体的 {}静态结构体{}。",
    "When using constructor inheritance, static structs are chained, i.e. you can get the static struct of a static struct, if the constructor has a parent constructor.":"在使用构造函数继承时，静态结构是链接的，也就是说，如果构造函数有父构造函数，则可以获得静态结构的静态结构。",
    "When you supply a function or method, this function returns the static struct for that function or method.":"当你提供一个函数或方法时，该函数返回该函数或方法的静态结构体。",
    "When you supply a function, this function returns the static struct for the function.":"当您提供函数时，此函数返回该函数的静态结构。",
    "You can also supply a struct, in which case it will give you the static struct for the constructor that was used to create the struct (or it may be a different struct if it was changed using {}{}static_set{}{}).":"您还可以提供一个结构，在这种情况下，它将为您提供用于创建该结构的构造函数的静态结构 (或者，如果它是使用 {}{}static_set{}{} 更改的，则它可能是一个不同的结构)。",
    "You can also supply a struct. What\u0027s returned depends on the struct:&nbsp;":"你也可以提供一个结构体。返回的内容取决于结构体：",
    "{}{}NOTE{}{}&nbsp;You can pass the result of&nbsp;{}{}method_get_index{}{}&nbsp;to get the static struct of a method\u0027s function.":"{}{}注意{}{}：你可以将 {}{}method_get_index{}{} 的结果传递给该函数，以获取方法的静态结构体。",
    "{}{}Struct{}{}&nbsp;or&nbsp;{}{}undefined{}{}&nbsp;(for the root struct)":"{}{}结构体{}{} 或 {}{}undefined{}{}（用于根结构体）"
}