{
    "A solid particle group prevents other fixtures from lodging inside of it. Should anything penetrate it, the solid particle group pushes the offending fixture back out to its surface, making a a solid particle group possess an especially strong repulsive force.":"实体粒子组可防止其他固定装置嵌入其中。如果有任何东西穿透它，固体颗粒团会将有害的固定装置推回到它的表面，使固体颗粒团具有特别强的排斥力。",
    "Finally you have to give the category for your particle group. This value is an arbitrary integer value that you give each particle group that you want to have similar properties, and it can be used to set flags later for that specific category as well as a number of other things.":"最后，必须为粒子组指定类别。该值是一个任意整数值，您可以为每个要具有类似属性的粒子组指定该值，以后可以使用该值为该特定类别以及许多其他类别设置标志。",
    "It is important to note that calling this function does {}not{} create the group in the physics room. This function simply begins the process and sets the base particle properties for the group. To actually create the particle group you need to give it a {}form{} (see the example below) and then call the function {}{}physics_particle_group_end(){}{}, at which point it will be created.":"请务必注意，调用此函数{}不会{}在物理房间中创建组。该函数只是开始该过程并为组设置基础粒子属性。要实际创建粒子组，需要为其指定 {} 形式 {}( 请参见下面的示例)，然后调用函数 {}{}physics_particle_group_end(){}{}，此时将创建该粒子组。",
    "Other than the flags, you can also set the position in the room to create the particle group at (the position given will be the center of mass of the finished group), the initial horizontal and vertical velocity, as well as the angular velocity of the group, permitting you to create moving, rotating groups.":"除了标志之外，还可以在房间中设置位置以创建粒子组(给定的位置将是完成组的质心)、初始水平和垂直速度以及组的角速度，从而允许您创建移动的旋转组。",
    "Physics Particle Flag Constant":"物理粒子标志常量",
    "Physics Particle Group Flag Constant":"物理粒子组标志常量",
    "Rigid particle groups are ones whose shape does not change, even when they collide with other fixtures.":"刚性粒子组是其形状不会更改的粒子组，即使它们与其他装置碰撞也是如此。",
    "Set the cohesion strength between particles in the group.":"设置组中粒子之间的内聚强度。",
    "The above code stores the flags for the particle type and the particle group properties in variables then uses these to create a circular particle group with a 100px radius at the mouse position.":"上述代码将粒子类型和粒子组属性的标志存储在变量中，然后使用这些标志在鼠标位置创建半径为 100px 的圆形粒子组。",
    "The angle (in degrees) to rotate the group to on create.":"创建时旋转组的角度(以度为单位)。",
    "The base alpha to use for the particle group.":"用于粒子组的基本 Alpha。",
    "The base colour to use for the particle group.":"用于粒子组的基础颜色。",
    "The flags to set on the particle.":"要在粒子上设置的标志。",
    "The group flags to set on the particle group (see table at the top).":"要在粒子组上设置的组标志(请参见顶部的表格)。",
    "The initial angular velocity.":"初始角速度。",
    "The initial horizontal velocity.":"初始水平速度。",
    "The initial vertical velocity.":"初始垂直速度。",
    "The user defined category to which the group belongs.":"用户定义的组所属的类别。",
    "The x position to create the particle group at.":"用于创建粒子组的 X 位置。",
    "The y position to create the particle group at.":"用于创建粒子组的 Y 位置。",
    "These group flags use bit-masking to create a final output value that is then checked to set the different basic properties of the group, apart from those set by the particle flags. You can use none, one or both of these constants by using the {}bitwise {}or{}{} \"|\" to mask the appropriate bits (as shown in the example below).":"这些组标志使用位掩码来创建最终输出值，然后选中该值以设置组的不同基本属性 (粒子标志设置的属性除外)。通过使用 {} 位 {} 或 {}{}\"|\" 来屏蔽相应的位 (如下例所示)，可以不使用任何、一个或两个常量。",
    "With this function you can create a group of particles in a room. A group of particles is one where the particles necessary to create a specific form are created all at once as a group, permitting you to create simulated soft-bodies with various properties set by the flags used. The \"flags\" are the return value of a combination of the {}particle constants{} (see the function {}{}physics_particle_create(){}{} for details of these), while the \"groupFlags\" are a combination of the following {}group constants{} (or 0 for no flags):":"使用此函数，可以在房间中创建一组粒子。在一组粒子中，创建特定形状所需的粒子将作为一个组一次创建，从而允许您创建具有由所用标志设置的各种属性的模拟软体。\"flags\" 是 {} 粒子常数 {} 的组合的返回值 (有关这些常数的详细信息，请参阅 {}{} 函数 physics_particle_create(){}{})，而 \"groupflags\" 是以下 {} 组常数 {} 的组合 (无标志时为 0)：",
    "You can also set initial colour and alpha of all particles in the group, with the values being used when drawing the particles using the function {}{}physics_particle_draw(){}{}. After that you set the cohesive strength of particles in the group, which is another way of saying how strongly they \"stick\" to each other. The strength can be a value between 0 and 1, where 0 is no cohesion, and 1 is maximum cohesion.":"您还可以设置组中所有粒子的初始颜色和 Alpha，使用函数 {}{}physics_particle_draw(){}{} 绘制粒子时使用的值。然后设置组中粒子的内聚强度，这是表示它们 \" 粘附 \" 彼此的强度的另一种方法。强度可以是介于 0 和 1 之间的值，其中 0 表示无内聚力，1 表示最大内聚力。",
    "{}NOTE{}: The particle type flags that you set will also influence the cohesion of the particle group, such that if you flag the particles as being of the water type (for example), when the group collides with another fixture it will break apart, while if you flag the particle as a spring type, then it will maintain its cohesion on collision.":"{}注意{}：设置的粒子类型标志也会影响粒子组的内聚力，例如，如果将粒子标记为水类型(例如)，则当粒子组与另一个固定装置碰撞时，粒子组会破裂，而如果将粒子标记为弹簧类型，则粒子组会在碰撞时保持内聚力。",
    "{}NOTE{}: You can use any integer value for the category {}except 0{} which is reserved by the simulation and is used to select all categories in other functions (like for drawing).":"{}注意{}: 您可以对类别{}使用除 0{} 之外的任何整数值，该值由模拟保留，用于选择其他函数中的所有类别(如用于绘图)。"
}