{
    "A viscous particle is one that exhibits \"clinginess\" or \"stickiness\", like oil. Viscous particles will clump and stick together more.":"粘性颗粒是表现出\"粘性\"或\"粘性\"的颗粒，就像油一样。粘性颗粒会更多地聚集并粘在一起。",
    "A zombie particle is one that will be destroyed in a single step with all others flagged in this way.":"僵尸粒子是一个将在一个步骤中销毁的粒子，所有其他粒子都以这种方式标记。",
    "Colour-mixing particles take on some of the colour of other particles with which they collide. Note that if only one of the two colliding particles is a colour-mixing one, the other particle retains its pre-collision colour.":"混色粒子具有其他粒子碰撞时的一些颜色。请注意，如果两个碰撞粒子中只有一个是颜色混合粒子，则另一个粒子保留其碰撞前的颜色。",
    "Elastic particles deform and may also bounce when they collide with other rigid bodies in the physics simulation.":"弹性粒子在物理模拟中与其他刚体碰撞时会变形并可能反弹。",
    "Powder particles produce a scattering effect such as you might see with sand or dust.":"粉末粒子会产生散射效果，例如您可能会看到沙子或灰尘。",
    "Spring particles produce the effect of being attached to one another, as if by a spring. Particles created with this flag are \"connected\" in pairs, with each particle being connected to the one that was closest to it at the time of creation. Once paired, particles do not change \"partners\" , and the farther an external force pulls them from one another, the greater the power with which they will collide when that external force is removed. Note that no matter how far paired particles get from each another, the connection between them will not snap.":"弹簧粒子产生相互连接的效果，就像弹簧一样。使用此标志创建的粒子成对\"连接\"，每个粒子都连接到创建时最接近它的粒子。一旦配对，粒子就不会改变\"伙伴关系\"，并且外力将它们彼此拉得越远，当外力被消除时，它们将碰撞的功率就越大。请注意，无论配对的粒子彼此之间的距离有多远，它们之间的连接都不会断开。",
    "Tensile particles are used to produce the effect of surface tension, or the taut curvature on the surface of a body of liquid. They might be used, for example, to create the surface tension you would see on a drop of water. Once the tension is broken, the particles bounce as if they were elastic, but also continue to attract each other. As a result, particles tend to form clusters as they bounce.":"拉伸粒子用于在液体表面产生表面张力或拉伸曲率的影响。例如，它们可用于创建在水滴上看到的表面张力。一旦张力被打破,颗粒就像弹性一样反弹,而且还继续相互吸引。因此，粒子在反弹时倾向于形成簇。",
    "The above code will create a variable to store the flags value and then use it to set the flags of all particles created with the category value of 1.":"以上代码将创建一个变量来存储标志值，然后使用该变量来设置使用类别值 1 创建的所有粒子的标志。",
    "The default properties for a soft body particle.":"柔体粒子的默认属性。",
    "The flags to set on the particle category.":"要在粒子类别上设置的标志。",
    "The particle category to set.":"要设定的粒子类别。",
    "These flags use bit-masking to create a final output value that is then checked to set the different basic properties of the particle category (with the base property always being that of {}phy_particle_flag_water{}). For example, if you want to simulate a viscous liquid with surface tension you would use the {}bitwise {}or{}{} \"|\" to mask off the appropriate bits as shown in the example below. In this way you can set different properties (other than the global properties) for each category of particle created.":"这些标志使用位掩蔽创建最终输出值，然后选中该值以设置粒子类别的不同基本属性 (基本属性始终为 {}phy_particle_flag_water{} 的基本属性)。例如，如果要模拟具有表面张力的粘性液体，则可以使用 {} 位{}或 {}{}\"|\" 来掩蔽相应的位，如下例所示。通过这种方式，可以为创建的每个粒子类别设置不同的属性 (全局属性除外)。",
    "This defines the particle as {}static{}, essentially creating it as an immovable object in the physics simulation, as they will remain in a fixed position no matter what collides with them. You should use this flag rather than set the density to 0.":"这将粒子定义为{}静态{}，实质上是在物理模拟中将其创建为不可移动的对象，因为无论与它们发生什么碰撞，它们都将保持在固定位置。您应该使用此标志，而不是将密度设置为 0。",
    "With this function you can change the particle flags for a category of particles. The {}category{} value is that which you defined in the function {}{}physics_particle_create(){}{} or (if you created a group) {}{}physics_particle_group_begin(){}{}, while the flags are the return value of a combination of the following {}constants{}:":"使用此功能，可以更改粒子类别的粒子标志。{} 类别 {} 的值是在函数 {}{}physics_particle_create(){}{} 或 (如果创建了组) {}{}physics_particle_group_begin(){}{} 中定义的值，而标志是以下{}常量{}的组合的返回值："
}