{
    "Adding effects to the main bus":"将效果添加到主总线",
    "All audio that you play in&nbsp;{}GameMaker{}&nbsp;ends up on this audio bus, whether that is {}2D audio{}, {}3D audio{}&nbsp;or {}emitter audio{}. This is referred to as all audio being&nbsp;{}routed {}to the main bus{}.{}":"在{}GameMaker{}中播放的所有音频都会在此音频总线上结束，无论是{}2D 音频{}、{}3D 音频{}还是{}发射器音频{}。 这称为{}路由{}到主总线的所有音频{}。{}",
    "Any audio output on a bus created using {}{}audio_bus_create{}{} still ends up on {}GameMaker{}\u0027s&nbsp;main audio bus.":"使用{}{}audio_bus_create{}{}创建的总线上的任何音频输出仍然在{}GameMaker{}的主音频总线上结束。",
    "Apply effects to the {}main bus{}, hence applying effects to&nbsp;{}all sounds{}":"将效果应用于{}主总线{}，因此将效果应用于{}所有声音{}",
    "Assigning an emitter to a bus will make the emitter output to that bus. You can assign any number of emitters to a bus.":"将发射器分配给总线将使发射器输出到该总线。可以将任意数量的发射器指定给总线。",
    "Audio Buses":"音频总线",
    "Audio effects are processed on an \"audio bus\".":"音频效果在\"audio bus\"上处理。",
    "By default audio emitters output directly to the main bus, so the audio that is played on an emitter will end up there and have the same effects applied as all other audio.":"默认情况下，音频发射器直接输出到主总线，因此在发射器上播放的音频将在那里结束，并具有与所有其他音频相同的效果。",
    "Bypassing Effects":"绕过效果",
    "Code Reference":"代码参考",
    "Create a {}custom bus{} and apply effects to that bus {} {}Custom buses can only be used with&nbsp;{}Audio Emitters{}&nbsp;{} {} ":"创建{}自定义总线{}并将效果应用于该总线{}{}自定义总线只能用于{}音频发射器{}{}{}",
    "Effects are applied on buses. GameMaker allows you to:":"效果应用于总线。GameMaker允许您：",
    "For a single effect this means that this effect is skipped, for a bus this means that all effects on the bus are skipped.":"对于单个效果，这意味着跳过该效果，对于总线，这意味着跳过总线上的所有效果。",
    "GameMaker offers a selection of audio effects, such as reverb, delay, bitcrusher, etc.":"GameMaker提供了一系列音频效果，如混响、延迟、Bitcrusher等。",
    "Setting Up Audio Effects":"设置音频效果",
    "Setting {}bypass{} to {}true{} means that what comes out of the bus or effect is the same as what goes in -- the input is the output.":"将{}旁路{}设置为{}真{}意味着从总线或效果出来的与进入的相同，输入就是输出。",
    "Sometimes you might want to turn off individual effects or turn off all effects on a bus. You can do this by setting {}bypass{} for an effect or a bus to {}true{}:&nbsp;":"有时您可能想关闭单个效果或关闭总线上的所有效果。通过将效果或总线的{}旁路{}设置为{}true{}，可以执行此操作：",
    "Sounds are always played through \"buses\". All sounds in GameMaker are played through its {}main bus{}.":"声音总是通过\"总线\"播放。GameMaker中的所有声音都通过其{}主总线{}播放。",
    "The effect is then assigned to the main audio bus\u0027s {}effects{} array. Assigning the effect to a slot in the array enables the effect.":"然后将效果分配给主音频总线的{}效果{}阵列。将效果指定给阵列中的槽可以启用效果。",
    "The quickest way to apply effects to all audio is by adding them to the main bus:&nbsp;":"将效果应用于所有音频的最快方法是将它们添加到主总线：",
    "The size of the reverb effect is set to 0.6 and the mix value to 0.5 (how much of the effect can be heard from 0-1, similar to&nbsp;{}{}lerp{}{}).":"混响效果的大小设置为0.6，混合值设置为0.5(从0-1可以听到多少效果，类似于{}{}lerp{}{})。",
    "This first creates a new audio effect of type {}{}AudioEffectType.Reverb1{}{}. Its parameters are then set by directly setting the members of the returned&nbsp;{}AudioEffect Struct{}.":"此操作首先创建新的音频效果类型{}{}AudioEffectType.Reverb1{}{}。 然后，通过直接设置返回的{}AudioEffect Struct{}的成员来设置其参数。",
    "This means that you can apply a delay effect to all sounds that are played on an emitter, and a reverb effect on the main audio bus. Audio that is played on the emitter is processed by the audio bus assigned to it so it will be heard with the delay effect from the emitter bus&nbsp;{}and&nbsp;{}the reverb effect from the main bus. Audio that is played directly on the main bus will {}only{} have the reverb effect applied.":"这意味着您可以将延迟效果应用于在发射器上播放的所有声音，并在主音频总线上应用混响效果。在发射器上播放的音频由分配给它的音频总线处理，因此它将与来自发射器总线的延迟效果和来自主总线的混响效果一起被听到。直接在主总线上播放的音频将{}仅{}应用混响效果。",
    "To get the audio bus that an emitter is assigned, use {}{}audio_emitter_get_bus{}{}.":"要获得分配发射器的音频总线，请使用{}{}audio_emitter_get_bus{}{}。",
    "You can add effects to an&nbsp;{}audio emitter{}&nbsp;by creating a new audio bus using&nbsp;{}{}audio_bus_create{}{}&nbsp;and assigning it to the emitter using {}{}audio_emitter_bus{}{}:&nbsp;":"通过使用{}audio_bus_create{}创建新的音频总线并使用{}{}audio_emitter_bus{}{}将其分配给发射器，可以向{}音频发射器{}添加效果：",
    "You can {}create your own bus{} to apply effects to a few sounds. All custom buses are routed to the main bus, so the parameters and effects on the main bus are applied to all other buses.":"您可以{}创建自己的总线{}，以对一些声音应用效果。所有自定义总线均路由至主总线，因此对主总线的参数和效果适用于所有其他总线。",
    "{}Audio Effects{}":"{}音效{}",
    "{}GameMaker{}&nbsp;has one audio bus by default, the main audio bus, which you can access through the built-in&nbsp;{}{}audio_bus_main{}{}&nbsp;struct.":"默认情况下，{}GameMaker{}有一条音频总线，即主音频总线，您可以通过内置的{}{}audio_bus_main{}{}struct来访问它。",
    "{}{}Applying Effects To Audio Emitters":"{}{}将效果应用于音频发射器",
    "{}{}IMPORTANT{}{}&nbsp;All effects have default parameters set that output the original signal. This means that you {}have to{} change the parameters in order for any effect to be heard.":"{}{}重要{}{}所有效果都有输出原始信号的默认参数设置。这意味着您{}必须{}更改参数才能听到任何效果。",
    "{}{}NOTE{}{}&nbsp;An audio bus can have a maximum of 8 effects assigned to its {}effects{} array. Set a slot to {}undefined{}&nbsp;to remove an effect.":"{}{}注意{}{}音频总线最多可以有8个效果分配给其{}效果{}阵列。将槽设置为{}未定义{}以移除效果。",
    "{}{}NOTE{}{}&nbsp;As previously mentioned, audio can only be processed on a different bus than the main bus by playing it on an emitter (using&nbsp;{}{}audio_play_sound_on{}{}).":"{}{}注意{}{}如前所述，音频只能在不同于主总线的总线上通过在发射器上播放来处理(使用{}{}audio_play_sound_on{}{})。",
    "{}{}NOTE{}{}&nbsp;Because the effect is processed from the moment it\u0027s assigned, it\u0027s good practice to first set the effect\u0027s parameters and only then assign the effect to the effects array. This will make sure that no transition from no effect to an audible effect occurs.":"{}{}注意{}{}因为效果是从分配的那一刻开始处理的，所以最好先设置效果的参数，然后再将效果分配给效果数组。这将确保不会发生从无效果到可听效果的过渡。"
}