{
    "A high-pass filter lets higher frequencies pass and mutes lower frequencies. The frequency at which this happens is called the {}cutoff{} frequency. All frequencies below this frequency are filtered.":"高通滤波器允许较高的频率通过，并使较低的频率静音。发生这种情况的频率称为{}截止{}频率。低于此频率的所有频率都会被过滤。",
    "A low-pass filter lets lower frequencies pass and mutes higher frequencies.&nbsp;The frequency at which this happens is called the {}cutoff{} frequency. All frequencies above this frequency are filtered.":"低通滤波器允许较低的频率通过，并使较高的频率静音。发生这种情况的频率称为{}截止{}频率。高于该频率的所有频率都会被过滤。",
    "A reverb effect is typically used to change the environment in which the audio is heard. You can configure reverb to make the environment appear anywhere between a small room and a grand hall or a vast open space.":"混响效果通常用于改变听到音频的环境。您可以配置混响，使环境出现在小房间和大厅或广阔的开放空间之间的任何地方。",
    "A tremolo effect changes the amplitude of a sound.":"颤音效果会改变声音的幅度。",
    "A whistle at a high pitch is an example of a high frequency.":"高音的哨声是高频的一个例子。",
    "Bass and drum kicks are typically low frequencies in audio.":"低音和鼓声通常是音频中的低频。",
    "Below is a list of audio effects that are currently available to choose from.":"以下是当前可供选择的音频效果列表。",
    "Below is a list of audio effects that are currently available to choose from. See&nbsp;{}AudioEffect Struct{}&nbsp;for the parameters you can set for each effect.":"以下是当前可供选择的音频效果列表。有关可为每个效果设置的参数，请参阅{}AudioEffect Struct{}。",
    "First the gain factor is applied to the input signal.":"首先，将增益因子应用于输入信号。",
    "Gain&nbsp;{}{}{}→{}{}{} Clipper&nbsp;{}{}{}→{}{}{} Sample rate reduction&nbsp;{}{}{}→{}{}{} Resolution reduction":"增益&nbsp;{}{}{}→{}{}{} 限幅&nbsp;{}{}{}→{}{}{} 采样率降低&nbsp;{}{}{}→{}{}{} 分辨率降低",
    "Here is an example of how this allows you to control frequencies:":"以下是如何控制频率的示例：",
    "Next, sample rate reduction reduces the quality of the audio by {}downsampling{}&nbsp;it. This leads to distortion.":"接下来，降低采样率会通过对音频进行{}下采样{}来降低音频质量。这会导致扭曲。",
    "Resolution reduction reduces the quality of the audio by decreasing the number of bits to represent a sample. As there are less bits to store the same value, some information is lost. This also leads to distortion.":"分辨率降低通过减少表示样本的位数来降低音频的质量。由于存储相同值的位数较少，因此会丢失一些信息。这也会导致失真。",
    "Sample rate reduction reduces the quality of the audio by {}downsampling{}&nbsp;it. This leads to distortion.":"采样率降低通过{}下采样{}来降低音频的质量。这会导致失真。",
    "See {}Delay (AudioEffectType.Delay){}&nbsp;for the full list of properties that you can adjust for this effect type.":"请参阅{}延迟 (AudioEffectType.Delay){}了解可针对此效果类型调整的完整属性列表。",
    "See {}Distortion (AudioEffectType.Bitcrusher){}&nbsp;for the full list of properties that you can adjust for this effect type.":"请参阅{}失真 (AudioEffectType.Bitcrusher){}了解可针对此效果类型调整的完整属性列表。",
    "See {}Gain (AudioEffectType.Gain){}&nbsp;for the full list of properties that you can adjust for this effect type.":"请参阅{}增益 (AudioEffectType.Gain){}了解可针对此效果类型调整的完整属性列表。",
    "See {}HPF (AudioEffectType.HPF2){}&nbsp;for the full list of properties that you can adjust for this effect type.":"请参见{}HPF (AudioEffectType.HPF2){}了解可针对此效果类型调整的完整属性列表。",
    "See {}LPF (AudioEffectType.LPF2){}&nbsp;for the full list of properties that you can adjust for this effect type.":"请参阅{}LPF (AudioEffectType.LPF2){}了解可针对此效果类型调整的完整属性列表。",
    "See {}Reverb (AudioEffectType.Reverb1){}&nbsp;for the full list of properties that you can adjust for this effect type.":"请参阅{}混响 (AudioEffectType.Reverb1){}了解可针对此效果类型调整的完整属性列表。",
    "See&nbsp;{}Tremolo (AudioEffectType.Tremolo){}&nbsp;for the full list of properties that you can adjust for this effect type.":"请参阅{}颤音 (AudioEffectType.Tremolo){}了解可针对此效果类型调整的完整属性列表。",
    "The audio channels are linked when evaluating the input signal\u0027s current level. This means that each channel will have the same gain reduction applied to it. This is done in order to prevent image shifting changing the user\u0027s localisation of positioned audio.":"在评估输入信号的当前电平时，音频通道会被链接。这意味着每个通道都将应用相同的增益降低。这样做是为了防止图像移位改变用户对定位音频的定位。",
    "The resulting signal is then&nbsp;{}clipped{}&nbsp;between -1 and 1 (essentially doing&nbsp;{}{}clamp{}{}&nbsp;on every sample). This is the first step that introduces distortion.":"然后，将得到的信号在 -1 和 1 之间进行{}剪裁{}(实质上是对每个样本进行{}{}clamp{}{})。这是引入扭曲的第一步。",
    "This effect contains a high-pass, a low-pass, 4 peak EQs, a high-shelf and a low-shelf filter.":"该效果包含一个高通、一个低通、4 个峰值均衡器、一个高架和一个低架滤波器。",
    "This effect performs&nbsp;{}downward{} compression, which reduces&nbsp;the volume of loud sounds&nbsp;{}above{}&nbsp;a certain threshold. The quiet sounds&nbsp;{}below{}&nbsp;the threshold remain unaffected.":"此效果执行{}向下{}压缩，从而降低{}高于{}某个阈值的响亮声音的音量。{}低于{}阈值的安静声音不受影响。",
    "This filter creates a peak or a dip in the spectrum by a specified gain around a specified centre frequency.":"该滤波器通过指定中心频率周围的指定增益在频谱中产生峰值或谷值。",
    "This filter passes all frequencies, but increases or reduces frequencies above the shelf frequency by a specified gain.":"该滤波器通过所有频率，但按指定增益增加或减少高于架子频率的频率。",
    "This filter passes all frequencies, but increases or reduces frequencies below the shelf frequency by a specified gain.":"该滤波器通过所有频率，但会按指定增益增加或减少低于架子频率的频率。",
    "This is a Parametric EQ ({}equalizer{}) effect. It combines multiple filters, each at a different frequency, to modify the frequency content of audio.":"这是参数 EQ({}均衡器{})效果。它结合了多个滤波器，每个滤波器具有不同的频率，以修改音频的频率内容。",
    "This is a gain effect, which amplifies the input signal by the given gain factor.":"这是一种增益效应，将输入信号放大给定的增益系数。",
    "This is a {}bitcrusher{} effect to create {}distortion{}. It does this in four steps (or {}stages{}), that take place in the following order:&nbsp;":"这是一种{}位粉碎器{}效果，以创建{}扭曲{}。它分四个步骤(或{}阶段{})，按以下顺序进行：",
    "This is a {}bitcrusher{} effect to create {}distortion{}. It does this in two ways: using sample rate reduction and resolution reduction.":"这是一个{}BitCrusher{}效果，用于创建{}扭曲{}。它通过两种方式实现这一点：使用采样率降低和分辨率降低。",
    "This is a {}compressor{} effect. It reduces the dynamic range of the audio going into it, resulting in an&nbsp;output with smaller level differences.":"这是一种{}压缩器{}效果。它减少了进入其中的音频的动态范围，从而产生电平差异较小的输出。",
    "This is a {}delay{} effect, which delays the input signal by a given amount of time and mixes this delayed version with the original signal.":"这是一种{}延迟{}效应，将输入信号延迟给定时间，并将此延迟版本与原始信号混频。",
    "This is a {}high-pass filter{} (shortened to {}HPF{}). A filter is used for filtering out certain frequencies.":"这是{}高通滤波器{}(简称为{}HPF{})。 滤波器用于滤除某些频率。",
    "This is a {}low-pass{} filter (shortened to {}LPF{}). A filter is used for filtering out certain frequencies.":"这是一个{}低通滤波器(简称为{}LPF{})。 滤波器用于滤除某些频率。",
    "This is a {}reverb{} effect. It combines the original signal with a reverberated version of it. High frequencies can be {}dampened{}&nbsp;(reduced).":"这是{}混响{}效果。它将原始信号与混响信号组合在一起。高频可以衰减{}(降低)。",
    "This is a {}tremolo{} effect. It makes use of an {}LFO{}&nbsp;(Low-Frequency Oscillator) to modulate&nbsp;audio effect parameters at audio rates (as opposed to game-frame rates).":"这是一种颤音效果。它利用 LFO(低频振荡器) 以音频速率 (而不是游戏帧速率) 调制音频效果参数。",
    "This is one of the built-in&nbsp;{}Enums{}&nbsp;that&nbsp;{}GameMaker{}&nbsp;provides. Pass a value from this Enum to&nbsp;{}{}audio_effect_create{}{}&nbsp;to determine the type of audio effect that you want to create.":"这是{}GameMaker{}提供的内置{}枚举{}之一。将此枚举中的值传递给{}{}audio_effect_create{}{}以确定您要创建的音频效果的类型。",
    "This is one of the built-in&nbsp;{}Enums{}&nbsp;that&nbsp;{}GameMaker{}&nbsp;provides. Pass a value of this enum to&nbsp;{}{}audio_effect_create{}{}&nbsp;to determine the type of audio effect that you want to create.":"这是{}GameMaker{}提供的内置{}枚举{}之一。将此枚举的值传递给{}{}audio_effect_create{}{}以确定要创建的音频效果的类型。",
    "{}AudioEffectType Enum{}":"{}AudioEffectType 枚举{}",
    "{}Gain&nbsp;{}→{} Clipper&nbsp;{}→{} Sample rate reduction&nbsp;{}→{} Resolution reduction{}":"{}增益{}→{}限幅器{}→{}采样率降低{}→{}分辨率降低{}",
    "{}{}NOTE{}{}&nbsp;Use&nbsp;{}{}db_to_lin{}{}&nbsp;and&nbsp;{}{}lin_to_db{}{}&nbsp;to convert back and forth between linear gains and gains expressed in decibels (dB).":"{}{}注意{}{}使用{}{}db_to_lin{}{}和{}{}lin_to_db{}{}在线性增益和以分贝(dB) 表示的增益之间来回转换。"
}