{
    "Horizontal position of the cell in the grid":"单元格在网格中的水平位置",
    "Index of the mp_grid that is to be used":"要使用的 mp_grid 的索引",
    "The above code will make all \"obj_Wall\" and all obj_Door add their equivalent cell positions into the mp_grid indexed in the variable \"grid\". In the first part of the example, this is done by taking the x/y coordinates of the object and dividing them by the resolution of the grid (using {}floor{} to keep the values as integers), and in the second part (since the grid resolution is a power of 2) it is done by bit-shifting the x,y coordinates 5 places to the right.":"上述代码将使所有\"obj_Wall\"和所有obj_Door将其等效单元格位置添加到变量\"grid\"中索引的mp_grid中。在示例的第一部分中，这是通过获取对象的x/y坐标并将其除以网格的分辨率(使用{}floor{}将值保持为整数)来完成的，而在第二部分(由于网格分辨率是2的幂)中，这是通过将x、y坐标向右移5位来完成的。",
    "Vertical position of the cell in the grid":"网格中单元格的垂直位置",
    "With this function we can mark individual cells within the given&nbsp;MP grid as being \"forbidden\" meaning that the path finding functions will not ever cross them. Now, normally you work in x/y {}room{} coordinates, and not in MP grid&nbsp;{}cell{} coordinates. So let\u0027s consider the following image which shows how the two can correlate:":"使用此函数，我们可以将给定 MP 网格内的单个单元格标记为 \" 禁止\"，这意味着路径查找函数将永远不会穿过它们。现在，通常您使用的是 x/y{} 房间 {} 坐标，而不是 MP 网格 {} 单元格 {} 坐标。因此，让我们考虑一下以下图像，它显示了这两者之间的关系：",
    "{}As you can see the mp_grid is numbered as a series of cells (starting at 0,0 in the upper left corner), and when you place this grid over the room there is a direct correlation between the room coordinates (which also start at 0,0 in the top left) and the cells within the grid. In the image you can see that an instance at the position 260,130 falls on the grid cell 8,4. You can calculate mathematically the exact cell that a position lands on easily by either dividing the number by the grid resolution and then rounding down {}or{}, if you are using power of 2 grid resolutions (like 8, 16, 32 etc...) you can use the {}bitwise operators{}. It should be noted that the bitwise operation is faster and the example below shows both methods.":"{}正如您可以看到的那样，mp_grid被编号为一系列单元格(从左上角的0,0开始)，当您将此网格放置在房间上时，房间坐标(也从左上角的0,0开始)与网格中的单元格之间存在直接关联。在图像中，您可以看到位于260、130处的实例落在网格单元8、4上。通过将数字除以网格分辨率，然后向下舍入{}或{}，可以在数学上计算位置轻松到达的精确单元格。如果使用2个网格分辨率的幂(如8、16、32等)，则可以使用{}位运算符{}。需要注意的是，位运算速度更快，下面的示例显示了这两种方法。"
}