{
    "Index of the mp_grid that is to be used":"要使用的mp_grid的索引",
    "Object index, or instance id, of the instances to be added into the mp_grid":"要添加到mp_grid中的实例的对象索引或实例ID",
    "The above code will add all instances of \"obj_Wall\" into the mp_grid indexed in the variable \"grid\" using the precise collision mask rather than the bounding box.":"上述代码将使用精确的碰撞掩码而不是边界框将\"obj_Wall\"的所有实例添加到变量\"网格\"中的mp_grid索引中。",
    "This function uses the instance collision mask (decided by the sprite properties or the mask index of the calling instance) to mark cells as forbidden or not in an MP grid, where forbidden cells cannot be crossed by any of the pathfinding functions. You can specify in the function whether to consider precise collisions or not and the forbidden cells marked will change depending on this setting. This image illustrates this behaviour:":"此函数使用实例碰撞掩码(由sprite属性或调用实例的掩码索引决定)在Mp网格中将单元格标记为\"禁止\"或\"不禁止\"，在Mp网格中，任何路径查找函数都无法跨越禁止的单元格。您可以在函数中指定是否考虑精确碰撞，标记的禁止单元格将根据此设置进行更改。此图像说明了此行为：",
    "Whether the check is based on pixel-perfect collisions (true = slow) or its bounding box in general (false = fast).":"该复选框是基于像素完美碰撞(true=slow)还是基于其边界框(一般情况下为False=fast)。",
    "{}The two instances above have been added into the MP grid using the {}mp_grid_add_instances(){} function with precise being set as true. As you can see the, green instance has only marked the grid squares it \"touches\" as forbidden, due to the fact that its sprite mask is also set to precise. However the second instance has marked other cells too which don\u0027t {}appear{} to be touching. This is because the sprite mask is {}not{} set to precise, meaning that even if you are using the precise setting in the function, only the bounding box of the sprite will be considered. This is also what would happen if you set the precise argument of the function to false - even instances with a precise sprite mask will be added into the grid based on their bounding boxes.":"{}上述两个实例已使用{}mp_grid_add_instances(){}函数添加到Mp网格中，并且精确设置为true。正如您可以看到的那样，由于其精灵遮罩也设置为精确，绿色实例仅将栅格方格标记为\"触摸\"，这是禁止的。但是，第二个实例也标记了其他看起来{}不接触的单元格。这是因为sprite掩码{}未设置为精确，这意味着即使在函数中使用了精确设置，也只会考虑精灵的边界框。如果将函数的精确参数设置为false，则也会发生这种情况-具有精确精灵遮罩的实例将基于其边界框添加到栅格中。"
}