{
    "Number of horizontal cells that the mp_grid will contain":"mp_grid将包含的水平单元格数",
    "Number of vertical cells that the mp_grid will contain":"mp_grid将包含的垂直单元格数",
    "Starting x coordinate of the mp_grid in the room":"房间中mp_grid的起始x坐标",
    "Starting y coordinate of the mp_grid in the room":"房间中mp_grid的起始Y坐标",
    "The above code creates a global variable \"grid\", then generates an mp_grid and assigns its index (id) to that variable for use in all further mp_grid function calls. The grid covers the room, with a cell resolution of 32x32 pixels. This means that, for example, in a room that is 640x480, the grid would contain 300 cells: 20 horizontal cells (640 / 32) multiplied by 15 vertical cells (480 /32) gives 300 cells":"上述代码创建一个全局变量\"网格\"，然后生成一个mp_grid并将其index(id)分配给该变量，以便在所有进一步的mp_grid函数调用中使用。网格覆盖房间，单元格分辨率为32 x 32像素。这意味着，例如，在640 x 480的房间中，栅格将包含300个单元格：20个水平单元格(640/32 )乘以15个垂直单元格(480/32 )得到300个单元格",
    "The height (in pixels) of each individual cell of the mp_grid":"mp_grid中每个单元格的高度(以像素为单位)",
    "The width (in pixels) of each individual cell of the mp_grid":"mp_grid中每个单元格的宽度(以像素为单位)",
    "With this function you can create an mp_grid for the motion planning functions. It returns an index that should be stored in a variable for use in all the other MP grid function calls. The x and y coordinates indicate the position of the top-left corner of the grid, hcells and vcells indicate the number of horizontal and vertical cells to be created within the grid, and cell width and cell height indicate the size of the cells in pixels. You can create and maintain multiple grid structures at the same moment if you need them for different things, but be aware that each grid will require memory, and the more cells they have the more memory they will require.&nbsp;Also note that the MP functions are quite processor heavy to use so the more often you call them and the higher the cell resolution then the more likely you are to have a drop in performance.":"使用此函数，可以为运动规划功能创建mp_grid。它返回一个索引，该索引应该存储在一个变量中，以便在所有其他Mp网格函数调用中使用。x和y坐标表示网格左上角的位置，hcell和vcell表示要在网格内创建的水平和垂直单元格的数量，单元格宽度和单元格高度表示单元格的大小(以像素为单位)。如果需要多个网格结构来处理不同的事情，可以同时创建和维护多个网格结构，但请注意，每个网格都需要内存，单元格越多，需要的内存就越多。另请注意，Mp函数的使用量非常大，因此调用它们的频率越高，单元分辨率越高，性能下降的可能性就越大。"
}