{
    "All results from using the Search &amp; Replace window will be shown in the {}Search Output Window{}&nbsp;at the bottom of the IDE. Each result can be {}&nbsp;double-clicked to open the asset with the term in the current workspace and pan to it, ready for editing.":"使用搜索和替换窗口的所有结果将显示在 IDE 底部的{}搜索输出窗口{}中。可以{}双击每个结果，以在当前工作区中打开带有术语的资源并平移到该资源，以供编辑。",
    "Pressing the {}Escape {}key while this window is open will clear the selected field, however if that field is already empty, then it will close the window.":"在此窗口打开时按下{}ESC{}键将清除选定的字段，但如果该字段已为空，则它将关闭窗口。",
    "Search &amp; Replace":"搜索与代替",
    "Searches can be general or you can refine them using the options below the search term inputs:":"搜索可以是常规搜索，也可以使用搜索词输入下面的选项进行优化：",
    "The Edit Menu":"编辑菜单",
    "The edit menu is where you can use the general edition tools of the {}GameMaker{} interface. The available options are:":"在编辑菜单中，您可以使用 {}GameMaker{} 界面的常规编辑工具。可用选项包括：",
    "When you select Search &amp; Replace from the Edit menu, it will open the following window:":"当您从编辑菜单中选择搜索和替换时，将打开以下窗口：",
    "When&nbsp;{}The Code Editor{}&nbsp;is open, the Edit menu will contain the following extra options:":"当 {} 代码编辑器 {} 打开时，编辑菜单将包含以下额外选项：",
    "You can apply a {}filter {}on the search results based on the different asset types in the asset browser. By default this is set to \"Everything\", but clicking on this will open the following menu where you can check or uncheck assets to be included in the search:":"您可以根据资源浏览器中的不同资源类型对搜索结果应用{}过滤器{}。默认情况下，此选项设置为\"每一个\"，但单击此选项将打开以下菜单，您可以在其中选中或取消选中要包括在搜索中的资源：",
    "You can choose to have the search {}ignore comments{}. When this is checked, any comments in your code that contain the search term will simply be ignored and not shown in the output results.":"您可以选择让搜索{}忽略备注{}。选中此选项后，代码中包含搜索词的任何注释都将被忽略，并且不会显示在输出结果中。",
    "You can choose to make the search {}case sensitive{}, in which case it will only include words that exactly match the search string case, ie: searching for \"My_Var\" without this option and you will get results with \"my_var\", \"mY_VAR\", or \"My_Var\", but with this option checked only \"My_Var\" will be included in the search results.":"您可以选择使搜索{}区分大小写{}，在这种情况下，它将只包括与搜索字符串大小写完全匹配的单词，即：在没有此选项的情况下搜索 \"My_Var\"，您将得到带有 \"my_var\"、\"mY_VAR\" 或 \"My_Var\" 的结果，但选中此选项后，搜索结果中将只包括 \"My_Var\"。",
    "You can choose to only include search results that include the {}whole word only{}, in which case any results that include the search term but aren\u0027t an exact match will be ignored, ie: a search for \"game\" without this checked will show up things like the function \"game_end()\" or variables like \"game_state\", while checking this and doing the search will only show results that are \"game\" itself.":"您可以选择仅包括仅包含{}全字的搜索结果{}，在这种情况下，任何包含搜索词但不是完全匹配的结果都将被忽略，即：搜索\"game\"而不选中此项将显示类似函数\"game_end()\"或变量\"game_state\"的内容，而选中此项并执行搜索将只显示\"game\"本身的结果。",
    "{}Code Editor{}&nbsp;Options":"{} 代码编辑器 {} 选项",
    "{}Find &amp; Replace{}: This contains the following options: {} {}{}Find In Editor{}: Opens the Find window in the editor so you can search through the open documents.{} {}{}Replace In Editor{}: Opens the same Find window in Replace mode. See:&nbsp;{}Find &amp; Replace{}{} {}{}Find In Project{}: Opens the global Search &amp; Replace window, which is otherwise always present in the Edit menu.{} {} ":"{} 查找和替换 {}：包含以下选项：{}{}{} 在编辑器中查找 {}：在编辑器中打开查找窗口，以便您可以搜索打开的文档。{}{}{} 在编辑器中替换 {}：在替换模式下打开相同的查找窗口。请参阅：{} 查找和查找替换 {}{}{}{} 在项目中查找 {}：打开全局搜索和查找替换窗口，否则该窗口始终出现在 Edit 菜单中。{}{}",
    "{}Find All{}: Find all the search terms and show them in the output window.":"{}查找全部{}：查找所有搜索词并在输出窗口中显示它们。",
    "{}Find Next{}: Find the next instance of the search term. This will open the asset containing the reference in the workspace (if it\u0027s not already open) and pan to it.":"{}查找下一个{}：查找搜索词的下一个实例。这将在工作区中打开包含引用的资源(如果它尚未打开)，并平移到它。",
    "{}Find Previous{}: Find the previous instance of the search term. This will open the asset containing the reference in the workspace (if it\u0027s not already open) and pan to it.":"{}查找上一个{}：查找搜索词的上一个实例。这将在工作区中打开包含引用的资源(如果它尚未打开)，并平移到它。",
    "{}Navigate{}: This contains the following options for navigating the&nbsp;{}Code Editor{}: {} {}{}Backward{}: Move the text cursor back one entry in the {}Text Cursor Location History{}, which is shared among editors, including editors that have been closed. Closed editors will be restored when needed. Multicursor locations are ignored.{} {}{}Forward{}:&nbsp;Move the text cursor forward one entry in the {}Text Cursor Location History{}.{} {}{}Go To Line{}: Opens the Go To Line dialog for the active document{} {}{}Go To Type{}: Opens the Go To Type dialog for switching to a different asset, option or preference{} {}{}Next Document{}: Move the text cursor to the next document{} {}{}Previous Document{}: Move the text cursor to the previous document{} {}{}Next Region{}:&nbsp;Move the text cursor to the next region{} {}{}Previous Region{}:&nbsp;Move the text cursor to the previous region{} {} ":"{} 导航 {}：其中包含用于导航 {} 代码编辑器 {} 的以下选项：{}{}{} 向后 {}：将文本光标在 {} 文本光标位置历史记录 {} 中向后移动一个条目，在编辑之间共享，包括已关闭的编辑。关闭的编辑器将在需要时恢复。多光标位置将被忽略。{}{}{} 向前 {}：将文本光标在 {} 文本光标位置历史记录 {} 中向前移动一个条目。{}{}{} 转到行 {}：打开转到行活动文档的对话框 {}{}{}Go To Type{}：打开 Go To Type 对话框以切换到不同的资源、选项或首选项 {}{}{} 下一个文档 {}：将文本光标移至下一个文档 {}{}{} 上一个文档 {}：将文本光标移动到上一个文档 {}{}{} 下一个区域 {}：将文本光标移动到下一个区域 {}{}{} 上一个区域 {}：将文本光标移至上一个区域 {}{}",
    "{}Once you have given a search (and optionally a replace) term and set up the search options, you can use the different buttons at the bottom to choose how to perform the search and any actions to take. These buttons are:":"{}一旦您指定了搜索条件(以及可选的替换)并设置了搜索选项，您就可以使用底部的不同按钮来选择如何执行搜索以及要执行的任何操作。这些按钮是：",
    "{}Reanalyze Project{}: Reanalyze the project so&nbsp;{}Code Completion{} is up-to-date with information on assets.":"{} 重新分析项目 {}：重新分析项目，以便 {} 代码完成 {} 了解最新的资产信息。",
    "{}Redo {}- Redo a previous action.":"{}重做{} - 重做之前的操作。",
    "{}Redo{}: Redo a previous action.":"{} 重做 {}：重做之前的操作。",
    "{}Regions{}: Contains the following options: {} {}{}Fold/Unfold region{}: Fold/unfold the region at the text cursor{} {}{}Fold All Regions{}: Fold all the regions in the document{} {}{}Unfold All Regions{}: Unfold all regions in the document{} {}{}Fold Active Document{}: Folds the currently active document (e.g. if you are in the Step event, it will be folded){} {}{}Fold All Documents{}: Folds all documents open in the editor (e.g. all Events in an Object){} {}{}Unfold All Documents{}: Unfolds all documents open in the editor{} {} ":"{}区域{}：包含以下选项：{}{}{} 折叠 / 展开区域 {}：折叠 / 展开文本光标处的区域 {}{}{}折叠所有区域{}：折叠其中的所有区域文档 {}{}{} 展开所有区域 {}：展开文档中的所有区域 {}{}{} 折叠活动文档 {}：折叠当前活动文档 (例如，如果您处于 Step 事件中，它将是折叠 ){}{}{} 折叠所有文档 {}：折叠在编辑器中打开的所有文档 (例如对象中的所有事件 ){}{}{} 展开所有文档 {}：展开在编辑器中打开的所有文档 {}{}",
    "{}Replace All{}: This will perform a search for the given term with the options set and also replace it in the assets with the new replace term you have specified.":"{}替换全部{}：这将使用选项集搜索给定的术语，并在资源中将其替换为您指定的新替换术语。",
    "{}Replace{}: This will replace the currently selected term in the current editor where it\u0027s highlighted with the selected replace term.":"{}替换{}：这将用所选替换术语替换当前编辑器中突出显示的当前所选术语。",
    "{}Search and replace {}- This will open a search window which permits you to search through your entire code (including room creation code, scripts, and events) for a given input - see below for further information.":"{}搜索并替换{} - 这将打开一个搜索窗口，允许您搜索给定输入的整个代码(包括房间创建代码、脚本和事件)-有关详细信息，请参阅下面的内容。",
    "{}Search and replace{}: This will open a search window which permits you to search through your entire code (including room creation code, scripts, and events) for a given input - see below for further information.":"{} 搜索和替换 {}：这将打开一个搜索窗口，允许您在整个代码 (包括房间创建代码、脚本和事件) 中搜索给定的输入 - 请参阅下文了解更多信息。",
    "{}Stop Search{}: Stop the current search if one is in progress.":"{}停止搜索{}：如果正在进行搜索，则停止当前搜索。",
    "{}Undo {}- Undo an action.":"{}撤消{} - 撤消操作。",
    "{}Undo{}: Undo an action.":"{} 撤消 {}：撤消操作。",
    "{}You can use this to search through all the scripted assets in your game, including room code, event code, scripts and shaders. When searching, you can type in a new search term in the box at the top, or you can click the arrow icon to the right to open a list of previously searched for terms. You also have the option to give a replacement term that will be used to replace the initial search term, and this too has an option to use a previously used replace string from the arrow button on the right.":"{}您可以使用它来搜索游戏中的所有脚本资源，包括房间代码、事件代码、脚本和着色器。搜索时，您可以在顶部的框中键入新的搜索词，也可以单击右侧的箭头图标打开以前搜索的搜索词的列表。您还可以选择给出一个替换项，该替换项将用于替换最初的搜索项，这也可以选择使用右侧箭头按钮中以前使用的替换字符串。",
    "{}{}NOTE{}{}&nbsp;The&nbsp;{}Code Editor{}&nbsp;is currently opt-in. Enable it in the&nbsp;{}Code Editor Preferences{}.{} {} While it is disabled, assets with text documents like {}Objects{}, {}Scripts{}, {}Notes{} etc. will open their respective editors, which make use of the&nbsp;{}Legacy Code Editor{}. ":"{}{} 注意{}{} 当前可选择加入 {} 代码编辑器 {}。在 {} 代码编辑器首选项 {} 中启用它。{}{} 禁用该功能后，包含 {} 对象 {}、{} 脚本 {}、{} 注释 {} 等文本文档的资源将打开其各自的编辑器，它使用 {} 旧版代码编辑器 {}。"
}