{
    "The Build Menu":"构建菜单",
    "The build menu is where you can choose to build your project either for testing, debugging or as a final executable. The available options are:":"在\"构建\"菜单中，您可以选择构建项目以用于测试、调试或作为最终可执行文件。可用选项包括：",
    "{}Clean Audio{} - This cleans the audio in the project\u0027s cache directory (i.e. the \"Audio\" folder).":"{}清除音频{} - 这将清除项目缓存目录 (即 \"Audio\" 文件夹) 中的音频。",
    "{}Clean Code{} - This cleans the code in the project\u0027s cache directory (i.e. the \"Scripts\" folder).":"{}清理代码{} - 这将清理项目缓存目录(即 \"Script\" 文件夹)中的代码。",
    "{}Clean Graphics{} - This cleans the graphics in the project\u0027s cache directory (i.e. the \"Shader\", \"Sprite\", \"TextureGroups\" and \"TexturePageEntries\" folders).":"{}清理图形{} - 这将清理项目缓存目录中的图形 (即 \"Shader\"、\"Sprite\"、\"TextureGroups\" 和 \"TexturePageEntry\" 文件夹)。",
    "{}Clean {}- {}GameMaker{} keeps a {}Cache{} of files to help speed up compile time when testing. However sometimes a \"stale\" cache can lead to odd and unexpected errors in your game, in which case the first thing you should do is clean the cache from here and re-test. It is also a good idea to clean the cache before you create a final executable for the target platform. Note that this command is the same as pressing the {}Clean Cache{} button {}&nbsp;in the IDE.":"{}清理{} - {}GameMaker{} 保存文件的{}缓存{}，以帮助加快测试时的编译时间。然而，有时\"陈旧\"的缓存可能会导致游戏中出现奇怪的和意想不到的错误，在这种情况下，您应该做的第一件事就是从这里清理缓存并重新测试。在为目标平台创建最终可执行文件之前清理缓存也是一个好主意。请注意，此命令与在 IDE 中按下{}清除缓存{}按钮{} 相同。",
    "{}Clean {}- {}GameMaker{} keeps a {}cache{} of files to help speed up compile time when testing. However sometimes a \"stale\" cache can lead to odd and unexpected errors in your game, in which case the first thing you should do is clean the cache from here and re-test. It is also a good idea to clean the cache before you create a final executable for the target platform. Note that this command is the same as pressing the {}Clean Cache{} button {}&nbsp;in the IDE.":"{}清理{} - {}GameMaker{} 保存文件的{}缓存{}，以帮助加快测试时的编译时间。然而，有时\"陈旧\"的缓存可能会导致游戏中出现奇怪的和意想不到的错误，在这种情况下，您应该做的第一件事就是从这里清理缓存并重新测试。在为目标平台创建最终可执行文件之前清理缓存也是一个好主意。请注意，此命令与在 IDE 中按下{}清除缓存{}按钮{} 相同。",
    "{}Create Executable and Launch{} - This will create an executable, just like the option above, and then it will launch that executable on the target platform. This command is the same as pressing the {}Create Executable and Launch{} button {}&nbsp;in the IDE.":"{}创建可执行文件并启动{} - 这将创建一个可执行文件，就像上面的选项一样，然后它将在目标平台上启动该可执行文件。此命令与在 IDE 中按下{}创建可执行文件并启动{}按钮{}相同。",
    "{}Create Executable and Launch{} - This will create an executable, just like the option above, and then it will launch that executable on the target platform. This command is the same as pressing the {}Create Executable and Launch{} button {}&nbsp;in the IDE. However if the package being created is an installer, it will not be launched, and this will function the same as the&nbsp;{}Create Executable{} button {}&nbsp;in the IDE.":"{} 创建可执行文件并启动 {}- 这将创建一个可执行文件，就像上面的选项一样，然后它将在目标平台上启动该可执行文件。此命令与按 IDE 中的 {} 创建可执行文件并启动 {} 按钮 {} 相同。不过，如果正在创建的软件包是安装程序，则不会启动它，并且其功能与 IDE 中的 {} 创建可执行文件 {} 按钮 {} 相同。",
    "{}Create Executable{} - This will compile the current project and create an {}executable package{} (or packages) for the target platform. It will first open the file explorer so that you can select where you want to save the project and then compile the game. See the section on {}Compiling{} for more information on setting up the compile targets. Note that this command is the same as pressing the {}Create Executable{} button {}&nbsp;in the IDE.":"{}创建可执行文件{} - 这将编译当前项目并为目标平台创建一个(或多个){}可执行程序包{}。它将首先打开文件资源管理器，以便您可以选择要保存项目的位置，然后编译游戏。有关设置编译目标的更多信息，请参见{}编译{}一节。请注意，此命令与在 IDE 中按下{}创建可执行文件{}按钮{}相同。",
    "{}Create Executable{} - This will compile the current project and create an {}executable package{} (or packages) for the target platform. It will first open the file explorer so that you can select where you want to save the project and then compile the game. See the section on {}Compiling{} for more information on setting up the compile targets. This command is the same as pressing the {}Create Executable{} button {}&nbsp;in the IDE.":"{}创建可执行文件{} - 这将编译当前项目并为目标平台创建一个(或多个){}可执行程序包{}。它将首先打开文件资源管理器，以便您可以选择要保存项目的位置，然后编译游戏。有关设置编译目标的更多信息，请参见{}编译{}一节。请注意，此命令与在 IDE 中按下{}创建可执行文件{}按钮{}相同。",
    "{}Debug {}- Run your current project for testing with the debugger so that you can see detailed performance information and debug any errors or issues you may have. For more information on debugging, please see the section {}Debugging{}. Note that this command is the same as pressing the Debug button {}&nbsp;in the IDE.":"{}调试{} - 运行当前项目以使用调试器进行测试，以便您可以查看详细的性能信息并调试您可能遇到的任何错误或问题。有关调试的更多信息，请参见{}调试{}一节。请注意，此命令与在IDE中按下调试按钮{}相同。",
    "{}Re-Run{} - This re-runs the last build without rebuilding. This command will be greyed out{}&nbsp;if a re-run isn\u0027t possible at the time, e.g. when there hasn\u0027t been a previous build, there were errors in the previous build or in the case of a run if more than an hour has passed as there is a licensing check in that will prevent this from running.{}":"{}重新运行{} - 这将在不重新构建的情况下重新运行上一次生成。如果此时无法重新运行，则此命令将呈灰色显示{}例如，如果没有以前的版本，则以前的版本中存在错误，或者，如果运行已超过一个小时，因为存在阻止运行的许可签入，则此命令将灰显。{}",
    "{}Run {}- Run your current project on the chosen target platform for testing. For the different compile options available when compiling please see the section on {}Compiling{}. Note that this command is the same as pressing the Run button {}&nbsp;in the IDE.":"{}运行{} - 在选定的目标平台上运行当前项目以进行测试。有关编译时可用的不同编译选项，请参阅{}编译{}一节。请注意，此命令与在IDE中按下运行按钮{}相同。",
    "{}The Build Menu{}":"{}构建菜单{}"
}