{
    "Background Preferences":"背景首选项",
    "The {}Background {}preferences deal with the Workspace background and what it will display as well as how it will be displayed. The options are:":"{}背景{}首选项处理工作区背景以及它将显示的内容和显示方式。选项包括：",
    "{}Background Image{}: This is the image file that will be used as the background for the different Workspaces. There is a default image supplied and it is enabled by default, but you can select your own image here. The types of image that you can select from are {}*.png{}, {}*.gif{}, {}*.jpg{}, {}*.jpeg{}, {}*.tif{}, {}*.tiff{}, {}*.ico{}, {}*.bmp{}, {}*.2bp{} or {}*.mdi{}, but note that regardless of initial image format, all files will be saved out for use as {}*.png{} files, so animated {}*.gif{} files for example will only be rendered as a single initial frame.":"{}背景图像{}：这是将用作不同工作区背景的图像文件。系统提供了一个默认图像，默认情况下会启用该图像，但您可以在此处选择您自己的图像。您可以选择的图片类型有：{}*.png{}、{}*.gif{}、{}*.jpg{}、{}*.jpeg{}、{}*.tif{}、{}*.tiff{}、{}*.ico{}、{}*.bmp{}、{}*.2bp{} 或 {}*.mdi{}，但请注意，无论初始图片格式如何，所有文件都会被保存为 {}*.png{} 文件。因此，动画文件 (例如，{}*.gif{}) 将仅渲染为单个初始帧。",
    "{}Image Scaling{}: This controls how the background image will be scaled within the different workspaces. The choices are: {} {}{}Stretch {}- The image will be stretched to fit the workspace, changing scale depending on the visible docks{} {}{}Tile {}- The image will be tiled to cover the workspace{} {}{}Best Fit {}- The image will be scaled to fit the workspace proportionally, with bars being added around the edge if it is not a 1:1 fit{} {}{}Desktop Stretch{} - The background will cover the whole workspace, and will move rather than change scale when docks are opened/closed{} {}{}Screen Stretch{} - The background will cover an area the size of the window and will be cropped/extended to show more or less of the image as docks are opened/closed.{} {} ":"{}图像缩放{}：控制背景图像在不同工作区内的缩放方式。选项是：{} {}{} 拉伸 {}- 图像将被拉伸以适应工作空间，根据可见的停靠点改变比例 {} {}{} 平铺 {}- 图像将被平铺以覆盖工作空间 {} {}{} 最佳匹配 {}- 图像将按比例缩放以适应工作空间，如果不是 1:1 大小，则会在边缘周围添加条 {} {}{} 桌面拉伸 {}- 背景将覆盖整个工作空间，并且在打开 / 关闭停靠时将移动而不是更改比例 {} {}{} 屏幕拉伸 {}- 背景将覆盖窗口大小的区域，并将在打开 / 关闭停靠时裁剪 / 扩展以显示或多或少的图像。{}{}",
    "{}Show background images on workspaces{}: This option controls whether the selected background image should be shown or not. By default this is checked as on.":"{}在工作区上显示背景图像{}：此选项控制是否应显示选定的背景图像。默认情况下，该选项处于启用状态。"
}