{
    "Compiling Preferences":"编译首选项",
    "The Compiling preferences deal with certain options related to the output when compiling your game for testing or creating a package, as well as certain areas of the compiling process. The options are:":"编译首选项处理编译游戏以测试或创建包时与输出相关的某些选项，以及编译过程的某些区域。选项包括：",
    "The&nbsp;{}Compiling Preferences{} deal with certain options related to the output when compiling your game for testing or creating a package, as well as certain areas of the compiling process. The options are:":"在编译游戏以测试或创建包时，{}编译首选项{}处理与输出相关的某些选项，以及编译过程的某些区域。选项包括：",
    "{}Automatically Stop Running before packaging:{}&nbsp;By default, if your game is already running and you try to create an executable, you will be shown an&nbsp;error&nbsp;message and will need to&nbsp;{}&nbsp;stop the game manually before creating an executable. You can enable this option to always skip this error message and automatically stop the game if it\u0027s running when \"Create Executable\" is selected. This is off by default.":"{}打包前自动停止运行：{}默认情况下，如果您的游戏已在运行，并且您尝试创建可执行文件，则会显示一条错误消息，并且您需要在创建可执行文件之前手动停止游戏。您可以启用此选项，以始终跳过此错误消息，并自动停止游戏时，如果它正在运行时，选择\"创建可执行文件\"。默认情况下，此选项处于禁用状态。",
    "{}Automatically open syntax error window on detection{}: Enable or disable syntax error notification when compiling. This is off by default.":"{}检测时自动打开语法错误窗口{}：编译时启用或禁用语法错误通知。默认情况下，此选项处于禁用状态。",
    "{}Clear output window on compile start{}: By default the compiler window will clear all previous messages from the compiler output window at the start of each build, however unchecking this will maintain previous compiler logs. This is on by default and is the recommended configuration since large compiler logs can slow down compile times.":"{}编译开始时清除输出窗口{}：默认情况下，编译器窗口将在每次编译开始时从编译器输出窗口中清除所有以前的消息，但取消选中此选项将保留以前的编译器日志。这在默认情况下是打开的，并且是推荐的配置，因为大的编译器日志可能会减慢编译时间。",
    "{}Compiling Preferences{}":"{}编译首选项{}",
    "{}Maximum parallel compile jobs{}: This value sets the maximum number of CPU cores to dedicate to compiling a project. The default value is 8 and in general you shouldn\u0027t have to change this, but if you are on a laptop or a lower end machine you may want to lower this value. The default is set to 8.":"{}最大并行编译作业数{}：该值设置专用于编译项目的最大 CPU 核心数。默认值为 8，通常您不必更改此值，但如果您使用的是笔记本电脑或低端计算机，则可能需要降低此值。默认设置为 8。",
    "{}Show compiler commands in compile output{}: This is checked by default and forces the compiler to show all relevant commands in the compile window. Unchecking this will make the output smaller and have less information.":"{}在编译输出中显示编译器命令{}：默认情况下选中此选项，并强制编译器在编译窗口中显示所有相关命令。取消选中此选项将使输出更小，包含的信息也更少。",
    "{}Show package in explorer on build completion{}: Checking this will make {}GameMaker{} open the OS explorer window at the location where the final executable package has been created. It is on by default.":"{}构建完成时在资源管理器中显示包{}：选中此选项将使 {}GameMaker{} 在创建最终可执行程序包的位置打开操作系统资源管理器窗口。默认情况下，它处于启用状态。",
    "{}Show the compile window during compilation{}: By default the compile window will be shown when you compile your projects, even if the compile dock is closed (it will open for the compile). Unchecking this will switch this behaviour off and the compile window will only be visible if open.":"{}编译期间显示编译窗口{}：默认情况下，当您编译项目时将显示编译窗口，即使编译停靠已关闭(它将为编译打开)。取消选中此选项将关闭此行为，并且编译窗口仅在打开时才可见。",
    "{}Show verbose compiler output{}: Checking this will force the compiler to show extra commands related to the compilation process. In general this is only required when debugging and may be requested by support should you have an issue. It is off by default (and this is the recommended setting).":"{}显示详细的编译器输出{}：选中此选项将强制编译器显示与编译过程相关的额外命令。通常，只有在调试时才需要这样做，如果您有问题，支持人员可能会要求您这样做。默认情况下，它处于关闭状态(这是推荐的设置)。",
    "{}Use subst for drive paths{}: When this is checked, {}GameMaker{} will create - and remove again when no longer required - virtual drives to use as a substitute for full file paths. These virtual drives bypass any potential issue with file paths being too long for the OS (particularly when compiling for Android or using extensions) and it is recommended to have this enabled. However, if you are having issues with {}GameMaker{} creating virtual drives like this, you can disable the option. By default, this is enabled.":"{}对驱动器路径使用 subst{}：选中此选项后，{}GameMaker{} 将创建虚拟驱动器，并在不再需要时再次删除，以替代完整的文件路径。这些虚拟驱动器绕过了文件路径对于操作系统来说太长的任何潜在问题(特别是在为 Android 编译或使用扩展名时)，建议启用此功能。但是，如果您在 {}GameMaker{} 创建这样的虚拟驱动器时遇到问题，您可以禁用该选项。默认情况下，此选项处于启用状态。"
}