{
    "Confirm Dialog Preferences":"确认对话框首选项",
    "The Confirm Dialogue preferences deal with some of the general confirmation pop-ups that will appear when performing certain actions in the {}GameMaker{} IDE. The options are:":"确认对话框首选项处理在 {}GameMaker{} IDE 中执行某些操作时将出现的一些常规确认弹出窗口。选项包括：",
    "{}Automatic response to closing a workspace via keyboard shortcut{}: The keyboard shortcut mentioned above can be used to close any open tab, but sometimes you may accidentally close an empty tab that you require. To prevent this you can set this option to \"Show message\" (the default option) to ask if you really want to close that empty tab. The other settings are \"No\", to simply do nothing if the shortcut is used, or \"Okay\" to close the tab without any message.":"{}通过键盘快捷键关闭工作区的自动响应{}：上述键盘快捷键可用于关闭任何打开的选项卡，但有时您可能会意外关闭所需的空选项卡。为了防止出现这种情况，您可以将此选项设置为“显示信息”(默认选项)，询问您是否真的要关闭那个空的选项卡。其他设置为“否”，如果使用快捷键，则不执行任何操作，或“确定”，关闭选项卡而不显示任何消息。",
    "{}Automatic response to resetting the project layout{}: When you select to reset the project layout (from the {}Layouts Menu{}) you will, by default, be shown a warning message about how this will close any open resource windows. However you can suppress this message and automatically reset the layout by selecting \"Okay\", or have it do nothing by selecting \"No\". The default value is to have \"Show Message\".":"{}自动响应重置项目布局{}：当您选择重置项目布局(从{}布局菜单{})时，默认情况下，您将看到一条警告消息，说明这将如何关闭所有打开的资源窗口。但是，您可以取消此消息并通过选择\"确定\"自动重置布局，或通过选择\"否\"使其不执行任何操作。缺省值为\"显示信息\"。",
    "{}Automatic response to restarting a running build{}: When you restart a build and another previous one is still running, you will be asked whether you want to stop the current build first. Un checking this message will suppress that message and force {}GameMaker{} to assume you had clicked \"Okay\" as a response. This option is set to \"Show Message\" by default.":"{}重新启动正在运行的构建的自动响应{}：当您重新启动一个构建，而另一个先前的构建仍在运行时，系统将询问您是否要首先停止当前构建。取消选中此消息将取消显示该消息，并强制 {}GameMaker{} 假定您已单击了“确定”作为响应。默认情况下，该选项设置为“显示信息”。",
    "{}Automatic response to warning when attempting to debug YYC{}: The YYC target compiles to native code and as such cannot be debugged using the built in debugger. When you try to use the debugger on the YYC target, you will get a warning informing you of this, and the fact that the project will be compiled using the VM instead. This option is set to \"Show Message\" by default, but setting it to \"OK\" will suppress this warning.":"{}尝试调试 YYC 时对警告的自动响应{}：YYC 目标编译为本机代码，因此无法使用内置调试器进行调试。当您尝试在YYC目标上使用调试器时，您将收到一条警告，通知您这一点，以及将使用VM编译项目的事实。默认情况下，此选项设置为\"显示信息\"，但将其设置为\"确定\"将取消此警告。"
}