{
    "Input&nbsp;Preferences":"输入首选项",
    "The {}{}Input {}preferences{} control certain aspects of the mouse and keyboard input within the IDE. The available options are:":"{}{}输入{}首选项{}控制 IDE 中鼠标和键盘输入的某些方面。可用选项包括：",
    "{}(macOS only){} {}Pinch to zoom sensitivity (%){}: Change the sensitivity of the trackpad pinch to zoom behaviour.":"{}(仅限 macOS){}{} 收缩至缩放灵敏度(%){}：将触控板收缩的灵敏度更改为缩放行为。",
    "{}(macOS only){}&nbsp;{}Enable pinch to zoom{}: Enable or disable trackpad pinch to zoom behaviour.":"{}(仅限 macOS){} {}启用按压以缩放{}：启用或禁用触摸板按压以缩放行为。",
    "{}Add bias to text selection to prevent line jumping{}: When this is checked, the conceived line height while selecting a single line in any text window will be padded, making it less prone to vertical imprecision. This is enabled by default.":"{}向文本选择添加偏置以防止跳行{}：选中此选项后，将填充在任何文本窗口中选择单行时设想的行高，使其不容易出现垂直不精确。这在默认情况下是启用的。",
    "{}Ctrl + MMB to open the inherited event instead of the manual{}: When this is checked, holding {}&nbsp;/ {} + the middle mouse button {} in an object will open the objects inherited event (if it has one) rather than the manual.":"{}Ctrl+鼠标中键打开继承的事件而不是手动{}：选中此选项后，在对象中按住{} /{}+鼠标中键{}将打开对象继承的事件(如果有)，而不是手动。",
    "{}Enable laptop mode on all devices{}: Checking this will show the {}Laptop Mode{}&nbsp;button on the IDE, enabling you to switch it on or off as required regardless of whether the device running {}GameMaker{} is a laptop or not. This is unchecked by default.":"{}在所有设备上启用笔记本电脑模式{}：选中此选项将在 IDE 上显示{}笔记本电脑模式{}按钮，使您可以根据需要打开或关闭它，而无论运行 {}GameMaker{} 的设备是否为笔记本电脑。默认情况下，此选项处于未选中状态。",
    "{}Force Laptop mode{}: This setting changes whether Laptop Mode is usable or not, and is enabled by default. You can disable this to ensure that Laptop Mode does not automatically get enabled when you start the IDE on a laptop.":"{}强制笔记本电脑模式{}：此设置更改笔记本电脑模式是否可用，并且默认情况下处于启用状态。您可以禁用此选项，以确保在笔记本电脑上启动 IDE 时不会自动启用笔记本电脑模式。",
    "{}Minimum zoom level for interacting with window contents (%){}: This option controls the zoom cut-off point at which the mouse will no longer be able to interact with workspace windows (ie: add nodes, drag windows, etc...). The default value is 40.":"{}与窗口内容交互的最低缩放级别(%){}：此选项控制鼠标将不再能够与工作区窗口交互的缩放截止点(例如：添加节点、拖动窗口等)。默认值为 40。",
    "{}Mouse wheel zoom requires Ctrl key{}: When this is checked all editors (and the main workspace) will have zoom enabled with {}&nbsp;/ {} + the mouse wheel {}, while un-checking it will enable zoom with only the mouse wheel MMB Icon.":"{}当按 Ctrl 键时鼠标滚轮缩放{}：选中此选项后，所有编辑器 (和主工作区) 将使用 {} /{}+ 鼠标滚轮 {} 启用缩放，而取消选中它将仅启用鼠标滚轮中键图标的缩放。",
    "{}Scroll lock time (ms){}: This option deals with the time that {}GameMaker{} should wait between scrolling windows that are overlapping. Essentially, When you\u0027re scrolling in window \"A\", the cursor might hover over another scrollable area in window \"B\", so this preference defines how long you have to wait after you stop scrolling \"A\" before you can then scroll \"B\", so you don\u0027t accidentally start scrolling different panels. The default value is 500ms.":"{}滚动锁定时间(毫秒){}：此选项处理 {}GameMaker{} 应在重叠滚动窗口之间等待的时间。基本上，当你在窗口“A”中滚动时，光标可能会悬停在窗口“B”中的另一个可滚动区域上，因此该首选项定义了在停止滚动“A”之后必须等待多长时间才能滚动“B”，这样就不会意外地开始滚动不同的面板。默认值为 500ms。",
    "{}Scroll speed{}: This controls the scrolling speed within the different workspaces. The default value is 1.":"{}滚动速度{}：控制不同工作区的滚动速度。默认值为 1。",
    "{}Slow double click time (ms){}: Some areas of the IDE require a slower double click to work correctly, for example when renaming a resource (a fast double click will open the resource editor, while a slow double click will permit you to rename it). This option permits you to set the detection speed, with a default value of 500ms.":"{}慢速双击时间(毫秒){}：IDE 的某些区域需要慢速双击才能正常工作，例如，在重命名资源时(快速双击将打开资源编辑器，而慢速双击将允许您重命名它)。该选项允许您设置检测速度，默认为 500ms。",
    "{}Tab drag distance to un-maximise desktop (px){}: When you drag a workspace tab away from its default position within the IDE, if there is only one workspace active at that time then the {}GameMaker{} window will un-maximise and move with the mouse (if you have more than one workspace active a new instance of the IDE will be created to hold the workspace). This setting controls how far you have to drag the tab before the workspace recognises it, and the default value is 50px.":"{}Tab 键拖动距离以取消最大化桌面(像素){}：当您将工作区选项卡从其在 IDE 中的默认位置拖走时，如果当时只有一个工作区处于活动状态，则 {}GameMaker{} 窗口将取消最大化并随鼠标移动 (如果有多个工作区处于活动状态，则会创建一个新的 IDE 实例来容纳该工作区)。此设置控制您必须将选项卡拖到多远才能被工作区识别，默认值为 50px。",
    "{}Wrap cursor around the screen when panning{}: When enabled, this will wrap the cursor around the screen bounds when panning workspaces. Default is enabled.":"{}平移时将光标绕过屏幕{}：启用后，平移工作区时光标将绕过屏幕边界。默认为已启用。"
}