{
    "The preferences here will affect how you move around within the different {}GameMaker{} {}{}workspaces{}{}. The options are:":"此处的首选项将影响您在不同的 {}GameMaker{} {}{}工作区{}{}中移动的方式。选项包括：",
    "Workspace Preferences":"工作区首选项",
    "{}Workspace chain column padding (px){}: Workspace elements are often \"chained\" to each other (for example, the Code Editor is chained to the Event Editor is chained to the Object Editor), and this option permits you to set the horizontal distance between any two chained windows. The default value is 30px.":"{}工作区链列填充(像素){}：工作区元素通常彼此链接(例如，代码编辑器链接到事件编辑器，链接到对象编辑器)，此选项允许您设置任意两个链接窗口之间的水平距离。默认值为 30px。",
    "{}Workspace chain link colour{}: This is the colour that will be used to display chains between workspace elements. Default colour is ARGB $99DD00.":"{}工作区链链接颜色{}：这是将用于显示工作区元素之间的链的颜色。默认颜色为 ARGB $99DD00。",
    "{}Workspace chain rendering segment count{}: Here you can set the maximum number of segments for render chains. Lowering this value may help performance on lower end machines. The default value is 20.":"{}工作空间链渲染分段数{}：可在此处设置渲染链的最大分段数。降低此值可能有助于提高低端计算机的性能。默认值为 20。",
    "{}Workspace chain row padding (px){}: As mentioned above, workspace elements are often \"chained\" to each other and this option permits you to set the vertical distance between any two chained windows. The default value is 20px.":"{}工作空间链行填充(像素){}：如上所述，工作空间元素通常相互\"链接\"在一起，该选项允许您设置任意两个链接窗口之间的垂直距离。默认值为 20px。",
    "{}Workspace chains can overlap{}: When enabled this option will permit workspace chains to cross and overlap. This is off by default.":"{}工作区链可以重叠{}：启用此选项后，工作区链将允许交叉和重叠。默认情况下，此选项处于禁用状态。",
    "{}Workspace keyboard navigation degree range{}: Within a workspace you can have multiple windows open for different objects and resources, and so to move around quickly between them you can use the keyboard shortcut {}&nbsp;/ {} + {}&nbsp;+ {}&lt;Arrow Keys&gt;{} to move between them. Given that the windows within a workspace are not grid aligned the IDE has to choose which window you mean when you press any of the possible 8 directions, and this option permits you to set the \"look angle\" that is used. The default value is 40°.":"{}工作区键盘导航度范围{}：在一个工作区内，您可以为不同的对象和资源打开多个窗口，因此可以使用键盘快捷键 {} /{}+{} +{}<方向键>{} 在它们之间快速移动。如果工作区内的窗口不是网格对齐的，那么当您按下 8 个可能的方向中的任何一个时，IDE 必须选择您想要的窗口，并且该选项允许您设置所使用的 \" 视角\"。默认值为 40°。",
    "{}Workspace keyboard navigation resets zoom{}: As mentioned above, you can skip from window to window within the workspace using keyboard shortcuts. You can also zoom the workspace in and out using the {}&nbsp;/ {} + the mouse wheel {}. Setting this option will mean that if you have the workspace zoomed and use the shortcuts to skip to another window, then the workspace will be returned to a 1:1 view and centered on the selected window. This option is off by default.":"{}工作区键盘导航重置缩放{}：如上所述，您可以使用键盘快捷键在工作区内从一个窗口跳到另一个窗口。您还可以使用{} /{}+鼠标滚轮{}来放大和缩小工作区。设置此选项将意味着，如果您缩放工作区并使用快捷键跳到另一个窗口，则工作区将返回到1：1视图并居中于所选窗口。默认情况下，此选项处于禁用状态。"
}