{
    "Before using data structures in your game, you should also be aware that there are certain moments when, due to rounding errors, you may get a result that is not what you expected. This may be resolved by changing the DS precision using the following function:":"在游戏中使用数据结构之前，您还应该注意，在某些时刻，由于舍入错误，您可能会得到不符合预期的结果。这可以通过使用以下函数更改D的精度来解决：",
    "Essentially, all data structures work in the same way - You create a data structure and store its {}index value{} in a variable. You then use this index to reference the data structure in all further function calls that can perform operations on it. Finally, once you are done you destroy the data structure again to remove it from memory. You can use as many of the structures at the same time as you need, and all structures can store any of the available {}data types{}.":"基本上，所有数据结构都以相同的方式工作-创建数据结构并将其{}索引值{}存储在变量中。然后，使用此索引在所有可对其执行操作的进一步函数调用中引用数据结构。最后，完成后，再次销毁数据结构以将其从内存中删除。您可以根据需要同时使用任意多个结构，并且所有结构都可以存储任何可用的{}数据类型{}。",
    "Grids":"网格 Grids",
    "In games you often need to store information in a precise and ordered way. For example, you may need to store lists of items that a person carries or you may want to store a grid of places that still need to be visited. Now, you {}can{} use the arrays for this, but if you want to do more complicated operations, like sorting the data or searching for a particular item, you need to write large pieces of GML code which can be slow to execute, difficult to debug and a real pain to write!":"在游戏中，您通常需要以精确有序的方式存储信息。例如，您可能需要存储某人携带的项目列表，或者您可能希望存储仍需要访问的网格位置。现在，您{}可以{}使用数组来执行此操作，但如果您想执行更复杂的操作，如对数据进行排序或搜索特定项目，则需要编写大量Gml代码，这些代码的执行速度可能很慢，很难进行调试，而且写起来非常麻烦！",
    "Information on the different data structures can be found in the following sections:":"有关不同数据结构的信息，请参阅以下各节：",
    "Lists":"列表 Lists",
    "Maps":"映射 Maps",
    "Priority Queues":"优先队列 Priority Queues",
    "Queues":"队列 Queues",
    "Stacks":"堆栈 Stacks",
    "There is also a special function for checking to see whether a data structure of any given type exists:":"还有一个特殊函数，用于检查是否存在任何给定类型的数据结构：",
    "To remedy this, {}GameMaker{} has a number of built-in {}data structures{} that can be accessed through specialist functions. There are six different types of data structure available, each one having its own benefits depending on the type of information that you are looking to store and how you wish to manipulate it later: stacks, queues, lists, maps, priority queues, and grids.":"为了解决此问题，{}GameMaker{}具有许多内置的{}数据结构{}，可以通过专家函数访问。有六种不同类型的数据结构可用，每种数据结构都有自己的优点，具体取决于您希望存储的信息类型以及希望以后如何操作它：堆栈、队列、列表、映射、优先级队列和网格。",
    "When you create a data structure, the index value used to identify it is an integer value starting at 0. This means that different data structures can have the {}same{} index value, so if in doubt you should be using the {}{}{}ds_exists{}{}{} function before accessing them. Also note that indices are re-used, so a destroyed data structure index value may be used by a newly created one afterwards, and we recommend that you set any variable that holds a DS index to -1 after having destroyed the data structure.":"创建数据结构时，用于标识该数据结构的索引值是从0开始的整数值。这意味着不同的数据结构可以具有{}相同的{}索引值，因此如果您有疑问，应在访问之前使用{}{}{}ds_exists{}{}{}函数。另请注意，索引将被重复使用，因此新创建的索引之后可能会使用已销毁的数据结构索引值，我们建议您在销毁数据结构之后将保留Ds索引的任何变量设置为-1。",
    "{}NOTE{}: It is recommend to use {}arrays{} and {}structs{} over DS lists and maps, as they have similar features, are easier to use and are garbage collected automatically.":"{}注意{}：建议在DS列表和映射上使用{}数组{}和{}结构{}，因为它们具有相似的函数，更易于使用，并且是垃圾自动收集的。",
    "{}{}NOTE{} {}As with all dynamic resources, data structures take up memory and so should {}always{} be destroyed when no longer needed to prevent memory leaks which will slow down and eventually crash your game.":"{}{}注意{}{}与所有动态资源一样，数据结构占用内存，因此当不再需要{}防止内存泄漏时，应始终销毁{}，这将降低速度并最终导致游戏崩溃。"
}