{
    "The above code will change the default precision setting for all data structure functions.":"上述代码将更改所有数据结构函数的默认精度设置。",
    "The precision value (default 0.0000001)":"精度值(默认值0.0000001)",
    "When comparing values, for example when searching in a map or sorting a list, {}GameMaker{} must decide when two values are equal. For strings and integer values this is clear but for real numbers, due to floating point round-off errors, seemingly equal numbers can easily become unequal. For example, it\u0027s possible that {}(5 / 3) * 3{} will {}not{} be equal to 5! To help avoid this, a precision value is used on all real number functions, and when the {}difference between two numbers is smaller{} than this precision they are considered equal. The default a precision of 0.0000001 is used for all data structure functions unless changed by this function.":"比较值时(例如，在地图中搜索或对列表排序时)，{}GameMaker{}必须决定两个值何时相等。对于字符串和整数值，这一点是清楚的，但对于实数，由于浮点舍入误差，看似相等的数字很容易变得不相等。例如，{}(5/3 )* 3{}可能不会{}等于5！为了避免这种情况，在所有实数函数上使用精度值，当两个数之间的{}差小于此精度{}时，它们被视为相等。默认精度0.000001用于所有数据结构函数，除非此函数更改。",
    "When comparing values, for example when searching in a map or sorting a list, {}GameMaker{} must decide when two values are equal. For strings and integer values this is clear but for real numbers, due to floating point round-off errors, seemingly equal numbers can easily become unequal. For example, it\u0027s possible that {}(5 / 3) * 3{} will {}not{} be equal to 5! To help avoid this, a precision value is used on all real number functions, and when the {}difference between two numbers is smaller{} than this precision they are considered equal. The default precision of 0.0000001 is used for all data structure functions unless changed by this function.":"比较值时，例如在地图中搜索或对列表排序时，{}GameMaker{} 必须决定两个值何时相等。对于字符串和整数值，这是很清楚的，但对于实数，由于浮点舍入误差，看似相等的数字很容易变得不相等。例如，{}(5 / 3) * 3{} 有可能 {} 不 {} 等于 5！为了帮助避免这种情况，所有实数函数都使用精度值，并且当 {} 两个数字之间的差异小于此精度时 {} 它们被视为相等。默认精度 0.0000001 用于所有数据结构函数，除非此函数更改。",
    "{}NOTE{}: This precision is used in all data structures but not in other comparisons in GML!":"{}注意{}：此精度用于所有数据结构，但不用于GML 中的其他比较！",
    "{}{}NOTE{}{}&nbsp;This precision is used in all data structures but not in other comparisons in GML!":"{}{} 注意{}{} 此精度用于所有数据结构，但不用于 GML 中的其他比较！"
}