{
    "Below that you have the different Packaging options which are:":"下面是不同的打包选项，它们是：",
    "Finally we come to the {}KeyStore{}. This is a file that will be used to \"sign\" all your Android apps so please fill in all the details correctly and keep in mind that this file will be required to create and update all your Android&nbsp;apps in the future, meaning that after setting {}{}it up{}{} it is advised to take a screenshot of the settings used and make a backup of the final file{}{}. If you lose this file you will {}not {}be able to update any existing games that have been uploaded to the&nbsp;store.":"最后，我们来到了{}密钥库{}。此文件将用于对您的所有 Android 应用程序进行\"签名\"，因此请正确填写所有详细信息，并记住，将来创建和更新您的所有 Android 应用程序时将需要此文件，这意味着在设置{}{}它之后{}{}，建议您对所使用的设置截屏并备份最终文件{}{}。如果丢失此文件，您将{}无法{}更新已上载到商店的任何现有游戏。",
    "Once this information is filled in and you are happy with it, press the button marked {}Generate Keystore{} for {}GameMaker{} to create the necessary keystore file. This may take a moment but once it is finished, it normally will not need to be changed again. Note that you can click the {}Import {}button to import a previously created keystore file (see the {}Filename {}section, above) and you can also retrieve the keystore SHA1 hash by clicking the {}Generate Key Hash {}button. Pressing this will generate two special security hash keys directly linked to your keystore file that some web sites require for correct functionality (for example, Facebook, or Google Play for the Sha1 hash). Should you need this, simply press the button, then copy and paste the hash keys that are generated.":"填写此信息并满意后，按下标记为{}生成密钥库{}的按钮，以让 {}GameMaker{} 创建所需的密钥库文件。这可能需要一段时间，但一旦完成，通常不需要再次更改。请注意，您可以单击{}导入{}按钮来导入以前创建的密钥库文件(请参见上面的{}文件名{}部分)，您还可以通过单击{}生成密钥哈希{}按钮来检索密钥库 SHA-1 哈希。按此将生成两个直接链接到您的密钥库文件的特殊安全哈希密钥，某些网站需要这些密钥才能正常运行(例如，Facebook 或 Google Play 要求 SHA-1 哈希)。如果需要，只需按下按钮，然后复制并粘贴生成的哈希键。",
    "The {}Android{} preferences are split into various sections listed below:":"{}Android{} 首选项分为下面列出的各个部分：",
    "To create a new keystore file the following details are required:":"要创建新的密钥库文件，需要以下详细信息：",
    "{}Alias Password{}: Your alias security password for the keystore file which must be at least six characters long.{} {} {}NOTE{}&nbsp;If your Android Studio version is 4.2 or above, you must use the same password for the \"Password\" and \"Alias Password\" fields above. Using a different password and alias password will cause your builds to fail. ":"{}别名密码{}：密钥库文件的别名安全密码，必须至少六个字符。{}注：如果您的 Android Studio 版本是 4.2 或更高版本，则上面的密码和别名密码字段必须使用相同的密码。使用不同的密码和别名密码会导致构建失败。",
    "{}Alias{}: This is another name that can be used for the keystore file and should be different to the name entered above.":"{}别名{}：这是另一个可用于密钥库文件的名称，应该与上面输入的名称不同。",
    "{}Always do full install of APK{}: Flagging this will make {}GameMaker{} remove any previous runners of your game from your device, as well as all associated files (for example, {}*.ini{} files) from your test device before installing a new version of the game.":"{}始终完全安装 APK{}：标记此选项将使 {}GameMaker{} 在安装游戏的新版本之前，从您的设备中删除所有以前运行游戏的程序，以及测试设备中的所有关联文件 (例如，{}*.ini{} 文件)。",
    "{}At the top of the preferences&nbsp;you can set the maximum size of the {}JDK Memory Heap{}&nbsp;(default is 2GB). Next you have to set up the various different {}Paths {}so that {}GameMaker{} knows where to look for the various tools required to build the final executable package and test your game. This is split into three sections for the {}Android SDK{}, {}Android NDK {}and {}Java JDK{}. These paths should have been filled in automatically for you, but should you have any issues you can click the button to the right to open the file explorer and manually select the locations for each element. You can find details of what versions are required for each of the SDK elements {}here{}. Paths should be validated as you apply them and a message will show \"{}Found{}\" or tell you of any errors (in which case you should revise all the information to make sure it is correct).":"{}在首选项顶部，您可以设置 {}JDK 内存堆{}的最大大小(默认为 2 GB)。接下来，您必须设置各种不同的{}路径{}，以便{}GameMaker{}知道在哪里查找构建最终可执行程序包和测试游戏所需的各种工具。分为 {}Android SDK{}、{}Android NDK{} 和 {}Java JDK{} 三个部分。这些路径应该已经为您自动填充，但如果您有任何问题，您可以单击右侧的按钮打开文件资源管理器，并手动选择每个元素的位置。您可以在{}此处{}查看每个 SDK 元素需要的版本的详细信息。应在应用路径时对其进行验证，一条消息将显示\"{}Found{}\"或告诉您任何错误(在这种情况下，您应修改所有信息以确保其正确无误)。",
    "{}Common Name{}: This would normally be your name.":"{}常用名称{}：这通常是您的名字。",
    "{}Country{}: The standard {}two letter code{} for the country where you are based.":"{}国家/地区{}：您所在国家/地区的标准{}双字母代码{}。",
    "{}Filename{}: This is the name of the keystore file.":"{}文件名称{}：这是密钥库文件的名称。",
    "{}Install on package{}: When this option is flagged, compiling a final executable {}*.apk{} package will also install it automatically on the currently selected target device.":"{}在包上安装{}：标记此选项后，编译最终的可执行文件 {}*.apk{} 包也会自动将其安装在当前选择的目标设备上。",
    "{}Location{}: The name of the town or city where you are based.":"{}位置{}：您所在的城镇或城市的名称。",
    "{}NOTE{}: {}This is not your name or the company name, but the name of the file to be generated! If you already have a keystore file from previous projects then you can click the file browser button here and direct {}GameMaker{} to the previously created&nbsp;keystore file (or click the {}Import {}button). In this case, you must still fill out the rest of the required information ({}exactly as it was when you first generated the file{}) but you must {}not {}click the {}Generate Keystore&nbsp;{}button!. That will generate a new keystore file, overwriting the previous one.{}":"{}注意{}：{}这不是您的姓名或公司名称，而是要生成的文件的名称！如果您已经拥有以前项目中的密钥库文件，则可以单击此处的文件浏览器按钮，并将 {}GameMaker{} 定向到先前创建的密钥库文件(或单击{}导入{}按钮)。在这种情况下，您仍然必须填写所需的其余信息({}与您第一次生成文件时的信息{}完全相同)，但您必须{}不能{}单击{}生成密钥库{}按钮！这将生成一个新的密钥库文件，覆盖以前的文件。{}",
    "{}Organisational Unit{}: The department within the company that you are a part of.":"{}组织单位{}：您所在的公司内部的部门。",
    "{}Organisation{}: The name of your company.":"{}组织{}：公司名称。",
    "{}Password{}: Your security password for the keystore file which must be at least six characters long.":"{}密码{}：密钥库文件的安全密码，长度必须至少为六个字符。"
}