{
    "The HTML5 preferences have the following options:{}":"HTML5 首选项有以下选项：{}",
    "{}Default Web Server Address{}: Here you can change the default web server address for the HTML5 web server.&nbsp;Default value is 127.0.0.1.":"{}默认 Web 服务器地址{}：您可以在此处更改 HTML5 Web 服务器的默认 Web 服务器地址。 默认值为127.0.0.1。",
    "{}Default Web Server Allowed IPs{}: Here you can add in any allowed IPs for the web server and they will be set as default for all devices added through the Target Manager.":"{}默认 Web 服务器允许的 IP{}：您可以在此处添加 Web 服务器的任何允许 IP，这些 IP 将被设置为通过目标管理器添加的所有设备的默认 IP。",
    "{}Default Web Server Port{}: This lets you change the default port for the HTML5 web server. Default value is 51264.":"{}默认 Web 服务器端口{}：这允许您更改 HTML5 Web 服务器的默认端口。默认值为 51264。",
    "{}Default packaging type{}: When building a final HTML5 executable package, you can choose between {}Package as loose files{} - which will simply generate all the required files in a folder - or {}Package as Zip{} - which will create a compressed {}ZIP {}file that will have the game and any additional files within. By default you will be given a choice of which of these two options you wish to choose on compile, but you can set this preference to always use one or the other. Note that when this option is set to {}Show Dialogue{}, in the actual dialogue window that pops up on compile, choosing \"Remember Packaging Option\" will set this preference to the option you select.":"{}默认打包类型{}：在构建最终的 HTML5 可执行包时，您可以选择{}打包为松散文件{}-这将只是在文件夹中生成所有必需的文件-或者{}打包为 ZIP{}-将创建一个压缩的 {}ZIP{} 文件，其中将包含游戏和任何其他文件。默认情况下，您可以选择在编译时选择这两个选项中的哪一个，但您可以将此首选项设置为始终使用其中之一。请注意，当此选项设置为{}显示对话框{}时，在编译时弹出的实际对话框窗口中，选择\"记住打包选项\"会将此首选项设置为您选择的选项。",
    "{}Enable Conditional Compilation{}: This option enables conditional compilation of the runtime code,&nbsp;{}which will strip parts that are unused by your game. It can be used together with {}Remove Unused Functions{} for best results.{}":"{}启用条件编译{}：此选项启用运行时代码的条件编译，{}这将删除游戏未使用的部分。它可以与{}删除未使用的函数{}一起使用，以获得最佳效果。{}",
    "{}Enable Debug Rename{}: This option prefixes identifiers in the minified code with {}obf_{}&nbsp;instead of renaming them to short ones, making it easier to look for things when debugging.":"{}启用前缀{}：此选项在缩小的代码中使用{}obf_{}作为标识符的前缀，而不是将它们重命名为短标识符，从而使调试时更容易查找内容。",
    "{}HTML5{}&nbsp;Preferences":"{}HTML5{} 首选项",
    "{}Keep JSDoc{}:&nbsp;This enables or disables JSDoc comments in the game code.":"{}保持JSDoc{}：这将在游戏代码中启用或禁用JSDoc注释。",
    "{}Obfuscate{}: Whether the HTML5 runner code should be obfuscated in debug mode or not.":"{}混淆{}：是否应在调试模式下对 HTML5 运行器代码进行混淆处理。",
    "{}Path to HTML5 Runner{}: Here you can change the path to the HTML5 runner to use a custom version of the runner. The default value is&nbsp;{}${html5_runner_path}{}, which points to the HTML5 runner downloaded through the IDE.":"{}HTML5 Runner 路径{}：您可以在此处更改 HTML5 Runner 的路径，以使用自定义版本的 Runner。缺省值为 {}${html5_runner_path}{}，它指向通过 IDE 下载的 HTML5 运行器。",
    "{}Pretty Print{}: Whether the game code should be pretty printed (formatted) or not.":"{}美化打印{}：游戏代码是否需要美化打印(格式化)。",
    "{}Remove Unused Functions{}: Whether unused functions should be removed from the final JavaScript code (removes both built-in GameMaker functions and custom GML functions which are unused).":"{}删除未使用的函数{}：是否应从最终的 JavaScript 代码中删除未使用的函数(同时删除未使用的内置 GameMaker 函数和自定义 GML 函数)。",
    "{}Remove Unused Functions{}: Whether unused functions should be removed from the final JavaScript code (removes both built-in {}GameMaker{}&nbsp;functions and custom GML functions which are unused). Enabling this reduces runtime size.":"{}删除未使用的函数{}：是否应从最终JavaScript代码中删除未使用的函数(删除未使用的内置{}GameMaker{}函数和自定义GML函数)。启用此选项可减少运行时大小。",
    "{}Verbose{}: Enable or disable verbose logging in the Output Log while building for HTML5.":"{}详细{}：在为 HTML5 生成时启用或禁用输出日志中的详细日志记录。",
    "{}{}IMPORTANT{}{}&nbsp;When using a particular target device (i.e. browser), the IP and port values set for that particular device are used instead of these preferences. Check {}The Device Manager{}&nbsp;to see a list of your devices with their details.":"{}{}重要{}{} 使用特定目标设备(即浏览器)时，将使用为该特定设备设置的IP和端口值，而不使用这些首选项。检查{}设备管理器{} 以查看您的设备列表及其详细信息。"
}