{
    "All instances have a unique identifier ({}{}id{}{}) which can be used to modify and manipulate them while a game is running, but you may not always know what the id for a specific instance is and so this function can help as you can use it to iterate through all of them to find what you need. You specify the object that you want to find the instance of and a number, and if there is an instance at that position in the instance list then the function returns the id of that instance, and if not it returns the special {}keyword{} {}{}noone{}{}. You can also use the keyword {}{}all{}{} to iterate through all the instances in a room, as well as a parent object to iterate through all the instances that are part of that parent / child hierarchy,&nbsp;and you can even specify an instance (if you have its {}id{}) as a check to see if it actually exists in the current room. Please note that as instances are sorted in an {}arbitrary{} manner, there is no specific order to how the instances are checked by this function, and any instance can be in any position.":"所有实例都有一个唯一的标识符({}{}id{}{})，当游戏运行时，它可以用来修改和操纵它们，但您可能并不总是知道特定实例的id是什么，因此该函数可以帮助您使用它来遍历所有实例以找到您需要的内容。指定要查找实例的对象和编号，如果实例列表中该位置有实例，则函数返回该实例的 id，否则返回特殊{}关键字{}{}{}noone{}{}。 您还可以使用关键字{}{}all{}{}遍历房间中的所有实例，以及父对象以遍历该父/子层次结构的一部分的所有实例，甚至可以指定一个实例(如果具有其{}id{})作为检查，以查看它是否实际存在于当前房间中。请注意，由于实例以{}任意{}方式排序，因此该函数对实例的检查没有特定顺序，任何实例都可以位于任何位置。",
    "For an object index: {}{}instance_number(OBJ) - 1{}{}":"对于object index：{}{}instance_number(OBJ)- 1{}{}",
    "For the keyword {}{}all{}{}: {}{}instance_count - 1{}{}":"关键字{}{}all{}{}：{}{}instance_count- 1{}{}",
    "The above code will use a {}for{} loop to iterate through all the instances of \"obj_Enemy\" and store their {}id{} in the array \"enemy[]\".":"上面的代码将使用{}for{}循环遍历\"obj_Enemy\"的所有实例，并将其{}id{}存储在数组\"敌人[]\"中。",
    "The maximum value for \"n\" in this function would be":"此函数中\" n \"的最大值为",
    "The number of the instance to find.":"要查找的实例的编号。",
    "The object to find the nth instance of":"要查找其第n个实例的对象"
}