{
    "Note that the function also accepts the special keyword {}{}{}all{}{}{}, in which case all instances found to be in collision will be listed. The function returns the number of instances found, or 0 if none are found.":"请注意，函数还接受特殊关键字{}{}{}all{}{}{}，在这种情况下，将列出发现冲突中的所有实例。函数返回找到的实例数，如果未找到，则返回0。",
    "The DS list to use to store the IDs of colliding instances.":"用于存储冲突实例的ID的DS列表。",
    "The above code will check for a collision with all instances found at the calling instances position. These will be added to a DS list, which is then looped through to destroy each of the instances in collision.":"上面的代码将检查与在调用实例位置找到的所有实例的冲突。这些将被添加到DS列表中，然后循环以销毁冲突中的每个实例。",
    "The object to check for instances of.":"要检查其实例的对象。",
    "The x position to check for instances.":"要检查实例的X位置。",
    "The y position to check for instances.":"要检查实例的Y位置。",
    "Whether the list should be ordered by distance ({}true{}) or not ({}false{}).":"列表是否应按距离排序({}true{})或({}false{})。",
    "With this function you can check a position for a collision with all instances of an object using the collision mask of the instance that runs the code for the check. When you use this you are effectively asking {}GameMaker{} to move the instance to the new position, check for a collision, then move back and tell you if a collision was found or not. This will work for precise collisions, but only if both the instance and the instances of the object being checked for have precise collision masks selected, otherwise only bounding box collisions are applied.":"使用此函数，您可以使用为检查运行代码的实例的碰撞掩码来检查与对象的所有实例碰撞的位置。使用该选项时，实际上是要求{}GameMaker{}将实例移动到新位置，检查冲突，然后返回并告诉您是否发现冲突。此操作适用于精确碰撞，但仅当选中对象的实例和实例都选择了精确碰撞遮罩时，否则仅应用边界框碰撞。",
    "You supply a {}DS list{} too, so the&nbsp;{}{}id{}{} values of any instances that are colliding with the calling instance will be added to the end of the given list. You can {}clear{} the list before calling this function so that it only contains results from this function call. You also have the option to order the list based on the distance from the origin of the instance doing the checking to the origin of the instances found to be in collision.":"您还提供了一个{}DS列表{}，因此与调用实例冲突的任何实例的{}{}ID{}{}值都将添加到给定列表的末尾。您可以在调用此函数之前{}清除{}列表，以便它只包含此函数调用的结果。您还可以选择根据从执行检查的实例的原点到发现发生冲突的实例的原点的距离对列表进行排序。",
    "{}{}Real{}{} (The number of instances found to be in collision)":"{}{}Real{}{} (发现发生碰撞的实例数)"
}