{
    "It is worth noting that changing the instance means that you should perform no further actions with that instance until the next step, in particular trying to access variables etc... as that will cause an error. Basically, you change the instance but it is not actually available until the end of the current step, so to access any of the variables it contains directly (for example, calling {}obj_Changed.x{}) will not work.":"值得注意的是，更改实例意味着在下一步之前您不应对该实例执行进一步操作，特别是尝试访问变量等... 因为那样会导致错误。基本上，您更改实例，但在当前步骤结束之前它实际上不可用，因此直接访问它包含的任何变量(例如，调用{}obj_Changed.x{})将不起作用。",
    "The above code will change the calling instance into an instance of \"obj_Player_Swimming\" without performing the original instances destroy event nor the new instances create event when the user presses the \"Enter\" key, exiting the code block when done.":"以上代码将调用实例更改为\"obj_Player_Swimming\"实例，用户按\"Enter\"键时不执行原实例销毁事件或新实例创建事件，完成后退出代码块。",
    "The new object the calling object will change into.":"调用对象将更改为的新对象。",
    "Whether to perform that new object\u0027s Create and Destroy events (true) or not (false).":"是否执行新对象的创建和销毁事件(true)或不执行(false)。",
    "You can use this function to change one instance of an object into another instance of a different object, and while doing so decide whether to perform the initial instances Destroy and Clean Up Events and the new instances Create Event. In this way, you can have (for example) a bomb change into an explosion - in which case the \"perf\" argument would probably be true as you would want the bomb to perform its Destroy Event and Clean Up Event, as well as the explosion to perform its Create Event - or you could have your player character change into a different one - in which case the \"perf\" argument would probably be false as you do not want the instances to perform their Create and Destroy/Clean Up events.":"您可以使用此函数将对象的一个实例更改为不同对象的另一个实例，同时决定是否执行初始实例\"销毁和清理事件\"以及新实例\"创建事件\"。通过这种方式，您可以(例如)将炸弹更改为爆炸，在这种情况下，\"perf\"参数可能为真，因为您希望炸弹执行其销毁事件和清理事件，以及爆炸以执行其创建事件。或者，您可以让您的玩家角色更改为其他角色，在这种情况下，\"perf\"参数可能是假的，因为您不希望实例执行其创建和销毁/清理事件。",
    "{}WARNING!{} When changing a physics enabled instance, the physical properties {}will not be carried over{} to the new instance being changed into. Therefore you should have code in place to \"transfer\" the physics state of the current instance over to the new instance, or have defined the new instances physical properties in its Create Event, or in the object editor. For this reason it is recommended that you not use this function with physics enabled instances, but rather use a combination of {}{}instance_destroy(){}{} and {}{}{}instance_create_layer(){}{}.{}":"{}警告！{}更改启用物理的实例时，物理属性{}不会转移到正在更改的新实例{}。因此，您应该有代码来\"转移\"当前实例的物理状态到新实例，或者已经在其创建事件或对象编辑器中定义了新实例的物理属性。因此，建议您不要将此函数用于启用物理的实例，而应使用{}{}instance_destroy(){}{}和{}{}{}instance_create_layer(){}{}的组合。{}",
    "{}警告!{}更改启用了物理的实例时，物理属性{}将不会转移到要更改为的新实例。因此，应该具有适当的代码，以便将当前实例的物理状态\"传输\"到新实例，或者已经在其\"创建事件\"(Create Event)或对象编辑器中定义了新实例的物理属性。因此，建议您不要在启用了物理功能的实例中使用此功能，而是使用{}{}实例销毁(){}{}和{}{}{}实例创建层(){}{}的组合。{}{}":""
}