{
    "The above code writes the name string of the current server (stored in \"global.ServerName\"), then writes it to a binary buffer with the id \"broadcast_buffer\". This data is then broadcast locally to a range of IPs (the device IP is currently implied as the broadcast base range) to port 6511.":"上述代码写入当前服务器的名称字符串(存储在global.ServerName中)，然后将其写入id为\"broadcast_buffer\"的二进制缓冲区。然后将该数据本地广播到IP段范围(设备Ip当前隐含为广播基本范围)到端口6511。",
    "The id of the buffer to get the data from.":"从中获取数据的缓冲区的ID。",
    "The id of the socket to use.":"要使用的套接字的ID。",
    "The port that the server will use.":"服务器将使用的端口。",
    "The size (in bytes) of the data.":"数据的大小(以字节表示)。",
    "With this function you can broadcast the data from a buffer locally to a range of IP addresses (for more information on buffers see {}Reference - Buffers{}). The range is limited to that of the device running the server, such that if the device has an IP of 92.168.11.130, then the data will be broadcast over the range 92.168.11.*. The function will return the number of bytes of data sent, or a number less than 0 if the send has failed.":"使用此函数，您可以在本地将缓冲区中的数据广播到Ip地址范围(有关缓冲区的详细信息，请参阅{}参考-缓冲区{})。该范围仅限于运行服务器的设备的范围，因此，如果设备的Ip为192.168.11.130，则数据将在范围192.168.11.*上广播。该函数将返回发送的数据的字节数，如果发送失败，则返回小于0的数字。",
    "{}{}IMPORTANT{}{}&nbsp;iOS 14 and later require that you request the multicast entitlement ({}com.apple.developer.networking.multicast{}) and enable it in order to {}send and receive{}&nbsp;multicasts and broadcasts.{} Moreover, iOS 14 does not show the consent modal dialog to the user until a packet is first sent. So the alert will not be shown if the UDP socket only receives.{} A way to work around this is to send an empty \"dummy\" packet so that the consent modal is triggered.":"{}{}重要{}{}iOS 14和更高版本要求您请求多播授权({}com.apple.developer.networking.multicast{})并启用它，以便{}发送和接收{}多播和广播。{}此外，在首次发送数据包之前，iOS 14不向用户显示同意模式对话框。因此，如果Udp套接字仅接收，则不会显示警报。{}解决此问题的一种方法是发送一个空的\"虚拟\"数据包，以便触发同意模式。",
    "{}{}NOTE{}{}&nbsp;This function will not work when used in a project running on the HTML5 target.":"{}{}注意{}{}在HTML5目标上运行的项目中使用此函数将不起作用。",
    "{}{}NOTE{}{}&nbsp;This function will only work when used with UDP - your server needs to be TCP and your client needs to have a UDP client socket created with {}{}{}network_create_socket_ext(){}{}{} in order to receive any broadcasts sent from the server.":"{}{}注意{}{}此函数仅在与Udp一起使用时有效-您的服务器需要为Tcp，并且您的客户端需要使用{}{}{}network_create_socket_ext(){}{}{}创建Udp客户端套接字，以便接收从服务器发送的任何广播。"
}