{
    "Network Send Type Constant":"网络发送类型常量",
    "Options Argument":"选项参数",
    "Send a binary message":"发送二进制消息",
    "Send a text message":"发送文本消息",
    "The APIs for some platforms only accept text messages when using WebSockets (e.g. Twitch), so the {}network_send_text{} constant can be used in such cases. If this argument is not specified, binary data is sent by default.":"某些平台的API在使用WebSockets(例如Twitch)时仅接受文本消息，因此{}network_send_text{}常量可用于此类情况。如果未指定此参数，则默认情况下会发送二进制数据。",
    "The above information loads a previously saved buffer data into memory and returns the buffer id to be stored in the variable \"buff\". This complete buffer is then send as a raw data packet over the network using the socket identified by the variable \"sock\".":"上述信息将先前保存的缓冲区数据加载到内存中，并返回要存储在变量\"buffe\"缓冲区中。然后，使用由变量\"sock\"标识的套接字，将该完整缓冲区作为原生数据包通过网络发送。",
    "The id of the buffer to get the data from.":"缓冲区的ID。",
    "The id of the socket to use.":"要使用的套接字的ID。",
    "The last argument is optional, and is only used with WebSockets. It allows you to choose between sending binary or text data. Either of these constants can be specified in this argument:":"最后一个参数是可选的，仅与WebSockets一起使用。它允许您选择发送二进制数据还是文本数据。可以在此参数中指定以下任一常量：",
    "The size (in bytes) of the data.":"数据的大小(以字节表示)。",
    "With this function you can send a \"raw\" data packet through the network. The function takes the {}socket id{} to connect through and then you must supply the {}buffer id{} which contains the data to be sent (for more information on buffers see {}Reference - Buffers{}) and finally the size (in bytes) of the data packet. The data sent is not formatted by {}GameMaker{} in any way and the receiving devices will get the data as a stream which means you will have to handle it yourself. The function will return the number of bytes of data sent, or a number less than 0 if the send has failed.":"通过此功能，您可以通过网络发送\"原生\"数据包。该函数使用{}套接字ID{}进行连接，然后必须提供包含要发送的数据的{}缓冲区ID{}(有关缓冲区的详细信息，请参阅{}参考-缓冲区{})，最后是数据包的大小(以字节为单位)。{}GameMaker{}不会以任何方式对发送的数据进行格式化，接收设备将以流的形式获取数据，这意味着您必须自行处理这些数据。该函数将返回发送的数据的字节数，如果发送失败，则返回小于0的数字。",
    "{}OPTIONAL{} Used for WebSockets to choose between text and binary data; if not specified, binary data is sent.":"{}可选{}用于WebSockets在文本数据和二进制数据之间进行选择;如果未指定，则发送二进制数据。"
}