{
    "0 = block, 1 = don\u0027t block":"0 = 阻塞的, 1 = 不阻塞",
    "A value in milliseconds":"以毫秒为单位的值",
    "Disables the \"reliable UDP\" protocol for an existing UDP socked.":"禁用现有Udp套接的\"可靠Udp\"协议。",
    "Enables the \"reliable UDP\" protocol for an existing UDP socket":"为现有Udp套接字启用\"可靠Udp\"协议",
    "It is possible to have two separate UDP sockets, one with reliable UDP enabled for one with reliable UDP disabled for the other.":"可能有两个单独的Udp插座，一个启用了可靠Udp，另一个禁用了可靠Udp。",
    "Network Config Constant":"网络配置常量",
    "Set a connection timeout value":"设置连接超时值",
    "Sets the&nbsp;{}SO_LINGER{} timeout value to 0 for an exisiting TCP socket":"将现有Tcp套接字的{}SO_LINGER{}超时值设置为0",
    "Tell {}GameMaker{} not to block on connect.":"告诉{}GameMaker{}不要在连接时阻塞。",
    "The above code will set the timeout for the network connection to 1000ms and tell {}GameMaker{} not to block on connect.":"以上代码将网络连接的超时设置为1000 ms，并告诉{}GameMaker{}不要阻塞连接。",
    "The config constant to set (refer to the table at the top of this page).":"要设置的配置常量(请参阅本页顶部的表格)。",
    "The final option,&nbsp;{}network_config_avoid_time_wait{}&nbsp;is for&nbsp;{}TCP connections only{}&nbsp;and can be used to set the {}SO_LINGER{} value to {}0{}&nbsp;t{}o avoid large numbers of connections sitting in the {}TIME_WAIT{}&nbsp;{}{}state, tying up all the available resources on a server.{}&nbsp;This change is permanent while the socket is alive and cannot be undone.":"最后一个选项{}network_config_avo_time_wait{}仅适用于{}Tcp连接{}，可用于将{}SO_LINGER{}值设置为{}0{}t{}，以避免大量连接处于{}TIME_WAIT{}{}{}状态，从而占用服务器上的所有可用资源。{}此更改在套接字处于活动状态时是永久性的，无法撤消。",
    "The protocol should be enabled/disabled on both sides before sending your data, and any data sent or received before the option has been enabled/disabled will not be affected.":"在发送数据之前，应在两端启用/禁用协议，并且在启用/禁用该选项之前发送或接收的任何数据都不会受到影响。",
    "The second option ({}network_config_use_non_blocking_socket{}) means that the {}network_connect_*{} functions (non-async) will all return a {}socket_id{} instantly, {}but you can\u0027t send or receive on that socket until you\u0027ve received an async network event{}. The event triggered will have the \"type\" key set to {}network_type_non_blocking_connect{} (you can find further details from the page on the {}Networking Asynchronous Event{}). This is a {}global{} setting as {}GameMaker{} does not support a mixture of blocking and non-blocking in one application.":"第二个选项({}network_config_use_non_blocking_socket{})表示{}network_connect_*{}函数(非异步)将立即返回{}socket_id{}，但在收到异步网络事件{}之前无法在该套接字上发送或接收。触发的事件将\"type\"键设置为{}network_type_non_blocking_connect{}(您可以从{}{}网络异步事件{}的页面中找到更多详细信息)。这是一个{}全局{}设置，因为{}GameMaker{}不支持在一个应用程序中混合使用阻止和非阻止。",
    "The setting value of the config.":"配置的设置值。",
    "The socket ID to target":"目标的套接字ID",
    "The third and fourth options ({}network_config_enable_reliable_udp{}, {}network_config_disable_reliable_udp{}) are for enabling or disabling the {}GameMaker{} reliable UDP protocol and as such, should {}only be used with UDP connections{}. What \"reliable\" in this case this means is that, when enabled on {}both{} ends of a connection, {}GameMaker{} will attempt to check your packets have arrived correctly and re-send any that don\u0027t arrive (note, we do not guarantee in your packets will arrive in order of transmission). When using a reliable socket type, there will be a 12-byte header added to all udp packets which contains information needed by {}GameMaker{} to check the packet for errors and re-send missing packets. The following points are worth noting when using this option:":"第三个和第四个选项({}network_config_enable_reliable_udp{},{}network_config_disable_reliable_udp{})用于启用或禁用{}GameMaker{}可靠的Udp协议，因此，应该{}仅用于Udp连接{}。在这种情况下，\"可靠\"是指，在连接的{}两端启用时，{}GameMaker{}将尝试检查您的数据包是否已正确到达并重新发送任何未到达的数据包(注意，我们不保证您的数据包是按传输顺序到达的)。使用可靠的套接字类型时，会在所有udp数据包中添加一个12字节的头，其中包含{}GameMaker{}检查数据包是否有错误以及重新发送丢失的数据包所需的信息。使用此选项时，以下几点值得注意：",
    "These configurations are given as {}constants{} and the setting will depend on the constant that you have chosen. The table below lists the available constants and their settings:":"这些配置以{}常量{}的形式提供，设置将取决于您选择的常量。下表列出了可用的常量及其设置：",
    "With this function you can set different network configurations.":"使用此功能，您可以设置不同的网络配置。",
    "You can enable or disable the protocol for any given socket ID multiple times, as long as this is properly managed on both the server side and client side":"您可以多次启用或禁用任何给定套接字ID的协议，只要在服务器端和客户端都正确管理该协议",
    "{} The first option ({}network_config_connect_timeout{}) simply sets the timeout for connecting to a server but doesn\u0027t change connection behaviour apart from the time you have to wait. It is recommended that you don\u0027t set this too low and keep it at about 1000 for a LAN only game or 4000 or so for internet, or the game may fail to connect randomly. If you wish to set a timeout value for sending/receiving packets then use the function {}{}network_set_timeout(){}{}.":"{}第一个选项({}network_config_connect_timeout{})只是简单地设置连接到服务器的超时时间，但不会更改除了必须等待的时间之外的连接行为。建议您不要将此值设置得太低，对于局域网专用游戏，应保持在1000左右，对于互联网，应保持在4000左右，否则游戏可能无法随机连接。如果要为发送/接收数据包设置超时值，请使用函数{}{}network_set_timeout(){}{}。",
    "{}NOTE{}: This function will not work when used in a project running on the HTML5 target.":"{}注意{}:在HTML5目标上运行的项目中使用时，此函数将不起作用。"
}