{
    "Skeletal Animation Sprites":"骨骼动画精灵",
    "The Fragment Shader:":"片段着色器：",
    "The Vertex Shader (this is the same as the default passthrough vertex shader)":"顶点着色器(与默认的穿过顶点着色器相同)",
    "The functions found in this section are {}only{} for use with sprites that have been imported from a skeletal animation file (specifically, the JSON files that {}{}Spine{}{} exports) and can be used to get information about an animation asset in your game, as well as for setting certain properties within an animation. These functions can to be used along with the regular sprite functions and variables, permitting you to (for example) mix two skeleton animations using these special functions while setting the image scale using the normal sprite instance variables (for more information on the sprite instance variables see {}here{}).":"本节中的函数{}仅{}用于从骨骼动画文件(特别是{}{}spine{}{}导出的JSON文件)导入的精灵，并且可用于获取有关游戏中动画资源的信息，以及用于设置动画中的某些属性。这些函数可以与常规Sprite函数和变量一起使用，允许您(例如)使用这些特殊函数混合两个骨架动画，同时使用普通Sprite实例变量设置图像比例(有关Sprite实例变量的详细信息，请参见此{}处的{})。",
    "This feature allows the dark areas of Spine sprite slots to be tinted differently to the light areas (this is a Spine IDE feature, see the {}Tint black{} section {}here{} more details). Currently, in order to make use of this feature in {}GameMaker{}, you are required to use a custom {}shader{}&nbsp;when drawing a Spine sprite that uses it. This shader contains a global uniform variable called \"{}gm_SpineTintBlackColour{}\" which the runner fills with the current tint-black colour, retrieved from the Spine data automatically. The shader required is shown below:":"此功能允许Spine Sprite插槽的深色区域以不同于浅色区域的方式着色(这是Spine IDE的一项功能，有关更多详细信息，请参阅{}Tint Black{}部分{}此处{})。目前，为了在{}GameMaker{}中使用此功能，您需要在绘制使用它的Spine Sprite时使用自定义{}着色器{}。该着色器包含一个名为\"{}GM_spinetintblackcolour{}\"的全局统一变量，跑步者用当前的淡黑色填充该变量，该颜色是从脊柱数据中自动检索的。所需的着色器如下所示：",
    "You can find out more about the functions for these kinds of sprites from the sections below:":"您可以从以下部分找到有关这些类型的精灵的功能的更多信息：",
    "You would use this by first calling the shader, then drawing the sprite, then resetting the shader, something like this:":"您可以通过首先调用着色器，然后绘制精灵，然后重置着色器来使用它，如下所示：",
    "{}NOTE{}&nbsp;For further information on importing skeletal animation sprites made with Spine, please see the section {}Importing Non-Bitmap Sprites{}.":"{}注意{}有关导入使用Spine制作的骨骼动画精灵的更多信息，请参见{}导入非位图精灵{}一节。"
}