{
    "All&nbsp;{}ProjectTool{}&nbsp;output is shown in the Project Tool Window that you can open manually through the&nbsp;{}Project Tool Output{} option of&nbsp;{}The Windows Menu{}. It can also automatically be shown when&nbsp;{}ProjectTool{}&nbsp;runs by enabling&nbsp;{}Show Project Tool Output{} in the&nbsp;{}General Preferences{}.":"所有 {}ProjectTool{} 输出都显示在 {}Project Tool 输出 {} 中，您可以通过 {4} 窗口菜单 {5} 的 Project Tool Output 选项手动打开该窗口。当 {6}ProjectTool{7} 运行时，也可以通过启用 {10} 常规首选项 {11} 中的显示 {8}Project Tool 输出 {9} 来自动显示该窗口。",
    "It is accessible from the IDE through&nbsp;{}The Tools Menu{}&nbsp;&gt; {}Project Tool{} option.":"可以通过 {} 工具菜单 {} &gt; {} 项目工具 {} 选项从 IDE 访问该工具。",
    "It is used by the IDE&nbsp;internally to convert projects from older project formats to the current format and the other way round.":"IDE在内部使用它将项目从旧的项目格式转换为当前格式，或者反过来。",
    "The tool window contains the following fields:":"工具窗口包含以下字段：",
    "{}Clean Conversion Folders{} - When this checkbox is ticked,&nbsp;{}ProjectTool{}&nbsp;cleans up the conversion folders after conversion. This is enabled by default.":"{}清理转换文件夹{}-选中此复选框后，{}ProjectTool{}将在转换后清理转换文件夹。默认情况下启用此功能。",
    "{}Destination{} - This field contains the path to the destination&nbsp;project to create. Paste a valid path here or click the&nbsp;{}&nbsp;button to bring up a file selector. This field can be empty when the source project is a&nbsp;{}.yyp{}&nbsp;file, in which case&nbsp;{}ProjectTool{}&nbsp;does an in-place conversion (i.e. it converts the project in the source directory). It must be filled out, however, when the source project is a package file. {}ProjectTool{}&nbsp;shows the following message&nbsp;if you attempt to convert a package with an empty destination path:&nbsp;{}":"{}目标{}-此字段包含要创建的目标项目的路径。在此处粘贴有效路径或单击{}按钮以调出文件选择器。当源项目是{}.yyp{}文件时，此字段可以为空，在这种情况下，{}ProjectTool{}执行就地转换(即转换源目录中的项目)。但是，如果源项目是包文件，则必须填写此字段。如果您尝试转换目标路径为空的包，{}ProjectTool{}将显示以下消息：{}",
    "{}Force VERS0 Conversion if required{} - When this checkbox is enabled,&nbsp;{}ProjectTool{}&nbsp;forces a conversion to the intermediary base version 0 format in a last attempt to fix any issues with your project. The VERS0 format is a format to facilitate conversion between the NOV23 format and the versioned DEFAULT format.{} {} {}{}WARNING{}{}&nbsp;You should be very careful with enabling this option, as it will make a best guess to missing fields and strip out any unknown data. ":"{} 强制 VERS0 转换 (如果需要 ){}- 启用此复选框时，{}ProjectTool{} 强制转换为中间基础版本 0 格式，以最后尝试修复项目中的任何问题。VERS0 格式是一种便于在 NOV23 格式和版本化 DEFAULT 格式之间转换的格式。{} {}{}{}注意{}{} 启用此选项时应非常小心，因为它将对丢失的字段进行最佳猜测并剔除任何未知数据。",
    "{}Project Format{} - This drop-down&nbsp;list contains the available project formats that you can convert to. The following formats are available:&nbsp; {} {}{}LTS22{} - This is the project format used by the 2022.0 LTS release.{} {}{}NOV23{} - This is the project format used by the 2023.11 release.{} {}{}DEFAULT{} - This is the current default, versioned project format.{} {} ":"{} 项目格式 {}- 此下拉列表包含您可以转换为的可用项目格式。以下格式可用：{}{}{}LTS22{}- 这是 2022.0 LTS 版本使用的项目格式。{}{}{}NOV23{}- 这是 2023.11 版本使用的项目格式。{}{}{}DEFAULT{} -这是当前默认的版本化项目格式。{}{}",
    "{}ProjectTool{}":"{}项目工具{}",
    "{}ProjectTool{}&nbsp;Output":"{}ProjectTool{}输出",
    "{}ProjectTool{}&nbsp;is a built-in tool to convert projects between different versions of&nbsp;{}GameMaker{}.":"{}ProjectTool{}是一个内置工具，用于在不同版本的{}GameMaker{}之间转换项目。",
    "{}Source{} - This field contains the path to the source project or package file to convert. Paste a valid file path here or click the {}&nbsp;button to bring up a file selector.":"{}源{}-此字段包含要转换的源项目或包文件的路径。请在此处粘贴有效的文件路径或单击{}按钮以调出文件选择器。",
    "{}{}NOTE{}{}&nbsp;See the&nbsp;{}Project Format{}&nbsp;page for details on the current project format.":"{}{} 注意{}{} 有关当前项目格式的详细信息，请参阅 {} 项目格式 {} 页面。"
}