{
    "For this to work correctly you need to supply a high resolution splash screen and a high resolution icon image. The recommended sizes would be:":"为了正常工作，你需要提供一个高分辨率的启动屏和一个高分辨率的图标图像。建议的大小为：",
    "Once you have supplied these images they will be shown in the {}Preview Windows{} and you can then set the type of \"fit\" to be used when applying them to the different platforms. You can choose from the following:":"一旦您提供了这些图像，它们将显示在{}预览窗口{}中，然后您可以设置将它们应用到不同平台时要使用的\"适合\"类型。您可以从以下选项中进行选择：",
    "Project Image Generator":"项目图像生成器",
    "You can also set the {}background colour{} for both icons and images. This colour will be used to \"pad\" the image when scaled with aspect ratio. The following image shows how this will look once everything has been set up:":"您还可以为图标和图像设置{}背景色{}。当按长宽比缩放时，此颜色将用来\"填充\"图像。下图显示了一切设置完成后的外观：",
    "{}Crop To Fit{} - this will take the base image and make it fit best along either the horizontal or vertical axis and then crop the remainder. For example, if you have a 640x480 image that has to be used as a splash screen for 480x800, then the image will be scaled {}up{} to fit the vertical axis (480 -&gt; 800) and the rest of the image will be cropped away. Likewise if you have a 1080x1920 image that has to fit 800x800 then the image will be scaled down to fit the horizontal axis and the rest cropped away.":"{}裁剪以适应{} - 这将获取基本图像，使其沿水平轴或垂直轴最适合，然后裁剪其余部分。例如，如果您的 640x480 图像必须用作 480x800 的启动屏，则该图像将被{}放大{}以适应垂直轴 (480->800)，图像的其余部分将被裁剪掉。同样，如果您的 1080x1920 图像必须适合 800x800，则图像将被缩小以适应水平轴，其余部分将被裁剪掉。",
    "{}IMPORTANT! {}While this tool will generate all the images you require, that does not mean it is perfect! It will try to do its best to make the images suit the different sizes and resolutions for each platform but sometimes this may not look how you really want since there really is no \"one size fits all\" solution. Therefore after running this tool we recommend that you revise all the images in each platforms Game Options and tweak those that may not look exactly how you want manually.":"{}重要！{} 虽然此工具将生成您需要的所有图像，但这并不意味着它是完美的！它会尽最大努力使图像适合不同平台的不同大小和分辨率，但有时这可能看起来不是你真正想要的，因为真的没有\"一刀切\"的解决方案。因此，在运行此工具后，我们建议您修改每个平台游戏选项中的所有图像，并手动调整那些看起来可能不完全像您想要的图像。",
    "{}Icons{}: at least 1024x1024px (which is the size of the largest icon required), and authored as a 24bit {}*.png{} which can have transparencies":"{}图标{}：至少 1024x1024px (这是要求的最大图标的大小)，并制作为  24bit {}*.png{}，可以有透明胶片",
    "{}Keep Aspect Ratio{} - this will scale the image to fit maintaining the aspect ratio and adding in a background colour to fill in the sides if the fit is not 1:1":"{}保持纵横比{} - 这将缩放图像以适合纵横比，并在不适合1:1的情况下添加背景色来填充边框",
    "{}NOTE{}: The exception to the above statement is {}Android Adaptive Icons{}. These {}will not be generated{} using this tool due to the way they are structured.":"{}注意{}：上述说法的例外是{} Android 自适应图标{}。由于它们的结构方式，这些{}将不会使用此工具{}生成。",
    "{}Now all you have to do is click on {}Generate {}and {}GameMaker{} will populate all the Game Options {}Image {}and {}Icon {}settings with images for each platform.":"{}现在您所要做的就是点击{}生成{}，然后 {}GameMaker{} 将使用每个平台的图像填充所有游戏选项{}图像{}和{}图标{}设置。",
    "{}Splash Screen{}: at least 1920x1080px, or 1080x1920px for portrait, and authored as a 24bit {}*.png{} with no transparencies.":"{}启动屏{}：至少 1920x1080px，或竖向为 1080x1920px，制作为 24bit {}*.png{}，不带透明底片。",
    "{}Stretch To Fit{} - this will stretch the images to fit the full size of the image/icon.":"{}拉伸以适合大小{} - 这将拉伸图像以适合图像/图标的完整大小。",
    "{}The {}Project Image Generator{} is accessed from the {}Tools Menu{} at the top of the {}GameMaker{} IDE. This tool is designed to quickly create all the different splash screens, promo images and icons that are required by all the different target platforms from a single set of images. You supply the base image and the base icon and then click the {}Generate {}button, and your {}Game Options{} for each platform will update with the new images.":"{}{}项目图像生成器{}可从位于 {}GameMaker{} IDE 顶部的{}工具菜单{}访问。该工具旨在从一组图像中快速创建所有不同目标平台所需的所有不同启动画面、宣传图片和图标。您提供基本图像和基本图标，然后单击{}生成{}按钮，每个平台的{}游戏选项{}将使用新图像进行更新。"
}