{
    "The mixer itself is split into the following sections:":"混音器本身分为以下几个部分：",
    "To add sounds to the mixer, you can use {}&nbsp;/&nbsp;{} +{}&nbsp;to select sounds in the {}Asset Browser{} and then open the right click {}&nbsp;menu and select {}Open In Sound Mixer{}. Alternatively, you can click {}&nbsp;on a sound asset and drag it into the mixer.":"要将声音添加到混音器，您可以使用{} / {}+{} 在{}资源浏览器{}中选择声音，然后打开右键单击{} 菜单并选择{}在混音器中打开{}。或者，您也可以单击声音资源上的{} 并将其拖到混音器中。",
    "{}Audio Group{}: If you have assigned sound resources to different {}Audio Groups{} then you can select the group from this drop-down menu and all the sounds will be added to the current sound mixer column.":"{}音频组{}：如果您已将声音资源分配给不同的{}音频组{}，则您可以从此下拉菜单中选择该组，所有声音都将添加到当前混音器列中。",
    "{}Column Controls{}: This section contains the controls for the column of sounds. You can choose to play back all sounds in the column, as well as set them to loop or rewind to the start. You can also set the volume that they should be played back at, and changing this value will change it for all sounds in the group in real time.":"{}列控件{}：此部分包含声音列的控件。您可以选择回放该列中的所有声音，并将它们设置为循环或倒带到开头。您还可以设置播放它们的音量，更改此值将实时更改组中所有声音的音量。",
    "{}Extra Column / Add Column{}: You can add as many extra columns to the sound mixer as required by clicking the large button to the right of the mixer. Each extra column will be added to he right-most column and can then be linked the previous one, and you can add sounds or audio groups as you would normally. If you need to remove a column from the mixer, then you can find the {}Remove Sound Group{} button {}&nbsp;found beside the Audio Group drop down menu.":"{}额外的列/添加列{}：您可以通过点击混音器右侧的大按钮，根据需要向混音器添加任意数量的额外列。每个额外的栏将被添加到最右边的栏，然后可以链接到前一栏，您可以像往常一样添加声音或音频组。如果您需要从混音器中删除某一列，则可以找到音频组下拉菜单旁边的{}删除声音组{}按钮{}。",
    "{}Link Columns{}: The Link Columns button {}&nbsp;will link adjacent columns meaning that their volume and playback controls will now be linked. So, any sounds that are in either of the linked columns will have their volume affected by changes to either column control.":"{}链接列{}：链接列按钮{}将链接相邻的列，这意味着现在将链接它们的音量和播放控件。因此，任何一个链接列中的任何声音的音量都会受到对任一列控件的更改的影响。",
    "{}Sound Assets{}: This part of the column view shows each of the sounds that have been added to the mixer. You can set the overall volume for all sounds for the column at the top of the mixer, then use the individual sound volume controllers to change it as required, and you can also playback and loop individual sounds. To remove a sound from the column view, simply click the close button&nbsp;{}&nbsp;for the sound, and you can also expand/collapse the individual sound playback and volume controls to make the view more compact.":"{}声音资源{}：列视图的这一部分显示了已添加到混音器中的每个声音。您可以为混音器顶部的列设置所有声音的总音量，然后使用各个音量控制器根据需要进行更改，还可以回放和循环播放各个声音。要从列视图中删除声音，只需单击该声音的关闭按钮{}，您也可以展开/折叠各个声音播放和音量控制以使视图更紧凑。",
    "{}Sound Mixer{}":"{}混音器{}",
    "{}While creating any project it can be useful to check and set volumes of groups of sounds together, so that you can be sure that in-game they all sound correct. This can be tricky when you have to open each individual sound editor within the workspace, and so {}GameMaker{} permits you to open a{} Sound Mixer{} window where you can play multiple sounds all from the same place and tweak their volume levels accordingly. This window can be opened from the {}Sound Editor{} (which will add that selected sound to the mixer view) or from the {}Tools Menu{}.":"{}在创建任何项目时，检查和设置声音组的音量会很有用，这样你就可以确保游戏中它们的声音都是正确的。当您必须在工作区中打开每个单独的声音编辑器时，这可能会很棘手，因此 {}GameMaker{} 允许您打开一个{}混音器{}窗口，您可以在其中播放来自同一位置的多个声音，并相应地调整它们的音量。此窗口可以从{}声音编辑器{}(它会将所选声音添加到混音器视图中)或从{}工具菜单{}打开。"
}