{
    "Below you can find links to&nbsp;a small tutorial on how to set up this plugin and use the SCM tools with a project.":"在下面的链接中，您可以找到一个关于如何设置此插件并在项目中使用配置管理工具的小教程。",
    "Cloning A Repository":"克隆一个仓库",
    "Conflicts":"冲突",
    "Repository Options":"仓库选项",
    "Reverting Files":"回滚文件",
    "Setting Up External Merge/Diff Tools":"外部合并/差异工具",
    "Setting Up The Git Plugin":"设置 Git 插件",
    "Source Control":"源码控制",
    "Standard Workflow":"标准工作流程",
    "{}Clone Repository{}: This option will permit you to clone a repository from a source to a new destination.":"{}克隆仓库{}：此选项允许您将仓库从源克隆到新目标。",
    "{}Commit Changes{}: With this option you can stage changed files in your project and then commit them to the repository.":"{}提交更改{}：使用此选项，您可以在项目中存放已更改的文件，然后将它们提交到仓库。",
    "{}Create Project Repository{}: This option permits you to create a local repository in the same directory as your project files.":"{}创建项目仓库{}：此选项允许您在与项目文件相同的目录中创建本地仓库。",
    "{}GameMaker{} makes use of {}Git{} for its SCM, which must be installed and set up separately before SCM can be used within GameMaker. See the {}Git Documentation{} for more specific info regarding Git.":"{}GameMaker{} 将 {}Git{} 用于其 SCM，必须单独安装和设置才能在 GameMaker 中使用 SCM。有关 Git 的更多具体信息，请参阅 {}Git 文档 {}。",
    "{}GameMaker{} makes use of {}Git{} for its SCM, which must be installed and set up separately before SCM can be used within {}GameMaker{}. See the {}Git Documentation{} for more specific info regarding Git.":"{}GameMaker{} 将 {}Git{} 用于其 SCM，必须单独安装和设置才能在 {}GameMaker{} 中使用 SCM。有关 Git 的更多具体信息，请参阅 {}Git 文档 {}。",
    "{}GameMaker{} will show a drop-down menu in the Menu Bar for Source Control, which will be populated with the following options once Source Control has been activated for your project (see the section {}Setting Up The Git Plugin{} above for details):":"{}GameMaker{} 将在源代码管理的菜单栏中显示一个下拉菜单，一旦为您的项目激活了源代码管理，该下拉菜单将填充以下选项 (有关详细信息，请参阅上面的{}设置 Git 插件{}一节)：",
    "{}Here we outline each of the available options (most of them are explained in more depth in the tutorial sections above):":"{}我们在这里概述了每个可用选项(上面的教程部分对其中大多数进行了更深入的说明)：",
    "{}IMPORTANT!{} We recommend that you have some working knowledge of how source control works before attempting to use it in {}GameMaker{}.":"{}重要！{} 我们建议您在尝试在 {}GameMaker{} 中使用源代码管理之前，先了解源代码管理的工作原理。",
    "{}Pull Changes{}: With this option you can update the local repository by pulling the changed files from the master repository.":"{}拉取更改{}：使用此选项，您可以通过从主仓库中拉取已更改的文件来更新本地仓库。",
    "{}Push Changes{}: After doing a commit or a merge this option is used to push the changes to the master repository.":"{}推送更改{}：在执行提交或合并后，此选项用于将更改推送到主仓库。",
    "{}Show Conflicts{}: This will open the Conflicts window and list any conflicted files that may exist in the project, permitting you to deal with them either through the {}GameMaker{} IDE or using a specific Merge Tool.":"{}显示冲突{}：这将打开冲突窗口并列出项目中可能存在的任何冲突文件，允许您通过 {}GameMaker{} IDE 或使用特定的合并工具来处理它们。",
    "{}Source Control Management{} (SCM) is the name given to the method of working with {}sub-versions{} or backups of your projects through a repository and local source. Basically, an SCM solution is an independent software package which controls all the aspects of maintaining, changing and comparing versions of your project as you work on it. This is especially useful to those that work in a team and need to be able to control who does what and not worry about losing data or making changes that may need to be undone at a later date, but individuals can benefit from this powerful yet flexible system too.":"{}源代码管理{}(SCM) 是通过仓库和本地源处理项目的 {} 子版本 {} 或备份的方法的名称。基本上，SCM 解决方案是一个独立的软件包，它控制您在处理项目时维护、更改和比较项目版本的所有方面。这对那些在团队中工作并且需要能够控制谁做什么并且不担心丢失数据或进行可能需要在以后撤消的更改的人特别有用，但个人也可以从这个强大而灵活的系统中受益。",
    "{}Source Control{}":"{}源码控制{}",
    "{}View History{}: This will open the history window where you can view all the version history of the project and choose to roll back specific file paths or whole revisions.":"{}查看历史记录{}：打开历史记录窗口，可以查看项目的所有版本历史记录，并选择回滚特定文件路径或整个修订版本。",
    "{}{}{}IMPORTANT{}{}&nbsp;{}We recommend that you have some working knowledge of how source control works before attempting to use it in {}GameMaker{}.":"{}{}{} 重要事项{}{}{} 我们建议您在尝试在 {}GameMaker{} 中使用源代码控制之前，先了解源代码控制的工作原理。"
}