{
    "For example, let\u0027s say your computer\u0027s local IP address is {}192.168.0.110{} ({}read this{} to know how to find it), and the port shown in the Micro Web Server window is {}51264{}. After running the game on your computer, you would connect to {}192.168.0.110:51264{} from a browser on your mobile, and play your game.":"例如，假设您的计算机的本地 IP 地址是 {}192.168.0.110{}({} 请阅读此 {} 以了解如何找到它)，而微型 Web 服务器窗口中显示的端口是 {}51264{}。在您的计算机上运行游戏后，您可以从手机上的浏览器连接到 {}192.168.0.110:51264{}，然后玩游戏。",
    "The Micro Web Server":"微型 Web 服务器",
    "The Web Server will show a certain amount of debug information related to the files that have been served, and has a button to clear this at the bottom. Beside the \"Clear\" button is the path to the root JS file for the project, while underneath that you have the {}Network Speed{} option. This is set to \"No Limit\" by default, but clicking it will open up a list of different network options:":"Web 服务器将显示与已提供的文件相关的一定数量的调试信息，并在底部有一个清除该信息的按钮。在 \"Clear\" 按钮旁边是项目的根 JS 文件的路径，而在该按钮下面有 {}Network Fast{} 选项。默认情况下，此选项设置为\"无限制\"，但单击它将打开不同网络选项的列表：",
    "This small tool\u0027s primary function is to connect to and serve files to some of the available target platforms for {}GameMaker{} (like the HTML5 target). It also serves files for the&nbsp;{}GameMaker{} manual when used offline.":"这个小工具的主要功能是连接到 {}GameMaker{} 的一些可用的目标平台并向其提供文件 (如 HTML5 目标)。当脱机使用时，它还提供 {}GameMaker{} 手册的文件。",
    "When the Micro Web Server is running, you can access your game from any local device (and even remotely, if port forwarding is properly set up). Simply access your computer\u0027s local IP address through the port shown in this window, and you will be able to play your game from another device, like a mobile phone, or another computer.":"当微型 Web 服务器运行时，您可以从任何本地设备访问您的游戏(如果正确设置了端口转发，甚至可以远程访问)。只需通过此窗口中显示的端口访问计算机的本地 IP 地址，您就可以在另一台设备上玩游戏，如手机或另一台计算机。",
    "When you run a game on a target that requires the Micro Web Server, you will see a new window open as the game is served to the chosen device:":"当您在需要微型 Web 服务器的目标上运行游戏时，您将看到一个新窗口打开，因为游戏被提供给所选设备：",
    "You can also see the list of {}Allowed IPs{} along with the {}Port {}number being used, but these cannot be edited in the Micro Web Server. They should be set instead in the {}Device Manager{}&nbsp;settings for the given device target, or the {}HTML5&nbsp;Preferences{}&nbsp;when using the \"Default\" device.":"您还可以看到{}允许的IP的列表{}以及正在使用的{}端口号{}，但这些无法在微型 Web 服务器中进行编辑。它们应该在给定设备目标的{}设备管理器{}设置中进行设置，或者在使用\"默认\"设备时在{} HTML5 首选项{}中进行设置。",
    "{}Changing this setting will also change the package {}Size {}option to the right. You can also edit this manually, in which case the Network Speed will be set to \"Custom\". Setting it to anything other than the maximum value will effectively throttle the network transfer speed and permit you to test games in a low bandwidth environment.":"{}更改此设置还会更改右侧的包{}大小{}选项。您也可以手动编辑，在这种情况下，网络速度将设置为\"自定义\"。将其设置为最大值以外的任何值都将有效地限制网络传输速度，并允许您在低带宽环境中测试游戏。",
    "{}NOTE{}&nbsp;The first time you run a game on a target that requires the Micro Web Server, you may get a firewall alert. You should permit the web server to communicate through the firewall if this happens.":"{}注意{}：当您第一次在需要微型 Web 服务器的目标上运行游戏时，您可能会收到防火墙警报。如果发生这种情况，您应该允许 Web 服务器通过防火墙进行通信。"
}