{
    "As shown above, selecting an instance in a room and clicking on \"Open Editor\" in the inspector will open its instance editor.":"如上所示，在房间中选择一个实例，然后在检查器中点击[打开编辑器]，就会打开它的实例编辑器。",
    "By default, an Inspector window appears on the left side of the IDE.":"默认情况下，在 IDE 的左侧会出现一个检查器窗口。",
    "Click on the empty area in the list to return to the multi-select view.":"单击列表中的空白区域以返回到多选视图。",
    "Editing Values":"编辑属性值",
    "Editor Elements":"编辑器元素",
    "Finally, when&nbsp;{}The Inspector{}&nbsp;shows an&nbsp;{}Included File{}, clicking \"Open Editor\" will execute the action set under&nbsp;{}Default option for opening included files{}, in the Paths preferences under&nbsp;{}External Editors{}.":"最后，当 {} 检查器 {} 显示 {} 包含的文件 {} 时，单击 \" 打开编辑器 \" 将执行 {6} 外部编辑器 {7} 下的路径首选项中的 {} 打开包含的文件的默认选项 {} 下设置的操作。",
    "For example, doing this with an object will open the Object Editor, where you can modify its properties, add events, etc.":"例如，对对象执行此操作将打开对象编辑器，您可以在其中修改其属性、添加事件等。",
    "For example, you may usually edit your event code in fullscreen, and frequently navigate back into a Workspace to edit that object\u0027s properties.":"例如，您通常可以在全屏中编辑事件代码，并经常导航回工作区以编辑该对象的属性。",
    "However if the items have different values for a property, the editor will simply show {}-{}&nbsp;in place of that value.":"但是，如果属性的项具有不同的值，则编辑器将简单地显示{}-{} 来代替该值。",
    "However, when editing anything inside a room, such as an instance or a layer, the Inspector will only focus on editors inside the Room Editor.":"但是，当编辑房间内的任何内容时，例如实例或层，检查器将只关注房间编辑器内的编辑器。",
    "If you have an asset selected, you can click on \"Open Editor\" in the Inspector to open its asset editor.":"如果您选择了某个资源，则可以在检查器中单击\"打开编辑器\"以打开其资源编辑器。",
    "If your selected items share the same value for a property, that shared value will appear in that field.":"如果所选项目共享同一属性值，则该共享值将显示在该字段中。",
    "In addition to assets, you can also inspect elements in an editor, such as layers in a room, tracks in a Sequence, etc.":"除了资源之外，您还可以在编辑器中检查元素，如房间中的层、序列中的曲目等。",
    "Inspecting Sequence Track":"检查序列轨迹",
    "Inspecting Sound Asset":"检查声音资源",
    "Multi-Select":"多选",
    "Multiple Inspectors":"多个检查器",
    "Note that you can\u0027t select multiple items within this list.":"请注意，您不能在此列表中选择多个项目。",
    "Press the {}X{} next to an item to remove it from your selection.":"按项目旁边的{}X{}可将其从您的选择中删除。",
    "Select your desired assets or elements by holding {}CTRL{} / {}CMD{} and clicking with the left mouse button. Your selected items will show in a \"multi-select\" list in the Inspector:":"通过按住 {}Ctrl{}/{}CMD{} 并用鼠标左键单击来选择所需的资源或元素。您选择的项目将显示在检查器中的\"多选\"列表中：",
    "Selecting \"Open Editor\" for a Path Layer will focus on the editor for that layer":"为路径图层选择\"打开编辑器\"将聚焦于该图层的编辑器",
    "Selecting \"Open Editor\" for an instance will open the instance editor, instead of the object editor":"为实例选择\"打开编辑器\"将打开实例编辑器，而不是对象编辑器",
    "Selection Highlight":"选择高亮显示",
    "Selection Within The List":"列表中的选择",
    "Similarly, selecting a Path layer and clicking \"Open Editor\" will move focus to the Layers panel where you can edit the layer\u0027s properties, instead of opening the Path asset editor.":"同样，选择一个路径层并点击\"打开编辑器\"会将焦点移到\"层\"面板，在那里你可以编辑层的属性，而不是打开路径资源编辑器。",
    "The \"Open Editor\" Button":"\"打开编辑器\"按钮",
    "The Inspector":"检查器",
    "The Inspector allows you to apply a filter or effect to a room layer, which you can\u0027t do through the Room Editor itself:":"检查器允许您对房间层应用滤镜或效果，这不能通过房间编辑器本身来实现：",
    "The Inspector allows you to view and edit assets without having to rely solely on {}Workspaces{}.":"检查器允许您查看和编辑资源，而不必完全依赖{}工作区{}。",
    "The Inspector allows you to view and edit properties for multiple assets and elements (such as room layers and sequence tracks) at the same time.":"检查器允许您同时查看和编辑多个资源和元素(如房间层和序列轨迹)的属性。",
    "The {}spr_player{} track, selected in the multi-select list, appears with a red outline in the Sequence editor":"在多选列表中选择的 {}spr_player{} 路径将以红色轮廓显示在序列编辑器中",
    "The&nbsp;{}Inspector {}window shows all the properties associated with the selected elements in the IDE.":"{}检查器{}窗口显示与 IDE 中选定元素关联的所有属性。",
    "Three Sprite tracks selected in a Sequence.":"在一个序列中选择三个精灵轨迹。",
    "To do this, you would open an inspector, select an IDE element to inspect, and then click the&nbsp;{} lock button on the inspector to lock it on the element (shown in the image below). Once you have locked an inspector, you can open another one and then repeat the process.":"为此，您可以打开检查器，选择要检查的 IDE 元素，然后单击检查器上的锁定按钮{}将其锁定在该元素上 (如下图所示)。锁定检查器后，可以打开另一个检查器，然后重复该过程。",
    "To ensure that each time you click an element all open inspectors don\u0027t change to show the new selection, you must first {}lock {}each inspector window one-by-one.":"为了确保每次单击某个元素时，所有打开的检查器都不会更改为显示新的选择，您必须首先逐个{}锁定{}每个检查器窗口。",
    "Using the Inspector":"使用检查器",
    "Using the lock feature you can open multiple inspectors at the same time with each one being locked to a specific asset, as shown in the example below:":"使用锁定功能，您可以同时打开多个检查器，每个检查器都锁定到一个特定的资源，如下例所示：",
    "Values displayed for multiple tracks in a Sequence.":"为序列中的多个曲目显示的值。",
    "View any one item within the multi-select list":"查看多选列表中的任何一项",
    "When you have an item selected within the multi-select list, it will appear in the editor with a red outline:":"当您在多选列表中选择一个项目时，它将以红色轮廓显示在编辑器中：",
    "While this particular example only covers objects, the Inspector can do much more and allow you to edit many different kinds of assets (e.g. Sprites, Fonts, Animation Curves, etc.).":"虽然此特定示例仅涵盖对象，但检查器可以执行更多操作，并允许您编辑许多不同类型的资源(例如精灵、字体、动画曲线等)。",
    "With the Inspector, you can view an object\u0027s details&nbsp;while remaining in fullscreen view:":"使用检查器，您可以在保持全屏视图的同时查看对象的详细信息：",
    "You can change any of these fields. Changing a value will apply it to all of your selected items.":"您可以更改这些字段中的任何一个。更改一个值会将其应用于所有选定的项目。",
    "You can change the colour of this outline in the {}Room Preferences{} and {}Sequence Preferences{}.":"您可以在 {} 房间首选项 {} 和 {} 序列首选项 {} 中更改此轮廓的颜色。",
    "You can open more Inspector windows from {}The Windows Menu{}&nbsp;at the top of the GameMaker window:":"您可以从位于 GameMaker 窗口顶部的{}窗口菜单{}打开更多的检查器窗口：",
    "You can open more Inspector windows from {}The Windows Menu{}&nbsp;at the top of the {}GameMaker{}&nbsp;window:":"您可以从 {}GameMaker{} 窗口顶部的 {}Windows 菜单 {} 打开更多检查器窗口：",
    "You can open multiple Inspector windows at any time, and each one can be linked to a specific element in the IDE.":"您可以随时打开多个检查器窗口，并且每个窗口都可以链接到 IDE 中的特定元素。",
    "You can select any one item within your multi-select list to view and edit its properties, without having to reset your selection.":"您可以在多选列表中选择任何一项来查看和编辑其属性，而不必重置您的选择。",
    "You can select one or multiple elements in any editor, and view or change its various properties:":"可以在任何编辑器中选择一个或多个元素，并查看或修改其各种属性：",
    "{}After opening an Inspector window, you can dock it anywhere in the IDE, or use it as a floating window:":"{}打开检查器窗口后，您可以将其停靠在 IDE 中的任何位置，或将其用作浮动窗口：",
    "{}NOTE{} When you apply a filter/effect to a non-FX layer using the Inspector, it will always be applied as a \"single layer\" effect, i.e. its effect will only be applied on that particular layer and not on other layers below it.":"{}注意{} 当您使用检查器将滤镜/效果应用于非FX层时，该滤镜/效果将始终作为\"单层\"效果应用，即其效果将仅应用于该特定层，而不会应用于其下的其他层。",
    "{}Note that a locked inspector window does not lock the editing of any values for the element being inspected. It simply locks the inspector to the selected element and you can continue to edit it at any time, even when the original element is not the main focus of the IDE.":"{}请注意，锁定的检查器窗口不会锁定正在检查的元素的任何值的编辑。它只是将检查器锁定到选定的元素，您可以随时继续编辑它，即使原始元素不是IDE的主要焦点也是如此。",
    "{}This makes it possible to modify an object\u0027s properties and&nbsp;delete/change events while editing its code in fullscreen, and also set up&nbsp;Parenting, Variable Definitions, and more.":"{}这样可以在全屏编辑对象代码的同时修改对象的属性和删除/更改事件，还可以设置父子关系、变量定义等。",
    "{}{}NOTE{}{}&nbsp;When you apply a filter/effect to a non-FX layer using the Inspector, it will always be applied as a \"single layer\" effect, i.e. its effect will only be applied on that particular layer and not on other layers below it.":"{}{}注意{}{} 当您使用检视器将滤镜/效果应用到非特效层时，它将始终作为\"单层\"效果应用，即其效果将仅应用于该特定层，而不会应用于其下方的其他层。"
}