{
    "A Keyframe Data Struct contains the following variables:":"关键帧数据结构包含以下变量：",
    "Sequence Audio Key Constant":"序列音频键常数",
    "Sequence Keyframe Data Struct":"序列关键帧数据结构",
    "Sequence Text Alignment Constant":"序列文本对齐常量",
    "Text Track Data":"文本跟踪数据",
    "The index of the audio asset to use for the track. This property is only available for tracks of the type {}seqtracktype_audio{} and you can get or set it.":"要用于音轨的音频资源的索引。此属性仅对类型为{}SeqTrackType_Audio{}的轨道可用，您可以获取或设置它。",
    "The index of the sprite asset to use for the track. This property is only available for tracks of the type {}seqtracktype_graphic{} and you can get or set it.":"用于轨迹的精灵资源的索引。此属性仅适用于类型为{}SeqTrackType_Graphic{}的轨道，您可以获取或设置它。",
    "The playback mode for the sound. This property is only available for tracks of the type {}seqtracktype_audio{} and you can get or set it. The property should be one of the constants given in the table below this one.":"声音的播放模式。此属性仅对类型为{}SeqTrackType_Audio{}的轨道可用，您可以获取或设置它。属性应该是下表中给出的常量之一。",
    "The sound will loop when played.":"播放时声音将循环播放。",
    "The sound will only play once then stop.":"声音只会播放一次，然后停止。",
    "The struct will contain the following additional variables if assigned to a&nbsp;{}text track{}&nbsp;({}seqtracktype_text{}):":"如果分配给{}文本轨道{}({}seqTrackType_text{})，则该结构将包含以下附加变量：",
    "The text will be aligned to the bottom of the frame":"文本将与框架的底部对齐",
    "The text will be aligned to the left of the frame":"文本将与框架的左侧对齐",
    "The text will be aligned to the right of the frame":"文本将与框架的右侧对齐",
    "The text will be aligned to the top of the frame":"文本将与框架顶部对齐",
    "The text will be centred horizontally within the frame":"文本将在框架内水平居中",
    "The text will be centred vertically within the frame":"文本将在框架内垂直居中",
    "The text will be justified within the frame":"文本将在框架内对齐",
    "The {}playbackMode{} variable can be one of the following constants:":"{}playbackMode{}变量可以是以下常量之一：",
    "This is a boolean that indicates whether the text should be wrapped ({}true{}) or not ({}false{}).":"这是一个布尔值，指示文本是否应该换行({}true{})或不换行({}false{})。",
    "This is the channel that the keyframe data should be applied to. It is a positive integer value starting at 0, and it\u0027s worth noting that when creating parameter tracks for \"position\" or \"scale\" keyframes, then you need to use very specific channel values. These are: channel 0 is the X position or the X scale, channel 1 is the Y position or Y scale.":"这是应用关键帧数据的通道。这是一个从0开始的正整数值，值得注意的是，在为\"位置\"或\"缩放\"关键帧创建参数轨迹时，您需要使用非常特定的通道值。这些是：通道0是X位置或X比例，通道1是Y位置或Y比例。",
    "This is the horizontal alignment of the text, and will be one of the&nbsp;{}{}Sequence Text Alignment Constant{}{}s given below.":"这是文本的水平对齐方式，将是下面给出的{}{}序列文本对齐常数{}{}之一。",
    "This is the text string that is drawn on the track.":"这是在轨道上绘制的文本字符串。",
    "This is the vertical alignment of the text, and will be one of the {}{}Sequence Text Alignment Constant{}{}s given below.":"这是文本的垂直对齐，将是下面给出的{}{}序列文本对齐常数{}{}之一。",
    "This is the&nbsp;{}{}Font Asset{}{}&nbsp;used by the text track.":"这是文本音轨使用的{}{}字体资产{}{}。",
    "This property allows access to the {}events{} and {}broadcast messages{} associated with the keyframe data struct. You can get or set this property, and when getting it an array of strings is returned, and when setting it an array of strings should be specified. For more information on events, please see the section {}Sequence Events And Moments{}. This property is only available for tracks of the type {}seqtracktype_message{}.":"此属性允许访问与关键帧数据结构关联的{}事件{}和{}广播消息{}。可以获取或设置此属性，获取时返回字符串数组，设置时应指定字符串数组。有关事件的更多信息，请参阅\"{}事件和时刻{}序列\"部分。 此属性仅适用于类型{}seqtracktype_message{}的轨迹。",
    "This property is simply a value that is associated with the keyframe data channel, and is only available for tracks of the type {}seqtracktype_real{} when no {}curve{} struct is supplied. This can be, for example, the X or Y position of the track if placed inside a {}\"position\"{} parameter track.":"此属性只是一个与关键帧数据通道关联的值，并且仅在未提供{}曲线{}结构时可用于类型{}seqtracktype_real{}的轨迹。例如，如果放置在{}\"位置\"{}参数轨道内，则可以是轨迹的X或Y位置。",
    "This property requires an animation curve struct (see&nbsp;{}here{}&nbsp;for more information) and is only available for tracks of the type&nbsp;{}seqtracktype_real{}. If no curve struct is used then the value for this property will be -1.":"此属性需要动画曲线结构(有关详细信息，请参见此处{})，并且仅适用于类型为{}seqtracktype_real{}的轨迹。 如果没有使用曲线结构，则该属性的值为-1。",
    "This property returns (or requires, if being set) an {}array{} for the colour value of the keyframe with the format [A, R, G, B]. This is only available for tracks of the type {}seqtracktype_colour{}. Note that the values for each component should be expressed as between 0 and 1, where 0 corresponds to the HEX value #00 and 1 corresponds to the HEX value #FF (0 - 255 as shown in the colour picker for colour tracks in the Sequences Editor).":"此属性返回(或需要，如果已设置){}数组{}，用于格式为[A，R，G，B]的关键帧的颜色值。这仅适用于类型为{}seqtracktype_colour{}的曲目。 注意，每个组件的值应表示为0和1之间，其中0对应于十六进制值# 00，1对应于十六进制值# FF(0- 255，如序列编辑器中颜色轨迹的颜色选择器所示)。",
    "This property will return (or can be set to) the {}method{} associated with the keyframe data struct. If no method has been specified or you wish to remove the method, then the property should be -1. This property is only available for tracks of the type {}seqtracktype_moment{}.":"此属性将返回(或可以设置为)与关键帧数据结构关联的{}方法{}。如果未指定方法或希望删除该方法，则属性应为-1。此属性仅适用于类型{}seqtracktype_moment{}的轨迹。",
    "This property will return (or requires, if being set) a {}sequence object struct{} and is only available for tracks of the type {}seqtracktype_sequence{}.":"此属性将返回(或需要(如果已设置)){}序列对象结构{}，并且仅适用于类型为{}seqtracktype_sequence{}的轨迹。",
    "This property will return (or requires, if being set) an object index and is only available for tracks of the type {}seqtracktype_instance{}.":"此属性将返回(或需要(如果已设置))对象索引，并且仅适用于类型为{}seqtracktype_instance{}的轨迹。",
    "When you define a {}keyframe struct{} for a track, you need to also define the data that will be associated with it. This is comprised of different {}channels{}, where each channel is simply a Keyframe Data Struct. A channel can be given specific type of data depending on what type of track you are setting the keyframe data for.":"为轨迹定义{}关键帧结构{}时，还需要定义与其关联的数据。这由不同的{}通道{}组成，其中每个通道仅是关键帧数据结构。根据要设置关键帧数据的曲目类型，可以为通道指定特定类型的数据。",
    "{}Any additional variables listed in the table(s) below{}":"{}下表中列出的任何其他变量{}",
    "{}alignmentH{} can be any of the following constants:":"{}ALIGNMENTH{}可以是以下任何常量：",
    "{}alignmentV{} can be any of the following constants:":"{}AlignmentV{}可以是以下任何常量："
}