{
    "A sequence, when placed in a room, is placed as an&nbsp;{}element{}&nbsp;on the layer, and this element contains a&nbsp;{}sequence instance{}. This sequence instance will have the following properties in its {}struct{}:":"将序列放置在房间中时，将作为{}元素{}放置在层上，并且该元素包含{}序列实例{}。 此序列实例的{}结构{}中将具有以下属性：",
    "Sequence Active Track Struct":"序列活动跟踪结构",
    "Sequence Direction Constant":"序列方向常数",
    "Sequence Instance Struct":"序列实例结构",
    "The ID of the particle system of this track (particle system tracks).":"此轨迹的粒子系统的ID(粒子系统轨迹)。",
    "The ID of the sound instance that\u0027s playing on this track\u0027s emitter (audio tracks).":"在此轨道的发射器 (音轨) 上播放的声音实例的 ID。",
    "The Sequence Instance Struct":"序列实例结构",
    "The X origin of the asset for the track (all assets).":"轨迹资源的X原点(所有资源)。",
    "The Y origin of the asset for the track (all assets).":"轨迹资源的Y原点(所有资源)。",
    "The character spacing value (text tracks).":"字符间距值(字幕信息)。",
    "The colour multiply value for the asset on the track in the sequence at the current playhead position (sprite, instance and sequence tracks). This value will be an {}array{} of four {}ARGB{} values with the format [A, R, G, B]. Note that the values for each component are expressed as between 0 and 1, where 0 corresponds to the HEX value #00 and 1 corresponds to the HEX value #FF (0 - 255 as shown in the colour picker for colour multiply tracks in the Sequences Editor).":"当前播放头位置(精灵、实例和序列曲目)序列中曲目上资源的颜色乘法值。此值为{}数组{}，包含4个{}ARGB{}值，格式为[A，R，G，B]。请注意，每个组件的值在0和1之间表示，其中0对应于十六进制值# 00，1对应于十六进制值# FF(0- 255，如序列编辑器中多色轨迹的颜色选择器所示)。",
    "The following list contains the properties that may be available to you when accessing an active track struct (as included in the {}activeTracks{} array of a Sequence Instance struct, explained above). Each asset track struct can have any of the following properties, depending on the type of asset the track uses (note that you can modify all these properties, except where specified as {}read-only{}), and all values returned are for the current playhead position:":"以下列表包含访问活动跟踪结构时可用的属性(如上面解释的序列实例结构的{}activeTracks{}数组中包含的属性)。根据曲目所使用的资源类型，每个资源跟踪结构可以具有以下任何属性(请注意，您可以修改所有这些属性，除非指定为{}只读{})，并且返回的所有值都针对当前播放头位置：",
    "The gain (volume) of the track at the current playhead position (audio tracks).":"当前播放头位置(音轨)的音轨增益(音量)。",
    "The height (in pixels) of the asset for the track (sprite, instance and sequence tracks).":"轨迹(精灵、实例和序列轨迹)资源的高度(以像素为单位)。",
    "The horizontal size of the text frame (text tracks).":"文本框架(字幕信息)的水平大小。",
    "The image index for the asset on the track in the sequence at the current playhead position (sprite and instance tracks).":"资源在序列中当前播放头位置的轨迹上的图像索引(精灵和实例轨迹)。",
    "The image speed for the asset on the track in the sequence at the current playhead position (sprite and instance tracks).":"资源在当前播放指针位置(精灵与实例轨迹)的序列中的轨迹上的图像速度。",
    "The index of the audio emitter belonging to this track (audio tracks).":"属于该音轨的音频发射器的索引(音轨)。",
    "The line spacing value (text tracks).":"行距值(字幕信息)。",
    "The paragraph spacing value (text tracks).":"段落间距值(字幕信息)。",
    "The parent sequence instance ID for the track (all assets, a {}read-only{} value).":"轨迹的父序列实例ID(所有资源，{}只读{}值)。",
    "The pitch of the track at the current playhead position (audio tracks).":"当前播放指针位置的音轨间距(音频音轨)。",
    "The position of the asset in the sequence along the X axis for the track at the current playhead position (all assets).":"资源在序列中沿轨道X轴的当前播放头位置的位置(所有资源)。",
    "The position of the asset in the sequence along the Y axis for the track at the current playhead position (all assets).":"资源在序列中沿轨道Y轴的当前播放头位置的位置(所有资源)。",
    "The scale of the asset in the sequence along the X axis for the track at the current playhead position (sprite, instance and sequence tracks).":"在当前播放头位置(\"精灵\"轨迹，\"实例\"轨迹与\"序列\"轨迹)，资源在序列中沿轨迹X轴的缩放。",
    "The scale of the asset in the sequence along the Y axis for the track at the current playhead position (sprite, instance and sequence tracks).":"在当前播放头位置(\"精灵\"、\"实例\"和\"序列\"轨迹)，资源在序列中沿轨迹Y轴的缩放。",
    "The sequence will play frames in a decremental order from right to left":"序列将按从右到左递减的顺序播放帧",
    "The sequence will play frames in an incremental order from left to right":"序列将按从左到右的递增顺序播放帧",
    "The vertical size of the text frame (text tracks).":"文本框架(字幕信息)的垂直大小。",
    "The width (in pixels) of the asset for the track (sprite, instance and sequence tracks).":"轨迹(精灵、实例和序列轨迹)资源的宽度(以像素为单位)。",
    "The {}Track Struct{} that this track is based on (all assets, a {}read-only{} value).":"此轨道所基于的{}轨道结构{}(所有资源，一个{}只读{}值)。",
    "This is an array of evaluation structs for each parameter track that the asset track contains (all assets, a {}read-only{} value). The contents of each struct in the array are listed in the parameter {}Track Struct{} section.":"这是资源轨迹包含的每个参数轨迹(所有资源，{}只读{}值)的计算结构数组。数组中每个结构的内容在参数{}轨道结构{}部分列出。",
    "This is the ID of the {}sequence object{} struct that the sequence instance has been created from (see {}here{}for more details). You can get or set this struct, and so change the base sequence that the instance is referencing.":"这是从中创建序列实例的{}序列对象{}结构的 ID(有关详细信息，请参见此处{})。您可以获取或设置此结构，从而更改实例所引用的基序列。",
    "This is the current playback direction for the sequence instance. You can get or set this value using the constants given in the next table (Note that you can use the layer functions {}{}layer_sequence_get_headdir(){}{}&nbsp;and {}{}layer_sequence_headdir(){}{}&nbsp;to get or set this value without having to access the struct directly).":"这是序列实例的当前播放方向。可以使用下表中给出的常量获取或设置此值(请注意，可以使用层函数{}{}layer_sequence_get_headdir(){}{}和{}layer_sequence_headdir(){}{}来获取或设置此值，而无需直接访问该结构)。",
    "This is the current {}playhead{} position (in frames) for the sequence instance. You can get or set this value, but note that setting it to a value greater or less than the currently defined play region will have different effects depending on the type of playback set for the sequence. See {}{}layer_sequence_headpos(){}{}&nbsp;for more information.":"这是序列实例的当前{}播放头{}位置(以帧为单位)。您可以获取或设置此值，但请注意，将其设置为大于或小于当前定义的播放区域的值将具有不同的效果，具体取决于序列设置的回放类型。有关详细信息，请参见{}{}layer_sequence_headpos(){}{}。",
    "This is the transformation matrix used to draw the track (sprite, instance and sequence tracks).":"这是用于绘制轨迹(精灵、实例和序列轨迹)的变换矩阵。",
    "This property can be used to get or set the playback speed scale. The speed scale is a {}multiplier{}, where 1 is the default playback speed and values less than 1 will slow the playback and values larger than 1 will speed it up, eg: a value of 0.5 would be half playback speed, while a value of 2 would be double playback speed. Note that you can use the layer functions {}{}layer_sequence_get_speedscale(){}{}&nbsp;and {}{}layer_sequence_speedscale(){}{}&nbsp;to get or set this value without having to access the struct directly.":"此属性可用于获取或设置播放速度刻度。速度标度为{}乘数{}，其中1为默认回放速度，小于1的值将减慢回放速度，大于1的值将加速回放速度，例如：值0.5表示一半回放速度，值2表示双倍回放速度。请注意，可以使用层函数{}{}layer_sequence_get_speedscale(){}{}和{}{}layer_sequence_speedscale(){}{}获取或设置此值，而无需直接访问该结构。",
    "This property holds the ID of the sequence {}element{}. This ID is a simple identifying value that is associated with a layer in the room editor, and it can then be used with the appropriate {}layer functions{}&nbsp;to find the layer the sequence has been assigned to or to change certain sequence properties without having to deal with the struct.":"此属性保存 sequence{}元素{}的 ID。 此 ID 是与房间编辑器中的层关联的简单标识值，然后可以与相应的{}层函数{}一起使用，以查找已指定序列的层或更改某些序列属性，而无需处理该结构。",
    "This property will hold an array of \"evaluation\" structs containing information on the current state of each {}asset track{} in the sequence (graphics, sequence, audio etc...). These are the top-level tracks, and the array returned is {}read-only{}. For the contents of the asset track struct returned in each array entry, please see the section below.":"此属性将保存包含序列(图形、序列、音频等)中每个{}资源轨道{}的当前状态的信息的\"评估\"结构数组。这些是顶级轨迹，返回的数组为{}只读{}。 对于每个数组条目中返回的资源跟踪结构的内容，请参见以下部分。",
    "You can check this property to see if a sequence has been paused or not, and it will be {}true{} if it has, or {}false{} otherwise. This is a {}read-only{} property, but you can use the layer function {}{}layer_sequence_pause(){}{}&nbsp;to pause playback, and {}{}layer_sequence_play(){}{}&nbsp;to resume it again if required. You can also check this property using the layer function {}{}layer_sequence_is_paused(){}{}&nbsp;rather than check the property in the struct directly.":"您可以检查此属性以查看序列是否已暂停，如果已暂停，则为{}true{}，否则为{}false{}。这是一个{}只读{}属性，但是您可以使用层函数{}{}layer_sequence_pause(){}{}来暂停播放，并使用{}{}layer_sequence_play(){}\\{}来根据需要再次恢复播放。您还可以使用层函数{}{}layer_sequence_is_paused(){}{}来检查此属性，而不是直接检查结构中的属性。",
    "You can check this property to see if a sequence has finished playing or not, returning {}true{} if it is finished playing, and {}false{} otherwise. This is a {}read-only{} property, and will only ever return {}true{} for tracks that are not set to loop or ping-pong. You can also check this property using the layer function {}{}layer_sequence_is_finished(){}{}&nbsp;rather than check the property in the struct directly.":"您可以检查此属性以查看某个序列是否已完成播放，如果已播放完毕，则返回{}true{}，否则返回{}false{}。这是{}只读{}属性，仅对于未设置为循环或乒乓的曲目返回{}true{}。也可以使用层函数{}{}layer_sequence_is_finished(){}{}来检查此属性，而不是直接检查结构中的属性。",
    "activeTracks Struct":"activeTracks 结构体",
    "{}{}IMPORTANT{}{}&nbsp;Although this property already exists in the sequence instance struct in the Sequence Create event, it is only filled with tracks after the first Sequence Begin Step event. So the first time you will find values in this struct is during the first iteration of the Sequence Step Event.":"{}{}IMPORTANT{}{}虽然此属性已存在于\"序列创建\"事件中的序列实例结构中，但仅在第一个\"序列开始步骤\"事件之后填充有轨迹。因此，首次在此结构中找到值是在序列步长事件的第一次迭代期间。"
}