{
    "A&nbsp;{}{}Sequence Object Struct{}{} is the name given to the struct retrieved from a Sequence asset.&nbsp;All the data for a Sequence is stored in this struct at runtime, and is referenced by any elements of the Sequence that are created in a room. This means that if any variables in this struct&nbsp;(or inside any of its nested structs) are modified, the original Sequence will change (until the game is closed and re-opened) and any of its existing Sequence elements will be affected.":"{}{}序列对象结构{}{}是从序列资源检索到的结构的名称。在运行时，序列的所有数据存储在此结构中，并由在房间中创建的序列的任何元素引用。这意味着，如果修改此结构(或其任何嵌套结构内)中的任何变量，原始序列将改变(直到游戏关闭并重新打开)，并且其任何现有的序列元素将受到影响。",
    "Note that if you want to access the properties of a sequence that has been created in the asset browser, you must first call the function {}{}sequence_get(){}{} on the asset index to retrieve the sequence object struct. Also note that any changes made to this sequence struct will mean that all further instances of this sequence asset will also have these changes, and they will be maintained as long as the game is running, even if you call the {}game_restart(){} function.":"请注意，如果要访问在资源浏览器中创建的序列的属性，必须先调用资源索引上的函数{}{}sequence_get(){}{}来检索序列对象结构。另请注意，对此序列结构所做的任何更改将意味着此序列资源的所有其他实例也将具有这些更改，只要游戏正在运行，即使您调用{}game_restart(){}函数，它们也会得到维护。",
    "Remarks":"备注",
    "Sequence Object Struct":"序列对象结构",
    "Sequence Play Mode Constant":"顺序播放模式常数",
    "The length of the sequence in frames. You can get or set this value, but note that making a sequence shorter may cause issues if a sequence instance referencing this sequence has its playhead set to past the new length.":"以帧为单位的序列长度。您可以获取或设置此值，但请注意，如果引用此序列的序列实例将其播放头设置为超过新长度，则使序列更短可能会导致问题。",
    "The sequence will loop, with the playhead going back to the start when it reaches the end of the playback region.":"序列将循环，当播放头到达播放区域的结尾时，它将返回到开始。",
    "The sequence will loop, with the playhead reversing direction when it reaches the end of the playback region.":"序列将循环，当到达播放区域的结尾时，播放头将反转方向。",
    "The sequence will play once then stop when finished.":"序列将播放一次，然后在完成时停止。",
    "This allows access to the list of {}asset tracks{} on the top level of the sequence. You can get or set this property, and when getting this property an array of track structs is returned, and for setting the property you should supply an array of track structs. For more information, please see the section on {}{}Track Structs{}{}.":"这允许访问序列顶层上的{}资源轨迹列表{}。可以获取或设置此属性，并且当获得此属性时，将返回轨迹结构数组，要设置属性，应提供一个轨迹结构数组。有关更多信息，请参阅{}{}轨道结构{}{}一节。",
    "This allows access to the message event keyframes for the sequence. You can get or set these message events, and when getting this property an array of keyframe structs is returned, and for setting the property you should supply an array of keyframe structs. For more information, please see the page on {}Sequence Events and Moments{}.":"这允许访问序列的消息事件关键帧。可以获取或设置这些消息事件，当获得此属性时，将返回关键帧结构数组，要设置属性，您应提供关键帧结构数组。有关更多信息，请参见{}序列事件和时刻{}上的页面。",
    "This allows access to the moment event keyframes for the sequence. You can get or set these moment events, and when getting this property an array of keyframe structs is returned, and for setting the property you should supply an array of keyframe structs. For more information, please see the page on {}Sequence Events and Moments{}.":"这允许访问序列的瞬间事件关键帧。可以获取或设置这些瞬间事件，当获得此属性时，将返回关键帧结构数组，要设置该属性，您应提供关键帧结构数组。有关更多信息，请参见{}序列事件和时刻{}上的页面。",
    "This is a scalar value from 0 to 1 that is used to scale the volume of all audio tracks in the sequence. You can get or set this value and it will modify the global audio output for all tracks - for example, if you have an audio track with a volume of 0.8 and then set the sequence volume property to 0.5, the audio track will have a final volume of 0.4.":"这是一个从0到1的标量值，用于缩放序列中所有音轨的音量。您可以获取或设置此值，它将修改所有音轨的全局音频输出-例如，如果您有一个音量为0.8的音轨，然后将\"序列音量\"属性设置为0.5，则该音轨的最终音量将为0.4。",
    "This is the name of the sequence as a string and you can get or set this value as required. Note that sequences created using the function {}{}sequence_create(){}{} will not have a name and this will simply be an empty string \"\".":"这是序列的字符串名称，您可以根据需要获取或设置此值。请注意，使用函数{}{}sequence_create(){}{}创建的序列将没有名称，这将只是空字符串\"\"。",
    "This is the origin of the sequence along the X axis.":"这是沿X轴的序列的原点。",
    "This is the origin of the sequence along the Y axis.":"这是沿Y轴的序列的原点。",
    "This is the playback mode of the sequence object and can be get or set. This can be any one of the constants shown in the table below this one.":"这是序列对象的播放模式，可以获取或设置。这可以是下表中显示的任一常数。",
    "This specifies how the {}playbackSpeed{} should be interpreted and you can get or set this value.":"这指定了如何解释{}PlaybackSpeed{}，您可以获取或设置此值。",
    "This specifies the playback speed of the sequence, which is interpreted as either frames-per-second or frames-per-game-frame depending on the {}playbackSpeedType{} (see below). You can get or set this value.":"这指定了序列的播放速度，根据{}playSpeedType{}(见下文)，序列的播放速度可以解释为每秒帧或每帧帧。您可以获取或设置此值。",
    "This&nbsp;{}struct{} will have the following properties that can be changed:":"此{}结构{}将具有以下可更改的属性：",
    "{}loopMode{} can be any one of the following constants:":"{}loopMode{}可以是以下任一常量："
}