{
    "Apart from those tools within the image editor itself, there are also a number of extra tools available to you from the Menu Bar at the top of the IDE:":"除了图像编辑器本身中的这些工具之外，IDE 顶部的菜单栏中还提供了许多其他工具：",
    "Below we list the tools that are available by default with {}GameMaker{} - note that all tools can be used with the left {}&nbsp;and right {}&nbsp;mouse button, and most of them have keyboard shortcuts associated with them (the important ones are listed here along with the tool, but for a full list please see the page on {}Shortcuts{}). Most tools will also have extra options that will be visible at the top of the image editor as shown below:":"下面我们列出了 {}GameMaker{} 默认可用的工具-请注意，所有工具都可以与鼠标左 {} 和右 {} 按钮一起使用，并且大多数工具都具有与其关联的键盘快捷键 (此处列出了重要的快捷键和工具，但是有关完整列表，请参阅 {} 快捷键 {} 的页面)。大多数工具还具有额外的选项，这些选项将显示在图像编辑器的顶部，如下所示：",
    "Beneath the Onion Skin button, you have the {}Loop Control{} button {}&nbsp;used to set whether the sprite loops (goes back to frame 1 when the last frame is reached) or ping-pongs (goes backwards through the frames when the last frame is reached). The Play button {}&nbsp;at the bottom is for starting/stopping the preview of the animation.":"在\"洋葱皮\"按钮下，您可以使用{}循环控制{}按钮{}来设置精灵循环(到达最后一帧时返回第1帧)还是乒乓球(到达最后一帧时返回帧)。底部的\"播放\"按钮{}用于开始/停止动画预览。",
    "Canvas Zoom Controls {}: These buttons control the current canvas zoom level. You can zoom in or out and clicking the {}&nbsp;button will reset the canvas to be 1:1 with the image being edited. You can also click the Window Fit button {}&nbsp;to make the entire image canvas fit within the current editor workspace (this will zoom in/out as appropriate to make it fit). Note that you can also zoom in and out using the {}&nbsp;/&nbsp;{} and the Mouse Wheel {}, and pressing {}&nbsp;/&nbsp;{}&nbsp;+&nbsp;{}&nbsp;will set the room canvas to be 1:1 with the image.":"画布缩放控件 {}：这些按钮控制当前画布的缩放级别。您可以放大或缩小图像，单击 {} 按钮将重置画布为正在编辑的图像的 1:1。也可以单击 \" 窗口 \" 按钮 {}，使整个图像画布适合当前编辑器工作区 (这将根据需要放大 / 缩小以使其适合)。请注意，您还可以使用 {}/{} 和鼠标滚轮 {} 进行放大和缩小，按 {}/{}+{} 会将房间画布与图像的比例设置为 1:1。",
    "Enabling this will show some extra controls over the frames which you can click {}&nbsp;and drag to set the number of preceding frames to show as well as the number of following frames.":"启用此选项将显示帧上的一些额外控件，您可以单击{}并拖动这些控件来设置要显示的前面的帧数以及后面的帧数。",
    "Here you can select the {}brush {}to paint with. By default you have a selection of different sized square and round brushes to use, but you can easily create your own brush by painting on the image layer, and then selecting the part you wish to use for the new brush and using {}&nbsp;/&nbsp;{}&nbsp;+ \"{}C{}\"&nbsp;to copy it. The copied section will then be added to your brushes and you can paint with it as you would any other brush, and this includes using the different paint tools available like drawing a line.":"您可以在此处选择{}画笔{}进行绘制。默认情况下，您可以选择不同大小的方形和圆形画笔来使用，但是您可以通过在图像层上绘制，然后选择要用于新画笔的零件并使用{}/{}+\"{}C{}\"来复制它，从而轻松创建自己的画笔。然后，复制的截面将添加到画笔中，您可以像使用其他任何画笔一样使用该截面进行绘制，这包括使用可用的不同绘制工具(如绘制线)。",
    "If you double click {}&nbsp;on a layer (or use {}&nbsp;and select {}Edit Layer Properties{}) you\u0027ll get access to the Layer Properties window:":"如果双击图层上的{}(或使用{}并选择{}编辑图层属性{})，则可以访问\\\"图层属性\\\"窗口：",
    "If you hold CTRL/CMD and click {}&nbsp;on any of the default colour swatches, it will bring up the colour picker tool and allow you to edit the default palette for the sprite. Clicking \"OK\" in the colour picker in this case will set the palette to the new colour and save it along with the sprite asset being edited.":"如果按住 CTRL/CMD 并单击任何默认色板上的 {}，则会调出颜色选择器工具并允许您编辑精灵的默认调色板。在这种情况下，单击颜色选择器中的 \"OK\" 将调色板设置为新颜色，并将其与正在编辑的精灵资源一起保存。",
    "If you hold CTRL/CMD and click {}&nbsp;on any of the default colour swatches, it will bring up the colour picker tool and allow you to edit the default palette for the sprite. Clicking \"Okay\" in the colour picker in this case will set the palette to the new colour and save it along with the sprite asset being edited.":"如果按住 CTRL/CMD 并单击任何默认色板上的 {}，则会调出颜色选择器工具并允许您编辑精灵的默认调色板。在这种情况下，单击颜色选择器中的 \"OK\" 将调色板设置为新颜色，并将其与正在编辑的精灵资源一起保存。",
    "If you want to remove a brush from the list, simply click on it and press the {}&nbsp;key and it will be removed.":"如果要从列表中删除画笔，只需单击该画笔并按{}键即可将其删除。",
    "Note that the default blending colour for the new brush will be white, but if you change the colour with the colour picker and paint using the brush, it will be {}blended {}with this new colour. If you want to remove a brush from the list, simply click on it and press the {}&nbsp;key and it will be removed.":"请注意，新画笔的默认混合颜色将为白色，但如果使用颜色选择器更改颜色并使用画笔进行绘制，则会将其与此新颜色{}混合{}。如果要从列表中删除画笔，只需单击该画笔并按{}键即可将其删除。",
    "Note that the value used here for the animation speed will also set the way the sprite is animated when used in a game, either as a sprite asset on a layer or as a sprite assigned to an instance, although you can modify this at runtime using the appropriate {}functions{}&nbsp;and {}variables{}.":"请注意，此处用于动画速度的值还将设置在游戏中使用精灵时的动画方式，或者作为层上的精灵资源，或者作为指定给实例的精灵，尽管您可以在运行时使用适当的{}函数{}和{}变量{}修改此值。",
    "So, you can create a custom colour palette in a sprite image and then use that to set the palette for any other sprite in the Asset Browser, or you can open a sprite image and import the colour palette from any other sprite in the Asset Browser. This sprite palette feature is covered in more detail in the following&nbsp;tech blog:":"因此，可以在精灵图像中创建自定义调色板，然后使用该调色板在资源浏览器中为任何其他精灵设置调色板，也可以打开精灵图像并从资源浏览器中的任何其他精灵导入调色板。以下技术博客将更详细地介绍精灵调色板功能：",
    "Split Canvas {}: Clicking this will cycle between splitting the canvas horizontally, vertically keeping it a single a single canvas. When in split canvas view, each canvas will have its own set of Canvas controls so you can zoom one in and the other out, for example, and you can edit either canvas with the changes being reflected in the other canvas. To change the canvas view toggle, you can click the Split Options {}&nbsp;button and select the one you wish to use or simply click the Split Canvas button until it cycles to the one you want.":"拆分画布 {}：单击此按钮将在水平拆分画布之间循环，垂直保持单个画布。在分割画布视图中，每个画布都有自己的一组画布控件，例如，您可以放大一个画布控件，缩小另一个画布控件，并且可以编辑任一画布以及其他画布中反映的更改。要更改画布视图切换，可以单击\"拆分选项\"{}按钮并选择要使用的选项，或者只需单击\"拆分画布\"按钮，直到循环到所需的选项。",
    "The Image Editor":"图像编辑器",
    "The canvas controls deal with various aspects of how the main draw canvas and its contents are displayed. The options are:":"画布控件处理主绘图画布及其内容显示方式的各个方面。选项包括：",
    "The eye-dropper tool permits you to sample a colour from the image currently being edited.":"滴管工具允许您从当前正在编辑的图像中采样颜色。",
    "The magic wand selection tool will select areas of the same colour based on the tolerance value set from the top bar of the editor. If you tick \"Colour only\" then alpha value will not be taken into consideration. You can cancel a selection from the Image menu or pressing {}.":"魔术棒选择工具将根据编辑器顶部栏中设置的公差值选择相同颜色的区域。如果勾选 \" 仅颜色\"，则不会考虑 Alpha 值。您可以从 \" 图像 \" 菜单中取消选择或按 {}。",
    "The single line of colours below the palette shows your colour history, with your most recently selected colour being on the very left. This section is {}not{} copied when using the \"Import colours\" or \"Copy colours\" option, as that only applies to the main palette above.":"调色板下方的单行颜色显示您的颜色历史记录，您最近选择的颜色位于最左侧。使用\"导入颜色\"或\"复制颜色\"选项时，{}不会{}复制此部分，因为这仅适用于上面的主调色板。",
    "The top of this section has a number or predefined colour {}swatches{} that you can choose from, and they can be assigned to the left {}&nbsp;and right {}&nbsp;mouse buttons respectively by clicking on them with either button (you can also swap the colours between each button by clicking the arrow icon in beside the swatches). The colours selected will be shown below as swatches beside the image of the mouse, and you can then click these to open the {}Colour Picker{} window:":"此部分的顶部有一个数字或预定义的颜色{}样本{}，您可以从中进行选择，通过使用任一按钮单击它们，可以将它们分别指定给左{}和右{}鼠标按钮(您也可以通过单击样本旁边的箭头图标在每个按钮之间交换颜色)。下面选择的颜色将显示为鼠标图像旁边的色板，然后您可以单击这些来打开{}颜色选择器{}窗口：",
    "The&nbsp;{}Image Editor{}":"{}图像编辑器{}",
    "These colour palettes can then be swapped and applied to different sprites using the colour palette {}Options {}menu:":"然后可以使用调色板{}\"选项\"{}菜单交换这些调色板并将其应用于不同的精灵：",
    "This bar contains the {}Frame Information{}. Here you can set the speed at which the animation frames should be played back using the input box on the left. The frame speed can either be based on \"{}Frames per second{}\", or \"{}Frames per game frame{}\". The total number of frames available are shown to the right along with the current frame that has been selected, and you can collapse this bar (hide it) by clicking on the {}&nbsp;icon to the left. You can set this to always start open or always start closed from the {}Image Editor Preferences{}.":"此栏包含{}帧信息{}。您可以在此处使用左侧的输入框设置动画帧的播放速度。帧速度可以基于\"{}每秒帧数{}\"或\"{}每个游戏帧数{}\"。可用帧总数和当前选定帧一起显示在右侧，您可以通过单击左侧的{}图标来折叠此栏(隐藏它)。您可以从{}图像编辑器首选项{}中将其设置为始终启动打开或始终启动关闭。",
    "This is the colour remove tool. When you select it, you can then click {}&nbsp;or {}&nbsp;on any pixel in the image and all pixels that are of the same colour will be removed (they are technically replaced with the colour black at an alpha of 0). The top bar has a tolerance slider where you can set the pixel colour tolerance - the lower this value the more exact a colour has to match the one that was clicked, while a higher value will expand this to include those colours that are similar to the one clicked. If you have previously made a selection using any of the selection tools, then only clicking on pixels within the selection will have an effect, and only the pixels within the selection will be removed.":"这是颜色删除工具。当您选择它时，您可以单击图像中的任何像素 {} 或 {}，并且所有具有相同颜色的像素都将被删除 (从技术上讲，它们将被 Alpha 为 0 的黑色所取代)。顶部栏有一个公差滑块，您可以在其中设置像素颜色公差-该值越低，颜色必须与单击的颜色匹配得越精确，而较高的值将扩展该值，以包括与单击的颜色相似的颜色。如果以前使用任何选择工具进行过选择，则只有单击选择内的像素才会产生效果，并且只会删除选择内的像素。",
    "This is the colour replace tool. When you select it, you can then click {}&nbsp;or {}&nbsp;on any pixel in the image and all pixels that are of the same colour will be replaced by the colour assigned to the mouse button used. The top bar has a tolerance slider where you can set the pixel colour tolerance - the lower this value the more exact a colour has to match the one that was clicked, while a higher value will expand this to include those colours that are similar to the one clicked. If you have previously made a selection using any of the selection tools, then only clicking on pixels within the selection will have an effect, and only the pixels within the selection will be affected by the colour change.":"这是颜色替换工具。选择后，可以单击图像中的任何像素{}或{}，并且所有颜色相同的像素都将被指定给所用鼠标按钮的颜色所替换。顶部栏有一个公差滑块，您可以在其中设置像素颜色公差-该值越低，颜色必须与单击的颜色匹配得越精确，而较高的值将扩展该值，以包括与单击的颜色相似的颜色。如果以前使用任何选择工具进行过选择，则仅单击选择内的像素将产生效果，并且只有选择内的像素才会受到颜色变化的影响。",
    "This is the eraser tool. It uses the selected brush to erase an area on click from either mouse button. Selecting this will also add extra tools to the top bar of the editor to permit you to scale the brush or enable/disable smoothing ({}linear interpolation{}).":"这是橡皮擦工具。它使用选定的笔刷从任一鼠标按钮单击时擦除区域。选择此选项还将向编辑器的顶部栏添加额外的工具，以允许您缩放画笔或启用/禁用平滑({}线性插值{})。",
    "This is the flip tool. Selecting this will mirror the current brush along the horizontal axis. This option does not create a new brush and will only affect how the current brush is drawn.":"这是翻转工具。选择此选项将沿水平轴镜像当前画笔。此选项不会创建新画笔，只会影响当前画笔的绘制方式。",
    "This is the main editing window for your images. Here you can apply any of the tools on the right to paint on the currently selected layer. You can paint with either the left {}&nbsp;or the right {}&nbsp;mouse button (and assign a colour to each from the colour picker) and use any of the brushes defined from the top right of the editor. You can also use {}&nbsp;/&nbsp;{}&nbsp;and the Mouse Wheel {}&nbsp;to zoom in or out, and pressing {}&nbsp;/&nbsp;{}&nbsp;+&nbsp;{} will set the canvas to be 1:1 with the image (or you can use the Canvas Controls as explained above). Note too that you can pan around the canvas using the middle mouse button {}&nbsp;or&nbsp;{}&nbsp;+ {}.":"这是图像的主编辑窗口。在这里，可以应用右侧的任何工具在当前选定的图层上绘制。您可以使用鼠标左键{}或右键{}进行绘制(并从颜色选择器中为每个颜色指定一种颜色)，然后使用编辑器右上角定义的任何画笔。您还可以使用{}/{}和鼠标滚轮{}进行放大或缩小，按{}/{}+{}会将画布与图像的比例设置为 1:1 (也可以使用上述画布控件)。请注意，您可以使用鼠标中键{}或{}+{}在画布周围平移。",
    "This is the mirror tool. Selecting this will mirror the current brush along the vertical axis. This option does not create a new brush and will only affect how the current brush is drawn.":"这是镜像工具。选择此选项将沿垂直轴镜像当前画笔。此选项不会创建新画笔，只会影响当前画笔的绘制方式。",
    "This is the paint bucket (or fill) tool. This will fill in an area of the image based on the chosen alpha tolerance setting, which you can change using the slider shown in the top bar of the editor.":"这是油漆桶 (或填充) 工具。这将填充基于所选 Alpha 公差设置的图像区域，您可以使用编辑器顶部栏中显示的滑块更改该设置。",
    "This is the pan tool. When you select this, you can then click {}&nbsp;and drag the mouse to pan the layer contents around within the layer. Note that any pixels outside of the draw canvas will not be visible and the image will be cropped to the draw canvas size when you change tool again. Note too that if you have made a selection then the selected pixels will be moved rather than the contents of the layer.":"这是平移工具。选择此选项后，可以单击{}并拖动鼠标在图层内平移图层内容。请注意，再次更改工具时，绘图画布之外的任何像素都将不可见，并且图像将裁剪为绘图画布大小。请注意，如果您已经进行了选择，则将移动选定的像素，而不是移动图层的内容。",
    "This is the pencil tool. It uses the selected brush to paint in the selected colour for the mouse button, and you can set the size from the top bar of the image editor as well as enable/disable smoothing (interpolation). Note that you can also resize and scale any brush by holding down {}&nbsp;+ \"{}Z{}\" then clicking {}&nbsp;and dragging the mouse to change the proportions of the brush, or alternatively select one of the predefined brushes from the top right.":"这是铅笔工具。它使用选定的画笔为鼠标按钮绘制选定的颜色，您可以从图像编辑器的顶部栏设置大小，以及启用 / 禁用平滑 (插值)。请注意，也可以通过按住 {}+\"{}Z{}\"，然后单击 {} 并拖动鼠标来更改画笔的比例，或者从右上角选择一个预定义画笔来调整任何画笔的大小和缩放比例。",
    "This is the rotate tool. If you have an area selected using one of the Selection tools, then clicking this will permit you to rotate the selected area by an arbitrary amount from 0° to 360°. If you do not have an area of the image selected then this will permit you to rotate the current brush. To rotate, simply hold down the left mouse button {}&nbsp;and drag left or right or set the value directly in the top bar. To accept the changes you can press either&nbsp;{} or select another tool. Note that accepting the change will not change the source material, but rather create a new Brush resource for you to use with the selected image or a brush rotated by the amount you set. Also note that the keyboard shortcut \"{}Z{}\" can be used to rotate any selection or brush by 90° and that this option does not create a new brush and will only affect how the current brush is drawn.":"这是旋转工具。如果使用其中一个选择工具选择了某个区域，则单击此按钮将允许您在 0° 到 360° 之间任意旋转所选区域。如果未选择图像的某个区域，则允许您旋转当前画笔。要旋转，只需按住鼠标左键 {} 并向左或向右拖动，或直接在顶部栏中设置值。要接受更改，您可以按 {} 或选择其他工具。请注意，接受更改不会更改源材质，而是会创建一个新的 \" 画笔 \" 资源，以用于选定的图像或按设置的量旋转的画笔。另请注意，键盘快捷键 \"{}Z{}\" 可用于将任何选择或画笔旋转 90°，并且此选项不会创建新画笔，只会影响当前画笔的绘制方式。",
    "This is the spline tool. It uses the selected brush to create a {}spline{}. You click and hold either mouse button to set a point and then drag the mouse to generate the spline, releasing the mouse and repeating to add further points and curves. The spline will be drawn using the selected brush, which can be edited using the top bar of the editor to set size and smoothing. The top bar also has a setting for {}Iterations {}which will define how smooth the resulting spline is (lower values will be rougher, higher smoother, and the default value is 10).":"这是样条曲线工具。它使用所选笔刷创建{}样条线{}。单击并按住鼠标按钮以设置点，然后拖动鼠标以生成样条线，释放鼠标并重复以添加更多点和曲线。将使用所选笔刷绘制样条曲线，可以使用编辑器的顶部栏编辑该笔刷以设置大小和平滑度。顶栏还具有{}迭代{}的设置，该设置将定义生成的样条曲线的平滑度(值越低越粗糙，平滑度越高，默认值为10)。",
    "This part of the window shows the frames in the order that they will be animated in. You can click the&nbsp;{} button to the left to add further frames - or use the {}Image Menu{} - and you can also click and drag any of the frames to change their position along the timeline. In the top left of the Frame View you can switch on {}Onion Skinning{} {}, which means that in a single frame of any sprite animation, you can choose to see any of the preceding or succeeding frames as a semi-transparent layer under the image frame you are currently editing. The great thing about this is that each frame is drawn slightly lighter than the last so you can see how the animation has been progressing from frame to frame while drawing the next one.":"窗口的这一部分按照帧的动画顺序显示帧。您可以单击左侧的{}按钮以添加更多帧，也可以使用{}图像菜单{}-也可以单击并拖动任何帧以沿时间轴更改其位置。在\"帧视图\"的左上角，您可以打开{}洋葱皮{} {}，这意味着在任何子画动画的单个帧中，您可以选择将前面或后面的任何帧视为当前正在编辑的图像帧下的半透明层。这样做的好处是，每个帧的绘制都比上一帧稍微轻一些，因此您可以看到动画在绘制下一帧时如何从一帧进行到另一帧。",
    "This small bar at the bottom shows the different values for the mouse position and width and height of the selection tools in the editor.":"底部的这个小条形图显示了编辑器中鼠标位置以及选择工具的宽度和高度的不同值。",
    "This tool will draw a line between two points. Click once with either button to create the first point and then click again elsewhere to create another point and join them. The line will be drawn using the selected brush to create the outline, and you can edit some of the brush properties using the top bar of the editor (size, {}linear interpolation{}, etc...).":"此工具将在两点之间绘制一条直线。使用任一按钮单击一次以创建第一个点，然后在其他位置再次单击以创建另一个点并连接它们。将使用所选笔刷绘制线条以创建轮廓，并且您可以使用编辑器的顶部栏(尺寸、{}线性插值{}等)编辑某些笔刷属性。",
    "This tool will draw either a filled or an outlined ellipse. If you click in the top left of the icon, it will be outlined, while clicking the bottom right will be filled and if you require both then you can select that option from the top bar of the image editor (or use {}&nbsp;+ {}&nbsp;to select one then the other on the toolbox icon), as well as set the size and smoothing of the brush being used. The ellipse will be drawn using the selected brush to create the outline. Note that while drawing you can hold down {}&nbsp;and click to draw from the centre of the mouse position.":"此工具将绘制一个填充椭圆或一个轮廓椭圆。如果单击图标的左上角，则会勾勒出该图标，同时单击右下角将填充该图标;如果两者都需要，则可以从图像编辑器的顶部栏中选择该选项(或者使用{}+{}在工具箱图标上先选择一个再选择另一个)，并设置正在使用的画笔的大小和平滑度。将使用所选笔刷绘制椭圆以创建轮廓。请注意，绘制时可以按住{}并单击从鼠标位置的中心进行绘制。",
    "This tool will draw either a filled or an outlined polygon. If you click in the top left of the icon, it will be outlined, while clicking the bottom right will be filled and if you require both then you can select that option from the top bar of the image editor (or use&nbsp;{}&nbsp;+ {}&nbsp;to select one then the other on the toolbox icon), as well as set the size and smoothing of the brush being used. You click&nbsp;{}&nbsp;or&nbsp;{} to add points to the polygon using the selected brush and when you are happy with the results you should select a different tool to commit the changes and generate the image. The polygon will be drawn using the selected brush. You can press&nbsp;{}&nbsp;at any time to cancel the polygon definition.":"此工具将绘制填充多边形或轮廓多边形。如果单击图标的左上角，则会勾勒出该图标，同时单击右下角将填充该图标;如果两者都需要，则可以从图像编辑器的顶部栏中选择该选项(或者使用{}+{}在工具箱图标上先选择一个再选择另一个)，并设置正在使用的画笔的大小和平滑度。单击{}或{}可使用选定的笔刷向多边形添加点，当您对结果感到满意时，应选择其他工具来提交更改并生成图像。将使用选定的笔刷绘制多边形。您可以随时按{}取消多边形定义。",
    "This tool will draw either a filled or an outlined rectangle. If you click in the top left of the icon, it will be outlined, while clicking the bottom right will be filled and if you require both then you can select that option from the top bar of the image editor (or use {}&nbsp;+ {}&nbsp;to select one then the other on the toolbox icon), as well as set the size and smoothing of the brush being used. The rectangle will then be drawn using the selected brush. Note that while drawing you can hold down {}&nbsp;and click to draw from the centre of the mouse position.":"此工具将绘制一个已填充或轮廓分明的矩形。如果单击图标的左上角，则会勾勒出该图标，同时单击右下角将填充该图标;如果两者都需要，则可以从图像编辑器的顶部栏中选择该选项(或者使用{}+{}在工具箱图标上先选择一个再选择另一个)，并设置正在使用的画笔的大小和平滑度。然后将使用选定的画笔绘制矩形。请注意，绘制时可以按住{}并单击从鼠标位置的中心进行绘制。",
    "Those are just some of the more advanced features that the image editor offers. To find out the full feature range, please read the items below detailing the functions of every part of the editor:":"这些只是图像编辑器提供的一些更高级的功能。要了解整个功能范围，请阅读下面的项目，详细介绍编辑器的每个部分的功能：",
    "To create a new brush from the selection regardless of the setting of&nbsp;{}Image Selection Copy/Paste,{}&nbsp;use&nbsp;{}&nbsp;+ \"B\". This shortcut will also work if you have the preference set to {}Paste as Layer{}.":"要从所选内容创建新画笔，而不考虑 {}图像选择复制/粘贴{}的设置，请使用 {} +\"B\"。如果您将首选项设置为{}粘贴为层{}，则此快捷方式也适用",
    "Toggle Canvas Grid {}: This will toggle on/off the canvas grid. This is a grid that {}GameMaker{} draws over the main canvas to divide it into sections, and by default is set to 1px in size. However if you click the Grid Menu icon {}&nbsp;you will open the grid options:{} {}These options permit you to set the grid colour and alpha, as well as the cell values for the grid along the X and Y axis. You also have an option to enable or disable grid snapping here (disabled by default). ":"切换画布网格 {}：这将打开 / 关闭画布网格。这是一个网格，{}GameMaker{} 在主画布上绘制以将其划分为多个部分，默认情况下设置为 1px 大小。但是，如果单击 \" 网格菜单 \" 图标 {}，将打开网格选项：{}{} 这些选项允许您设置网格颜色和 Alpha，以及沿 X 轴和 Y 轴的网格单元格值。您还可以选择在此启用或禁用栅格捕捉 (默认情况下处于禁用状态)。",
    "When you create multiple frames, you can draw to them as they animate! So, if you press the play button{} on the {}Frame Control{} bar, and then select a brush and start to draw in the editor window, you\u0027ll see that the frames will animate in the editor and what you draw will be added to the corresponding frame in that moment. You can experiment with different frame rates until you get something you like, but once you\u0027ve got the hang of how this works you\u0027ll be creating dynamic sprites and effects in no time.":"当您创建多个帧时，可以在这些帧设置动画时对其进行绘制！因此，如果按{1}帧控制{2}栏上的播放按钮{}，然后选择一个画笔并开始在编辑器窗口中绘制，您将看到这些帧将在编辑器中设置动画，您所绘制的内容将在此时添加到相应的帧中。你可以尝试不同的帧速率，直到你得到你喜欢的东西，但一旦你掌握了这是如何工作的诀窍，你将很快创建动态的精灵和效果。",
    "When you use the {}Copy {}functions to, for example, copy a selection of an image, then the selection copied gets added to your {}brush list{}. This means that you can select a part of an image and then use it in the rest of the paint tools to draw lines, polygons or just paint freely. The brush can be scaled and blended with a colour too. Note that the {}Paste {}functionality is not intended for use internally within the editor as anything you copy is added to the brush list and so can be selected for \"pasting\" that way. Instead paste is simply for you to capture something from an external program and paste it into the Image Editor.":"例如，当您使用{}复制{}功能复制选定的图像时，复制的选定内容将添加到{}画笔列表{}中。这意味着您可以选择图像的一部分，然后在其余绘制工具中使用它来绘制直线、多边形或自由绘制。画笔也可以缩放并与颜色混合。请注意，{}粘贴{}功能不打算在编辑器内部使用，因为您复制的任何内容都将添加到画笔列表中，因此可以通过这种方式选择\"粘贴\"。相反，粘贴只是为了从外部程序中捕获某些内容并将其粘贴到图像编辑器中。",
    "With this tool you can \"paint\" a selected area using any of the brushes, including custom brushes. All the same keyboard shortcuts apply as for the Pencil tool. You can cancel a selection from the Image menu or pressing {}":"使用此工具，可以使用任何笔刷(包括自定义笔刷)\"绘制\"选定区域。所有键盘快捷键都适用于铅笔工具。您可以从\"图像\"菜单中取消选择或按{}",
    "With this tool you can generate a rectangular selection. You can cancel a selection from the Image menu or pressing {}.":"使用此工具可以生成矩形选择。您可以从\"图像\"菜单中取消选择或按{}。",
    "You can also paste externally from your clipboard ({}&nbsp;/&nbsp;{}&nbsp;+ \"{}V{}\") to create a new brush, which can be changed in the&nbsp;{}Image Editor Preferences{}.":"您也可以从剪贴板 ({}/{}+\"{}V{}\") 从外部粘贴以创建新画笔，该画笔可以在 {} 图像编辑器首选项 {} 中更改。",
    "You can also paste from your clipboard ({}&nbsp;/&nbsp;{}&nbsp;+ \"{}V{}\") to create a new layer, which can be enabled/disabled in the&nbsp;{}Image Editor Preferences{}&nbsp;(see \"{}Image Selection Copy/Paste{}\").":"您也可以从剪贴板 ({}/{}+\"{}v{}\") 粘贴以创建新的层，可以在 {} 图像编辑器首选项 {} 中启用 / 禁用该层 (请参阅 \"{} 图像选择复制 / 粘贴 {}\")。",
    "You can click on any frame to select it for editing, and a selected frame will have a Delete button&nbsp;{}&nbsp;at the top corner which you can click to remove the frame from the sprite. You can also click {}&nbsp;/&nbsp;{}&nbsp;+ {}&nbsp;on multiple frames to select them together, in which case clicking the Delete button will delete all the selected frames. Finally, you can use the standard keyboard shortcuts for {}Cut{}, {}Copy {}and {}Paste {}to edit selected frames:&nbsp;{}&nbsp;/&nbsp;{}&nbsp;+ \"{}X{}\",&nbsp;{}&nbsp;/&nbsp;{}&nbsp;+ \"{}C{}\", and {}&nbsp;/&nbsp;{}&nbsp;+ \"{}V{}\".":"您可以单击任何框架选择它进行编辑，选定的框架顶部将有一个\"删除\"按钮{}，您可以单击该按钮将框架从精灵中删除。您也可以单击多个帧上的{}/{}+{}一起选择它们，在这种情况下，单击\"删除\"按钮将删除所有选定的帧。最后，您可以使用{}剪切{}、{}复制{}和{}粘贴{}的标准键盘快捷键来编辑选定的帧：{}/{}+\"{}X{}\"、{}/{}+\"{}C{}\"和{}/{}+\"{}V{}\"。",
    "You can create {}layers {}in the image editor for different parts of your image, and these layers can be manipulated and drawn to using the various brushes and tools. To create a new layer, simply click the {}&nbsp;icon, and to remove it again the&nbsp;{} icon. Layers can also be ordered by clicking {}&nbsp;on a layer and then dragging the layer up or down to the position you require, and you can further organise the layers by creating folders using the {}&nbsp;button and then dragging layers into them.":"您可以在图像编辑器中为图像的不同部分创建{}图层{}，并且可以使用各种画笔和工具操纵和绘制这些层。要创建新图层，只需单击{}图标，然后再次删除{}图标。也可以通过单击图层上的{}，然后将该图层向上或向下拖动到所需的位置来对图层进行排序，还可以通过使用{}按钮创建文件夹，然后将图层拖动到这些图层中来进一步组织图层。",
    "You can have multiple layers for each sprite thanks to the handy {}layer editor{}. These layers can ordered and even placed in folders to make creating more complex images easier.":"由于使用了方便的{}图层编辑器{}，每个精灵可以有多个图层。这些图层可以排序，甚至可以放置在文件夹中，以便更轻松地创建更复杂的图像。",
    "You can pull the Image Editor tab off of the main workspace window into it\u0027s own window. This can be handy when using multiple monitors, for example.":"您可以将\"图像编辑器\"选项卡从主工作区窗口拉出到自己的窗口中。例如，在使用多个显示器时，这可能非常方便。",
    "You can pull the Image Editor tab off of the main workspace window into its own window. This can be handy when using multiple monitors, for example.":"您可以将\"图像编辑器\"选项卡从主工作区窗口拉出到自己的窗口中。例如，在使用多个显示器时，这可能非常方便。",
    "You can quickly change between sub-images (frames) in the editor by using the \"{}1{}\" and \"{}2{}\" keys on the keyboard.":"通过使用键盘上的 \"{}1{}\" 和 \"{}2{}\" 键，可以在编辑器中快速更改子图像 (帧)。",
    "{} This is the text input tool. It creates a new text layer where you can type anything you need. You can set the font to use as well as the formatting from the top bar of the image editor.":"{}这是文本输入工具。它会创建一个新的文本层，您可以在其中键入所需的任何内容。您可以从图像编辑器的顶部栏设置要使用的字体以及格式。",
    "{}1:1{} - Scale the image to be 1:1 with the resolution (ie: actual size) and center it in the image edit window.":"{}1:1{}- 通过分辨率 (即实际大小) 将图像缩放为 1:1，并在图像编辑窗口中居中显示。",
    "{}Add Frame{} - Add a new frame to the sprite.":"{} 添加框架 {}- 向精灵添加新框架。",
    "{}Auto Trim All Frames{} - This option permits you to trim all the zero-alpha pixels from around the edges of a sprite. This will take into consideration all image frames within the sprite, so each side will crop to the edge of whichever frame has the furthest non-zero alpha pixel.{} {} ":"{} 自动修剪所有帧 {}- 此选项允许您修剪精灵边缘周围的所有零 Alpha 像素。这将考虑精灵中的所有图像帧，因此每一侧将裁剪到具有最远非零 Alpha 像素的帧的边缘。{}{}",
    "{}Blur {}- Apply a blur effect to the image. You can set the intensity as well as the type of blur to use (box or gaussian) and set whether to only blur along the horizontal or vertical axis, or along both. You can then choose to apply this to only the current layer, visible layers or all layers.{} {} ":"{} 模糊 {}- 对图像应用模糊效果。您可以设置强度以及要使用的模糊类型 (长方体或高斯)，并设置是仅沿水平轴或垂直轴模糊，还是同时沿两者模糊。然后，您可以选择仅将其应用于当前图层、可见图层或所有图层。{}{}",
    "{}Brushes{}{}Brushes{}":"{}画笔{}{}画笔{}",
    "{}Cancel Selection{} - Clear any selection from the image.":"{} 取消选择 {}- 清除图像中的任何选择。",
    "{}Canvas Controls{}{}Canvas Controls{}":"{}画布控件{}{}画布控件{}",
    "{}Canvas Values{}{}Canvas Values{}":"{}画布值{}{}画布值{}",
    "{}Colour Picker{}{}Colour Picker{}":"{}颜色选择器{}{}颜色选择器{}",
    "{}Colour Remove{}":"{}颜色删除{}",
    "{}Colour Replace{}":"{}颜色替换{}",
    "{}Convert to Frames{} - This option will convert a single image into a number of separate frames. You must first have created a single frame with all the parts of the animation in it (or imported a single strip image) like the one shown below:{} {}Since this is a single image and we want to convert it into individual frames, we can use this option which will then open the following window:{} {}Here you can set how the single image should be split to create the frames, setting the number of frames, the width and height of the frames and any including any offset values. ":"{} 转换为帧 {}- 此选项将单个图像转换为多个单独的帧。您必须首先创建包含动画所有部分的单个帧 (或导入单个条带图像)，如下所示：{}{} 由于这是单个图像，并且我们希望将其转换为单个帧，因此可以使用此选项，然后将打开以下窗口：{}{} 在这里，您可以设置如何拆分单个图像以创建帧、设置帧数、帧的宽度和高度以及任何包括任何偏移值的值。",
    "{}Copy Frame{} / {}Selection {}- Copy the frame or the selection from the image, depending on Editor focus. If copying a selection, this will add it to the brushes.":"{} 复制帧 {}/{} 选择 {}- 根据编辑器焦点复制帧或图像中的选择。如果复制选择，则会将其添加到画笔中。",
    "{}Crop All Frames To Selection{} - This option will only be available when you have an area of the image selected in the main draw canvas. When you then choose this option, the image being edited (and all other frames in the animation) will be cropped to the boundaries of the selection.":"{} 裁剪所有要选择的帧 {}- 只有在主绘图画布中选择了图像的某个区域时，此选项才可用。然后选择此选项时，正在编辑的图像 (以及动画中的所有其他帧) 将裁剪到选择的边界。",
    "{}Cut Frame{} / {}Selection {}- Cut the frame or selection from the image, depending on Editor focus. If cutting a selection, this will add it to the brushes.":"{} 剪切帧 {}/{} 选择 {}- 剪切帧或从图像中选择内容，具体取决于编辑器焦点。如果剪切选定内容，则会将其添加到画笔中。",
    "{}Delete Selected Fames{} - Remove the selected frame from the sprite (you can use {}&nbsp;/&nbsp;{}&nbsp;+ {}&nbsp;and/or {}&nbsp;+ {}&nbsp;to select multiple frames).":"{} 删除选定的族 {}- 从精灵中删除选定的帧 (您可以使用 {}/{}+{} 和 / 或 {}+{} 选择多个帧)。",
    "{}Draw Canvas{}{}Draw Canvas{}":"{}绘制画布{}{}绘制画布{}",
    "{}Effects{}{}Effects{}":"{}效果{}{}效果{}",
    "{}Ellipse{}":"{}椭圆{}",
    "{}Eraser{}":"{}橡皮擦{}",
    "{}Export to PNG{} - Selecting this option will export the sprite as a single {}PNG{} image. If the sprite has more than a single image, then a \"strip\" sprite will be created with all the images, one after another, and the save file name will automatically be appended with \"{}_stripX{}\", where \"{}X{}\" is the number of frames exported. For example, a five frame sprite will be exported as \"{}sprite_name_strip5.png{}\".":"{} 导出到 PNG{} - 选择此选项会将精灵导出为单个 {}PNG{} 图像。如果精灵具有多个图像，则将使用所有图像依次创建\"条带\"精灵，并且保存文件名将自动附加 \"{}_stripX{}\"，其中 \"{}X{}\" 是导出的帧数。例如，五帧精灵将导出为 \"{}sprite_name_strip5.png{}\"。",
    "{}Eye Dropper{}":"{}滴管{}",
    "{}Fit Screen{} - Scale the image to fill the image edit window.":"{} 调整屏幕 {}- 缩放图像以填充图像编辑窗口。",
    "{}Flip {}- This option permits you to flip either the current frame all all the frames that comprise the sprite along the horizontal axis.":"{} 翻转 {}- 此选项允许您翻转当前帧以及沿水平轴构成子画面的所有帧。",
    "{}Flip{}":"{}翻转{}",
    "{}Frame Information{}{}Frame Information{}":"{}帧信息{}{}帧信息{}",
    "{}Frame View{}{}Frame View{}":"{}帧视图{}{}帧视图{}",
    "{}From this window you can define the colour using any of the available sliders and gadgets, or you can input values directly for the {}ARGB{}&nbsp;values or {}HSV{} values.":"{}在此窗口中，您可以使用任何可用的滑块和小工具定义颜色，也可以直接为 {}ARGB{} 值或 {}HSV{} 值输入值。",
    "{}Greyscale {}- Desaturate the image by a determined amount. You can choose to apply this to only the current layer, visible layers or all layers.{} {} ":"{} 灰度 {}- 按确定的量使图像去饱和。您可以选择仅将其应用于当前图层、可见图层或所有图层。{}{}",
    "{}Here you can name the layer as well as set the blend mode (the way that it should be \"mixed\" with the layers beneath), choosing from {}normal{}, {}additive{}, {}subtractive {}or {}multiply {}blends. Finally you can set the opacity (transparency) of the layer with a slider, but note that this is cumulative with the actual alpha value of individual pixels - for example, if you have pixels that are 50% opaque and set the layer opacity to 50%, the final pixels will be drawn at 25% opacity.":"{}您可以在此处命名图层并设置混合模式(它应该与下面的图层\"混合\")，选择{}正常{}、{}加法{}、{}减法{}或{}乘法{}混合。最后，您可以使用滑块设置图层的不透明度(透明度)，但请注意，这是使用单个像素的实际 Alpha 值累积的，例如，如果像素的不透明度为 50%，并将图层不透明度设置为 50%，则最终像素将以 25% 的不透明度绘制。",
    "{}Image{}{}Image{}":"{}图像{}{}图像{}",
    "{}Import Image(s){} - Load an image to be used as a frame from disk. Note that you can load multiple frames at once by selecting multiple individual files to import in the explorer window. Once you have selected your file or files you will be shown the following Import window:{} {}Here you can choose how the imported image should be added to the current sprite, permitting you to resize the entire draw canvas, crop or pad it, and also set the \"anchor\" position for placing the new image(s). ":"{} 导入图像 {}- 从磁盘加载要用作帧的图像。请注意，通过在资源管理器窗口中选择要导入的多个单独文件，可以一次加载多个帧。选择一个或多个文件后，将显示以下 \" 导入 \" 窗口：{}{} 您可以在此选择如何将导入的图像添加到当前精灵中，允许您调整整个绘图画布的大小、裁剪或填充它，还可以设置 \" 锚点 \" 位置以放置新图像。",
    "{}Import Strip Image{} - This option will open a file explorer and prompt you to look for a single strip image file to be used to create frames from. Once selected an image the Import strip window will open, exactly the same as for the {}Convert To Frames{} option shown above.":"{} 导入条带图像 {}- 此选项将打开文件资源管理器，并提示您查找用于创建帧的单个条带图像文件。选择映像后，将打开 \" 导入条带 \" 窗口，该窗口与上面显示的 {}\" 转换为帧 {}\" 选项完全相同。",
    "{}Insert Frame{} - Insert a new frame after the one currently showing.":"{} 插入框架 {}- 在当前显示的框架之后插入新框架。",
    "{}Invert Selection{} - Invert the current selection.":"{} 反转选择 {}- 反转当前选择。",
    "{}Layer Editor{}{}Layer Editor{}":"{}图层编辑器{}{}图层编辑器{}",
    "{}Line{}":"{}线{}",
    "{}Magic Wand{}":"{}魔棒{}",
    "{}Mirror {}- This option permits you to mirror either the current frame all all the frames that comprise the sprite along the vertical axis.":"{} 镜像 {}- 此选项允许您沿垂直轴镜像当前帧中组成子画面的所有帧。",
    "{}Mirror{}":"{}镜像{}",
    "{}NOTE{}: Brushes are not retained between sessions, closing your project will remove any brushes that you have created.":"{}注意{}：两次会话之间不会保留画笔，关闭项目将删除已创建的所有画笔。",
    "{}Onion Skin Settings{} - Change the onion skin settings. This will open the following window where you can set the frames shown by the onion skin button, as well as the opacity and colour of the skinned frames.{} {} ":"{} 洋葱皮设置 {}- 更改洋葱皮设置。这将打开以下窗口，您可以在其中设置洋葱皮按钮显示的帧，以及蒙皮帧的不透明度和颜色。{}{}",
    "{}Paint / Fill{}":"{}油漆/填充{}",
    "{}Paint Selection{}":"{}画笔选择{}",
    "{}Pan{}":"{}平移{}",
    "{}Paste Frame{} / {}Selection {}- Paste the frame from the clipboard, or paste the selection from the clipboard to the image, depending on the current focus of the IDE. When pasting into an image, you should note that this option is designed only for use with clipboard data from external programs. When you cut or copy to the clipboard from an image in the Image Editor, this is added to the brushes in the top right of the editor, and you should select a brush to draw with the cut/copied selection rather than try to paste it into the image. Also note that a number of programs will have issues pasting transparencies from the clipboard into {}GameMaker{} image editor due to the format used by the clipboard.":"{} 粘贴帧 {}/{} 选择 {}- 根据 IDE 的当前焦点，从剪贴板粘贴帧或从剪贴板粘贴所选内容到图像。粘贴到图像中时，应注意此选项仅用于外部程序中的剪贴板数据。从 \" 图像编辑器 \"(Image Editor) 中的图像剪切或复制到剪贴板时，会将其添加到编辑器右上角的画笔中，并且应该选择一个画笔来使用剪切 / 复制的选择进行绘制，而不是尝试将其粘贴到图像中。另请注意，由于剪贴板使用的格式，许多程序在将透明胶片从剪贴板粘贴到 {}GameMaker{} 图像编辑器时会遇到问题。",
    "{}Pencil{}":"{}铅笔{}",
    "{}Polygon{}":"{}多边形{}",
    "{}Rectangle Selection{}":"{}矩形选择{}",
    "{}Rectangle{}":"{}矩形{}",
    "{}Resize All Frames{} - When you select this option it will open the following window where you can set the way that you want to resize all the animation frames that comprise the sprite:{} {}You can choose to either {}Scale {}the image, or to {}Resize{} the&nbsp;canvas. If you choose to scale the image then you simply select the new width and/or height for each frame, whether to scale using the same aspect ratio, and also whether to scale in pixels or percent. Note that when scaling you can enable {}linear interpolation{} on or off, where having it on will cause the pixels to blur or \"smear\" as the image is scaled (in general, for hi resolution art you want this {}on{}, but for pixel art you want this {}off{}).{} {} The option to resize the canvas will not alter the pixels within the image but instead increase or decrease the size of the canvas that the images are being drawn on. You can set where the \"anchor\" for the resize should be using the arrow icons, then set the new size (in pixels or as a percentage) as well as set whether to maintain the aspect ratio of the original frames. Note that making the frame smaller than the original sprite images will crop the pixels. ":"{}调整所有帧的大小{} - 选择此选项后，将打开以下窗口，您可以在其中设置要调整构成精灵的所有动画帧大小的方式：{}{}您可以选择{}缩放{}图像或{}调整画布大小{}。如果选择缩放图像，则只需为每个帧选择新的宽度和/或高度，是否使用相同的纵横比进行缩放，以及是否以像素或百分比进行缩放。请注意，当缩放时，您可以启用或禁用{}线性插值{}，启用该插值会导致图像缩放时像素模糊\"或涂抹\"(通常，对于高分辨率图片，您希望此插值{}开启{}，但对于像素图片，您希望此插值{}关闭{})。{}{}调整画布大小的选项不会改变图像中的像素，而是会增加或减小绘制图像时所在画布的大小。您可以使用箭头图标设置调整大小的\"锚点\"所在的位置，然后设置新大小(以像素或百分比表示)，以及设置是否保持原始帧的纵横比。请注意，使帧小于原始精灵图像将裁剪像素。",
    "{}Reverse Frames{} - Selecting this will simply reverse the frame order for the sprite.":"{} 反转帧 {}- 选择此选项将简单地反转精灵的帧顺序。",
    "{}Rotate all Frames (anti-clockwise 90°){} - This option will rotate all the frames of the animation 90° anti-clockwise.":"{} 将所有帧旋转 (逆时针 90°){}- 此选项将动画的所有帧逆时针旋转 90°。",
    "{}Rotate all Frames (clockwise 90°){} - This option will rotate all the frames of the animation 90° clockwise.":"{} 将所有帧旋转 (顺时针 90°){}- 此选项将动画的所有帧顺时针旋转 90°。",
    "{}Rotate{}":"{}旋转{}",
    "{}Select All {}- Select the full image.":"{} 全部选择 {}- 选择完整图像。",
    "{}Show grid{} - Toggle the pixel grid. This is the same as the grid button found in the Canvas Controls (explained further up this page).":"{} 显示网格 {}- 切换像素网格。这与在画布控件中找到的网格按钮相同 (本页上部进一步说明)。",
    "{}Spline{}":"{}样条{}",
    "{}Text{}":"{}文本{}",
    "{}The Effects menu is where you can add your own custom effects plugins, and has the following effects by default:":"{}在\"效果\"菜单中，您可以添加自己的自定义效果插件，默认情况下具有以下效果：",
    "{}The Image menu has the following options (some of which may or may not be available depending on the currrent editor focus):":"{}\"图像\"菜单具有以下选项(其中某些选项可能可用，也可能不可用，具体取决于当前编辑器焦点)：",
    "{}The I{}mage Editor {}is where you can create your own {}sprites{} or edit those you have imported or created previously. If you have used any other image tools then this should be familiar to you but there are a few things to note when using the {}GameMaker{} Image Editor which may not be immediately apparent:":"{}您可以在{}图像编辑器{}中创建自己的{}精灵{}或编辑以前导入或创建的精灵。如果您使用了任何其他图像工具，则您应该熟悉这一点，但在使用 {}GameMaker{} 图像编辑器时需要注意一些事项，这些事项可能不会立即显示出来：",
    "{}The View menu has the following options:":"{}\"视图\"菜单具有以下选项：",
    "{}These menus are explained in the sections below:":"{}这些菜单在以下部分中进行了说明：",
    "{}Tools{}{}Tools{}":"{}工具{}{}工具{}",
    "{}View{}{}View{}":"{}视图{}{}视图{}",
    "{}You can set certain properties for onion-skinning from the&nbsp;{}View{}&nbsp;conext menu, which is explained further down this page.":"{}您可以从{}\"查看{}下一页\"菜单中设置洋葱皮的某些属性，下一页将对此进行进一步说明。",
    "{}{}NOTE{}{}&nbsp;Brushes are not retained between sessions, closing your project will remove any brushes that you have created.":"{}{}注意{}{} 会话之间不保留画笔，关闭项目将删除您创建的所有画笔。",
    "{}{}NOTE{}{}&nbsp;The default blending colour for the new brush will be white, but if you change the colour with the colour picker and paint using the brush, it will be {}blended {}with this new colour.":"{}{}注意{}{} 新画笔的默认混合颜色将是白色，但如果您使用颜色选择器更改颜色并使用画笔绘制，它将与此新颜色{}混合{}。",
    "{}{}NOTE{}{}&nbsp;The value used here for the animation speed will also set the way the sprite is animated when used in a game, either as a sprite asset on a layer or as a sprite assigned to an instance, although you can modify this at runtime using the appropriate {}functions{}&nbsp;and {}variables{}.":"{}{}注意{}{} 此处使用的动画速度值还将设置在游戏中使用精灵的动画方式，无论是作为层上的精灵资源还是作为指定给实例的精灵，尽管您可以在运行时使用适当的{}函数{}和{}变量{}对其进行修改。"
}