{
    "A Particle System consists of various emitters, each of which \"emits\" a particular type of particle. A particle is simply an image that is animated according to its settings, and has a fixed lifespan.":"粒子系统由不同的发射器组成，每个发射器\"发射\"一种特定类型的粒子。粒子只是一个根据其设置设置动画并具有固定寿命的图像。",
    "Add the particle system asset to your game in any of these three ways: {} {}Drop it inside an Asset Layer in&nbsp;{}The Room Editor{}{} {}Drop it inside a {}Sequence{} as a track{} {}Add&nbsp;{}GML Code{} to show the effect at runtime: {} {}Create the particle system using&nbsp;{}{}part_system_create{}{}/{}{}part_system_create_layer{}{}&nbsp;or the GML Visual equivalent:&nbsp;{}Create Particle System{}{} {}Paste the code generated by the {}Copy GML to Clipboard{}&nbsp;{} button where needed in your code{} {}Create the particles in an existing particle system using&nbsp;{}{}part_particles_burst{}{}{} {} {} {} ":"通过以下三种方式中的任意一种将粒子系统资源添加到您的游戏中：{} {}将其放入{}房间编辑器{}中的资源层中{}{}将其作为轨道放入{}序列中{}{}{}添加 {}GML 代码{}以在运行时显示效果：{} {}使用 {}{}part_system_create{}{}/{}{}part_system_create_layer{}{} 或 GML Visual 等效项创建粒子系统 : {}创建粒子系统{}{} {}将通过{}将 GML 复制到剪贴板{} {} 按钮生成的代码粘贴到代码中需要的位置{} {}使用在现有粒子系统中创建粒子  {}{} part_articles_burst{}{}{} {} {} {}",
    "Add the particle system asset to your game in any of these three ways: {} {}Drop it inside an Asset Layer in&nbsp;{}The Room Editor{}{} {}Drop it inside a {}Sequence{} as a track{} {}Show the effect at runtime using&nbsp;{}{}part_system_create{}{}/{}{}part_system_create_layer{}{}&nbsp;or the GML Visual equivalent:&nbsp;{}Create Particle System{}{} {} ":"通过以下三种方式之一将粒子系统资源添加到游戏中：{}{}将其放入中的资源层中{}房间编辑器{}中{} {}将其放入{}序列中{}作为轨迹{}{}在运行时显示效果 {}{}part_system_create{}{}/{}{}part_system_create_layer{}{} 或 GML 可视化等价：{}创建粒子系统{}{}{}",
    "After configuring a particle emitter to your liking, click {}Save as Preset{}&nbsp;{}&nbsp;under the \"Library\" panel (seen above) and enter a name for the new preset:&nbsp;":"在根据您的喜好配置粒子发射器后，单击\"库\"面板(如上所示)下的{}另存为预设{}{}，然后输入新预设的名称：",
    "An emitter has a region and a shape. Particles are created inside the shape stretched across the emitter\u0027s region.":"发射器有一个区域和一个形状。粒子是在整个发射器区域拉伸的形状内创建的。",
    "As briefly described above, a Particle System can be used in your game in three ways:":"如上所述，可以通过三种方式在游戏中使用粒子系统：",
    "As with creating a preset, the Link/Unlink button&nbsp;{}&nbsp;becomes highlighted to indicate that this emitter\u0027s properties are linked to the library preset.":"与创建预设一样，链接/取消链接按钮{}会突出显示，以指示该发射器的属性已链接到库预设。",
    "By creating emitters inside systems and configuring their particle settings, you can create effects ranging from fire, explosions, etc. to complicated effects that use multiple emitters, as shown above.":"通过在系统内创建发射器并配置其粒子设置，您可以创建从火灾、爆炸等到使用多个发射器的复杂效果，如上所示。",
    "By default, all emitters in the particle system are listed on the left side of the canvas. Click {}Add{} {}&nbsp;to add a new one. Click {}Delete{}&nbsp;{} to delete the selected particle emitter(s).":"默认情况下，粒子系统中的所有发射器都列在画布的左侧。单击{}添加{}{}以添加新的。单击{}删除{}{}以删除选定的粒子发射器。",
    "By passing a value for this optional {}partsys{} parameter,&nbsp;{}GameMaker{}&nbsp;will initialise the particle system for you according to how you set it up in the Particle System Editor.":"通过传递此可选的 {}partsys{} 参数的值，{}GameMaker{} 将根据您在粒子系统编辑器中的设置来初始化粒子系统。",
    "Changing Linked Emitters\u0027 Properties":"更改链接发射器的属性",
    "Click the Eye icon&nbsp;{}&nbsp;in the list to disable (pause) the emitter, and the padlock icon {} to lock it. Locking prevents changes to any of its properties, both on the canvas and in&nbsp;{}The Inspector{}.":"点击列表中的眼睛图标{}禁用(暂停)发射器，点击挂锁图标{}锁定发射器。锁定可防止更改其任何属性，无论是在画布上还是在{}检查器{}中。",
    "Click the Link/Unlink button&nbsp;{}&nbsp;to unlink an emitter from a preset. The emitter keeps the properties it got from the preset, but these can now be changed independently. Instead of being stored in the preset, they are now stored in the emitter itself.":"单击链接/取消链接按钮{}取消发射器与预设的链接。发射器保留从预设获得的属性，但现在可以单独更改这些属性。它们现在存储在发射器本身中，而不是存储在预设中。",
    "Configuring an Emitter":"配置发射器",
    "Contents":"目录",
    "Create a&nbsp;{}{}Particle System Asset{}{}&nbsp;and modify the default emitter (see&nbsp;{}Emitter Properties{})":"创建{}{}粒子系统资源{}{}并修改默认发射器(请参阅{}发射器属性{})",
    "Create the particle system yourself in&nbsp;{}GML Code{}&nbsp;using one of the built-in functions&nbsp;{}{}part_system_create{}{}/{}{}part_system_create_layer{}{}&nbsp;or in {}GML Visual{}&nbsp;using {}Create Particle System{}.":"使用 {}GML 代码{}中的一个内置函数 {}{}part_system_create{}{}/{}{}part_system_create_layer{}{} 或使用{}创建粒子系统{}在 {10}GML 可视化{11}中自己创建粒子系统。",
    "Creating A Particle System":"创建粒子系统",
    "Creating a Preset":"创建预设",
    "Doing this will override your emitter\u0027s settings with the selected preset. Click \"OK\" when asked for confirmation:&nbsp;":"执行此操作将使用选定的预设覆盖发射器的设置。当系统要求确认时，请单击\"确定\"： ",
    "Double-clicking on a Particle System asset in the Asset Browser will open this editor:":"在资源浏览器中双击粒子系统资源将打开此编辑器：",
    "Double-clicking on a Particle System asset in&nbsp;{}The Asset Browser{} will open this editor:":"双击{}资源浏览器{}中的粒子系统资源将打开此编辑器：",
    "Drag a particle system asset onto&nbsp;{}The Room Editor{}&nbsp;canvas with an Asset Layer selected. The entire particle system, including its emitters, will be added as an element to the layer. To preview the particle system in the Room Editor, press the {}Play Animation{} button {}.":"将粒子系统资源拖动到{}房间编辑器{}画布上，并选择资源层。整个粒子系统(包括其发射器)将作为元素添加到层中。要在房间编辑器中预览粒子系统，请按{}播放动画{}按钮{}。",
    "Drag a particle system asset onto&nbsp;{}The Sequence Editor{}&nbsp;canvas. This adds a new sequence track of type {}seqtracktype_particlesystem{}&nbsp;to the sequence.":"将粒子系统资源拖动到{}序列编辑器{}画布上。这会将类型为 {}seqtracktype_particlesystem{} 的新序列轨迹添加到序列中。",
    "Emitters":"发射器",
    "Emitters in a particle system can be linked to a previously created emitter preset in the library. To do this, click \"Select Particles\" under&nbsp;the \"Library\" panel and select the preset you want to use for this emitter.":"粒子系统中的发射器可以链接到库中以前创建的发射器预设。若要执行此操作，请单击\"库\"面板下的\"选择粒子\"，然后选择要用于该发射器的预设。",
    "Emitters that you create can be shared between particle system assets in your&nbsp;{}GameMaker{}&nbsp;project. This requires them to be saved in the library as {}presets{}.":"您创建的发射器可以在 {}GameMaker{} 项目中的粒子系统资源之间共享。这要求它们在库中另存为{}预设{}。",
    "Every emitter is shown, including a preview of its region and shape (rectangle, ellipse, diamond or line) in which it emits its particles. This preview can be disabled for each emitter separately.":"将显示每个发射器，包括其发射粒子的区域和形状(矩形、椭圆、菱形或线条)的预览。可以分别为每个发射器禁用该预览。",
    "For details on configuring emitters, see:&nbsp;{}Emitter Properties{}":"有关配置发射器的详细信息，请参阅：{}发射器属性{}",
    "GameMaker also comes with some built-in presets you can choose from. You can load a built-in preset into an emitter, make your changes and save it as a new preset. The built-in presets themselves can\u0027t be modified, so the preset will be unlinked the moment the emitter\u0027s settings are changed.":"GameMaker 也带有一些内置的预设，你可以从中选择。您可以将内置预设加载到发射器中，进行更改并将其另存为新预设。内置的预设本身不能被修改，所以一旦发射器的设置改变，预设就会被取消链接。",
    "In this case, the Preset shows \"Custom Particles\" to indicate they are specific to this emitter.":"在这种情况下，预设显示\"自定义粒子\"，以指示它们特定于该发射器。",
    "It contains the following:&nbsp;":"它包含以下内容：",
    "Linking an Emitter to a Preset":"将发射器链接到预设",
    "Newer particles are drawn first and older particles are drawn on top of them. Newer particles are drawn behind older ones.":"首先绘制较新的粒子，然后在其上面绘制较旧的粒子。较新的粒子被拉到较老的粒子后面。",
    "Older particles are drawn first and newer particles are drawn on top of them. Older particles are drawn behind newer ones.":"首先绘制较旧的粒子，然后在其顶部绘制较新的粒子。较老的粒子被拉到较新的粒子后面。",
    "On the other hand, the rest of the emitter properties (such as textures, colour, life, scale, etc.) are saved to the preset whenever they are changed.":"另一方面，发射器的其余属性(如纹理、颜色、寿命、比例等)。无论何时更改，都会保存到预设中。",
    "Optionally, add more emitters to achieve your desired effect":"或者，添加更多发射器以达到您想要的效果",
    "Origin &amp; Draw Order":"原点绘制顺序",
    "Origin, Draw Order &amp; Copy GML":"原点，绘图顺序 和 复制GML",
    "Particle emitters and the particles they create can be fully configured in {}The Inspector{}.":"粒子发射器及其创建的粒子可以在{}检查器{}中进行完全配置。",
    "Pass the&nbsp;{}{}Particle System Asset{}{}&nbsp;to the function/action as the optional {}partsys{} argument:&nbsp;":"将 {}{} 粒子系统资源 {}{} 作为可选的 {}partsys{} 参数传递给函数 / 动作：",
    "Right-clicking on an emitter allows you to delete, cut, copy, duplicate and rename the emitter.":"在发射器上单击鼠标右键可以删除、剪切、复制、复制和重命名发射器。",
    "Shared Emitters":"共享发射器",
    "Spawn the particle system in&nbsp;{}GML Code{}&nbsp;using one of the built-in functions&nbsp;{}{}part_system_create{}{}/{}{}part_system_create_layer{}{}&nbsp;or in {}GML Visual{}&nbsp;using {}Create Particle System{}.":"使用内置函数 {}{}part_system_create{}{}/{}{}part_system_create_layer{}{} 之一在 {0}GML Code{1} 中生成粒子系统，或者在 {}GML Visual{} 中使用 {}Create 粒子系统{}。",
    "The Canvas":"画布",
    "The Draw Order determines the order in which particles are drawn (i.e. which particles are drawn on top of others).":"绘制顺序确定绘制粒子的顺序(即，哪些粒子绘制在其他粒子之上)。",
    "The Origin and Draw Order settings are shown in the top-left corner of the canvas.":"原点和绘制顺序设置显示在画布的左上角。",
    "The Toolbox is shown in the top-right corner of the canvas.":"工具箱显示在画布的右上角。",
    "The canvas displays a preview of all particle emitters that you added to the system, and allows you to move and resize emitters.":"画布显示添加到系统中的所有粒子发射器的预览，并允许您移动发射器并调整其大小。",
    "The emitter is now {}linked&nbsp;{}to the preset. Instead of \"Select Particles\" (or \"Custom Particles\" for an emitter after unlinking), the name of the new preset is now shown under the \"Library\" panel. The Link/Unlink button&nbsp;{} is also highlighted, indicating that this emitter\u0027s properties are linked to the library preset (the properties under all panels that show the yellow chain icon on the right are linked to the preset).":"发射器现在已{}链接{}到预设。取消链接后，新预设的名称将显示在\"库\"面板下，而不是\"选择粒子\"(或取消链接后发射器的\"自定义粒子\")。链接/取消链接按钮{}也会突出显示，表示此发射器的属性链接到库预设(右侧显示黄色链条图标的所有面板下的属性都链接到预设)。",
    "The {}Copy GML to Clipboard{}&nbsp;button&nbsp;{} copies the&nbsp;{}GML Code{}&nbsp;needed to create the particle system at runtime, including its emitters and particle types to the clipboard. You can then paste that&nbsp;code&nbsp;to create a particle system that will look exactly the same. For more information, see&nbsp;{}Copy GML to Clipboard{}.":"{} 将 GML 复制到剪贴板 {} 按钮 {} 将在运行时创建粒子系统所需的 {}GML 代码 {}( 包括其发射器和粒子类型) 复制到剪贴板。然后可以粘贴该代码以创建外观完全相同的粒子系统。有关详细信息，请参见 {} 将 GML 复制到剪贴板 {}。",
    "The {}Draw Order{} determines the order in which particles are drawn (i.e. which particles are drawn on top of others).":"{} 绘制顺序 {} 确定绘制粒子的顺序 (即哪些粒子在其他粒子之上绘制)。",
    "The {}Origin{}&nbsp;and&nbsp;{}Draw Order{} as well as the&nbsp;{}Copy GML to Clipboard{}&nbsp;button are shown in the top-left corner of the canvas.":"{} 原点 {} 和 {} 绘制顺序 {} 以及 {} 将 GML 复制到图形 {} 按钮显示在画布的左上角。",
    "These are the basic steps for setting up a {}{}Particle System Asset{}{}:":"以下是设置{}{}粒子系统资源{}{}的基本步骤：",
    "This is identical to the runtime-only method of creating particles, which involves creating an empty particle system and setting up particle emitters and types:":"这与创建粒子的仅运行时方法相同，该方法涉及创建空粒子系统并设置粒子发射器和类型：",
    "Toolbox":"工具箱",
    "Unlinking an Emitter from a Preset":"取消发射器与预设的链接",
    "Use the Docking menu&nbsp;{}&nbsp;to undock/dock the emitter list, or change its position around the canvas.":"使用停靠菜单{}取消停靠/停靠发射器列表，或更改其在画布周围的位置。",
    "Using A Particle System":"使用粒子系统",
    "When a preset is modified, that change is applied to all emitters that are linked to the preset, even if they are in different particle system assets.":"修改预设时，该更改将应用于链接到该预设的所有发射器，即使它们位于不同的粒子系统资源中。",
    "When the game is run, the particle system is instantiated on the layer and starts playing immediately. The layer element added is of type&nbsp;{}layerelementtype_particlesystem{}&nbsp;(see&nbsp;{}{}layer_get_element_type{}{}).":"当游戏运行时，粒子系统在层上实例化并立即开始播放。添加的层元素类型为 {}layerelementtype_particlesystem{} (请参见 {}{}layer_get_element_type{}{}).",
    "When you create an emitter preset, the \"Emitter Settings\" (such as the distribution, shape, region) are initially saved. However, if you change these emitter settings after creating the preset, the new settings will not be saved to the preset.":"当您创建发射器预设时，最初会保存\"发射器设置\"(如分布、形状、区域)。但是，如果在创建预设后更改这些发射器设置，则不会将新设置保存到预设。",
    "You can create emitters inside a particle system. One emitter emits one type of particle.":"可以在粒子系统内创建发射器。一个发射器发射一种类型的粒子。",
    "You can use&nbsp;{}{}particle_get_info{}{}&nbsp;to get the emitters and particle types used in a particle system. You can use this to manually spawn a particle type using&nbsp;{}{}part_particles_create{}{}.":"您可以使用 {}{}particle_get_info{}{} 获取粒子系统中使用的发射器和粒子类型。您可以使用此选项使用 {}{}part_particles_create{}{} 手动生成粒子类型。",
    "{}A Particle System consists of various emitters, each of which \"emits\" a particular type of particle. A particle is simply an image that is animated according to its settings, and has a fixed lifespan.":"{}粒子系统由不同的发射器组成，每个发射器发射一个特定类型的粒子。粒子只是一个根据其设置设置动画的图像，并具有固定的寿命。",
    "{}Add To Room Editor{}{}Add To Room Editor{}":"{}添加到房间编辑器{}{}添加到房间编辑器{}",
    "{}Add To Sequence Editor{}{}Add To Sequence Editor{}":"{}添加到序列编辑器{}{}添加到序列编辑器{}",
    "{}Canvas Settings{} {}{}: Enable or disable the canvas frame here and set its origin and dimensions (default is 1366x768). You can also set a background image here to use as a reference.":"{}画布设置{} {}{}：打开或关闭此处的画布边框，并设置其原点和尺寸 (默认为 1366x768)。您还可以在此处设置背景图像作为参考。",
    "{}Click \"Save\" to confirm saving the emitter as a new preset.":"{}点击\"保存\"确认将发射器保存为新的预设。",
    "{}Create At Runtime{}{}Create At Runtime{}":"{}在运行时创建{}{}在运行时创建{}",
    "{}GameMaker{}&nbsp;also comes with some built-in presets you can choose from. You can load a built-in preset into an emitter, make your changes and save it as a new preset. The built-in presets themselves can\u0027t be modified, so the preset will be unlinked the moment the emitter\u0027s settings are changed.":"{}GameMaker{} 还提供了一些内置的预设选项供您选择。您可以将内置预设加载到发射器中，进行更改并将其保存为新预设。内置预设选项本身无法修改，因此发射器的设置更改时预设将取消链接。",
    "{}Origin indicates the position on the canvas around which transformations take place, similar to a sprite\u0027s origin. If you add a particle system asset to a sequence or to a room asset layer, its X, Y position will correspond to the origin set here.":"{}原点表示画布上发生变换的位置，类似于精灵的原点。如果将粒子系统资源添加到序列或房间资源层，则其 X、Y 位置将对应于此处设置的原点。",
    "{}The Particle System Editor{}":"{}粒子系统编辑器{}",
    "{}The Particle System Editor{}&nbsp;can be used to create visual particle effects and preview them in real-time, as they would appear in-game.":"{}粒子系统编辑器{}可用于创建视觉粒子效果并实时预览，就像它们在游戏中一样。",
    "{}Toggle Grid{}&nbsp;{}: This toggles the grid on the canvas. The caret contains more options, such as the grid size, enable/disable snap to grid and the grid colour.":"{}切换网格{} {}：这将在画布上切换网格。插入符号包含更多选项，如网格大小、启用/禁用对齐网格和网格颜色。",
    "{}Zoom Controls{} {}: Zoom in, reset zoom, zoom out, centre fit.":"{}缩放控件{} {}：放大、重置缩放、缩小、中心适配。",
    "{}{}IMPORTANT{}{}&nbsp;This adds a single track for the particle {}system{}. Individual {}emitters{} in the particle system cannot currently be animated in a sequence.":"{}{}重要{}{} 这将为粒子{}系统添加单个轨迹{}。粒子系统中的单个{}发射器{}当前不能在序列中设置动画。",
    "{}{}IMPORTANT{}{}&nbsp;This adds a single track for the whole particle system. Individual emitters in the particle system cannot be animated separately in a sequence.":"{}{}重要提示{}{}这将为整个粒子系统添加单个轨迹。粒子系统中的各个发射器不能在序列中单独设置动画。",
    "{}{}NOTE{}{}&nbsp;Shared emitters are stored per-project. They\u0027re only available in the project they\u0027re created in, and are not shared among different projects.":"{}{}注意{}{} 共享发射器按项目存储。它们仅在创建它们的项目中可用，不能在不同的项目之间共享。",
    "{}{}NOTE{}{}&nbsp;Unlike in&nbsp;{}GML Code{}, there is no way to create individual particles (e.g.&nbsp;using&nbsp;{}{}part_particles_create{}{}) in&nbsp;{}The Particle System Editor{}. All particles in&nbsp;{}The Particle System Editor{}&nbsp;are created by particle emitters (or by particles themselves, as {}Subparticles{}).":"{}{}注意{}{} 与 {}GML 代码{}不同，无法在{10}粒子系统编辑器中{11}创建单独的粒子(例如使用 {}{}part_particles_create{}{})。{}粒子系统编辑器{}中的所有粒子都是由粒子发射器(或粒子本身，作为{}子粒子{})创建的。",
    "{}{}NOTE{}{}&nbsp;You cannot get the particle system ID for particle systems that you add this way.":"{}{}注意{}{} 您无法获取以此方式添加的粒子系统的粒子系统 ID。",
    "{}{}Origin{} indicates the position on the canvas around which transformations take place, similar to a sprite\u0027s origin. If you add a particle system asset to a sequence or to a room asset layer, its X, Y position will correspond to the origin set here.":"{}{} 原点 {} 表示画布上发生变换的位置，类似于精灵的原点。如果您将粒子系统资源添加到序列或房间资源层，则其 X，Y 位置将对应于此处设置的原点。",
    "{}{}TIP{}{}&nbsp;As a layer element, the particle system can have rotation and a blend colour, which a particle system can\u0027t have by itself.{}":"{}{}提示{}{} 作为层元素，粒子系统可以具有旋转和混合颜色，这是粒子系统本身不能拥有的。{}",
    "{}{}TIP{}{}&nbsp;As a sequence track the particle system can have its position, rotation, scale, blend colour and origin&nbsp;changed.":"{}{}提示{}{} 作为序列轨迹，粒子系统可以更改其位置、旋转、比例、混合颜色和原点。"
}