{
    "As with all resources in {}GameMaker{} you should give your new path a unique name as this is what will be used to identify it throughout the game you are making, and a good system that a lot of people use is to prefix (or suffix) the resource for easy recognition in code or actions (eg: {}path_Enemy_1{} or {}PowerUp_path{}).":"与 {}GameMaker{} 中的所有资源一样，你应该给你的新路径起一个独特的名字，因为这将是你在整个游戏中用来识别它的东西，很多人使用的一个好的系统是给资源加前缀（或后缀），以便在代码或动作中容易识别（例如：{}path_Enemy_1{} 或 {}PowerUp_path{}）.",
    "As with all resources in {}GameMaker{} you should give your new path a unique name as this is what will be used to identify it throughout the game you are making, and a good system that a lot of people use is to prefix (or suffix) the resource for easy recognition in code or actions (eg: {}path_Enemy_1{} or {}PowerUp_path{}). {}":"与{}GameMaker{}中的所有资源一样，你应该给你的新路径起一个独特的名字，因为这将是你在整个游戏中用来识别它的东西，很多人使用的一个好的系统是给资源加前缀（或后缀），以便在代码或动作中容易识别（例如：{}path_Enemy_1{}或{}PowerUp_path{}）.{}",
    "It is worth noting that you can fast double click {}&nbsp;on any of the defined points in the list to pan the editor to the selected point, or slow double click {}&nbsp;on one of the values to edit it manually (x, y, or speed).":"值得注意的是，你可以快速双击{}&nbsp;列表中的任何一个定义的点，将编辑器平移到选定的点上，或者慢速双击{}&nbsp;其中的一个值，手动编辑它（X、Y或速度）。",
    "It is worth noting that you can fast double click {}&nbsp;on any of the defined points in the list to pan the editor to the selected point, or slow double click {}&nbsp;on one of the values to edit it manually (x, y, or speed).{}":"值得注意的是，你可以快速双击{}&nbsp;列表中的任何一个定义的点，将编辑器平移到选定的点上，或者慢速双击{}&nbsp;其中的一个值，手动编辑它（X、Y或速度）。",
    "Note that you can also use the following shortcuts to perform some extra operations that are not available through the right mouse button menu on the choose path point(s):":"请注意，你还可以使用以下快捷键来执行一些额外的操作，这些操作是通过鼠标右键菜单在选择路径点上无法实现的：",
    "Once you have named the path, you can start to define it by placing points in the main editor on the right, with each point being added to the list here along with its position and speed.&nbsp;The speed value for path points is defined by a percentage of the speed at which you make the instance move along the path (default is 100%). So if you start an instance at a speed of 2 (2 pixels per step) along a path and then one of the path points has a speed value of 50%, the instance will reduce speed as it approaches this points to a speed of 1 (50% of the path speed). Equally, you can set the speed to 150% and the instance will accelerate as it reaches the point. In this way you can create some nice dynamic looking movement without any code whatsoever.":"一旦你命名了路径，你就可以开始通过在右边的主编辑器中放置点来定义它，每个点都被添加到这里的列表中，同时还有它的位置和速度。&nbsp;路径点的速度值由你让实例沿着路径移动的速度的百分比来定义（默认是100%）。因此，如果你以2的速度（每步2个像素）沿着路径启动一个实例，然后其中一个路径点的速度值为50%，那么实例在接近这个点的时候会降低速度，变成1的速度（路径速度的50%）。同样地，你可以将速度设置为150%，当实例到达该点时将加速。通过这种方式，你可以创建一些看起来不错的动态运动，而不需要任何代码。",
    "Once you have named the path, you can start to define it by placing points in the main editor on the right, with each point being added to the list here along with its position and speed.&nbsp;The speed value for path points is defined by a percentage of the speed at which you make the instance move along the path (default is 100%). So if you start an instance at a speed of 2 (2 pixels per step) along a path and then one of the path points has a speed value of 50%, the instance will reduce speed as it approaches this points to a speed of 1 (50% of the path speed). Equally, you can set the speed to 150% and the instance will accelerate as it reaches the point. In this way you can create some nice dynamic looking movement without any code whatsoever. ":"一旦你命名了路径，你就可以开始通过在右边的主编辑器中放置点来定义它，每个点都被添加到这里的列表中，同时还有它的位置和速度。&nbsp;路径点的速度值由你让实例沿着路径移动的速度的百分比来定义（默认是100%）。因此，如果你以2的速度（每步2个像素）沿着路径启动一个实例，然后其中一个路径点的速度值为50%，那么实例在接近这个点的时候会降低速度，变成1的速度（路径速度的50%）。同样地，你可以将速度设置为150%，当实例到达该点时将加速。通过这种方式，你可以创建一些看起来不错的动态运动，而不需要任何代码。",
    "Paths are simply a collection of points joined together by a line. In the editor, you place these points by using the left mouse button {}. You can add points anywhere in the room editor and they will be added to the point list consecutively to make a path. If you place a point near a connecting line or another node, the new point will be inserted in the path rather than added to it (you can set the detection distance for this in the {}Preferences{}). You can press {}&nbsp;/ {} and click {}&nbsp;on already placed points to select them, and then any operations done on the path points like moving them, will be applied to all the selected points as a group. To remove a point or selection of points you can right-click {}&nbsp;and select \"Delete Point\" or press the {}&nbsp;key.":"路径只是由一条线连接起来的一个点的集合。在编辑器中，你通过使用鼠标左键{}来放置这些点。你可以在房间编辑器的任何地方添加点，它们将被连续添加到点列表中，从而形成一个路径。如果你在连接线或其他节点附近放置一个点，新的点将被插入路径中，而不是添加到路径中（你可以在{}Preferences{}中为此设置检测距离）。你可以按{}&nbsp;/ {}并点击{}&nbsp;在已经放置的点上选择它们，然后对路径上的点所做的任何操作，比如移动它们，都会作为一个组应用到所有被选中的点上。要删除一个点或选择的点，你可以右击{}&nbsp;并选择 \"删除点 \"或按{}&nbsp;键。",
    "R + {}: Rotate the path points":"R + {}: 旋转路径点",
    "S + {}: Scale the path points":"S + {}: 缩放路径点",
    "T + {}: Translate (move) the path points":"T + {}: 平移（移动）路径点",
    "The Path Editor":"路径编辑器",
    "The basic idea is rather simple - you define a path by drawing it in the path editor, then you can place an action (or code) in the creation event of an object to tell the instance to follow that particular path. You can also set the speed to follow the path and a number of other actions relating to the position and orientation of the path within the room. When you first create a path resource the path editor window will open with the following options:":"其基本思想相当简单——通过在路径编辑器中绘制路径来定义路径，然后可以在对象的创建事件中放置操作(或代码) ，告诉实例遵循该特定路径。您还可以设置跟随路径的速度，以及与房间内路径的位置和方向相关的许多其他操作。第一次创建路径资源时，路径编辑器窗口将打开，其中包含以下选项:",
    "The tool box buttons at the top are where you can control how things are drawn in the editor window. You can toggle the background grid on or off, as well as set the addition of path points to either be snapped to this grid or not:{}":"顶部的工具箱按钮是你可以控制编辑器窗口中事物的绘制方式的地方。你可以打开或关闭背景网格，也可以设置增加路径点，使之与该网格相接或不相接：{}",
    "There is an additional menu available to you in the editor window when you right click {}, shown below:":"在编辑器窗口中，当你右击{}时，有一个额外的菜单可供你使用，如下图所示。",
    "You can add points to the path clicking {}&nbsp;anywhere in the edit window, and all subsequent clicks will add further points. Once placed in the editor a point can be moved by clicking {}&nbsp;and dragging on it or by changing the values presented to you on the left for the X and Y position and speed (see {}Path Properties{}, above). You can use {}&nbsp;/ {}&nbsp;and left click {}&nbsp;on multiple points to select them together, and this group of points can then be dragged around and placed as you require. You can press {}&nbsp;to delete the selected point or points too.":"你可以在编辑窗口的任何地方点击{}&nbsp;向路径添加点，所有后续的点击都会进一步添加点。一旦在编辑器中放置了一个点，就可以通过点击{}&nbsp;并拖动它，或者通过改变左边显示的X、Y位置和速度的值来移动它（见上文{}路径属性{}）。你可以用{}&nbsp;/ {}&nbsp;和左键点击{}&nbsp;在多个点上一起选择它们，然后这组点就可以按照你的要求拖动和放置。你也可以按{}&nbsp;来删除所选的一个或多个点。",
    "You can also specify the connection kind for the whole path and whether the path should be closed or not (a closed path will connect the last point on the path with the first). The connection kind can be either {}straight line{}&nbsp;or {}smooth,&nbsp;{}where a straight line connect simply connects the points of a path in a linear basis, with angular changes at each point, while a smooth connection will create a much softer path that may not pass directly through any of the points, but rather take an approximate line, creating nice curves using {}smooth interpolation{}. You can also specify the precision for the curves (default is 4) which can be from 1 to 8 with 8 being the smoothest. The image below shows an example of how these options affect the path:":"你还可以指定整个路径的连接方式，以及路径是否应该是封闭的（封闭的路径会将路径上的最后一个点与第一个点相连）。连接方式可以是{}直线{}，也可以是{}平滑{}，其中直线连接只是将路径上的点以线性方式连接起来，每个点都有角度变化，而平滑连接将创建一个更柔和的路径，可能不会直接穿过任何一个点，而是采取近似的直线，用{}平滑插值{}创建漂亮的曲线。你还可以指定曲线的精度（默认为4），可以从1到8，8是最平滑的。下面的图片显示了这些选项如何影响路径的一个例子：",
    "You can also specify the connection kind for the whole path and whether the path should be closed or not (a closed path will connect the last point on the path with the first). The connection kind can be either {}straight line{}, or {}smooth {}where a straight line connect simply connects the points of a path in a linear basis, with angular changes at each point, while a smooth connection will create a much softer path that may not pass directly through any of the points, but rather take an approximate line, creating nice curves using {}smooth interpolation{}. You can also specify the precision for the curves (default is 4) which can be from 1 to 8 with 8 being the smoothest. The image below shows an example of how these options affect the path:":"你还可以指定整个路径的连接方式，以及路径是否应该是封闭的（封闭的路径会将路径上的最后一个点与第一个点相连）。连接方式可以是{}直线{}，也可以是{}平滑{}，其中直线连接只是将路径上的点以线性方式连接起来，每个点都有角度变化，而平滑连接将创建一个更柔和的路径，可能不会直接穿过任何一个点，而是采取近似的直线，用{}平滑插值{}创建漂亮的曲线。你还可以指定曲线的精度（默认为4），可以从1到8，8是最平滑的。下面的图片显示了这些选项如何影响路径的一个例子。",
    "{}At some point while creating your games you may need one of your instances to follow a path through a level. Now, this can be done in code by simply creating an array of positions within the room and then having an instance move between them, but that can be a chore to set up and is difficult to change, test and adapt for different instances. For this reason {}GameMaker{} has path resources and a dedicated path editor.":"{}在创建游戏的某个时刻，您可能需要一个实例来遵循通过某个级别的路径。现在，这可以在代码中完成，只需在房间内创建一个位置数组，然后让一个实例在它们之间移动，但是这可能是一个繁琐的设置，并且很难更改、测试和适应不同的实例。因此{} GameMaker {}有路径资源和专用的路径编辑器。",
    "{}Delete Points{} - Delete the selected point or points.":"{}删除点{} - 删除选定的一个或多个点。",
    "{}Each of the items in this menu work as follows:":"{}本菜单中的每个项目的工作情况如下：",
    "{}Flip{} - Flip the path along the horizontal axis.":"{}翻转{} - 沿着水平轴翻转路径。",
    "{}Mirror{} - Flip the path along the vertical axis.":"{}镜像{} - 沿垂直轴翻转路径。",
    "{}Pan To Path{} - Pan the view in the editor to the center of the path.":"{}平移到路径{} - 将编辑器中的视图平移到路径的中心。",
    "{}Path Editing{}{}Path Editing{}":"{}路径编辑{}{}路径编辑{}",
    "{}Path Points{}{}Path Points{}":"{}路径点{}{}路径点{}",
    "{}Path Properties{}{}Path Properties{}":"{}路径属性{}{}路径属性{}",
    "{}Reverse{} - Reverse the order of the path points. This doesn\u0027t move them, but rather changes the order that they will be processed in so that the start becomes the end and vice versa.":"{}反转{} - 倒转路径点的顺序。这并不是移动它们，而是改变它们的处理顺序，使起点变成终点，反之亦然。",
    "{}Reverse{} - Reverse the order of the path points. This doesn\u0027t move them, but rather changes the order that they will be processed in so that the start becomes the end and vice-versa.":"{}Reverse{} - 倒转路径点的顺序。这并不是移动它们，而是改变它们的处理顺序，使起点变成终点，反之亦然。",
    "{}The Path Editor{}":"{}路径编辑器{}",
    "{}The Toolbox{}{}The Toolbox{}":"{}工具箱{}{}工具箱{}",
    "{}The snap values indicate the size of the grid cells and this can be changed to any value you require. The rest of the tools are dedicated to zooming in and out and panning the editor area, and you can click the&nbsp;{}&nbsp;button to reset to be 1:1 with the display. Note that if you pan too far from where you want to draw the path, you can use the right mouse button {}&nbsp;menu, and then click {}Pan to Path{} to scroll back to where you were working.":"{}快照值表示网格单元的大小，这可以改变为你需要的任何数值。其余的工具专门用于放大、缩小和平移编辑区，你可以点击&nbsp;{}&nbsp;按钮来重新设置为与显示器1:1。注意，如果你平移的位置离你想画的路径太远，你可以使用鼠标右键{}&nbsp;菜单，然后点击{}平移到路径{}，就可以滚动回到你工作的地方"
}