{
    "Apart from the in-editor tools, you will also see a drop down menu at the top of the IDE.":"除了编辑器中的工具，您还将在IDE的顶部看到一个下拉菜单。",
    "At the top of the main Room Editor canvas you have a few controls to deal with how things are displayed. They are:":"在主房间编辑器画布的顶部，您可以使用几个控件来处理内容的显示方式。它们是：",
    "Below is a brief overview of each of the Room Editor sections:":"以下是房间编辑器各部分的简要概述：",
    "Certain layer types will have additional tools added to the top of the IDE in the {}Layer Toolbox{} (for example, tile layers or path layers). The exact tools will change based on the layer type currently being edited, and so are explained on&nbsp;the page explaining each layer, {}here{}.":"某些图层类型将在IDE顶部的{}图层工具箱{}中添加其他工具(例如，图块层或路径层)。确切的工具将根据当前正在编辑的层类型而变化，因此在{}此处{}解释每个层的页面上进行了说明。",
    "Filters and Effects":"滤镜和效果",
    "For paths you can create a new path layer and path resource right from within the Room Editor- or create a new path resource and then drag it into the main editor window as you would for an instance - and then edit the path and its connections in the editor window too. For tile sets, you can \"paint\" them in from the tile set editor.":"对于路径，您可以直接从房间编辑器中创建新的路径层和路径资源-或者创建一个新的路径资源，然后将其拖动到主编辑器窗口中，就像您对实例所做的那样-然后也可以在编辑器窗口中编辑路径及其连接。对于图块集，您可以从图块集编辑器中对其进行绘制。",
    "Layer Types And Properties":"图层属性",
    "Layers are created by clicking &nbsp;the appropriate button for the type of layer you want to create, which are:":"图层是通过单击要创建的图层类型的相应按钮来创建的，这些图层包括：",
    "Note that you can select and move or delete multiple assets from the same layer by holding down {}&nbsp;/&nbsp;{}&nbsp;+&nbsp;{} on the ones you want, and most resources in the room editor will permit you to rotate and scale them (singly or as a group) by clicking and holding {}&nbsp;along the outside edges or corners and dragging the mouse. You can also double click {}&nbsp;on any single asset (tiles, instances, sprites) to have the editor pan to it and open up the properties window for the selected asset in the Inspector.":"请注意，您可以通过在所需资源上按住{} / {} + {}来选择并移动或删除同一层中的多个资源，而房间编辑器中的大多数资源将允许您通过沿外边或外角单击并按住{} 并拖动鼠标来旋转和缩放它们(单独或作为一组)。您还可以在任何单个资源(图块、实例、精灵)上双击{} ，让编辑器平移到它，并在检查器中打开所选资源的属性窗口。",
    "Note that you can toggle {}inheritance{} for the layer editor which will affect layer order and visibility. The visibility itself can be set by clicking&nbsp;the eye icon {}&nbsp;beside each of the layers, or you can click&nbsp;the one at the very top to enable/disable all layers at once. You also have the possibility to \"lock\" a layer (or all of them) so that they cannot be changed by clicking the padlock icon {}. Note that layers which are flagged as invisible will&nbsp;{}not{}&nbsp;be shown when the game is run.":"请注意，您可以切换图层编辑器的{}继承{}，这将影响图层顺序和可见性。可见性本身可以通过单击每个图层旁边的眼睛图标{}来设置，或者您可以单击最上面的图标来一次启用/禁用所有图层。您还可以锁定一个图层(或所有图层)，这样就不能通过点击挂锁图标{}来更改它们。请注意，当游戏运行时，标记为隐形的图层将{}不会{}显示。",
    "Room Inheritance":"房间继承",
    "Room Menu":"房间菜单",
    "The Inspector window will show layer properties depending on the currently selected layer in the layer editor.":"检查器窗口将根据图层编辑器中当前选定的层显示图层属性。",
    "The Room Editor":"房间编辑器",
    "The center of the room editor window is taken up with the area where all the actual editing takes place. Here is where you\u0027ll be placing your instances and assets, drawing your tiles, or positioning your paths. You can zoom in and out using the mouse wheel or the room controls at the top, and you can pan around by holding the middle mouse button {}&nbsp;down and moving the mouse around or using {}&nbsp;+ {}&nbsp;while moving.":"房间编辑器窗口的中心被所有实际编辑发生的区域占据。这里是您放置实例和资源、绘制图块或定位路径的位置。您可以使用鼠标滚轮或顶部的房间控件进行放大和缩小，也可以通过按住鼠标中键{}向下移动鼠标或在移动时使用{}+{} 来平移鼠标。",
    "The room editor is where you create your game {}rooms{}. Every game requires {}at least one room to run{}, and in the room you can place instances, sprites, tiles, paths and backgrounds. Each of these different assets can be placed on their own unique {}layer {}which can then be ordered however you wish in the {}Layers Editor{}. Due to the complexity of the room editor, we\u0027ll give you first a brief overview of the most important features, and then you can find more in-depth details from the section links listed below.":"您可以在房间编辑器中创建游戏{}房间{}。每个游戏需要{}至少一个房间来运行{}，您可以在房间中放置实例、精灵、图块、路径和背景。这些不同的资源中的每一个都可以放置在它们自己的独特的{}层{}上，然后可以在{}层编辑器{}中随心所欲地进行排序。由于房间编辑器的复杂性，我们将首先简要概述最重要的功能，然后您可以从下面列出的部分链接中找到更深入的详细信息。",
    "The room editor is where you create your game {}rooms{}. Every game requires {}at least one room to run{}, and in the room you can place instances, sprites, tiles, paths, backgrounds, sequences and particle systems. Each of these different assets can be placed on their own unique {}layer {}which can then be ordered however you wish in the {}Layers Editor{}. Due to the complexity of the room editor, we\u0027ll give you first a brief overview of the most important features, and then you can find more in-depth details from the section links listed below.":"您可以在房间编辑器中创建游戏{}房间{}。每个游戏需要{}至少一个房间来运行{}，您可以在房间中放置实例、精灵、图块、路径、背景和粒子系统。这些不同的资源中的每一个都可以放置在它们自己的独特的{}层{}上，然后可以在{}层编辑器{}中随心所欲地进行排序。由于房间编辑器的复杂性，我们将首先简要概述最重要的功能，然后您可以从下面列出的部分链接中找到更深入的详细信息。",
    "The room editor places things onto layers within the room. Each layer is at a discrete \"depth\", where those that appear at the bottom of the list in the layer window will be drawn under those that appear near the top.":"房间编辑将东西放在房间内的各个图层上。每一层都有一个离散的\"深度\"，出现在图层窗口列表底部的图层将被绘制在靠近顶部的图层下面。",
    "The rulers along the edge of the canvas show you the position of the things that are placed within it, and are marked from (0, 0) which is the center of the canvas and the origin for the room. You can click and drag on the rulers to pull a horizontal or vertical guide into the room, and this guide can then be used to accurately position the different assets that are being used, as moving an asset close to one will \"snap\" it to the guide. While positioning assets within the room, smart guides will also be temporarily shown indicating the distance between assets, as well as the distance from the room boundary or center point.":"画布边缘的尺子向您显示放置在其中的物品的位置，并从(0，0)开始标记，(0，0)是画布的中心和房间的原点。您可以在尺子上单击并拖动以将水平或垂直参考线拖入房间，然后该参考线可用于准确定位正在使用的不同资源，因为将资源移动到靠近某一资源会将其与参考线相关联。在房间内定位资源的同时，还将临时显示智能参考线，指示资源之间的距离，以及与房间边界或中心点的距离。",
    "The status bar is used to show you context specific information. The status bar will always show you where in the room the mouse cursor is, but it will also show additional information based on the layer being edited, the tool being used and the state of that tool.":"状态栏用于显示特定于上下文的信息。状态栏将始终向您显示鼠标光标在房间中的位置，但它还将根据正在编辑的层、正在使用的工具和该工具的状态显示其他信息。",
    "The user interface for the Room Editor is simple to navigate and split in various discrete sections. Those parts of the editor that are docked - {}The Inspector{}&nbsp;that shows the&nbsp;{}room or layer properties{}&nbsp;and the {}Layer Editor{}&nbsp;- can also be removed from the dock by simply dragging them out into the workspace, and they can be added back into the docks again by dragging them to the sides or the bottom of the workspace.":"房间编辑器的用户界面易于导航，并可拆分成不同的独立部分。编辑器中停靠的那些部分-显示{2}房间或层属性{3}的{}检查器{}和{}层编辑器{}-也可以从停靠区中移除，只需将它们拖到工作区中，然后通过将它们拖到工作区的侧面或底部，就可以将它们重新添加到停靠区中。",
    "The user interface for the room editor is simple to navigate and split in various discrete sections. Those parts of the editor that are docked - the {}Inspector{} that shows the&nbsp;{}room or layer properties{}&nbsp;and the {}layer editor{}&nbsp;- can also be removed from the dock by simply dragging them out into the workspace, and they can be added back into the docks again by dragging them to the sides or the bottom of the workspace.":"房间编辑器的用户界面易于导航，并可拆分成不同的独立部分。编辑器中停靠的那些部分-显示{2}房间或层属性{3}的{}检查器{}和{}层编辑器{}-也可以从停靠区中移除，只需将它们拖到工作区中，然后通过将它们拖到工作区的侧面或底部，就可以将它们重新添加到停靠区中。",
    "The user interface for the room editor is simple to navigate and split in various discrete sections. Those parts of the editor that are docked - {}The Inspector{}&nbsp;that shows the&nbsp;{}room or layer properties{}&nbsp;and the {}layer editor{}&nbsp;- can also be removed from the dock by simply dragging them out into the workspace, and they can be added back into the docks again by dragging them to the sides or the bottom of the workspace.":"房间编辑器的用户界面易于导航，并可拆分为多个独立的部分。编辑器停靠的部分-显示 {} 房间或图层属性 {} 的 {} 检查器 {} 和 {} 图层编辑器 {}- 也可以通过简单地将其拖到工作区中从停靠区中移除，并且可以通过将它们拖到工作区的侧面或底部来将它们再次添加回坞站中。",
    "This layer is for placing tiles from {}tile sets{}&nbsp;as {}tile map{}{}s{}.":"此图层用于将{}图块集{} 中的图块放置为{}图块地图{}{}{}。",
    "This layer is for placing&nbsp;{}instances{} that will be used in the room.":"该图层用于放置将在房间中使用的{}实例{}。",
    "This layer is for showing and adding {}paths{} in the room.":"此图层用于展示和添加房间内的{}路径{}。",
    "This layer is for visual assets to be added to the room, like {}sprites{} and {}sequences{}.":"该图层用于将可视资源添加到房间，如{}精灵{}和{}序列{}。",
    "This layer is for visual assets to be added to the room, like {}sprites{},&nbsp;{}sequences{}&nbsp;and&nbsp;{}particles{}.":"该图层用于将可视资源添加到房间，如{}精灵{}、{}序列{}和{}粒子{}。",
    "This type of layer defines a background, which is essentially a single colour or sprite image that may be tiled over the whole room.":"这种类型的图层定义了一个背景，它本质上是可以图块在整个房间上的单色或精灵图像。",
    "This type of layer defines a {}filter/effect{} that is applied to all layers below it.":"此类型的图层定义了应用于其下所有图层的{}滤镜/效果{}。",
    "When creating asset layers or instance layers, you can place the asset or instance by simply dragging it from the Asset Browser and then dropping it where you want it to be positioned. Alternatively you can select an asset or instance from the Asset Browser and then press and hold {}&nbsp;to preview the resource \"in-situ\", and if you additionally click the left mouse button {}&nbsp;you can add the instance and even \"paint\" it into the room layer by maintaining the button pressed and dragging the mouse. Note that by default instances and sprites that are added to a room in this way will be snapped to the defined room grid settings, but you can hold down&nbsp;{}&nbsp;/&nbsp;{} to have the instance follow the mouse precisely and not snap (releasing {}&nbsp;/&nbsp;{}&nbsp;will permit snapping again).":"创建资源层或实例层时，只需从资源浏览器中拖动资源或实例，然后将其放在希望放置的位置，即可放置资源或实例。或者，您可以从资源浏览器中选择资源或实例，然后按住{} 以\"就地\"预览资源，如果另外单击鼠标左键{} ，则可以添加实例，甚至通过按住按钮并拖动鼠标将其\"绘制\"到房间层中。请注意，默认情况下，以这种方式添加到房间的实例和精灵将捕捉到定义的房间网格设置，但您可以按住 {} / {}以使实例精确地跟随鼠标而不捕捉(释放{} / {} 将允许再次捕捉)。",
    "When the room asset is selected in the Asset Browser, the Inspector shows all the base properties for the room, like its size, whether it uses physics, or any cameras and viewports it requires. These can be changed here as well. This section is dicussed in more detail on the&nbsp;{}Room Properties page{}.":"在资源浏览器中选择房间资源后，检验器将显示房间的所有基本属性，如大小、是否使用物理或所需的任何摄影机和视口。这些也可以在这里更改。此部分在{}房间属性页面{}上进行了更详细的讨论。",
    "When you create a room asset, you can right click {}&nbsp;on it in the Asset Browser to open the context menu, which will permit you to create {}child rooms {}(see the page on {}Inheritance{} for more information), open up the room for editing, add a new resource group to better organise the rooms, rename the room or delete it. Note that to change the room order and/or inheritance you need to use the {}Room Manager{}, which you can open using the menu in the top right of the Asset Browser.":"创建房间资源时，可以在资源浏览器中右键单击{}以打开上下文菜单，该菜单允许您创建{}多个子房间{}(有关详细信息，请参阅{}继承页面{})、打开房间以进行编辑、添加新资源组以更好地组织房间、重命名房间或将其删除。请注意，要更改房间顺序和/或继承，需要使用{}房间管理器{}，您可以使用资源浏览器右上角的菜单打开该管理器。",
    "When you create a room asset, you can right click {}&nbsp;on it in the Asset Browser to open the context menu, which will permit you to create {}child rooms {}(see the page on {}Inheritance{} for more information), open up the room for editing, add a new resource group to better organise the rooms, rename the room or delete it. Note that to change the room order and/or inheritance you need to use {}The Room Manager{}, which you can open using the menu in the top right of the Asset Browser.":"创建房间资源时，可以在资源浏览器中右键单击 {} 以打开上下文菜单，这将允许您创建 {} 子房间 {}( 有关详细信息，请参阅 {} 继承 {} 页面)，打开房间进行编辑，添加新的资源组以更好地组织房间，重命名房间或将其删除。请注意，要更改房间顺序和 / 或继承，您需要使用 {}\" 房间管理器 \"{}，您可以使用 \" 资源浏览器 \" 右上角的菜单打开该菜单。",
    "When you create a room asset, you can right click {}&nbsp;on it in&nbsp;{}The Asset Browser{} to open the context menu, which will permit you to create {}child rooms {}(see the page on&nbsp;{}Room Inheritance{} for more information), open up the room for editing, add a new asset group to better organise the rooms, rename the room or delete it. Note that to change the room order and/or inheritance you need to use {}The Room Manager{}, which you can open using the menu in the top right of the Asset Browser.":"创建房间资源时，可以在{}资源浏览器{}中右键单击{}以打开上下文菜单，该菜单允许您创建{}多个子房间{}(有关详细信息，请参阅{}继承页面{})、打开房间以进行编辑、添加新资源组以更好地组织房间、重命名房间或将其删除。请注意，要更改房间顺序和/或继承，需要使用{}房间管理器{}，您可以使用资源浏览器右上角的菜单打开该管理器。",
    "You can also create a layer folder using the folder button {}&nbsp;where you can group selected layers together, as well as delete the selected layers with the delete button&nbsp;{}. Each of these layer types are discussed {}here{} in more detail.":"您还可以使用文件夹按钮{} 创建一个图层文件夹，其中可以将选定的图层组合在一起，也可以使用删除按钮 {}删除选定的图层。这些图层类型中的每一种都在{}此处{}更详细地讨论。",
    "You can get more information about some of the above mentioned sections from the following pages:":"您可以从以下页面获取有关上述部分的更多信息：",
    "{} Each window will have the different properties and lists associated with the currently selected layer type, and you will be able to edit fundamental details for how the layer is displayed and what is actually on the layer. Please see {}here{} for more detail.":"{}每个窗口将具有与当前选定的图层类型相关联的不同属性和列表，您将能够编辑有关图层的显示方式和图层上实际内容的基本详细信息。有关更多详细信息，请参阅{}此处{}。",
    "{}&nbsp;{}Canvas Zoom Controls{}: These buttons control the current canvas zoom level. You can zoom in or out and clicking the {}&nbsp;button will reset the canvas to be 1:1 with the room being edited. You can also click the Window Fit button {}&nbsp;to make the entire room canvas fit within the current editor workspace (this will zoom in/out as appropriate to make it fit). Note that you can also zoom in and out using the {}&nbsp;/&nbsp;{} and the Mouse Wheel {}, and pressing {}&nbsp;/&nbsp;{}&nbsp;+&nbsp;{}&nbsp;will set the room canvas to be 1:1 with the room settings.":"{}{} 画布缩放控件 {}：这些按钮控制当前画布的缩放级别。您可以放大或缩小，单击 {} 按钮会将画布与正在编辑的房间重置为 1：1。您还可以单击窗口适合按钮 {}，使整个工作室画布适合当前编辑器工作区 (这将根据需要进行放大 / 缩小)。请注意，您也可以使用 {}/{} 和鼠标滚轮 {} 进行放大和缩小，按下 {}/{}+{} 将房间画布设置为 1：1。",
    "{}&nbsp;{}Toggle Canvas Grid{}: This will toggle on/off the Room Editor canvas grid. This is a grid that {}GameMaker{} draws over the main canvas to divide it into sections, and by default is set to 32x32px in size. However if you click the Grid Menu icon {}&nbsp;you will open the grid options:{}These options permit you to set the grid colour and alpha, as well as the cell values for the grid along the X and Y axis. You also have an option to enable or disable grid snapping here (enabled by default). You can use the keyboard shortcuts \"G\" and {}&nbsp;+ \"G\" to toggle the grid visibility and grid snapping respectively.":"{}{} 切换画布网格 {}：这将打开 / 关闭房间编辑器画布网格。这是一个网格，由 {}GameMaker{} 在主画布上绘制，以将其划分为多个部分，默认情况下大小设置为 32x32px。但是，如果您单击网格菜单图标 {}，您将打开网格选项：{} 这些选项允许您设置网格颜色和 Alpha，以及沿 X 和 Y 轴的网格的单元格值。您还可以选择在此处启用或禁用栅格捕捉 (默认情况下启用)。您可以使用键盘快捷键 \"G\" 和 {}+\"G\" 分别切换栅格可见性和栅格捕捉。",
    "{}Assets{}":"{}资源{}",
    "{}Background{}":"{}背景{}",
    "{}Convert Image To Tile Map{}:&nbsp;The Convert Image To Tile Map option is a powerful tool that can be used to import a single image and then extract the tiles used from the image and recreate it as a tile map layer in the room editor, creating the required tile set and sprite as part of process. When you select this tool, you will be asked to supply an uncompressed image file ({}PNG{}, {}GIF {}or {}BMP{}) which will then be loaded. On load you will be presented with the {}Image Import{} tool:{} {}Here you are given options on how to split up the tile when creating the tile set, and you can set the cell width and height as well as any offsets required around the edges. You can also set the approximate width (in pixels) for the final sprite that is created. For example, if the tile set is made up of 64x64 tile cells and you set a width here of 200, the final sprite that is created for use in the tile set will be 192 pixels wide (ie: 3 tile cells). If you leave it at the default value of 0, then {}GameMaker{} will attempt to make as \"square\" a sprite as possible with approximately the same number of horizontal and vertical tile cells.{} {} After setting the way the image is to be split, clicking the swatch beside the {}Remove Colour{} option will open the colour picker and permit you to select a colour that is to be removed from the final sprite. This is usually a background colour that you want to remove and setting this swatch to anything other than 100% transparent (alpha 0) will remove the selected colour on import.{} {} Finally, you have the option to name the sprite, tile set and tile map layer that will be created for you by this tool. When you finalise the import, a sprite with all the images laid out in a grid will be created, as well as a tile set from this sprite. In the room, a new tile map layer will be created and the image reproduced using the generated tile set. Note that the tool will {}not {}duplicate tiles and will instead recognise when a cell has image data that coincides with another cell (this includes rotated tiles). You can see this in the following image where only one flower tile has been created and one crate tile too, yet there are multiple instances of both, with some instances rotated in the base image:{} {} ":"{}将图像转换为图块映射{}： 将图像转换为图块映射选项是一个强大的工具，可用于导入单个图像，然后从图像中提取使用的图块，并将其重新创建为房间编辑器中的图块贴图层，创建所需的图块集和精灵作为过程的一部分。当您选择此工具时，系统将要求您提供一个未压缩的图像文件({}PNG{}、{}GIF{}或{}BMP{})，然后将加载该文件。加载后，您将看到{}图像导入{}工具：{}{}在这里，您可以选择在创建图块集时如何拆分图块，您可以设置单元格宽度和高度以及围绕边缘所需的任何偏移量。还可以设置创建的最终精灵的近似宽度(以像素为单位)。例如，如果图块集由64x64图块单元格组成，而您在此处设置的宽度为200，则为在图块集中使用而创建的最终精灵将是192像素宽(即：3个图块单元格)。如果您将其保留为默认值0，则{}GameMaker{}将尝试使用大致相同数量的水平和垂直图块单元格使精灵尽可能地呈正方形。{}{}设置图像拆分方式后，单击{}移除颜色{}选项旁边的样本将打开颜色选择器，并允许您选择要从最终精灵中移除的颜色。这通常是您想要移除的背景颜色，将此样例设置为100%透明(Alpha 0)以外的任何颜色都会在导入时移除选定的颜色。{}{}最后，您可以选择命名将由此工具为您创建的精灵、图块集和图块贴图层。当您完成导入时，将创建一个在网格中布局所有图像的精灵，以及从此精灵设置的图块。在房间中，将创建一个新的图块地图层，并使用生成的图块集重现图像。请注意，该工具{}不会{}复制图块，而是会识别一个单元格的图像数据是否与另一个单元格一致(包括旋转的图块)。您可以在下图中看到这一点，其中只创建了一个鲜花图块和一个板条箱图块，但两者都有多个实例，其中一些实例在基础图像中旋转：{}{}",
    "{}Filter/Effect{}":"{}滤镜/效果{}",
    "{}Instance Creation Order{}:&nbsp;This will open the {}Instance Creation Order Window {}(which can also be opened by using the button in the {}Room Properties{}{}&nbsp;{}window):{} {}This window lists all the instances in the room in the order that they will be created (from top to bottom). Should you require a specific instance to be created before any other, you can simply click {}&nbsp;and drag it to the position your require. ":"{}实例创建顺序{}：这将打开{}实例创建顺序窗口{}(也可以通过使用{}房间属性{}{}{}窗口中的按钮打开)：{}{}此窗口按创建顺序(从上到下)列出房间中的所有实例。如果您需要在创建任何其他实例之前创建特定实例，只需单击{}并将其拖动到您需要的位置即可。",
    "{}Instance Creation Order{}:&nbsp;This will open the {}Instance Creation Order Window {}(which can also be opened by using the button in the&nbsp;{}Room Properties{} window):{} {}This window lists all the instances in the room in the order that they will be created (from top to bottom). Should you require a specific instance to be created before any other, you can simply click {}&nbsp;and drag it to the position your require. ":"{}实例创建顺序{}：将打开{}实例创建顺序窗口{}(也可以使用{}房间属性{}窗口中的按钮打开)：{}{}此窗口按创建顺序(从上到下)列出房间中的所有实例。如果您需要先创建特定实例，只需单击{}并将其拖动到所需位置即可。",
    "{}Instances{}":"{}实例{}",
    "{}Layer Editor{}{}Layer Editor{}":"{}图层编辑器{}{}图层编辑器{}",
    "{}Layer Properties{}{}Layer Properties{}":"{}图层属性{}{}图层属性{}",
    "{}Layer Toolbox{}{}Layer Toolbox{}":"{}图层工具箱{}{}图层工具箱{}",
    "{}Layer View{}: This will re-open the Layer Editor window should you have closed it at any time.":"{}图层视图{}：这将重新打开图层编辑器窗口，如果您在任何时候关闭它的话。",
    "{}Paths{}":"{}路径{}",
    "{}Reset Windows On Current Desktop{}:&nbsp;This will reset the room editor window layout to its default values for the desktop workspace currently focused.":"{}重置当前桌面上的窗口{}： 这会将房间编辑器窗口布局重置为当前关注的桌面工作区的默认值。",
    "{}Room Canvas{}{}Room Canvas{}":"{}房间画布{}{}房间画布{}",
    "{}Room Properties{}":"{}房间属性{}",
    "{}Room Properties{}{}Room Properties{}":"{}房间属性{}{}房间属性{}",
    "{}Room Toolbox{}{}Room Toolbox{}":"{}房间工具箱{}{}房间工具箱{}",
    "{}Rulers / Guides{}{}Rulers / Guides{}":"{}尺子/参考线{}{}尺子/参考线{}",
    "{}Status Bar{}{}Status Bar{}":"{}状态栏{}{}状态栏{}",
    "{}The Room Editor{}":"{}房间编辑器{}",
    "{}The Room Editor{} is where you create your game {}rooms{}. Every game requires {}at least one room to run{}, and in the room you can place instances, sprites, tiles, paths, backgrounds, sequences and particle systems. Each of these different assets can be placed on their own unique {}layer {}which can then be ordered however you wish in the {}Layer Editor{}. Due to the complexity of the Room Editor, we\u0027ll give you first a brief overview of the most important features, and then you can find more in-depth details from the section links listed below.":"您可以在{}房间编辑器{}中创建游戏{}房间{}。每个游戏需要{}至少一个房间来运行{}，您可以在房间中放置实例、精灵、图块、路径、背景和粒子系统。这些不同的资源中的每一个都可以放置在它们自己的独特的{}层{}上，然后可以在{}层编辑器{}中随心所欲地进行排序。由于房间编辑器的复杂性，我们将首先简要概述最重要的功能，然后您可以从下面列出的部分链接中找到更深入的详细信息。",
    "{}The Room Editor{} is where you create your game {}rooms{}. Every game requires {}at least one room to run{}, and in the room you can place instances, sprites, tiles, paths, backgrounds, sequences and particle systems. Each of these different assets can be placed on their own unique {}layer {}which can then be ordered however you wish in the {}Layers Editor{}. Due to the complexity of the room editor, we\u0027ll give you first a brief overview of the most important features, and then you can find more in-depth details from the section links listed below.":"{} 房间编辑器 {} 是您创建游戏 {} 房间 {} 的地方。每个游戏都需要 {} 至少一个房间来运行 {}，在房间中您可以放置实例，精灵，瓷砖，路径，背景，序列和粒子系统。这些不同的资源中的每一个都可以放置在它们自己独特的 {} 层 {} 上，然后可以在 {} 层编辑器 {} 中按照您的意愿对其进行排序。由于房间编辑器的复杂性，我们将给予您最重要功能的简要概述，然后您可以从下面列出的部分链接中找到更深入的详细信息。",
    "{}The distance that assets \"snap\" to guides, as well as other properties, can be set in the {}Room Editor Preferences{}.":"{}资源与参考线的距离以及其他属性可在{}房间编辑器首选项{}中设置。",
    "{}The room editor is itself a {}workspace{} and as such you can click {}&nbsp;on the tab and drag it off of the main window into a new window of its own - perhaps in another display, for example. You can also place it back into the main window by dragging the tab to the top of the IDE and releasing the mouse button.":"{}房间编辑器本身就是一个{}工作区{}，因此您可以单击选项卡上的{} ，并将其从主窗口拖到它自己的新窗口中--例如，在另一个显示中。也可以通过将选项卡拖到IDE的顶部并释放鼠标按钮，将其放回到主窗口中。",
    "{}These menus are explained below:":"{}这些菜单的说明如下：",
    "{}Tile Editing{}: When working with a tile layer, this option will be highlighted in the drop down menu. It has the following sub-menu:{} {}When editing the tile layer you can select multiple tiles by clicking, holding down and dragging the left mouse button {}, or you can select and group individual tiles using {}&nbsp;/&nbsp;{} + {}, or remove individual tiles from the selection using {}&nbsp;+ {}. From this menu you can then clear the selection or invert it as well as cut, copy or paste the selection to another layer (or even the same layer but in another position). The final option will re-open the tile set editor docked window should you have closed it. ":"{}图块编辑{}：使用图块层时，此选项将在下拉菜单中突出显示。它具有以下子菜单：{} {}在编辑图块层时，您可以通过单击、按住并拖动鼠标左键{}来选择多个图块，也可以使用{} / {}+{}选择单个图块并对其进行分组，或者使用{}+{}从所选内容中删除各个图块。然后，您可以从该菜单中清除选定内容或将其反转，以及将选定内容剪切、复制或粘贴到另一层(甚至是同一层，但位置不同)。最后一个选项将重新打开图块集编辑器停靠的窗口(如果已将其关闭)。",
    "{}Tile Maps{}":"{}图块地图{}",
    "{}{}&nbsp;Canvas Select From Any Layer{}: By default when you click on an element in the room canvas you will only be able to select those assets that are on the layer currently being edited, however if you enable this option you can then click on any element and it will be selected, changing the target layer to the one that the element is on. You can use the keyboard shortcut \" {}P{}\" to temporarily enable this (hold \"{}P{}\" to enable and release to disable) {}&nbsp;{} ":"{}{}从任意层中选择画布{}：默认情况下，当您单击房间画布中的某个元素时，您将只能选择当前正在编辑的层上的那些资源，但是，如果您启用此选项，则可以单击任何元素并将其选中，从而将目标层更改为该元素所在的层。您可以使用键盘快捷键\"{}P{}\"临时启用此功能(按住\"{}P{}\"可启用，松开可禁用){} {}",
    "{}{}&nbsp;Play Animations{}: When adding sprites, sequences or animated tiles, you may want to get an idea of how these will look within the room itself without having to compile the whole project, and so you can click this to start all the different animations playing. Clicking it again will stop the animation.":"{}{}播放动画{}：当添加精灵、序列或动画图块时，您可能希望了解这些动画在房间中的外观，而不必编译整个项目，因此您可以单击此按钮开始播放所有不同的动画。再次单击它将停止动画。",
    "{}{}&nbsp;Show Views{}: Clicking this will enable or disable the view rectangle. When enabled you will see a highlighted area that signifies the different views that are enabled for the room.":"{}{}显示视图{}：单击此选项将启用或禁用视图矩形。启用后，您将看到一个高亮显示的区域，该区域表示为房间启用的不同视图。",
    "{}{}IMPORTANT{}{}&nbsp;There is a minimum and maximum layer depth of -16000 to 16000. Anything placed on a layer outside that range will not be drawn although all events will still run as normal for anything on the layer.":"{}{}重要{}{} 有一个最小和最大的图层深度在-16000到16000之间。放置在该范围之外的图层上的任何内容都不会被绘制，尽管该图层上的所有事件仍将正常运行。",
    "{}{}IMPORTANT{}{}&nbsp;There is a minimum and maximum layer depth of&nbsp;{}-16000{} to {}16000{}. Anything placed on a layer outside that range will not be drawn although all events will still run as normal for anything on the layer.":"{}{}重要信息{}{}最小和最大层深度为{}-16000{}到{}16000{}。放置在该范围之外的层上的任何内容都不会被绘制，尽管所有事件仍将正常运行。",
    "{}{}NOTE{}{}&nbsp;Layers which are flagged as invisible will&nbsp;{}not{}&nbsp;be shown when the game is run.":"{}{}注意{}{} 当游戏运行时，标记为隐形的图层将{}不会{}显示。",
    "{}{}NOTE{}{}&nbsp;You can toggle {}inheritance{} for the layer editor which will affect layer order and visibility. The visibility itself can be set by clicking&nbsp;the eye icon {}&nbsp;beside each of the layers, or you can click&nbsp;the one at the very top to enable/disable all layers at once. You also have the possibility to \"lock\" a layer (or all of them) so that they cannot be changed by clicking the padlock icon {}.":"{}{}注意{}{} 您可以切换图层编辑器的{}继承{}，这将影响图层顺序和可见性。可见性本身可以通过单击每个图层旁边的眼睛图标{}来设置，或者您可以单击最上面的图标来一次启用/禁用所有图层。您还可以锁定一个图层(或所有图层)，这样就不能通过点击挂锁图标{}来更改它们。",
    "{}{}The Room Editor{} is itself a {}workspace{} and as such you can click {}&nbsp;on the tab and drag it off of the main window into a new window of its own - perhaps in another display, for example. You can also place it back into the main window by dragging the tab to the top of the IDE and releasing the mouse button.":"{}{} 房间编辑器 {} 本身就是一个 {} 工作区 {}，因此您可以单击 {} 选项卡，然后将其从主窗口拖到自己的新窗口中-例如，可能在另一个显示中。您也可以通过将选项卡拖到 IDE 的顶部并释放鼠标按钮，将其放回主窗口。"
}