{
    "A {}Sequence {}is essentially a collection of assets that perform a dynamic animation over time. They can contain sprites, instances, sounds and other things, and each of these can be set to move or change colour, or start/stop animating over time within the sequence itself. The assets you add are assigned to specific {}tracks {}within the sequence and these tracks can then have different attributes applied to them - called {}keyframes{}&nbsp;- which can be static or change over time. All editing of a sequence takes place in the {}Sequence Editor{} which is essentially comprised of three areas:":"{}序列{}实质上是随时间执行动态动画的资源的集合。它们可以包含精灵、实例、声音和其他内容，并且每个这些内容都可以设置为移动或更改颜色，或者在序列本身内随着时间的推移开始/停止动画。您添加的资源将分配给序列中的特定{}轨道{}，然后这些轨道可以应用不同的属性-称为{}关键点{}-这些属性可以是静态的，也可以随着时间的推移而变化。序列的所有编辑都在{}序列编辑器{}中进行，该编辑器基本上由三个区域组成：",
    "All parameter keys are stored in additional {}parameter tracks{} which are a subset of tracks under the main asset track in the Track Panel, and you can edit the parameter key data for each parameter in the track editor.":"所有参数键都存储在另外的{}轨道参数{}中，这些轨道是\"轨道面板\"中主资源轨道下的轨道的子集，您可以在轨道编辑器中编辑每个参数的参数键数据。",
    "As mentioned above, you can add {}Moments{}&nbsp;to a sequence. A sequence {}moment {}is a position on the timeline where the sequence can call a {}function{}. This is a {}scripted function{}&nbsp;that must have no parameters and when the moment (frame) on the timeline is reached, this function will be called. To set a moment, you simply move the playhead to the required position and then click the {}Add Moment{} button, and in the dialog that opens you give the name of the function to call.":"如上所述，您可以将 {} 时刻 {} 添加到序列中。序列{} 时刻 {} 是时间线上序列可以调用 {} 函数 {} 的位置。这是一个 {} 脚本函数 {}，必须没有参数，当到达时间线上的时刻 (帧) 时，将调用此函数。要设置时间，只需将播放头移动到所需位置，然后单击 {} 添加时间 {} 按钮，然后在打开的对话框中指定要调用的函数的名称。",
    "At this point, you\u0027ll usually want to position the asset in the canvas at its initial position for the start of the sequence, and add in any initial transforms, like scale or rotation.":"此时，您通常希望在画布中将资源定位在序列起点的初始位置，并添加任何初始变换(如缩放或旋转)。",
    "Before continuing to explain the details of the editor, we\u0027ll take a moment to explain how a sequence is created as well as some keywords that are used in the descriptions so you\u0027ll have a more thorough understanding of how the Sequence Editor works. The general workflow for creating a sequence is as follows:":"在继续解释编辑器的细节之前，我们将花一点时间来解释如何创建序列以及描述中使用的一些关键字，以便您更全面地了解序列编辑器的工作原理。创建序列的一般工作流程如下：",
    "Before continuing to explain the details of the editor, we\u0027ll take a moment to explain how a sequence is created as well as some keywords that are used in the descriptions so you\u0027ll have a more thorough understanding of how the Sequences Editor works. The general workflow for creating a sequence is as follows:":"在继续解释编辑器的详细信息之前，我们将花一些时间解释如何创建序列以及描述中使用的一些关键字，以便您能够更全面地了解序列编辑器的工作原理。创建序列的常规工作流如下：",
    "Below you can find an overview of each of the features of the Sequence Editor, and at the bottom of this page are links to pages that explain the three main features mentioned above in more depth:":"您可以在下面找到序列编辑器的每个功能的概述，并且在此页面的底部是指向更深入地解释上述三个主要功能的页面的链接：",
    "Below you can find an overview of each of the features of the sequence editor, and at the bottom of this page are links to pages that explain the three main features mentioned above in more depth:":"下面您可以找到序列编辑器的每个功能的概述，并且在此页面的底部是指向页面的链接，这些页面更深入地解释了上述三个主要功能：",
    "Broadcast Messages":"广播消息",
    "Clipping Masks":"剪切蒙版",
    "Due to the initial complexity of the Sequence Editor, we have only given a brief overview of the features available here, but we have additional pages listed below that go into more depth about its features and how they can be used:":"由于序列编辑器的初始复杂性，我们只对此处提供的功能进行了简要概述，但下面列出了更多页面，这些页面更深入地介绍了序列编辑器的功能以及如何使用这些功能：",
    "Each asset added to the canvas can be manipulated in multiple ways - rotated, transformed, or translated - based on how you interact with it, as each asset will have a {}bounding box{} and {}transform {}gizmos{}{} as well as {}bounding box controls{}. All this is explained in more detail on the page about the {}Sequence Editor Canvas{}.":"添加到画布中的每个资源都可以基于与其交互的方式以多种方式进行操作(旋转、转换或转换)，因为每个资源将具有{}边界框{}和{}转换{}小工具{}{}以及{}边界框控件{}。所有这些都将在关于{}序列编辑器画布{}的页面上进行更详细的说明。",
    "Each event can be assigned a single function which will be called when the event is triggered. You can assign the function using the input box for the event, and clicking the arrow button &nbsp;will open the script editor for the function to be edited. You can also click the Create New button at the bottom to create a new script resource with \"boilerplate\" functions already defined and ready to be filled in. Note that you can change the function names to anything you require and do not have to use the predefined names, and you can also remove any function definitions that you don\u0027t need. It is important note that functions used for sequence events cannot take any arguments.":"每个事件都可以分配一个函数，当触发事件时将调用该函数。您可以使用事件的输入框指定函数，单击箭头按钮将打开要编辑的函数的脚本编辑器。您也可以单击底部的 \" 新建 \" 按钮，创建一个新的脚本资源，其中 \"boilerplate\" 函数已定义并准备好填写。请注意，您可以将函数名称更改为所需的任何名称，而不必使用预定义的名称，还可以删除不需要的任何函数定义。需要注意的是，用于序列事件的函数不能采用任何参数。",
    "Events are added by clicking the {}Add Event{} button {}&nbsp;which will open the following window:":"通过单击{}添加事件{}按钮{}可添加事件，该按钮将打开以下窗口：",
    "First you\u0027d create your sequence from the {}Asset Browser{}, which will open it the Sequences Editor.":"首先，您将从{}资源浏览器{}创建序列，该浏览器将在序列编辑器中打开序列。",
    "First you\u0027d create your sequence from {}The Asset Browser{}, which will open it the Sequence Editor.":"首先，您将从{}资源浏览器{}创建序列，这将在序列编辑器中打开序列。",
    "First you\u0027d create your sequence from {}The Asset Browser{}, which will open it the Sequences Editor.":"首先，您将从{}资源浏览器{}创建序列，该浏览器将在序列编辑器中打开序列。",
    "In a similar way to regular objects, sequences can have events that can run some code assigned to them. The code is assigned in the form of a {}scripted function{}&nbsp;which can take no arguments and will be called when the event is triggered.":"与常规对象类似，序列可以具有可以运行分配给它们的某些代码的事件。代码以{}脚本函数{}的形式分配，该函数不能采用任何参数，并且在触发事件时将被调用。",
    "Next you\u0027d change the position of the {}playhead{} (the current play position in the dope sheet timeline) and then move or change the asset transforms and record another parameter key.":"接下来你要改变{}播放头{}的位置(关键点表时间线中的当前播放位置)，然后移动或改变资源转换，并记录另一个参数键。",
    "Next you\u0027d drag an asset (sprite, object, sound or sequence) into the editor canvas.":"接下来，将资源(精灵、对象、声音或序列)拖动到编辑器画布中。",
    "Note too that you can have sequences within sequences to create complex animations and effects, and sequences can also be accessed and changed through code to give you as much control as possible over how they will be displayed and used in your game. For more information on the coded aspect of sequences, please see the section on the {}Sequence Functions{}&nbsp;page.":"还请注意，您可以在序列中包含序列以创建复杂的动画和效果，并且序列也可以通过代码访问和更改，以便给予您尽可能多的控制权，控制它们在游戏中的显示和使用方式。有关序列编码方面的更多信息，请参阅{}序列函数{}页面上的部分。",
    "Note too that you can have sequences within sequences to create complex animations and effects, and sequences can also be accessed and changed through code to give you as much control as possible over how they will be displayed and used in your game. For more information on the coded aspect of sequences, please see the section on the {}Sequences Functions{}.":"请注意，您可以在序列中使用序列来创建复杂的动画和效果，也可以通过代码访问和更改序列，以便尽可能多地控制它们在游戏中的显示和使用方式。有关序列编码方面的详细信息，请参阅{}序列函数{}一节。",
    "Now you would repeat the above process for the length of the sequence, moving, rotating and scaling the asset as required, and then adding more assets as you need them.":"现在，您需要对序列的长度重复上述过程，根据需要移动、旋转和缩放资源，然后根据需要添加更多资源。",
    "Objects":"对象",
    "Particle Systems":"粒子系统",
    "Sequence events can also be added and edited using code. For more information please see {}here{}.":"也可以使用代码添加和编辑序列事件。有关详细信息，请参阅{}此处{}。",
    "Sequence moments can also be added and edited using code. For more information please see {}here{}.":"也可以使用代码添加和编辑序列力矩。有关详细信息，请参阅{}此处{}。",
    "Sequences":"序列",
    "Sound in Sequences":"声音序列",
    "Sounds":"声音",
    "Sprites":"精灵",
    "Text in Sequences":"序列文本",
    "The Object Editor":"对象编辑器",
    "The Sequence Canvas":"序列画布",
    "The Sequence Editor":"序列编辑器",
    "The Sequence Editor toolbox contains the different visualisation and setup options for the sequence being edited.":"序列编辑器工具箱包含要编辑的序列的不同可视化和设置选项。",
    "The Sound Editor":"声音编辑器",
    "The Sprite Editor":"精灵编辑器",
    "The Track Panel":"轨道面板",
    "The canvas view is where you can see a preview of the sequence canvas, and is where you can edit and position the different assets that make up your sequence. You can add an asset to the sequence by simply dragging it from the asset browser and then dropping it into the canvas, and this will create a new track in the Track Panel, and also add an asset key for the asset at the current timeline playhead position. The following assets can be dropped onto the canvas in this way:":"在画布视图中，您可以看到序列画布的预览，也可以编辑和定位构成序列的不同资源。只需从资源浏览器中拖动资源，然后将其拖放到画布中，即可将资源添加到序列中，这将在\"轨道面板\"中创建一个新轨道，同时还会在当前时间轴播放头位置为资源添加一个资源关键点。可以通过这种方式将以下资源放到画布上：",
    "The change orientation button&nbsp;{}&nbsp;can be used to change the way the Sequence Editor displays the different sections. By default you will have the Canvas View at the top and the Track Editor and Dopesheet at the bottom, but this can be changed by clicking the button to cycle through the different layouts, or by clicking the Options button&nbsp;{}&nbsp;to open a menu and select the layout that you want. The following layouts are available:":"更改方向按钮{}可用于更改序列编辑器显示不同部分的方式。默认情况下，顶部是画布视图，底部是\"轨道编辑器\"和\"关键点表\"，但可以通过单击按钮循环浏览不同的布局或单击\"选项\"按钮{}打开菜单并选择所需的布局来更改。以下布局可用：",
    "The change orientation button&nbsp;{}&nbsp;can be used to change the way the Sequence Editor displays the different sections. By default you will have the Cnavas View at the top and the Track Editor and Dopesheet at the bottom, but this can be changed by clicking the button to cycle through the different layouts, or by clicking the Options button&nbsp;{}&nbsp;to open a menu and select the layout that you want. The following layouts are available:":"更改方向按钮{}可用于更改序列编辑器显示不同部分的方式。默认情况下，顶部是画布视图，底部是\"轨道编辑器\"和\"关键点表\"，但可以通过单击按钮循环浏览不同的布局或单击\"选项\"按钮{}打开菜单并选择所需的布局来更改。以下布局可用：",
    "The distance that assets \"snap\" to guides, as well as other properties, can be set in the {}Sequences Preferences{}.":"可以在{}序列首选项{}中设置资源\"捕捉\"到参考线以及其他属性的距离。",
    "The events listed here are as follows:":"此处列出的事件如下：",
    "The keyframe control buttons are one of the ways that you can add, remove or edit specific keys in the dope sheet. The buttons are as follows:":"关键点控制按钮是在关键点表中添加、删除或编辑特定关键点的方法之一。按钮如下：",
    "The rulers along the edge of the canvas show you the position of the things that are placed within it, and are marked from (0, 0) which is the center of the canvas and the default origin for the sequence. You can click and drag on the rulers to pull a horizontal or vertical {}guide {}into the sequence, and this guide can then be used to accurately position the different assets that are being used, as moving an asset close to one will \"snap\" it to the guide. While positioning assets within the sequence, {}smart guides{} will also be temporarily shown indicating the distance between assets, as well as the distance from the sequence boundary or center point.":"沿着画布边缘的标尺将显示放置在其中的对象的位置，并且标记为 (0,0)，这是画布的中心，也是序列的默认原点。您可以单击并拖动标尺将水平或垂直{}参考线{}拉入序列，然后使用此参考线可以准确定位正在使用的不同资源，因为将资源移动到一个资源附近会将其\"捕捉\"到参考线。在序列内定位资源时，{}智能参考线{}也将临时显示，指示资源之间的距离以及与序列边界或中心点的距离。",
    "The {}Dope Sheet{} is where all the {}asset key{} and {}parameter key{}{}s{} for each track are shown. You can click {}&nbsp;and drag keys left or right to position them within the dope sheet timeline, and you can also click {}&nbsp;on the right edge of an asset key to change its length. Note that for sprites and objects, setting the length to be longer than the animation will cause the animation to loop over the extra frames. The dope sheet also has controls for setting the start and end of the clip region for the sequence, and you can click {}&nbsp;anywhere to set the playhead to that position. For more information on how to use the dope sheet, please see the following page:":"{}关键点表{}是显示每个轨道的所有{}资源键{}和{}参数键{}{}{}的位置。您可以单击{}并向左或向右拖动关键点，以便在涂层表时间轴内定位它们，也可以单击资源关键点右边缘上的{}以更改其长度。请注意，对于精灵和对象，将长度设置为比动画更长将导致动画在额外的帧上循环。关键点页还具有用于设置序列的剪辑区域的开始和结束的控件，您可以在任意位置单击{}将播放头设置为该位置。有关如何使用关键点表的详细信息，请参阅以下页面：",
    "The {}Track Panel{} is where each of the assets in your sequence is listed as a track, with each track having sub-tracks for any parameters that are being changed for the asset. You can click {}&nbsp;and drag on any asset track to change it\u0027s position above or below the other tracks (any assigned parameter tracks will move along with it), and you can use {}&nbsp;/&nbsp;{} + {}&nbsp;to select multiple tracks.":"{}轨道面板{}是将序列中的每个资源作为轨道列出的位置，每个轨道都具有要为资源更改的任何参数的子轨道。您可以单击 {} 并在任何资源轨道上拖动以更改其在其他轨道上方或下方的位置 (任何指定的参数轨道都将随之移动)，还可以使用 {}/{}+{} 选择多个轨道。",
    "The {}Track Panel{} is where each of the assets in your sequence is listed as a track, with each track having sub-tracks for any parameters that are being changed for the asset. You can click {}&nbsp;and drag on any asset track to change its position above or below the other tracks (any assigned parameter tracks will move along with it), and you can use {}&nbsp;/&nbsp;{} + {}&nbsp;to select multiple tracks.":"{}轨道面板{}是将序列中的每个资源作为轨道列出的位置，每个轨道都具有要为资源更改的任何参数的子轨道。您可以单击 {} 并在任何资源轨道上拖动以更改其在其他轨道上方或下方的位置 (任何指定的参数轨道都将随之移动)，还可以使用 {}/{}+{} 选择多个轨道。",
    "This bar has the various sequence playback controls:":"此栏具有各种序列播放控件：",
    "This option snaps the Track Editor and Dopesheet to the bottom of the IDE (this is the default view).":"此选项将\"轨道编辑器\"和\"关键点表\"放置到 IDE 的底部 (这是默认视图)。",
    "This option snaps the Track Editor and Dopesheet to the bottom of the IDE (this is the default view.{}":"此选项将\"轨道编辑器\"和\"关键点表\"放置到 IDE 的底部 (这是默认视图)。{}",
    "This option snaps the Track Editor and Dopesheet to the left of the IDE.":"此选项将\"轨道编辑器\"和\"关键点表\"放置到 IDE 的左侧。",
    "This option snaps the Track Editor and Dopesheet to the left of the IDE.{}":"此选项将\"轨道编辑器\"和\"关键点表\"放置到 IDE 的左侧。{}",
    "This option snaps the Track Editor and Dopesheet to the right of the IDE.":"此选项将\"轨道编辑器\"和\"关键点表\"放置到 IDE 的右侧。",
    "This option snaps the Track Editor and Dopesheet to the right of the IDE.{}":"此选项将\"轨道编辑器\"和\"关键点表\"放置到 IDE 的右侧。{}",
    "This option snaps the Track Editor and Dopesheet to the top of the IDE.":"此选项将\"轨道编辑器\"和\"关键点表\"放置到 IDE 的顶部。",
    "This option snaps the Track Editor and Dopesheet to the top of the IDE.{}":"此选项将\"轨道编辑器\"和\"关键点表\"放置到 IDE 的顶部。{}",
    "This will create an {}asset track{} in the {}Track Panel{}, and add an {}asset key{} to the {}Dope Sheet{}. The asset track is simply the name of the track that contains the asset, while the asset key is a bar that is drawn to symbolise the number of frames that the asset will be animated over in the sequence.":"这将在{}轨道面板{}中创建{}轨道资源{}，并将{}资源键{}添加到{}关键点表{}中。轨道资源只是包含资源的轨道的名称，而关键字资源是一个条形图，用于表示资源将在序列中动画显示的帧数。",
    "To navigate around the canvas view, you can use the same basic controls as for general Workspaces, ie: Use the middle mouse button {}&nbsp;and drag to pan the canvas (or alternatively use the {}&nbsp;+ {}&nbsp;combination), and you can scroll horizontally with the mouse wheel {}&nbsp;or zoom in and out using the&nbsp;{}&nbsp;/&nbsp;{}&nbsp;key and the mouse wheel {}. You can also cut, copy and paste assets using the {}&nbsp;/&nbsp;{}&nbsp;+ \"{}X{}\", {}&nbsp;/&nbsp;{}&nbsp;+ \"{}C{}\" and {}&nbsp;/&nbsp;{}&nbsp;+&nbsp;\"{}V{}\" key combinations.":"要在画布视图中导航，可以使用与常规工作区相同的基本控件，即：使用鼠标中键 {} 并拖动以平移画布 (或者使用 {}+{} 组合)，您可以使用鼠标滚轮 {} 水平滚动或使用 {}/{} 键和鼠标滚轮 {} 放大和缩小。您还可以使用 {}/{}+\"{}X{}\",{}/{}+\"{}C{}\" 和 {}/{}+\"{}V{}\" 组合剪切、复制和粘贴资源。",
    "T{}oggle Transform Gizmo Mode{} {}: Each asset added to a sequence has a transform gizmo at its origin:{} {}This gizmo can control how the asset is scaled or rotated, as well as control its position and the position of the origin of the asset, however it only shows one of these options at a time. Clicking this button will switch between the different widget types or you can click on the options menu {}&nbsp;to directly select the type of control action you want the transform gizmo to perform. ":"{}切换转换的小工具模式{} {}：添加到序列的每个资源在其原点都有一个变换小工具：{}{}此小工具可以控制资源的缩放或旋转方式，以及控制其位置和资源原点的位置，但是它一次只显示其中一个选项。单击此按钮将在不同的小工具类型之间切换，或者您可以单击选项菜单{}直接选择希望转换小工具执行的控件操作的类型。",
    "Using Animation Curves":"使用动画曲线",
    "Using The Dope Sheet":"使用关键点表",
    "When you are happy with the initial settings, you will want to record the {}parameter keys{}&nbsp;(or {}keyframe{}{}s{}) - which is simply the name given to the values for scale, rotation and position that a specific asset key has at a any point in the dope sheet timeline.":"如果您对初始设置感到满意，则需要记录{}参数帧{}(或{}关键点{}{}{})-，该参数名称只是指定给特定资源关键字在涂层时间线中任意点的缩放、旋转和位置值的名称。",
    "When you are happy with the initial settings, you will want to record the {}parameter keys{}&nbsp;(or {}keyframe{}{}s{}) - which is simply the name given to the values for scale, rotation and position that a specific asset key has at any point in the dope sheet timeline.":"如果您对初始设置感到满意，则需要记录{}参数帧{}(或{}关键点{}{}{})-，该参数名称只是指定给特定资源关键字在涂层时间线中任意点的缩放、旋转和位置值的名称。",
    "With this option the Sequence Editor will be split into two separate windows, where the main IDE window will show the Canvas view in the full desktop and the new window will show the Dope Sheet and Track Editor. Clicking the button again will change the layout again and remove the extra window.":"使用此选项，序列编辑器将分为两个单独的窗口，其中主 \"IDE\" 窗口将在整个桌面中显示\"画布\"视图，新窗口将显示\"关键点表\"和\"轨道编辑器\"。再次单击按钮将再次更改布局并删除多余的窗口。",
    "With this option the Sequence Editor will be split into two seperate windows, where the main IDE window will show the Canvas view in the full desktop and the new window will show the Dope Sheet and Track Editor. Clicking the button again will change the layout again and remove the extra window.{}":"使用此选项，序列编辑器将分为两个单独的窗口，其中主 \"IDE\" 窗口将在整个桌面中显示\"画布\"视图，新窗口将显示\"关键点表\"和\"轨道编辑器\"。再次单击按钮将再次更改布局并删除多余的窗口。{}",
    "You can also reset the Sequence Editor layout at any time by clicking the Reset option&nbsp;{}. This will restore the editor to it\u0027s default state and re-open any sections that had been closed.":"您也可以随时通过单击\"重置\"选项{}来重置序列编辑器布局。这将使编辑器恢复到默认状态，并重新打开已关闭的所有分区。",
    "You can also reset the Sequence Editor layout at any time by clicking the Reset option&nbsp;{}. This will restore the editor to its default state and re-open any sections that had been closed.":"您也可以随时通过单击\"重置\"选项{}来重置序列编辑器布局。这将使编辑器恢复到默认状态，并重新打开已关闭的所有分区。",
    "You can also use the&nbsp;{} {}Text{} tool in the Toolbox to create a text track. Read&nbsp;{}Text in Sequences{}&nbsp;for more information.":"也可以使用\"工具箱\"中的{}{}文本{}工具创建文本轨道。有关详细信息，请阅读{}序列中的文本{}。",
    "You can create a track by dragging an asset from the Asset Browser (either a sprite, an object, a sound or a sequence) into the sequence canvas, or you can click the&nbsp;{} icon at the bottom to add a new track and select the asset to use from the Asset Explorer window that opens. The new track will be created and the asset added at the current playhead position within the dope sheet timeline:":"您可以通过将资源(精灵、对象、声音或序列)从\"资源浏览器\"拖动到序列画布中来创建轨道，也可以单击底部的{}图标来添加新轨道，然后从打开的\"资源浏览器\"窗口中选择要使用的资源。将创建新曲目，并在涂料表时间轴内的当前播放头位置添加资源：",
    "You can create a track by dragging an asset from the Asset Browser (either a sprite, an object, a sound, a sequence or a particle system) into the sequence canvas, or you can click the&nbsp;{} icon at the bottom to add a new track and select the asset to use from the Asset Explorer window that opens. The new track will be created and the asset added at the current playhead position within the dope sheet timeline:":"您可以通过将资源(精灵、对象、声音、序列或粒子系统)从\"资源浏览器\"拖动到序列画布中来创建轨道，也可以单击底部的{}图标来添加新轨道，然后从打开的\"资源浏览器\"窗口中选择要使用的资源。将创建新曲目，并在涂料表时间轴内的当前播放头位置添加资源：",
    "You can create a track by dragging an asset from&nbsp;{}The Asset Browser{} (either a sprite, an object, a sound, a sequence or a particle system) into the sequence canvas, or you can click the&nbsp;{} icon at the bottom to add a new track and select the asset to use from the Asset Explorer window that opens. The new track will be created and the asset added at the current playhead position within the dope sheet timeline:":"可以通过从{}资源浏览器{}中拖动资源来创建轨迹(一个精灵，一个物体，一个声音，一个序列或一个粒子系统)到序列画布，或者您可以单击{}图标添加新曲目，并从打开的资源浏览器窗口中选择要使用的资源。将创建新曲目，并将资源添加到dope内的当前播放头位置工作表时间轴：",
    "{}&nbsp;- This is the \"Automatically Record Changes\" button. When this is enabled, any changes made to the asset within the canvas will be automatically recorded and the appropriate parameter tracks and parameter keys added at the playhead position in the dope sheet. For example, if you move the playhead from frame 0 to frame 10 and then in the canvas move the asset 100 pixels to the right, a parameter track will be added for position, and the parameter keys will be added at frame 0 (the initial position) and at frame 10 (the playhead position) and when you press \"Play\" on the sequence, the asset will move 100px to the right over ten frames.{} {} ":"{}- 这是 \" 自动记录更改 \" 按钮。启用此选项后，将自动记录画布中对资源所做的任何更改，并在关键点表中的播放头位置添加相应的参数轨道和参数键。例如，如果您将播放头从第 0 帧移动到第 10 帧，然后在画布中将资源向右移动 100 像素，则将添加一个位置参数轨道，并且将在第 0 帧 (初始位置) 和第 10 帧 (播放头位置) 添加参数关键点，当您按序列上的 \" 播放 \" 时，资源将在十帧上方向右移动 100 px。{}{}",
    "{}&nbsp;- This is the \"Delete selected keys\" button. When you have selected one or more parameter keys in the dope sheet, you can then click this button and they will be deleted:{} {} ":"{}- 这是 \"删除选定的关键点\" 按钮。在涂料表中选择一个或多个参数键后，可以单击此按钮并将其删除：{}{}",
    "{}&nbsp;- This is the \"Record a new key\" button. When you have selected an asset key in the dope sheet and press this button, new parameter keys will be added to the asset track as parameter tracks, and the parameter keys will be added as points in the dope sheet timeline at the playhead position:{} {} ":"{}- 这是 \" 录制新关键点\" 按钮。在涂层表中选择一个资源键并按此按钮后，新的参数键将作为参数轨道添加到资源轨道中，并且参数键将作为点添加到涂层表时间轴中的播放头位置：{}{}",
    "{}&nbsp;- This is the \"Split selected keys\" button. When you have selected one or more parameter keys in the dope sheet, you can then click this button and they will be split into two separate keys at the timeline playhead position (note that the keys must have been stretched to occupy multiple frames first):{} {} ":"{}- 这是 \"拆分选定的关键点\" 按钮。在涂料表中选择一个或多个参数关键点后，可以单击此按钮，它们将在时间轴播放头位置被拆分为两个单独的关键点 (请注意，这些关键点必须已拉伸才能首先占用多个帧)：{}{}",
    "{}Add Moment{}: Clicking this permits you to add a sequence {}moment{} at the current playhead position (this is explained in more detail below).":"{}添加时刻{}：单击此按钮可以在当前播放头位置添加序列{}时刻{}(下面将对此进行详细说明)。",
    "{}Add a Text Track{} {}: This allows you to add a text track into the Sequence Canvas. After selecting this option, you can&nbsp;{} click (and optionally, drag) anywhere in the Canvas to create a new Text Track.{} {} For detailed information on text tracks, read:&nbsp;{}Text in Sequences{}. ":"{}添加文本轨道{} {}：这允许您将文本轨道添加到序列画布中。选择此选项后，可以{}在画布中的任意位置单击(可选择拖动)以创建新的文本轨道。{}{}有关文本轨道的详细信息，请阅读：{}序列中的文本{}。",
    "{}Async Event{}: This is the equivalent of the object {}Asynchronous System Event{}. {}Important!{} If the sequence is paused then this event will {}not {}be triggered.":"{} 异步事件 {}: 这相当于对象 {} 异步系统事件 {}。{} 重要 !{} 如果序列暂停，则不会触发此事件 {}。",
    "{}Async Event{}: This is the equivalent of the object {}Asynchronous System Event{}.{} {} {}{}IMPORTANT{}{} If the sequence is paused then this event will {}not {}be triggered. ":"{}异步事件{}：这相当于对象{}异步系统事件{}。{} {} {}{}重要{}{}如果序列暂停，则此事件将{}不会{} 触发。",
    "{}Begin Step{} / {}Step {}/ {}End Step{} - The Step Event is an event that is checked every single step (frame) of the game while the sequence instance exists, and is split into three parts: begin, step and end. For most things the standard step event will be fine to use, but sometimes you want a bit more control over what code runs and at what time, so for that you are provided with the Begin and End step events, and these events will always be triggered in the same order every step (frame) of the game. {}Important!{} If the sequence is paused then these events will {}not {}be triggered, and when play resumes they will be triggered the {}next frame after the sequence starts playing again{}. Also note that the order of events is not influenced by the playhead direction, and even if the sequence is playing backwards, the events will still be run as Begin, Step and End.":"{} 步开始 {}/{} 步 {}/{} 步结束 {}- 步事件是在序列实例存在的情况下，每个步骤 (帧) 检查一次的事件，并分为三个部分：开始、步骤和结束。对于大多数情况，标准步骤事件可以使用，但有时您希望对运行的代码和时间进行更多控制，以便为您提供 \" 开始 \" 和 \" 结束 \" 步骤事件，并且这些事件在游戏的每个步骤 (帧) 总是以相同的顺序触发。{} 重要 !{} 如果序列暂停，则不会触发这些事件 {}，当播放恢复时，将在序列重新开始播放后触发 {} 下一帧 {}。另请注意，事件的顺序不受播放头方向的影响，即使序列正在反向播放，事件仍将以 \" 开始\"、\"步 \" 和 \" 结束 \" 的形式运行。",
    "{}Begin Step{} / {}Step {}/ {}End Step{} - The Step Event is an event that is checked every single step (frame) of the game while the sequence instance exists, and is split into three parts: begin, step and end. For most things the standard step event will be fine to use, but sometimes you want a bit more control over what code runs and at what time, so for that you are provided with the Begin and End step events, and these events will always be triggered in the same order every step (frame) of the game.{} {} {}{}IMPORTANT{}{} If the sequence is paused then these events will {}not {}be triggered, and when play resumes they will be triggered the {}next frame after the sequence starts playing again{}. Also note that the order of events is not influenced by the playhead direction, and even if the sequence is playing backwards, the events will still be run as Begin, Step and End. ":"{}开始步骤{}/{}步骤{}/{}结束步骤{} - 步骤事件是在序列实例存在时检查游戏的每个步骤（帧）的事件，并分为三个部分 ：开始、步骤和结束。 对于大多数情况，使用标准步骤事件就可以了，但有时您希望对运行哪些代码以及在何时运行有更多控制，因此为您提供了开始和结束步骤事件，并且这些事件将始终是 游戏的每个步骤（帧）都以相同的顺序触发。{} {} {}{}重要{}{}如果序列暂停，则这些事件将{}不会{}被触发，而当游戏恢复时，它们将被触发 {}序列再次开始播放后的下一帧{}被触发。 另请注意，事件的顺序不受播放头方向的影响，即使序列向后播放，事件仍将按 Begin、Step 和 End 运行。",
    "{}Broadcast Message{}: Clicking this permits you to add a {}broadcast message{} at the current playhead position (this is explained in more detail {}here{}).":"{} 广播消息 {}：单击此处可以在当前播放头位置添加 {} 广播消息 {}( {}此处 {} 对此进行了更详细的说明)。",
    "{}Canvas Toolbox{}{}Canvas Toolbox{}":"{}画布工具箱{}{}画布工具箱{}",
    "{}Canvas View{}{}Canvas View{}":"{}画布视图{}{}画布视图{}",
    "{}Canvas Zoom Controls{} {}: These buttons control the current canvas zoom level. You can zoom in or out and clicking the {}&nbsp;button will reset the canvas to be 1:1 with the sequence being edited. You can also click the Window Fit button {}&nbsp;to make the entire sequence canvas fit within the current editor workspace (this will zoom in/out as appropriate to make it fit). Note that you can also zoom in and out using the {}&nbsp;/&nbsp;{} and the Mouse Wheel {}, and pressing {}&nbsp;/&nbsp;{}&nbsp;+&nbsp;{}&nbsp;will set the canvas to be 1:1 with the display.":"{} 画布缩放控件 {}{}：这些按钮控制当前画布的缩放级别。您可以放大或缩小，单击 {} 按钮将重置画布为 1:1，并编辑序列。也可以单击 \" 窗口缩放 \"按钮 {}，使整个序列画布适合当前编辑器工作区 (这将根据需要放大 / 缩小以使其适合)。请注意，您还可以使用 {}/{} 和鼠标滚轮 {} 进行放大和缩小，按 {}/{}+{} 将在显示屏上将画布设置为 1:1。",
    "{}Canvas {}- where you place the assets that make up the sequence":"{}画布 {}- 放置构成序列的资源的位置",
    "{}Canvas {}- where you place the assets that make up the sequence.":"{}画布{}-放置组成序列的资源的位置。",
    "{}Change Orientation{}{}Change Orientation{}":"{}更改方向{}{}更改方向{}",
    "{}Clean Up{} - This event will be called after any event that removes an instance of the sequence from the room. So, it will be triggered if the sequence is destroyed, if the room ends, or if the game ends, and is designed to perform any task that you need performed once when the sequence instance is removed from the game for any reason. If you have destroyed the sequence instance using, for example, layer_sequence_destroy(), then this event will be called after the Destroy Event (see above).":"{} 清理 {}- 从房间中删除序列实例的任何事件发生后，将调用此事件。因此，如果序列被破坏，如果房间结束，或者如果游戏结束，并且被设计为在序列实例因任何原因从游戏中删除时执行一次所需要执行的任何任务，则会触发该任务。如果已使用 layer_sequence_destroy() 销毁序列实例，则在销毁事件之后将调用此事件 (请参阅上文)。",
    "{}Clean Up{} - This event will be called after any event that removes an instance of the sequence from the room. So, it will be triggered if the sequence is destroyed, if the room ends, or if the game ends, and is designed to perform any task that you need performed once when the sequence instance is removed from the game for any reason. If you have destroyed the sequence instance using, for example, {}{}layer_sequence_destroy{}{}, then this event will be called after the Destroy Event (see above).":"{}清理{}-此事件将在从房间中删除序列实例的任何事件之后调用。因此，如果序列被销毁，如果房间结束，或者如果游戏结束，它将被触发，并且旨在执行任何任务，当序列实例因任何原因从游戏中删除时，您需要执行一次。如果您使用以下方法销毁序列实例，例如，{}{}layer_sequence_destroy{}{}，则此事件将在销毁事件之后调用(见上文)。",
    "{}Create {}- This event happens when an instance of the sequence is first created, and is the very first thing that happens within a sequence placed in the room through the room editor when a room is entered.":"{} 创建 {}- 首次创建序列的实例时会发生此事件，并且是进入房间时通过房间编辑器放置在房间中的序列中发生的第一件事。",
    "{}Destroy {}- This event is executed when an instance of the sequence is destroyed, and will be run before the Clean Up event (see below).":"{} 销毁 {}- 此事件在序列的实例被销毁时执行，并将在 \" 清理 \" 事件之前运行 (请参阅下文)。",
    "{}Dope Sheet{} - where you add/remove/edit the {}keyframes{} of the tracks and control how they behave over time.":"{}关键点表 {}- 您可以在其中添加 / 删除 / 编辑轨道的 {} 关键点 {}，并控制它们随时间的变化如何。",
    "{}Dopesheet{}{}Dopesheet{}":"{}关键点表{}{}关键点表{}",
    "{}Keyframe Controls{}{}Keyframe Controls{}":"{}关键点控件{}{}关键点控件{}",
    "{}NOTE{}&nbsp;Sound assets, when added to a sequence, are essentially {}sound emitters{}{} {}that play only the given sound asset.":"{}注意{} 声音素材添加到序列中时，基本上是{}声音发射器{}{}{}，它们只播放给定的声音素材。",
    "{}Note that the boundary of the sequence and the center point marker lines for the sequence are also considered guides and will behave the same way as guides added from the rulers, with the exception that they cannot be edited.":"{}请注意，序列的边界和序列的中心点标记线也被视为参考线，其行为方式与从标尺添加的参考线相同，只是不能对其进行编辑。",
    "{}Open Curve Editor{}: This button toggles the currently selected track between the&nbsp;{}curve view{}&nbsp;and the&nbsp;{}keyframe view{}. This option is only really applicable to&nbsp;{}parameter{}&nbsp;tracks and when enabled you will then have further options available to you depending on whether the parameter track uses keyframes or an {}animation curve{}. For more information, please see the section on the {}Using Animation Curves{}.":"{}打开曲线编辑器{}：此按钮可在{}曲线视图{}和{}关键点视图{}之间切换当前选定的轨道。此选项实际上仅适用于{}参数{}轨道，启用此选项后，您将可以使用更多选项，具体取决于参数轨道是使用关键点还是使用{}动画曲线{}。有关详细信息，请参阅{}使用动画曲线{}一节。",
    "{}Playback Controls{}: with these buttons you can start and stop the sequence preview, as well as move the playhead to the start or the end. There is also a button to set whether the sequence should loop or not, and whether the sequence should \"ping-pong\" or repeat when looping. Note that this setting&nbsp;{}will{}&nbsp;affect how the sequence is played when the project&nbsp;is compiled and run.":"{}播放控件{}：使用这些按钮，您可以开始和停止序列预览，以及将播放头移动到开始或结束位置。还有一个按钮用于设置序列是否循环，以及循环时序列是否应该\"乒乓\"或重复。请注意，此设置{}将影响编译和运行项目时序列的播放方式。",
    "{}Playback Speed{}: this is the playback speed of the sequence in frames (steps) per second.":"{}播放速度{}：这是以每秒帧(步数)为单位的序列播放速度。",
    "{}Playhead Position{}: this is the current playhead position, and can be shown in time (h:m:s) or frames (f).":"{} 播放头位置 {}：这是当前播放头位置，可以显示为时间 (h:m:s) 或帧 (f)。",
    "{}Rulers / Guides{}{}Rulers / Guides{}":"{}尺子/参考线{}{}尺子/参考线{}",
    "{}Sequence Events{}{}Sequence Events{}":"{}序列事件{}{}序列事件{}",
    "{}Sequence Length{}: this displays the total possible length of the sequence in frames (f) or in time (m:h:s). Note that the sequence may not run to this length if you have set the clip region to be smaller.":"{} 序列长度 {}：这将以帧 (f) 或时间 (m:h:s) 显示序列的总可能长度。请注意，如果已将剪辑区域设置为较小，则序列可能无法运行到此长度。",
    "{}Sequence Tools{}{}Sequence Tools{}":"{}序列工具{}{}序列工具{}",
    "{}Snap Bottom{}":"{}置于底部{}",
    "{}Snap Left{}":"{}置于左边{}",
    "{}Snap Right{}":"{}置于右边{}",
    "{}Snap Top{}":"{}置于顶部{}",
    "{}Split Window{}":"{}拆分窗口{}",
    "{}The Sequence Editor{}":"{}序列编辑器{}",
    "{}The track editor has many other features that are discussed in full detail on the following page:":"{}轨道编辑器还具有许多其他功能，这些功能将在以下页面中详细讨论：",
    "{}Time Display Options{}: here you can set whether to display the sequence times in hours, minutes and seconds (h:m:s) or frames (f).":"{} 时间显示选项 {}：您可以在此设置是以小时、分钟和秒 (h:m:s) 还是以帧 (f) 显示序列时间。",
    "{}Toggle Canvas Frame{} {}: This button can be used to toggle the canvas frame on or off (it is on by default). The canvas frame is simply a guide that is used to judge where elements are placed in sequence canvas and any elements outside of the frame will not be rendered. This button also has the following options menu {}:{} {}Here you can set the canvas frame toggle as well as the size of the canvas. You also have the possibility of setting a {}reference image{}, which is an image that you select from your computer (it is not imported into the project) to be used as a background reference for the sequence. This image is only visible in the Sequence Editor itself and will not be rendered when the sequence is used in a project. If you add a reference image you can also set the opacity that it\u0027s drawn at and offset its position within the canvas frame. ":"{} 切换画布框 {}{}：此按钮可用于打开或关闭画布框 (默认情况下为打开状态)。画布框架只是一个简单的向导，用于判断元素在顺序画布中的放置位置，并且不会渲染框架之外的任何元素。此按钮还具有以下选项菜单 {}:{}{} 您可以在此处设置画布框切换以及画布大小。您还可以设置 {} 参考图像 {}，该图像是您从计算机中选择的图像 (不会导入到项目中)，用作序列的背景参考。此图像仅在序列编辑器本身中可见，并且在项目中使用序列时不会渲染。如果添加参考图像，还可以设置其绘制位置的不透明度，并在画布框架内偏移其位置。",
    "{}Toggle Canvas Grid{} {}: This will toggle on/off the Sequence Editor canvas grid. This is a grid that {}GameMaker{} draws over the preview canvas to divide it into sections, and by default is set to 32x32px in size. If you click the Grid Menu icon {}&nbsp;you will see the grid options:{} {}These options permit you to set the grid colour and alpha, as well as the cell values for the grid along the X and Y axis. You also have an option to enable or disable grid snapping here (disabled by default). You can use the keyboard shortcuts \"G\" and {}&nbsp;+ \"G\" to toggle the grid visibility and grid snapping respectively. ":"{} 切换画布网格 {}{}：这将打开 / 关闭序列编辑器画布网格。这是一个网格，{}GameMaker{} 将在预览画布上绘制以将其划分为多个部分，默认情况下设置为 32 x 32 px 的大小。如果单击 \" 网格菜单 \" 图标 {}，您将看到网格选项：{}{} 这些选项允许您设置网格颜色和 Alpha，以及沿 X 轴和 Y 轴的网格单元格值。您还可以选择在此启用或禁用栅格捕捉 (默认情况下处于禁用状态)。可以使用键盘快捷键 \"G\" 和 \"{}+G\" 分别切换栅格可见性和栅格捕捉。",
    "{}Toggle Gizmos{} {}: Clicking this will enable or disable the different {}gizmos{} visible in the canvas. When enabled you will see all the gizmos associated with the different assets and the canvas itself, and when disabled these will not be shown, giving a clearer view of how the sequence looks. Note that this is enabled by default, and there is a menu available from the options button {}&nbsp;where you can&nbsp;filter what is visible without having to disable all the different widgets together. A complete list of these filter options and an explanation of what they do can be found {}here{}.":"{}切换小工具{}{}：单击此选项将启用或禁用画布中可见的不同{}小工具{}。启用此选项后，您将看到与不同资源和画布本身关联的所有小工具;禁用此选项后，将不会显示这些小工具，从而更清楚地了解序列的外观。请注意，这在默认情况下是启用的，并且选项按钮{}中有一个菜单，您可以在其中过滤可见内容，而不必一起禁用所有不同的小工具。这些过滤器选项的完整列表以及它们的操作说明可以在{}此处{}找到。",
    "{}Track Panel {}- where you add/remove {}asset tracks{} and {}parameter tracks{} to your sequence":"{}轨道面板 {}- 在此向序列添加 / 删除 {} 资源轨道 {} 和 {} 参数轨道 {}",
    "{}Track Panel {}- where you add/remove {}asset tracks{} and {}parameter tracks{} to/from your sequences.":"{}跟踪面板{}-您可以在其中向序列添加/删除{}资产跟踪{}和{}参数跟踪{}。",
    "{}Track Panel{}{}Track Panel{}":"{}轨道面板{}{}轨道面板{}",
    "{}When adding a moment function, you can click the {}&nbsp;button to go to the script with the specified function, or you can click the {}&nbsp;button to create a new script resource with an empty function ready for editing. You can also remove moment and the function call it contains by clicking the {}&nbsp;button.":"{}添加时刻函数时，可以单击{}按钮转到具有指定函数的脚本，也可以单击{}按钮创建具有可供编辑的空函数的新脚本资源。您也可以通过单击{}按钮删除时刻及其包含的函数调用。",
    "{}When adding a moment function, you can click the {}&nbsp;button to go to the script with the specified function, or you can click the {}&nbsp;button to create a new script resource with an empty function ready for editing. You can also remove the moment and the function call it contains by clicking the {}&nbsp;button.":"{}添加时刻函数时，可以单击{}按钮转到具有指定函数的脚本，也可以单击{}按钮创建具有可供编辑的空函数的新脚本资源。您也可以通过单击{}按钮删除时刻及其包含的函数调用。",
    "{}{}NOTE{}{}&nbsp;Sound assets, when added to a sequence, are essentially {}sound emitters{}{} {}that play only the given sound asset.":"{}{}注意{}{} 声音素材添加到序列中时，基本上是{}声音发射器{}{}{}，它们只播放给定的声音素材。"
}