{
    "Beside the volume controls you also have the Playback controls where you can preview the sound, set it to loop or rewind. You can also click the {}&nbsp;Icon to open the sound in the {}Sound Mixer{}.":"除了音量控制，你还有播放控制，在这里你可以预览声音，将其设置为循环或倒退。你还可以点击{}图标，在{}声音混合器{}中打开声音。",
    "Beside the volume controls you also have the Playback controls where you can preview the sound, set it to loop or rewind. You can also click the {}&nbsp;Icon to open the sound in the {}Sound Mixer{}.{}":"除了音量控制，你还有播放控制，在这里你可以预览声音，将其设置为循环或倒退。你还可以点击{}&nbsp;图标，在{}声音混合器{}中打开声音。",
    "Here you can click the {}Open{}&nbsp;button to open the file explorer and choose an audio file to load. You can also set the name of the new resource from the \"Name\" field on the left. Names can only be alpha-numeric and may only use the underbar \"_\" symbol, and they cannot start with a number.":"在这里你可以点击{}Open{}按钮，打开文件资源管理器，选择一个音频文件来加载。你还可以从左边的 \"名称 \"字段中设置新资源的名称。名称只能是字母-数字，并且只能使用 _\"符号，而且不能以数字开头。",
    "Here you can set the playback volume for the given sound. In-game, this value is used as the asset-level gain for this asset (as listed in the {}Audio Properties Overview{}).{} For example, if the slider is in the middle the asset-level gain for all instances of this sound in the game will be 0.5. A sound instance of this sound asset with an instance-level gain of 1 will have a final gain of 0.5 * 1 = 0.5, an instance with its gain set to 0.5 will have a final gain of 0.5 * 0.5 = 0.25, etc.":"您可以在此处设置给定声音的播放音量。 在游戏中，该值用作该资产的资产级增益（如{}音频属性概述{}中所列）。{} 例如，如果滑块位于中间，则所有资产的资产级增益 游戏中此声音的实例将为 0.5。 该声音资源的实例级增益为 1 的声音实例的最终增益为 0.5 * 1 = 0.5，增益设置为 0.5 的实例的最终增益为 0.5 * 0.5 = 0.25，等等。",
    "Here you can set the playback volume for the given sound. This is value is simply the {}default{}&nbsp;value where if the slider is in the middle - for example - then volume for that sound when used in the game will be 0.5. However, this will be overridden by any change to the gain using the audio functions in your project.":"这里你可以设置给定声音的播放音量。这个值是简单的{}默认{}值，如果滑块在中间--例如--那么在游戏中使用该声音时的音量将是 0.5。然而，这将被你的项目中使用音频函数对增益的任何改变所覆盖。",
    "Here you can set the playback volume for the given sound. This is value is simply the {}default{}&nbsp;value where if the slider is in the middle - for example - then volume for that sound when used in the game will be 0.5. However, this will be overridden by any change to the gain using the audio functions in your project.{}":"这里你可以设置给定声音的播放音量。这个值是简单的{}默认{}&nbsp;值，如果滑块在中间--例如--那么在游戏中使用该声音时的音量将是0.5。然而，这将被你的项目中使用音频函数对增益的任何改变所覆盖。{}",
    "If you have chosen compressed audio, you can then also choose to have your sound {}streamed from disk{}. A streamed sound will be one that is uncompressed and played in real time, streamed from the disc rather than loaded into memory. Streaming is ideal for music as it reduces the one-off overhead of uncompressing the whole file -&nbsp;which may cause a pause in the game -&nbsp;but is not recommended for simple sound effects where the hit on the CPU is much less. If you select streamed audio, you will {}not{} be able to assign the sound to an {}Audio Group{}&nbsp;and this option will be disabled, as streamed sounds are not packaged in the same way as other sounds and you have full control over when they are loaded, played and unloaded using code.":"如果你选择了压缩音频，那么你也可以选择让你的声音{}从磁盘流{}。流媒体的声音将是未压缩的、实时播放的，从磁盘中流出来的，而不是加载到内存中。流媒体是音乐的理想选择，因为它减少了解压缩整个文件的一次性开销--这可能会导致游戏的暂停--但不建议用于简单的声音效果，因为它对CPU的影响要小得多。如果你选择了流式音频，你将{}不{}能把声音分配给{}音频组{}&nbsp;，这个选项将被禁用，因为流式声音的打包方式与其他声音不一样，你可以完全控制它们何时被加载、播放和卸载，使用代码。",
    "If you have chosen compressed audio, you can then also choose to have your sound {}streamed from disk{}. A streamed sound will be one that is uncompressed and played in real time, streamed from the disk rather than loaded into memory. Streaming is ideal for music as it reduces the one-off overhead of uncompressing the whole file -&nbsp;which may cause a pause in the game -&nbsp;but is not recommended for simple sound effects where the hit on the CPU is much less. If you select streamed audio, you will {}not{} be able to assign the sound to an {}Audio Group{}&nbsp;and this option will be disabled, as streamed sounds are not packaged in the same way as other sounds and you have full control over when they are loaded, played and unloaded using code. These sounds will, however, be assigned to the default audio group&nbsp;{}{}audiogroup_default{}{}.":"如果你选择了压缩音频，那么你也可以选择让你的声音{}从磁盘流{}。流媒体的声音将是未压缩的、实时播放的，从磁盘中流出来的，而不是加载到内存中。流媒体是音乐的理想选择，因为它减少了解压缩整个文件的一次性开销--这可能会导致游戏的暂停--但不建议用于简单的声音效果，因为它对 CPU 的影响要小得多。如果你选择了流式音频，你将{}不{}能把声音分配给{}音频组{}，这个选项将被禁用，因为流式声音的打包方式与其他声音不一样，你可以使用代码完全控制它们何时被加载、播放和卸载。但是，这些声音将被分配到默认音频组 {}{}audiogroup_default{}{}。",
    "If you have selected {}streamed {}audio then this option will be {}disabled{}, as streamed sounds are not packaged in the same way as other sounds and will be not be loaded into memory, but instead streamed directly from the storage medium.":"如果你选择了{}流式{}音频，那么这个选项将被{}禁用{}，因为流式声音的包装方式与其他声音不一样，不会被加载到内存中，而是直接从存储介质中串流出来。",
    "If you have selected {}streamed {}audio then this option will be {}disabled{}, as streamed sounds are not packaged in the same way as other sounds and will be not be loaded into memory, but instead streamed directly from the storage medium. ":"如果你选择了{}流式{}音频，那么这个选项将被{}禁用{}，因为流式声音的包装方式与其他声音不一样，不会被加载到内存中，而是直接从存储介质中流出来。",
    "It is important to note that when targeting the HTML5 platform, streamed audio will not play when the play request does not directly originate from a user interaction (i.e: a touch event, etc.). However, since {}GameMaker{} queues up click events and only handles them on the next frame, it is impossible to play streamed audio without the browser blocking it. To get around this, any HTML5 game run will treat all streamed audio as unstreamed in the engine, with the exception of streamed audio not being preloaded.":"需要注意的是，当针对HTML5平台时，当播放请求不是直接来源于用户交互（即：触摸事件等）时，流媒体音频将不会播放。然而，由于{}GameMaker{}排队等待点击事件，并且只在下一帧处理这些事件，因此不可能在不被浏览器阻止的情况下播放流媒体音频。为了解决这个问题，任何HTML5游戏的运行都会在引擎中把所有流媒体音频视为非流媒体，但流媒体音频不被预装除外。",
    "Note that while the rest of the audio properties are configuration specific, the audio group setting is {}not {}and a sound will belong to the same group on {}all configurations that you use{}.":"注意，虽然其余的音频属性是特定的配置，但音频组的设置是{}而不是{}，一个声音在{}所有你使用的配置{}上将属于同一个组。",
    "Once an audio file has been assigned to a group you can then use the specific audio group functions to change them and lo load/unload them from memory. See the reference section on {}Audio Functions{}&nbsp;for further information.":"一旦一个音频文件被分配到一个组，你就可以使用特定的音频组功能来改变它们，并从内存中加载/卸载它们。更多信息请参见{}音频功能{}&nbsp;的参考章节。",
    "Once an audio file has been assigned to a group you can then use the specific audio group functions to change them and to load/unload them from memory. See the reference section on {}Audio Functions{}&nbsp;for further information.":"一旦一个音频文件被分配到一个组，你就可以使用特定的音频组函数来改变它们，并从内存中加载/卸载它们。更多信息请参见{}音频函数{}的参考章节。",
    "Once you have loaded your file you can preview the sound by using the play button which will loop it continuously. This is very handy as it means you can make changes to the volume using the slider at the bottom of the window and hear what the effect it will have on the sound. There is a stop button too, so you can stop the preview at any time.":"一旦你加载了你的文件，你可以通过使用播放按钮来预览声音，它将连续循环。这是非常方便的，因为它意味着你可以使用窗口底部的滑块来改变音量，并听到它将对声音产生的影响。也有一个停止按钮，所以你可以在任何时候停止预览。",
    "The Sound Editor":"声音编辑器",
    "The Target Options panel is where you set the conversion rates for your game. These settings will affect how the sound is exported for the target platform, and {}GameMaker{} will automatically convert your sound files for you - you simply control the final quality of those sounds when converted. Generally the default settings of 16 bit quality (or {}bit depth{}), 44100kHz {}sample rate{}&nbsp;and 128kbps {}bit rate{} are perfectly adequate, but it may be that you wish sound effects (for example) to have a lower quality and music to have a higher quality, in which case these settings can be changed.":"目标选项面板是你为你的游戏设置转换率的地方。这些设置将影响声音在目标平台的输出方式，{}GameMaker{}会自动为你转换声音文件--你只需控制这些声音在转换时的最终质量。一般来说，16比特质量（或{}比特深度{}）、44100kHz {}采样率{}&nbsp;和128kbps {}比特率{}的默认设置是完全足够的，但你可能希望声音效果（例如）有较低的质量，音乐有较高的质量，在这种情况下，这些设置可以改变。",
    "The sound window also has other options which are explained below:":"声音窗口也有其他选项，解释如下：",
    "The {}\"Required\"{} option can be used to avoid such issues and ensure that the source audio file is always converted by the asset compiler into a new OGG file using the attributes specified in the Sound Editor.":"{}\"Required\"{}选项可以用来避免此类问题，确保源音频文件总是被资源编译器转换为一个新的OGG文件，使用在声音编辑器中指定的属性。",
    "The {}Required{}&nbsp;option can be used to avoid such issues and ensure that the source audio file is always converted by the asset compiler into a new OGG file using the attributes specified in the Sound Editor.":"{}Required{}选项可用于避免此类问题，并确保资源编译器始终使用声音编辑器中指定的属性将源音频文件转换为新的OGG文件。",
    "This option is only available for sounds that are in the {}OGG{} format and allows you to select one of these two&nbsp;options:":"这个选项只适用于{}OGG{}格式的声音，允许你选择这两个选项之一。",
    "This section is for setting the sound attributes. These are the attributes that will be set when you export your game and will affect how the sound is&nbsp;played back at runtime. For sound effects ({}WAV {}format) you will want them to be {}uncompressed {}so that they play quickly and don\u0027t require decoding. Note that using this option will convert your audio to the {}WAV{} format during compile time&nbsp;(however if the attributes set in the Sound Editor match the attributes of the source&nbsp;{}WAV{} file, then it&nbsp;will simply be copied over).&nbsp;For {}OGG{} and {}MP3{}, you\u0027d generally want one of the other three options available.":"本节用于设置声音属性。这些属性将在你导出游戏时被设置，并将影响声音在运行时的播放效果。对于声音效果（{}WAV {}格式），你会希望它们是{}未压缩的{}，这样它们就能快速播放，不需要解码。注意，使用这个选项会在编译时将你的音频转换为{}WAV{}格式（但是如果在声音编辑器中设置的属性与源{}WAV{}文件的属性相匹配，那么它就会被简单地复制过来）。对于{}OGG{}和{}MP3{}，你一般会想要其他三个选项之一。",
    "What this means is that if your game is running on a browser, and - for example - you have 10 music tracks that are all set as streamed {}mp3 {}files, all 10 will be initialised like unstreamed audio would, but they won\u0027t be decoded immediately before the game loads, unlike normal streamed audio which would get preloaded/decoded immediately during the load screen phase.":"这意味着，如果你的游戏在浏览器上运行，并且--例如--你有10个音乐曲目都被设置为流式{}mp3 {}文件，所有10个都会像非流式音频一样被初始化，但它们不会在游戏加载前立即被解码，不像正常的流式音频会在加载屏幕阶段立即被预加载/解码。",
    "While this bypasses the issue and prevents any huge increase in initial load times, it does mean that it may result in a state where your game has loaded, but certain streamed sounds may still be downloading or decoding. To deal with this you can use the GML function {}{}audio_sound_is_playable(){}{}&nbsp;which checks to see if a given sound can actually be played. On HTML5 this will return {}false {}if the sound is not fully loaded or decoded yet, and {}true {}if it is and can be played (on all other platforms it will always return true).":"虽然这绕过了这个问题，并防止了初始加载时间的巨大增加，但它确实意味着它可能会导致你的游戏已经加载，但某些流媒体的声音可能仍在下载或解码的状态。为了解决这个问题，你可以使用GML函数{}{}audio_sound_is_playable(){}{}&nbsp;来检查一个给定的声音是否真的可以被播放。在HTML5上，如果声音还没有完全加载或解码，这个函数将返回{}false {}；如果声音可以播放，则返回{}true {}（在所有其他平台上，它总是返回true）。",
    "You can also choose whether the conversion should be {}mono{}, {}stereo{} or {}3D{}. If you plan on using the {}audio emitter functions{}&nbsp;to create 3D sound effects,{}&nbsp;then you should pick mono or 3D, and not stereo, otherwise your sounds in-game may not come out of the speakers you expected.&nbsp;{}{}Note that there is no difference between “3D” and “mono” - “3D” is simply an IDE label used to help people new to audio to not pick stereo when they want positional audio.{} If you choose to use the 3D output, it will be exported as a mono sound.":"你还可以选择是{}单声道{}、{}立体声{}还是{}3D{}的转换。如果你打算使用{}音频发射器功能{}&nbsp;来创造3D音效，{}&nbsp;那么你应该选择单声道或3D，而不是立体声，否则你在游戏中的声音可能不会从你预期的扬声器中发出来。 &nbsp;{}{}注意，\"3D \"和 \"单声道 \"之间没有区别--\"3D \"只是一个IDE标签，用来帮助刚接触音频的人在想要定位音频时不要选择立体声。{}如果你选择使用3D输出，它将被导出为单声道声音。",
    "You can assign your audio file to a specific {}Audio Group{}. These are created from the {}Audio Groups{}&nbsp;window and are used to group audio assets together for easier memory management and volume control.":"你可以将你的音频文件分配到一个特定的{}音频组{}。这些文件是在{}音频组{}窗口中创建的，用于将音频资源分组，以方便内存管理和音量控制。",
    "You can assign your audio file to a specific {}Audio Group{}. These are created from the {}Audio Groups{}&nbsp;window and are used to group audio assets together for easier memory management and volume control. ":"你可以将你的音频文件分配到一个特定的{}音频组{}。这些文件是在{}Audio Groups{}&nbsp;窗口中创建的，用于将音频资源分组，以方便内存管理和音量控制。",
    "You can mitigate this CPU overhead somewhat by choosing to {}uncompress on load{}, which will place all the sounds into the device memory for faster playback, at the expense of increased memory use.":"你可以通过选择{}加载时解压缩{}来减轻CPU的开销，这将把所有的声音放到设备内存中，以加快播放速度，但代价是增加内存的使用。",
    "{}Attributes{}{}Attributes{}":"{}属性{}{}属性{}",
    "{}Audio Group{}{}Audio Group{}":"{}音频组{}{}音频组{}",
    "{}Compressed {}audio will force all your sound files (irrespective of whether they are {}WAV{} or {}MP3{}) to be compressed down to Ogg Vorbis {}OGG{} format files for {}all {}platforms (however, if the source audio is already {}OGG{}&nbsp;it will simply be copied over without being recompressed if the {}Conversion{} option is set to {}Automatic{}). These sounds are smaller on disc, but will have a slight CPU overhead due to the need to be uncompressed and loaded into memory before being played, so you should keep that in mind if you wish to use {}compression{} in an already CPU intensive game.":"{}压缩{}音频将强制你所有的声音文件（无论它们是{}WAV{}还是{}MP3{}）压缩成Ogg Vorbis {}OGG{}格式文件，用于{}所有{}平台（但是，如果源音频已经是{}OGG{}&nbsp；如果{}Conversion{}选项设置为{}Automatic{}，它将被简单地复制过来而不被再压缩）。这些声音在光盘上比较小，但会有轻微的CPU开销，因为在播放前需要解压缩并加载到内存中，所以如果你想在一个已经是CPU密集型的游戏中使用{}压缩{}，你应该记住这一点。",
    "{}NOTE{}&nbsp;The higher the quality of the sound, the larger the file, and this should be taken into account when deciding what bitrate and sample rate to choose.":"{}注意{}&nbsp;声音质量越高，文件越大，在决定选择什么比特率和采样率时，应考虑到这一点。",
    "{}Name And File{}{}Name And File{}":"{}名称和文件{}{}名称和文件{}",
    "{}OGG Conversion{}{}OGG Conversion{}":"{}OGG转换{}{}OGG转换{}",
    "{}TIP{} Use {}the Inspector{} to view the waveform for the selected sound.":"{}注意{} 使用{}检查器{}来查看所选声音的波形。",
    "{}Target Options{}{}Target Options{}":"{}目标选项{}{}目标选项{}",
    "{}The Sound Editor{}":"{}声音编辑器{}",
    "{}The {}Sound Editor{} is where you can load sounds into a new audio asset as well as set its properties. To load a sound, press the {}Load Sound{} button to the right of the sound name. A file selector dialogue pops up in which you can select the sound file. This should be either a {}WAV{}, an {}MP3{} file or an {}OGG{} file. In general {}*.wav{} are used for the short sound effects as even though they are generally larger files they will play instantaneously due to the fact that they do not need any type of decoding for playing. {}*.mp3{} or {}*.ogg{} format files should be used for background music or for sound effects that are longer or larger in size. These files are much smaller than a wave file would be but have a small CPU overhead as they have to be decoded before being played.":"{}您可以在{}声音编辑器{}中将声音加载到新的音频资源中并设置其属性。 要加载声音，请按声音名称右侧的{}加载声音{}按钮。 弹出文件选择器对话框，您可以在其中选择声音文件。 该文件应该是 {}WAV{}、{}MP3{} 文件或 {}OGG{} 文件。 一般来说，{}*.wav{} 用于短音效，尽管它们通常是较大的文件，但它们会立即播放，因为它们不需要任何类型的解码来播放。 {}*.mp3{} 或 {}*.ogg{} 格式文件应用于背景音乐或较长或较大的音效。 这些文件比波形文件小得多，但 CPU 开销很小，因为在播放之前必须对其进行解码。",
    "{}The {}Sound Editor{} is where you can load sounds into a new audio resource as well as set its properties. To load a sound, press the {}Load Sound{} button to the right of the sound name. A file selector dialogue pops up in which you can select the sound file. This be either a {}WAV{}, an {}MP3 {}file or an {}OGG{} file. In general {}*.wav{} are used for the short sound effects as even though they are generally larger files they will play instantaneously due to the fact that they do not need any type of decoding for playing. {}*.mp3{} or {}*.ogg{} format files should be used for background music or for sound effects that are longer or larger in size. These files are much smaller than a wave file would be but have a small CPU overhead as they have to be decoded before being played.":"{}{}声音编辑器{}是你可以将声音加载到一个新的音频资源中，并设置其属性。要加载一个声音，按声音名称右边的{}加载声音{}按钮。一个文件选择对话框会弹出来，你可以选择声音文件。这可以是{}WAV{}、{}MP3{}文件或{}OGG{}文件。一般来说，{}*.wav{}用于简短的声音效果，因为尽管它们通常是较大的文件，但由于它们不需要任何类型的解码就能播放，所以会立即播放。{}*.mp3{}或{}*.ogg{}格式的文件应该用于背景音乐或较长或较大尺寸的声音效果。这些文件比波形文件小得多，但由于它们在播放前必须进行解码，所以有少量的CPU开销。",
    "{}The {}Sound Editor{} is where you can load sounds into a new audio resource as well as set its properties. To load a sound, press the {}Load Sound{} button to the right of the sound name. A file selector dialogue pops up in which you can select the sound file. This be either a {}WAV{}, an {}MP3{} file or an {}OGG{} file. In general {}*.wav{} are used for the short sound effects as even though they are generally larger files they will play instantaneously due to the fact that they do not need any type of decoding for playing. {}*.mp3{} or {}*.ogg{} format files should be used for background music or for sound effects that are longer or larger in size. These files are much smaller than a wave file would be but have a small CPU overhead as they have to be decoded before being played.":"{}{}声音编辑器{}是你可以将声音加载到一个新的音频资源中，并设置其属性。要加载一个声音，按声音名称右边的{}加载声音{}按钮。一个文件选择对话框会弹出来，你可以选择声音文件。这可以是{}WAV{}、{}MP3{}文件或{}OGG{}文件。一般来说，{}*.wav{}用于简短的声音效果，因为尽管它们通常是较大的文件，但由于它们不需要任何类型的解码就能播放，所以会立即播放。{}*.mp3{}或{}*.ogg{}格式的文件应该用于背景音乐或较长或较大尺寸的声音效果。这些文件比波形文件小得多，但由于它们在播放前必须进行解码，所以有少量的CPU开销。",
    "{}Volume &amp; Playback{}{}Volume &amp; Playback{}":"{}音量与播放{}{}音量与播放{}",
    "{}With the {}\"Automatic\"{} option, the&nbsp;{}OGG{} sound file&nbsp;will not be&nbsp;converted by the asset compiler and will be copied into the game executable as is. This may cause issues if the attributes of the source file and the sound asset are mismatched, e.g. the source audio file being mono (having only one channel) but&nbsp;the&nbsp;asset\u0027s attributes specifies that it has two channels.":"{}使用{}\"Automatic\"{}选项，{}OGG{}声音文件不会被资源编译器转换，而是原样复制到游戏可执行文件中。如果源文件和声音资源的属性不匹配，例如源音频文件是单声道的（只有一个声道），但资源的属性指定它有两个声道，这可能会造成问题。",
    "{}With the {}Automatic{}&nbsp;option, the&nbsp;{}OGG{} sound file&nbsp;will not be&nbsp;converted by the asset compiler and will be copied into the game executable as is. This may cause issues if the attributes of the source file and the sound asset are mismatched, e.g. the source audio file being mono (having only one channel) but&nbsp;the&nbsp;asset\u0027s attributes specifies that it has two channels.":"{}使用{}自动{}选项时，资源编译器将不会转换{}OGG{}声音文件，而是将其原样复制到游戏可执行文件中。如果源文件和声音资源的属性不匹配，例如源音频文件是单声道(只有一个声道)，但资源的属性指定它有两个声道，则可能会导致问题。",
    "{}{}NOTE{}{}&nbsp;The higher the quality of the sound, the larger the file, and this should be taken into account when deciding what bitrate and sample rate to choose.":"{}{}注意{}{} 声音质量越高，文件越大，在决定选择什么比特率和采样率时，应考虑到这一点。",
    "{}{}NOTE{}{}&nbsp;While the rest of the audio properties are configuration specific, the audio group setting is {}not {}and a sound will belong to the same group on {}all configurations that you use{}.":"{}{}注意{}{} 虽然其余的音频属性是特定的配置，但音频组的设置是{}而不是{}，一个声音在{}所有你使用的配置{}上将属于同一个组。",
    "{}{}TIP{}{}&nbsp;Use {}the Inspector{} to view the waveform for the selected sound.":"{}{}提示{}{} 使用{}检查器{}查看所选声音的波形。",
    "{}{}TIP{}{}&nbsp;Use&nbsp;{}The Inspector{} to view the waveform for the selected sound.":"{}{}提示{}{}使用{}检查器{}查看所选声音的波形。"
}