{
    "All sprites have a {}collision mask{} which corresponds to the area of the sprite that will be used to detect collisions when the sprite is assigned to an instance. You can first set the {}Mode {}for the collision mask, which can be one of the following:":"所有精灵都有一个{}碰撞遮罩{}，它对应于精灵的区域，当精灵被分配给一个实例时，它将被用来检测碰撞。你可以首先为碰撞遮罩设置{}Mode{}，它可以是以下的一种：",
    "An additional part of the Frame Controls is the {}current frame{} display and input a bit further over on the left. The box shows the total number of frames of the sprite animation as well as the current frame being shown. You can change the current frame at any time by clicking on the input box and typing in the frame number you want to view.":"帧控制的另一个部分是{}当前帧{}的显示和输入，在左边稍远的地方。该框显示了精灵动画的总帧数，以及正在显示的当前帧。你可以通过点击输入框并输入你想要查看的帧数来随时改变当前帧。",
    "Apart from the collision mask Mode, there are also various {}types {}of collision mask which you can choose from the drop down menu:":"除了碰撞模式，还有各种{}类型{}的碰撞遮罩，你可以从下拉菜单中选择：",
    "Apart from the option given above to stretch a frame, you can also position the mouse on the edge of a frame and then when the cursor changes to a double arrow, simply click {}&nbsp;and drag to resize the frame so it takes more time:":"除了上面给出的拉伸框架的选项外，你还可以将鼠标放在框架的边缘，然后当光标变为双箭头时，只需点击{}&nbsp;并拖动即可调整框架的大小，这样需要更多时间。",
    "Beneath the collision mask setting, you have the {}alpha tolerance {}slider, which indicates the tolerance for creating the mask with respect to the transparency of the sprites pixels - with a higher tolerance pixels that are partially transparent are left outside the mask, while with a lower tolerance the mask will take into account those pixels. This influences both the bounding box (when not set to manual) and the mask for precise collision checking.":"在碰撞遮罩设置下面，你有{}alpha tolerance {}滑块，它指示了创建遮罩时对精灵像素透明度的容忍度--如果容忍度高，部分透明的像素就会被留在遮罩之外，而如果容忍度低，遮罩就会考虑到这些像素。这对边界框（当不设置为手动时）和用于精确碰撞检查的遮罩都有影响。",
    "By default the origin is the {}top left {}corner of the sprite but it is often more convenient to use the {}middle&nbsp;centre{} or you may wish to have some other position used (like for a platform game character you might want {}bottom centre{}), so you can click {}&nbsp;on the origin drop-down menu and select one of the default values. You can also set the origin manually by clicking {}&nbsp;in the sprite preview image which will move the origin marker cross to the point you clicked, or by inputting different values for x and y in the corresponding boxes. Note that you can even set an origin outside the area of sprite by using negative numbers (for left and up) or positive numbers larger than the sprite width and height (for right and down), which can be very useful when dealing with objects that need to draw composite sprites.":"默认情况下，原点是精灵的{}左上角{}，但使用{}中心{}往往更方便，或者你可能希望使用其他位置（比如对于一个平台游戏角色，你可能想要{}底部中心{}），所以你可以点击{}&nbsp;原点下拉菜单，选择一个默认值。你也可以通过点击{}精灵预览图中的来手动设置原点，这将使原点标记交叉移动到你所点击的位置，或者在相应的方框中输入不同的x和y值。请注意，你甚至可以通过使用负数（对于左和上）或大于精灵宽度和高度的正数（对于右和下）来设置精灵区域外的原点，这在处理需要绘制复合精灵的对象时可能非常有用。",
    "Finallly, you can also zoom in on the frame timeline using the \"handles\" on either side of the frame view as shown in the image below:":"最后，你还可以使用框架视图两侧的 \"手柄 \"放大框架的时间线，如下图所示。",
    "Finally you can set the {}Bounding Box{} limits for the mask. The bounding box is the name given to the rectangular area that the sprite mask fits in. Only pixels inside this bounding box are used for the mask and will be involved in collision checking, and by default this is automatically computed, taking the alpha tolerance into account. If you have \"precise (per frame)\" checked then this will be separate for each sub-image too. When setting it yourself, you can input the values in the boxes for left, right top and bottom, or you can click {}&nbsp;in the sprite preview window and drag to \"draw\" it over the sprite. Note that when \"drawing\" the bounding box, the mask is automatically generated to fit within the end values, and the bounding box can \"clip\" the mask.":"最后，你可以为面具设置{}边界框{}的限制。界限框是对精灵遮罩所处的矩形区域的命名。只有在这个边框内的像素才会被用于遮罩，并参与碰撞检查，默认情况下，这个边框是自动计算的，并考虑到了alpha容忍度。如果你勾选了 \"精确（每一帧）\"，那么这也会对每个子图像进行单独计算。当你自己设置时，你可以在左、右、上和下的方框中输入数值，或者你可以在精灵预览窗口中点击{}&nbsp;，然后拖动以在精灵上 \"画 \"出它。注意，在 \"绘制 \"边界框时，会自动生成遮罩，以适应末端的数值，而且边界框可以 \"夹住 \"遮罩。",
    "Finally, you can also zoom in on the frame timeline using the \"handles\" on either side of the frame view as shown in the image below:":"最后，您还可以使用框架视图两侧的\"手柄\"放大框架时间轴，如下图所示：",
    "Finally, you can chose the {}texture group{} that you wish the sprite resource to belong to. Basically, a texture group (previously defined in the {}Texture Group Manager{}) is something that you can set up so that all the image resources that you need for specific rooms or levels of your game can be stored together. So, for example, you can have all your level 1 images in one texture group, all your level 2 images in another etc... and {}GameMaker{} will try to place all those grouped resources on the same texture page to reduce texture page swapping while your game is running on the chosen target platform.":"最后，你可以选择你希望精灵资源所属的{}纹理组{}。基本上，一个纹理组（先前在{}纹理组管理器{}中定义）是你可以设置的，这样你需要的所有图像资源都可以储存在一起，用于游戏的特定房间或关卡。因此，举例来说，你可以把所有第1层的图像放在一个纹理组中，把所有第2层的图像放在另一个纹理组中，等等......而{}GameMaker{}会尝试把所有这些分组的资源放在同一个纹理页上，以减少你的游戏在所选目标平台上运行时的纹理页交换。",
    "Here you can name the sprite. The sprite name is what will be used throughout your game project to identify the sprite as a resource and can only be alpha-numeric and may only use the underbar \"_\" symbol. While you can use numbers in the sprites name, the name cannot start with a number as that would make it an invalid resource name when using GML or GML Visual.":"在这里你可以给精灵命名。这个精灵的名字将在整个游戏项目中被用来识别这个精灵的资源，它只能是字母数字，并且只能使用下划线\"_\"符号。虽然你可以在精灵名称中使用数字，但名称不能以数字开头，因为这将使它在使用 GML 或 GML 可视化时成为无效的资源名称。",
    "Here you can name the sprite. The sprite name is what will be used throughout your game project to identify the sprite as a resource and can only be alpha-numeric and may only use the underbar symbol {}_{}. While you can use numbers in the sprites name, the name cannot start with a number as that would make it an invalid resource name when using&nbsp;{}GML Code{} or {}GML Visual{}.":"您可以在这里为精灵命名。精灵名称是在整个游戏项目中用于将精灵标识为资源的名称，只能是字母数字，并且只能使用下划线符号{}_{}。虽然您可以在精灵名称中使用数字，但名称不能以数字开头，因为使用{}GML Code{}或{}GML Visual{}时，这会使其成为无效的资源名称。",
    "If you mark your sprite as needing a separate texture page, you can set whether that texture page is {}dynamic{} or not.":"如果你将你的精灵标记为需要一个单独的纹理页，你可以设置该纹理页是否为{}动态{}",
    "If your sprite is going to be used as a texture map in a 3D game, then you should check the {}Separate Texture Page{} box and the sprite will be given a texture page all of its own (note that each sub-image will also get its own texture page, so if your sprite has 10 images you will generate 10 texture pages). This will increase the texture memory needs of your game and so great care must be taken when using this option. Also note that in general if your sprite is using this option for 3D, then the textures should be a power of 2 (i.e.:&nbsp;128x128, 256x256, 512x512, etc.). For more information read&nbsp;{}Texture Pages{}.":"如果你的精灵将被用作3D游戏中的纹理贴图，那么你应该选中{}分离纹理页面{}框，精灵将被赋予一个自己的纹理页面(注意每个子图像也将得到其自己的纹理页，所以如果你的精灵有10个图像，你将生成10个纹理页面)。这会增加游戏的纹理内存需求，因此在使用此选项时必须非常小心。另外请注意，通常情况下，如果您的精灵在3D中使用此选项，则纹理应该是2的幂(即：128 x128，256 x256，512 x512等)。有关详细信息，请阅读{}纹理页面{}。",
    "If your sprite is going to be used as a texture map in a 3D game, then you should check the {}Separate Texture Page{} box and the sprite will be given a texture page all of its own (note that each sub-image will also get its own texture page, so if your sprite has 10 images you will generate 10 texture pages). This will increase the texture memory needs of your game and so great care must be taken when using this option. Also note that in general if your sprite is using this option for 3D, then the textures should be a power of 2 (ie:&nbsp;128x128, 256x256, 512x512 etc...). For more information read&nbsp;{}Texture Pages{}.":"如果你的精灵将被用作3D游戏中的纹理贴图，那么你应该勾选{}单独的纹理页{}，精灵将被赋予一个属于自己的纹理页（注意，每个子图像也将得到自己的纹理页，所以如果你的精灵有10个图像，你将产生10个纹理页）。这将增加你的游戏的纹理内存需求，因此在使用这个选项时必须非常小心。还要注意的是，一般来说，如果你的精灵使用这个选项来做3D，那么纹理应该是2的幂（即：128x128, 256x256, 512x512等...）。更多信息请阅读{}纹理页{}。",
    "In this section you can also click {}Edit Image{} to open the sprite for editing in&nbsp;{}The Image Editor{}&nbsp;if no external editor for the given sprite type is set, or in the external editor for the given sprite type, if it\u0027s provided in the {}Path Preferences{}.":"在本节中，如果没有为给定的精灵类型设置外部编辑器，您还可以单击{}编辑图像{}打开精灵，以便在{}图像编辑器{}中进行编辑;如果在{}路径首选项{}中提供了外部编辑器，则可以在给定精灵类型的外部编辑器中进行编辑。",
    "In this section you can also either open the {}Image Editor{}&nbsp;to draw&nbsp;your sprite, or you can click on the \"{}Import{}\" button to import a previously created sprite. Sprites can be imported from most common bitmap formats ( {}PNG{}, {}JPG{}, {}GIF{}, etc...) but {}GameMaker{} also supports vector sprites ({}SWF{}) and skeletal animation sprites ( {}Spine{}). For more information on these formats, please see the section on {}Non-Bitmap Sprites{}. Note that when importing bitmap sprites you can select multiple image files in the file explorer and each one will be added to the same sprite as separate sub-images (frames).":"在这一部分，你也可以打开{}Image Editor{}&nbsp;来绘制你的精灵，或者你可以点击\"{}Import{}\"按钮来导入一个之前创建的精灵。可以从大多数常见的位图格式（{}PNG{}、{}JPG{}、{}GIF{}等）导入精灵，但{}GameMaker{}也支持矢量精灵（{}SWF{}）和骨骼动画精灵（{}Spine{}）。关于这些格式的更多信息，请参见{}非位图精灵{}部分。注意，在导入位图精灵时，你可以在文件资源管理器中选择多个图像文件，每个文件都将作为独立的子图像（帧）被添加到同一个精灵中。",
    "In this section you can also either open the {}Image Editor{}&nbsp;to draw&nbsp;your sprite, or you can click on the \"{}Import{}\" button to import a previously created sprite. Sprites can be imported from most common bitmap formats ( {}PNG{}, {}JPG{}, {}GIF{}, etc...) but {}GameMaker{} also supports vector sprites ({}SWF{}) and skeletal animation sprites ({}Spine{}). For more information on these formats, please see the section on {}Non-Bitmap Sprites{}. Note that when importing bitmap sprites you can select multiple image files in the file explorer and each one will be added to the same sprite as separate sub-images (frames).":"在这一部分，你也可以打开{}图像编辑器{}来绘制你的精灵，或者你可以点击\"{}导入{}\"按钮来导入一个之前创建的精灵。可以从大多数常见的位图格式（{}PNG{}、{}JPG{}、{}GIF{} 等）导入精灵，但 {}GameMaker{} 也支持矢量精灵（{}SWF{}）和骨骼动画精灵（{}Spine{}）。关于这些格式的更多信息，请参见{}非位图精灵{}部分。注意，在导入位图精灵时，你可以在文件资源管理器中选择多个图像文件，每个文件都将作为独立的子图像（帧）被添加到同一个精灵中。",
    "In this section you can also either open the {}Image Editor{}&nbsp;to draw&nbsp;your sprite, or you can click on the \"{}Import{}\" button to import a previously created sprite. Sprites can be imported from most common bitmap formats ( {}PNG{}, {}JPG{}, {}GIF{}, etc...) but {}GameMaker{} also supports vector sprites ({}SWF{}), SVGs (which are converted to bitmaps) and skeletal animation sprites ({}Spine{}). For more information on these formats, please see the section on {}Non-Bitmap Sprites{}. Note that when importing bitmap sprites you can select multiple image files in the file explorer and each one will be added to the same sprite as separate sub-images (frames).":"在这一部分，你也可以打开{}图像编辑器{}来绘制你的精灵，或者你可以点击\"{}导入{}\"按钮来导入一个之前创建的精灵。可以从大多数常见的位图格式（{}PNG{}、{}JPG{}、{}GIF{}等）导入精灵，但 {}GameMaker{} 也支持矢量精灵（{}SWF{}）和骨骼动画精灵（{}Spine{}）。关于这些格式的更多信息，请参见{}非位图精灵{}部分。注意，在导入位图精灵时，你可以在文件资源管理器中选择多个图像文件，每个文件都将作为独立的子图像（帧）被添加到同一个精灵中。",
    "In this section you can set the image size by clicking the {}Sprite Size{} button {}. This will open the following window:":"在这一部分，你可以通过点击{}Sprite Size{}按钮{}来设置图像大小。这将打开以下窗口。",
    "In this section you can set the {}speed {}at which the animation frames should be played back from the input box on the left. The frame speed setting can either be based on \"{}Frames per second{}\", or \"{}Frames per game frame{}\", where a setting of 30 \"Frames per second\" will show 30 frames of the animation in one second, while a setting of 30 \"Frames per game frame\" will try to show all 30 frames in a single game step, so \"Frames per game frame\" values are usually set to 1 or lower (eg: a frames per game frame&nbsp;speed of 0.5 will show a new frame every two game steps).":"在本节中，你可以从左边的输入框中设置播放动画帧的{}速度{}。帧速设置可以基于\"{}每秒帧数{}\"，或\"{}每游戏帧数{}\"，其中 \"每秒帧数 \"设置为30，将在一秒钟内显示30个动画帧，而 \"每游戏帧数 \"设置为30，将试图在一个游戏步骤中显示所有30个帧，因此 \"每游戏帧数 \"的值通常设置为1或更低（例如：每游戏帧数&nbsp；速度为0.5将每两个游戏步骤显示一个新帧）。",
    "It is worth noting that if you go to the Preview window, you can adjust the collision mask using the \"handles\" found in each corner. Clicking and dragging these will adjust the collision mask just the same as inputing values for the bounding box would.":"值得注意的是，如果你进入预览窗口，你可以使用每个角落的 \"手柄 \"来调整碰撞遮罩。点击并拖动这些手柄将调整碰撞遮罩，就像为边界框输入数值一样。",
    "It\u0027s important to note that the Frame Speed settings will not only affect the playback of the animation in the preview window, but {}will also govern how the sprite is animated in your games{}. The speed you set here will show the sprite preview as it will run in the game with an image speed multiplier of 1, but this can be set in code using the {}{}image_speed{}{}&nbsp;variable meaning the sprite can run faster or slower depending on what is programmed. So, for example, if you set the sprite to use 10 \"frames per second\" and then set the {}image_speed{} to 0.5, the game will draw the sprite at half speed - 5 frames per second. Conversely, if we set the {}image_speed{} for the same sprite to 2, in the game it will be drawn animated twice as fast - 20 frames per second. Note that the frame speed can also be set in the {}Image Editor{}.":"值得注意的是，帧速设置不仅会影响预览窗口中的动画回放，而且{}也会制约精灵在游戏中的动画效果{}。你在这里设置的速度将显示精灵预览，因为它将在游戏中运行，图像速度乘数为1，但这可以在代码中使用{}{}image_speed{}{}&nbsp;变量来设置，这意味着精灵可以根据编程的内容运行的更快或更慢。因此，举例来说，如果你将精灵设定为使用每秒10个 \"帧\"，然后将{}image_speed{}设置为0.5，游戏将以半速--每秒5个帧的速度绘制精灵。相反，如果我们将同一精灵的{}image_speed{}设置为2，在游戏中，它将以两倍的速度绘制动画--每秒20帧。注意，帧速也可以在{}图像编辑器{}中设置。",
    "It\u0027s important to note that the Frame Speed settings will not only affect the playback of the animation in the preview window, but {}will also govern how the sprite is animated in your games{}. The speed you set here will show the sprite preview as it will run in the game with an image speed multiplier of 1, but this can be set in code using the&nbsp;{}{}image_speed{}{} variable meaning the sprite can run faster or slower depending on what is programmed. So, for example, if you set the sprite to use 10 \"frames per second\" and then set the {}image_speed{} to 0.5, the game will draw the sprite at half speed - 5 frames per second. Conversely, if we set the {}image_speed{} for the same sprite to 2, in the game it will be drawn animated twice as fast - 20 frames per second. Note that the frame speed can also be set in {}The Image Editor{}.":"请务必注意，帧速度设置不仅会影响预览窗口中动画的播放，而且{}还将控制精灵在游戏中的动画效果{}。 您在此处设置的速度将显示精灵预览，因为它将在游戏中以图像速度乘数 1 运行，但这可以使用 {}{}image_speed{}{} 变量在代码中设置，这意味着精灵可以运行得更快 或者更慢，具体取决于编程内容。 因此，举例来说，如果您将精灵设置为使用 10“每秒帧数”，然后将 {}image_speed{} 设置为 0.5，则游戏将以半速绘制精灵 - 每秒 5 帧。 相反，如果我们将同一个精灵的 {}image_speed{} 设置为 2，则在游戏中绘制动画的速度会是原来的两倍 - 每秒 20 帧。 请注意，还可以在{}图像编辑器{}中设置帧速度。",
    "Non-Bitmap Sprites":"非位图精灵",
    "Note that the loop/ping-pong option {}will not affect how the sprite is displayed in the game{}, so setting these options in the sprite will not change the way it is shown when the game is compiled and run. This is also&nbsp;true&nbsp;for loop-points that can be set in the {}Frame View {}(see below for more information) - these are purely visible in the Sprite Editor and designed to help you test out your animations, but will have no effect on how the sprite animation is displayed in your games.":"请注意，循环/乒乓选项{}不会影响精灵在游戏中的显示方式{}，所以在精灵中设置这些选项不会改变游戏编译和运行时的显示方式。对于可以在{}Frame View{}中设置的循环点也是如此。(更多信息请参见下文)-这些在精灵编辑器中完全可见，旨在帮助您测试动画，但不会影响精灵动画在游戏中的显示方式。",
    "Note that the loop/ping-pong option {}will not affect how the sprite is displayed in the game{}, so setting these options in the sprite will not change the way it is shown when the game is compiled and run. This is also&nbsp;true&nbsp;for loop-points that can be set in the {}Frame View {}(see below for more information) - these are purely visible in the sprite editor and designed to help you test out your animations, but will have no effect on how the sprite animation is displayed in your games.":"注意，循环/平移选项{}不会影响精灵在游戏中的显示方式{}，所以在精灵中设置这些选项不会改变游戏编译和运行时的显示方式。对于可以在{}帧视图{}中设置的循环点也是如此（详见下文）--这些循环点在精灵编辑器中纯粹是可见的，旨在帮助你测试你的动画，但不会对精灵动画在游戏中的显示方式产生影响。",
    "Texture groups are only relevant to&nbsp;{}bitmap{}&nbsp;images, and non-bitmap sprites will not be assigned to texture groups and some of the above options will not be available for them. Some non-bitmap sprites will already have their own unique texture page (skeleton animation sprites) while others just don\u0027t require textures as they are comprised of&nbsp;{}vector{} {}s{}&nbsp;(SWF sprites). For more information please see the following section:":"纹理组只与&nbsp;{}位图{}&nbsp;图像有关，非位图精灵不会被分配到纹理组中，上述的一些选项也不会对它们可用。一些非位图精灵已经有了自己独特的纹理页（骨骼动画精灵），而另一些则不需要纹理，因为它们是由&nbsp;{}矢量数学{} {}{}&nbsp;（SWF精灵）组成的。更多信息请见以下章节：",
    "The Sprite Editor":"精灵编辑器",
    "The following image illustrates the different mask options:":"下面的图片说明了不同的遮罩选项：",
    "The next option is to enable {}Pre-Multiplied Alpha{} for the sprite images. When enabled, this will pre-multiply the alpha of all sub-images of the sprite. This is normally only necessary drawing sprites to surfaces, or for some specific special effects. For normal sprite use you should not see any noticeable difference between the normal sprite and the pre-multiplied one.":"下一个选项是为精灵图像启用{}预乘 Alpha{}。启用后，这将对精灵的所有子图像的阿尔法进行预乘。通常只有在将精灵绘制到表面上，或者在某些特定的特殊效果下才需要这样做。对于正常的精灵使用，你不应该看到正常的精灵和预乘的精灵之间有任何明显的区别。",
    "The parts that make up the Sprite Editor are as follows:":"组成精灵编辑器的部分如下：",
    "The right mouse button menu has the following options:":"鼠标右键菜单有以下选项：",
    "The sprite {}preview {}window shows the sprite as it will look in the game, and can be zoomed in or out by using the mouse wheel {}, and panned around using the middle mouse button {}&nbsp;and draggging, or alternatively use the combination&nbsp;{}&nbsp;+ {}&nbsp;and dragging. You can use the Frame controls (explained below) to change how the preview image is displayed too.":"精灵{}预览{}窗口显示的是精灵在游戏中的样子，可以用鼠标滚轮{}放大或缩小，用鼠标中键{}&nbsp;和拖动来平移，或者用组合键&nbsp;{}&nbsp;+ {}&nbsp;和拖动。你也可以使用框架控制（在下面解释）来改变预览图像的显示方式。",
    "The top bar of the sprite editor contains the {}sprite origin{} properties. This is the point on the sprite that corresponds to its position within the room, ie: when you create an instance at a particular x/y position, the origin of the sprite is placed there.":"精灵编辑器的顶栏包含{}精灵原点{}属性。这是精灵上与它在房间里的位置相对应的点，即：当你在一个特定的X/Y位置上创建一个实例时，精灵的原点就放在那里。",
    "The {}Nine Slice Preview{} window allows you to resize the image and shows how the final image will look, after it is scaled using the Nine Slice technique. This preview sprite can also be rotated.":"{}九宫格预览{}窗口允许你调整图像的大小，并显示了使用九宫格技术缩放后的最终图像的效果。这个预览精灵也可以旋转。",
    "The {}Nine Slice{} section has the following options:":"{}九宫格{}部分有以下选项：",
    "The {}Playback controls{} are for playing back in the preview window the animation of the frames, with the play button {}&nbsp;starting/stopping the animation and the Loop button {}&nbsp;used to set whether the sprite loops {}&nbsp;(goes back to frame 1 when the last frame is reached) or ping-pongs {}&nbsp;(goes backwards through the frames when the last frame is reached).":"{}播放控制{}用于在预览窗口中回放帧的动画，其中播放按钮{}&nbsp;用于启动/停止动画，循环按钮{}&nbsp;用于设置精灵是循环{}&nbsp;（到达最后一帧时回到第一帧）还是平移{}&nbsp;（到达最后一帧时倒退到各帧）。",
    "The {}Tile Horizontally{} and {}Tile Vertically{} check boxes are, by default, not normally checked as most times you do not want to tile sprites. However, in certain circumstances you may wish them to tile, meaning that you should check these options, especially if you are going to be scaling the view or room as scaling can introduce artefacts into the graphics of a game if the texture page is not generated properly.":"默认情况下，{}图块水平{}和{}图块垂直{}复选框是不被选中的，因为大多数情况下你并不希望对精灵进行图块。然而，在某些情况下，你可能希望它们图块，这意味着你应该勾选这些选项，特别是当你要缩放视图或房间的时候，因为如果纹理页没有正确生成，缩放会给游戏的图形带来伪影。",
    "This button will add a {}broadcast message{} to the sprite timeline, opening a dialog where you can add the message to be broadcast. The message will be added wherever the {}playhead{} is in the frame view and consists of a simple string that can be picked up in the {}Broadcast Message Event{}&nbsp;when it is triggered and then acted on.":"这个按钮将在精灵的时间线上添加一个{}广播信息{}，打开一个对话框，你可以添加要广播的信息。消息将被添加到{}播放头{}在框架视图中的任何地方，并由一个简单的字符串组成，当它被触发时，可以在{}广播消息事件{}&nbsp;中获取，然后进行操作。",
    "This part of the sprite editor shows each of the different {}frames {}that make up a single sprite set along a sequence timeline. You can click {}&nbsp;on any frame and drag it left or right to change the order in which they will be animated, and you can also double click {}&nbsp;on any frame to launch the {}Image Editor{}&nbsp;and edit them. You can cut, copy and paste frames using the standard keyboard shortcuts or by using the right-mouse button {}&nbsp;menu options, and you can also select multiple frames to operate on using {}&nbsp;/&nbsp;{}&nbsp;+ {}.":"在精灵编辑器的这一部分，显示了每个不同的{}帧{}，它们沿着序列时间线组成了一个精灵集。你可以点击{}&nbsp;任何一帧，并向左或向右拖动，以改变它们的动画顺序，你也可以双击{}&nbsp;任何一帧，启动{}图像编辑器{}&nbsp;并编辑它们。你可以使用标准的键盘快捷键或使用鼠标右键{}&nbsp;菜单选项来剪切、复制和粘贴帧，你还可以使用{}&nbsp;/&nbsp;{}&nbsp;+{}选择多个帧来进行操作。",
    "This part of the sprite editor shows each of the different {}frames {}that make up a single sprite set along a sequence timeline. You can click {}&nbsp;on any frame and drag it left or right to change the order in which they will be animated, and you can also double click {}&nbsp;on any frame to launch&nbsp;{}The Image Editor{} and edit them. You can cut, copy and paste frames using the standard keyboard shortcuts or by using the right-mouse button {}&nbsp;menu options, and you can also select multiple frames to operate on using {}&nbsp;/&nbsp;{}&nbsp;+ {}.":"精灵编辑器的这一部分显示每个不同的{}帧{}，这些帧沿着序列时间轴组成单个精灵集。您可以单击{}任何帧并向左或向右拖动它来更改它们的动画顺序，还可以双击{}任何帧以启动{}图像编辑器{}并编辑它们。您可以剪切，使用标准键盘快捷键或使用鼠标右键{}菜单选项复制和粘贴帧，还可以使用{}/{}+{}选择多个帧进行操作。",
    "This window will also show a \"cross\" that marks the&nbsp;{}origin{}&nbsp;of the sprite (see the Sprite Origin section above for more details), and it can also show the&nbsp;{}collision mask{}&nbsp;if that option is being edited (see the Collision Mask section, above).":"这个窗口也会显示一个标记精灵的&nbsp;{}原点{}&nbsp;的 \"十字\"（详见上面的精灵原点部分），它也可以显示&nbsp;{}碰撞遮罩{}&nbsp;，如果该选项正在编辑的话（详见上面的碰撞遮罩部分）。",
    "To the top right of the Preview window you have the {}zoom controls{}. These buttons control the current preview sprite zoom level. You can zoom in or out and clicking the {}&nbsp;button will reset the preview to be 1:1 with the sprite being edited. You can also click the Window Fit button {}&nbsp;to make the entire sprite preview fit within the current editor window (this will zoom in/out as appropriate to make it fit).&nbsp;Note that you can zoom in and out using the {}&nbsp;/&nbsp;{} and the Mouse Wheel {}, and pressing {}&nbsp;/&nbsp;{}&nbsp;+&nbsp;{}&nbsp;will set the preview to be 1:1 with the actua sprite size.":"在预览窗口的右上方，你有{}缩放控制{}。这些按钮控制着当前预览精灵的缩放级别。你可以放大或缩小，点击{}&nbsp;按钮将重置预览，使其与正在编辑的精灵成1:1。你也可以点击窗口适合按钮{}&nbsp;，使整个精灵预览适合于当前编辑器窗口（这将酌情放大/缩小以使其适合）。 注意，你可以用{}&nbsp;/&nbsp;{}和鼠标滚轮{}来放大和缩小，按{}&nbsp;/&nbsp;{}&nbsp;+&nbsp;{}&nbsp;会将预览设置为与实际精灵尺寸1:1。",
    "We also have an{} Edge Filtering{} option. This option is specifically for when you have {}linear interpolation{} enabled for your game and you are seeing \"halos\" of colour around your sprites. This is caused by the hardware interpolating from multiple source {}texel{}{}s{} on the texture page all at once, and can be particularly obvious when you scale games up in resolution. Enabling this will filter the edge pixels to take on the colour of the nearest full alpha sprite pixel and so blend the interpolated pixels without the halo that was present previously.":"我们也有一个{}边沿滤波{}选项。这个选项特别适用于当你的游戏启用了{}线性插值{}，而你在精灵周围看到了颜色的 \"光晕\"。这是由于硬件同时从纹理页面上的多个源{}Texel{}{}s{}进行插值造成的，当你扩大游戏的分辨率时，会特别明显。启用这个功能将过滤边缘像素，使其采用最近的全阿尔法精灵像素的颜色，从而将插值的像素混合在一起，不会出现之前的光晕。",
    "When you are happy with the new size, you can click {}Apply {}to apply the changes and close the Resize properties window. Note that when applying a change in scale or size to a sprite, you can choose to have the change applied to the origin of the sprite too, by checking the {}Apply to Origin {}checkbox beside the {}Apply&nbsp;{}button. When checked - if the origin is not one of the default settings and is not locked in the sprite - then its position will be scaled to match the change to the size of the sprite. When un-checked, no scaling will be applied to the origin. If the origin is not a custom value or is locked, then it will be grayed out and unavailable. You can set this option for all sprites from the {}Sprite Editor Preferences{}.":"当你对新的尺寸感到满意时，你可以点击{}应用{}来应用这些变化并关闭 \"调整大小 \"属性窗口。请注意，当应用一个精灵的比例或大小的变化时，你可以选择把这个变化也应用到精灵的原点，方法是勾选{}应用到原点{}复选框旁边的{}应用{}复选框。勾选后--如果原点不是默认设置之一，也没有被锁定在精灵中--那么它的位置将被缩放以匹配精灵尺寸的变化。如果不勾选，将不会对原点进行缩放。如果原点不是自定义值或被锁定，那么它将是灰色的，不可用。你可以在{}精灵编辑器首选项{}中为所有精灵设置这个选项。",
    "You can also import GIFs and&nbsp;{}Strip Images{}&nbsp;for animation.":"您还可以导入GIF和{}条带图像{}用于动画。",
    "You can click on the \"{}Import{}\" button to import a previously created sprite. Sprites can be imported from most common bitmap formats ({}PNG{}, {}JPG{}, {}GIF{}, etc.) but {}GameMaker{} also supports vector sprites ({}SWF{}), SVGs (which are converted to bitmaps) and skeletal animation sprites ({}Spine{}). For more information on these formats, please see the section on&nbsp;{}Non-Bitmap Sprites{}. Note that when importing bitmap sprites you can select multiple image files in the file explorer and each one will be added to the same sprite as separate sub-images (frames).":"您可以点击“{}导入{}”按钮导入之前创建的精灵。 可以从最常见的位图格式（{}PNG{}、{}JPG{}、{}GIF{} 等）导入精灵，但 {}GameMaker{} 还支持矢量精灵 ({}SWF{})、SVG （转换为位图）和骨骼动画精灵 ({}Spine{})。 如需了解有关这些格式的更多信息，请参阅有关{}非位图精灵{} 的部分。 请注意，导入位图精灵时，您可以在文件资源管理器中选择多个图像文件，每个图像文件都将作为单独的子图像（帧）添加到同一精灵中。",
    "You can find out more about texture pages {}here{}.":"你可以在{}这里{}找到更多关于纹理页的信息。",
    "{}A stretched frame will take more time to be shown, just as if you\u0027d duplicated the same frame multiple times.&nbsp;":"{}一个被拉伸的框架将需要更多的时间来显示，就像你把同一个框架重复了多次一样。",
    "{}Activate Nine Slice:{} This option controls whether Nine Slice scaling is used when the sprite is scaled. When enabled, Nine Slice&nbsp;scaling will be used for the sprite (and any object instances using that sprite) placed in a Sequence or a Room Layer, and scaled sprites drawn using {}draw_sprite_ext(){}&nbsp;and other similar functions.{} {} {}{}{}NOTE{}: Nine Slicing will not work with functions that draw only a part of the sprite or distort it, such as&nbsp;{}{}draw_sprite_part(){}{} or&nbsp;{}{}draw_sprite_pos(){}.{}{}{} ":"{}激活九宫格：{}该选项控制在精灵被缩放时是否使用Nine Slice缩放比例。启用后，九宫格缩放将被用于放置在序列或房间层中的精灵（以及任何使用该精灵的对象实例），以及使用{}draw_sprite_ext(){}&nbsp;和其他类似函数绘制的缩放精灵。{}{}{}{}{}注意{}：九宫格不能用于只绘制精灵的一部分或使其变形的函数，例如&nbsp;{}{}draw_sprite_part(){}{}或&nbsp;{}{}draw_sprite_pos(){}。{}{}{}",
    "{}Add Frame{} - Add a new frame to the animation at the end.":"{}添加帧{} - 在动画的最后添加一个新帧。",
    "{}Automatic{}: {}GameMaker{} will calculate the collision mask automatically based on the sprite alpha values (this will depend on the Tolerance setting explained below).":"{}自动{}：{}GameMaker{}将根据精灵的阿尔法值自动计算碰撞遮罩（这将取决于下面解释的公差设置）。",
    "{}Broadcast Messages{}{}Broadcast Messages{}":"{}广播信息{}{}广播信息{}",
    "{}Collision Mask{}{}Collision Mask{}":"{}碰撞遮罩{}{}碰撞遮罩{}",
    "{}Cut {}/ {}Copy {}/ {}Paste {}- Cut, copy and paste one or more frames.":"{}剪切{}/ {}复制{}/ {}粘贴{}-剪切、复制和粘贴一个或多个帧。",
    "{}Delete Selected Frames{} - Delete the currently selected frame or frames.":"{}删除选定帧{} - 删除当前选定的一个或多个帧。",
    "{}Diamond{}: Creates a \"diamond\" collision mask. This is slower to resolve and generates more CPU overhead than both the rectangular and ellipitical masks.":"{}钻石{}：创建一个\"钻石\"碰撞遮罩。与矩形和椭圆形遮罩相比，它的解析速度较慢，产生的CPU开销也更大。",
    "{}Ellipse{}: Creates an elliptical collision mask. This is slower to resolve than the rectangular mask.":"{}椭圆{}：创建一个椭圆的碰撞遮罩。这比矩形遮罩的解析速度要慢。",
    "{}Frame Speed{}{}Frame Speed{}":"{}帧速率{}{}帧速率{}",
    "{}Frames{}{}Frames{}":"{}帧{}{}帧{}",
    "{}Full Image{}: The mask will be calculated with it\u0027s bounds being the same as the left, right, top and bottom bounds of the sprite.":"{}完整图像{}：遮罩将被计算，它的边界与精灵的左、右、上、下边界相同。",
    "{}Guides:{} This section displays the offset of each guide on its axis, and can be used to change those offsets. These guides can also be moved inside the {}Sprite Preview{} window by simply dragging them with the mouse.{} {} {}{}{}NOTE{}{}&nbsp;Any guides on the same axis cannot cross each other, and dragging one over the other will result in the second guide being pushed.{}{} {} {}{} The offset of each guide is relative to its corresponding edge. For example, the left guide is offset from the left edge, the right edge is offset from the right edge, and so on.{} {} The color and alpha of each guide can be changed by clicking on the colored button next to the guide’s position.{} {} ":"{}参考线：{}这部分显示每个参考线在其轴上的偏移量，并可以用来改变这些偏移量。这些导轨也可以在{}精灵预览{}窗口内移动，只需用鼠标拖动它们。{}{}{}{}{}注意{}{}&nbsp;同一轴上的任何参考线不能相互交叉，将一个参考线拖到另一个上会导致第二个参考线被推开。{}{}{}{}{}每个参考线的偏移量是相对于其对应的边缘而言的。例如，左边的参考线是从左边的边缘偏移的，右边的边缘是从右边的边缘偏移的，以此类推。{}{}通过点击参考线位置旁边的彩色按钮，可以改变每个参考线的颜色和字母。{}{}",
    "{}Here you can see a preview of the sprite before and after applying the chosen transforms, and the section below is for setting the new sprite properties and is split into two parts:":"{}在这里你可以看到应用所选变换之前和之后的精灵预览，下面的部分是设置新的精灵属性，分为两部分：",
    "{}Highlight{}: This option affects how a selected slice appears in the Sprite Preview window.&nbsp;{}\"Inverted\"{} highlights the sprite with an overlay&nbsp;except&nbsp;for the selected slice, and {}\"Overlay\"{} highlights only the selected slice with an overlay.{} {}{} The color and alpha of the overlay can be changed by clicking on the colored button next to the drop-down menu. ":"{}高亮{}：该选项影响所选片断在精灵预览窗口中的显示方式。{}\"Inverted\"{}用覆盖物突出精灵，但所选片断除外；{}\"Overlay\"{}只用覆盖物突出所选片断。{}{}{}可以通过点击下拉菜单旁边的彩色按钮改变覆盖物的颜色和alpha。",
    "{}IMPORTANT!{} Frames are shown numbered from 1 to&nbsp;{}maxframe number{}, however in your game code, frames will be numbered from 0 to&nbsp;{}maxframe number - 1{}.":"{}重要！{} 帧数显示为从1到{}最大帧数{}，然而在你的游戏代码中，帧数将从0到{}最大帧数-1{}编号。",
    "{}Image Properties{}{}Image Properties{}":"{}图像属性{}{}图像属性{}",
    "{}Insert Frame{} - Insert a new frame in the animation after the currently selected frame.":"{}插入帧{} - 在当前选定的帧之后插入一个新的动画帧。",
    "{}Manual{}: Selecting this means that you wish to set the bounds of the collision mask using the input values for left, right, top and bottom.":"{}手动{}：选择此项意味着你希望使用左、右、上、下的输入值来设置碰撞遮罩的边界。",
    "{}NOTE{} This option is only available for {}bitmap{} sprites and will be greyed out for SWF or skeleton animation sprites.":"{}注意{} 该选项仅适用于{}位图{}精灵，对于SWF或骨骼动画精灵，该选项将被置为灰色。",
    "{}Nine Slice{}{}Nine Slice{}":"{}九宫切片{}{}九宫切片{}",
    "{}Once added, the message will be shown in the Frame View, and you can click the right mouse button {}&nbsp;on it to open a menu where you can delete the message or edit it. For more information on Broadcast Messages please see {}here{}.":"{}一旦添加，信息将显示在框架视图中，你可以点击鼠标右键{}&nbsp;，打开一个菜单，你可以删除该信息或编辑它。关于广播信息的更多信息，请见{}这里{}。",
    "{}Once added, the message will be shown in the Frame View, and you can click the right mouse button {}&nbsp;on it to open a menu where you can delete the message or edit it. See&nbsp;{}Broadcast Messages &amp; Moments{} for more info.":"{} 添加后，该消息将显示在 Frame View 中，您可以在其上点击鼠标右键 {} 打开一个菜单，您可以在其中删除该消息或对其进行编辑。请参阅 {} 广播消息和广播消息时刻 {} 了解更多信息。",
    "{}Once added, the message will be shown in the Frame View, and you can click the right mouse button {}&nbsp;on it to open a menu where you can delete the message or edit it. See&nbsp;{}Broadcast Messages{} for more info.":"{}添加后，消息将显示在框架视图中，您可以在其上单击鼠标右键{}以打开一个菜单，您可以在其中删除或编辑消息。有关详细信息，请参阅{}广播消息{}。",
    "{}Playback Controls{}{}Playback Controls{}":"{}播放控制{}{}播放控制{}",
    "{}Precise (per frame){}: This creates a precise collision mask on a per-frame basis (i.e.: the mask will change to conform to the outline of each different frame). Note that the precise mask will be clipped to the {}bounding box{} if the Mode is set to Manual and you change the default values. This is by far the slowest type of collision mask to resolve and should be avoided except in very, very specific and infrequent cases.":"{}精确(每帧){}：这将在每帧的基础上创建精确的碰撞掩码(即：遮罩将改变以符合每个不同帧的轮廓)。注意，如果模式设置为手动并且您更改默认值，精确遮罩将被剪切到{}边界框{}。这是迄今为止解决冲突遮罩的最慢类型，应该避免，除非在非常，非常具体和罕见的案例。",
    "{}Precise (per frame){}: This creates a precise collision mask on a per-frame basis (ie: the mask will change to conform to the outline of each different frame). Note that the precise mask will be clipped to the {}bounding box{} if the Mode is set to Manual and you change the default values. This is by far the slowest type of collision mask to resolve and should be avoided except in very, very specific and infrequent cases.":"{}精确(每帧){}：这将在每一帧的基础上创建一个精确的碰撞遮罩（即：遮罩将改变以符合每个不同帧的轮廓）。请注意，如果模式设置为手动，并且你改变了默认值，那么精确蒙版将被剪切到{}边界框{}上。这是迄今为止解决碰撞遮罩最慢的类型，应该避免，除非在非常、非常特殊和不常见的情况下。",
    "{}Precise{}: This creates a precise collision mask based on the outline of the sprite. If the sprite has multiple sub-images, then this will be a {}composite {}of the edges of {}all {}the sub-images placed over each other. Note that the precise mask will be clipped to the {}bounding box{} if the Mode is set to Manual and you change the default values. This is very slow and generates a lot of CPU overhead.":"{}精确{}：这将根据精灵的轮廓创建一个精确的碰撞屏蔽。如果精灵有多个子图像，那么这将是{}所有{}子图像的边缘的{}合成{}，并相互重叠。请注意，如果模式设置为手动，并且你改变了默认值，那么精确蒙版将被剪切到{}边界框{}。这是很慢的，而且会产生大量的CPU开销。",
    "{}Preview{}{}Preview{}":"{}预览{}{}预览{}",
    "{}Rectangle{}: A simple rectangular collision mask. This is the fastest to resolve when used in your project.":"{}矩形{}：一个简单的矩形碰撞遮罩。在你的项目中使用时，这是最快速的解决方式。",
    "{}Resize Canvas{}: This option will resize the draw canvas to the new size without scaling the contents. You can set the \"anchor\" point for the resize using the directional arrows then set the size value. There is an option to maintain aspect ratio when resizing the canvas and at the bottom you can choose to set the resize values in either pixels or as a percentage.":"{}调整画布{}：该选项将把画布的大小调整到新的尺寸，而不对内容进行缩放。你可以用方向箭头设置调整大小的 \"锚 \"点，然后设置大小值。在调整画布大小时，有一个选项可以保持长宽比，在底部你可以选择以像素或百分比来设置调整值。",
    "{}Rotated Rectangle{}: This is a simple rectangular collision mask which will rotate along with the {}image_angle{} value of the instance with the sprite assigned. This is slower to resolve than the regular rectangular collision mask, but faster than a precise collision mask.":"{}任意方向矩形{}: 这是一个简单的矩形碰撞遮罩，它将随着分配给精灵的实例的{}image_angle{}值进行旋转。这比普通的矩形碰撞遮罩解决得慢，但比精确碰撞遮罩快。",
    "{}Scale Image{}: With this option you can resize the sprite draw canvas and any images contained on the sprite will be stretched and scaled to fit the new size. You can choose to scale and maintain the aspect ratio of the base image, and you can also choose whether to scale in Pixels or in Percentage. Depending on the type of image you are working with you may also want to enable linear interpolation or not (in general, linear interpolation will \"smooth\" pixels over an area and so is best left off for pixel art).":"{}缩放图像{}：有了这个选项，你可以调整精灵画布的大小，精灵上包含的任何图像都会被拉伸和缩放以适应新的尺寸。你可以选择缩放并保持基础图像的长宽比，你也可以选择以像素或百分比的方式缩放。根据你所处理的图像类型，你可能还想启用线性插值或不启用（一般来说，线性插值会在一个区域内 \"平滑 \"像素，所以对于像素艺术来说最好不要启用）。",
    "{}Selected Slice:{} This option can be used to select a slice, choosing one from the edge slices (left, top, right, bottom) and the centre one. A slice can also be selected by&nbsp;{}&nbsp;left clicking on it in the {}Sprite Preview{} window, and clicking on it again will de-select it.":"{}所选切片：{}这个选项可以用来选择一个图块，从边缘图块（左、上、右、下）和中间图块中选择一个。也可以通过在{}精灵预览{}窗口中左键点击一个片断来选择，再次点击它将取消选择。",
    "{}Spine Collision Mesh{}: Apart from Rectangle, this is the only selectable option for Spine sprites. It enables more precise collision checking against the mesh in the sprite.":"{}脊柱碰撞网格{}：除了矩形之外，这是脊柱精灵的唯一可选选项。 它可以对精灵中的网格进行更精确的碰撞检查。",
    "{}Sprite Name{}{}Sprite Name{}":"{}精灵名称{}{}精灵名称{}",
    "{}Sprite Origin{}{}Sprite Origin{}":"{}精灵原点{}{}精灵原点{}",
    "{}Texture Settings{}{}Texture Settings{}":"{}纹理设置{}{}纹理设置{}",
    "{}The Sprite Editor{}":"{}精灵编辑器{}",
    "{}The collision checking options are very important ones for your game, as they will directly influence how your objects interact and how your game runs, with the wrong settings even having a negative impact on the over all performance. Why is that? Well, whenever two instances meet, and both instances have a valid mask, a collision event is generated by checking the overlap of the bounding box {}and&nbsp;{}the mask, which can either be precise or not, and adapted to the image index or not. Below is an image to illustrate this:":"{}碰撞检查选项对你的游戏来说是非常重要的，因为它们将直接影响你的物体如何互动，以及你的游戏如何运行，错误的设置甚至会对整体性能产生负面影响。为什么会这样呢？好吧，每当两个实例相遇，并且两个实例都有一个有效的遮罩，一个碰撞事件就会通过检查边界框{}和&nbsp;{}遮罩的重叠而产生，这个遮罩可以是精确的，也可以是不精确的，并且适应图像索引。下面是一张图片来说明这个问题：",
    "{}The {}Nine Slice{} section of the Sprite Editor allows you to enable&nbsp;{}Nine Slicing{} on a sprite, and preview it in action inside the {}Nine Slice Preview{} window on the right.":"{}精灵编辑器的{}九宫格{}部分允许你在精灵上启用&nbsp;{}九宫格{}，并在右边的{}九宫格预览{}窗口内预览其动作。",
    "{}The {}Sprite Editor{} is where you set the general properties for {}sprites{}&nbsp;that you make. You can open this window by creating a new sprite (right-click&nbsp;{}&nbsp;on the {}Asset Browser{}&nbsp;and select \"Create Sprite\"), by double-clicking {}&nbsp;on an existing sprite or by right-clicking {}&nbsp;an existing sprite and selecting \"{}Properties{}\".":"{}{}精灵编辑器{}是你为你制作的{}精灵{}设置一般属性的地方。你可以通过创建一个新的精灵（在{6}资源浏览器{7}上右击{}，选择\"创建精灵\"），在现有的精灵上双击{}，或者右击{}现有的精灵并选择\"{}属性{}\"来打开这个窗口。",
    "{}This section of the sprite properties window deals with how {}GameMaker{} stores the images that make up your sprite on {}texture page{}{}s{} for use with devices and browsers. For desktop platforms this may not be too important, but when you start to develop for mobile or web the proper management of your image assets (textures) becomes very important as poorly managed textures can have detrimental effect on your game, causing performance issues.":"{}精灵属性窗口的这一部分涉及到{}GameMaker{}如何在{}纹理页{}{}{}上存储构成你的精灵的图像，以便在设备和浏览器上使用。对于桌面平台来说，这可能不是太重要，但当你开始为手机或网络开发时，正确管理你的图像资源（纹理）就变得非常重要，因为纹理管理不善会对你的游戏产生不利影响，导致性能问题。",
    "{}Tile Mode: {}This option is used in conjunction with the {}Selected Slice{} option, to control how the slice appears when the sprite is scaled. You can apply one of the following Tile Modes to each slice:{} {} {} {}{}Stretch{}{}:{} The slice will be stretched to fill the gap between its connected corners.{} {}{}Repeat{}{}:{} The slice will be repeated or tiled to preserve detail.{} {}{}Mirror{}{}:{} The slice will be repeated by mirroring.{} {}{}Blank Repeat{}{}:{} The slice will only appear once, resulting in a blank area after it.{} {}{}Hide{}{}:{} The slice will not appear at all.{} {} ":"{}图块模式：{}这个选项与{}所选切片{}选项一起使用，控制精灵被缩放时，图块如何出现。你可以为每个片断应用以下一种图块模式：{} {} {} {}{}拉伸{}{}:{} 该片将被拉伸以填补其连接角之间的空隙。{}{}{}重复{}{}:{} 该片将被重复或图块以保留细节。 {}{}{}镜像{}{}:{}该片断将通过镜像重复。{} {}{}空白重复{}{}:{}该片断将只出现一次，导致其后面出现空白区域。{} {}{}隐藏{}{}:{}该片断将完全不出现。{}{}",
    "{}Zoom Controls{}{}Zoom Controls{}":"{}缩放控制{}{}缩放控制{}",
    "{}{}IMPORTANT{}{}&nbsp;Frames are shown numbered from 1 to&nbsp;{}maxframe number{}, however in your game code, frames will be numbered from 0 to&nbsp;{}maxframe number - 1{}.":"{}{}重要{}{} 帧的编号从1到{}最大数量帧{}，但在您的游戏代码中，帧的编号将从0到{}最大数量帧 - 1{}。",
    "{}{}NOTE{}{}&nbsp;This may not always be necessary and the performance increase from this method will depend on whether the target device is CPU bound or GPU bound.":"{}{}注意{}{}&nbsp;这可能并不总是必要的，这种方法的性能提升将取决于目标设备是CPU绑定还是GPU绑定。",
    "{}{}NOTE{}{}&nbsp;This option is only available for {}bitmap{} sprites and will be greyed out for SWF or skeleton animation sprites.":"{}{}注意{}{}此选项仅适用于{}位图{}精灵，并且将在贴图或骨架动画精灵中灰显。",
    "{}{}NOTE{}{}&nbsp;When you import a GIF with a single frame that has a frame speed defined, the sprite\u0027s animation speed will be set to this frame speed.":"{}{}注意{}{}当您导入具有已定义帧速度的单帧GIF时，精灵的动画速度将设置为该帧速度。",
    "{}{}Nine Slicing{}{}&nbsp;(also known as 9-slicing) is a technique used to scale rectangular images for preserving details, making them retain their original form after scaling. See the page on {}Nine Slice{} for more information.":"{}{}九宫格（Nine Slicing）{}{}&nbsp;(又被称为 9-slicing）是一种用于缩放矩形图像以保留细节的技术，使其在缩放后保留原始形态。更多信息请参见{}九宫格{}的页面。",
    "{}{}Nine Slicing{}{}&nbsp;(also known as 9-slicing) is a technique used to scale rectangular images for preserving details, making them retain their original form after scaling. See the page on&nbsp;{}Nine Slice{} for more information.":"{}{}九宫切片{}{}(也称为9层切片)是一种用于缩放矩形图像以保留细节的技术，使它们在缩放后保持原始形状。有关详细信息，请参阅{}九宫切片{}页面。",
    "{}{}The Sprite Editor{}&nbsp;is where you set the general properties for {}sprites{}&nbsp;that you make. You can open this window by creating a new sprite (right-click&nbsp;{}&nbsp;on {}The Asset Browser{}&nbsp;and select {}Create Sprite{}), by double-clicking {}&nbsp;on an existing sprite or by right-clicking {}&nbsp;an existing sprite and selecting {}Properties{}.":"{}在{}精灵编辑器{}中，您可以设置所制作{}精灵{}的常规属性。您可以通过创建新精灵(右键单击{}打开{}资产浏览器{}并选择\"{}创建精灵{}\")，方法是双击{}在现有精灵上或通过右键单击{}一个现有的精灵并选择属性。"
}