{
    "Also see the preferences:":"另请参阅首选项：",
    "Code Editor Preferences":"代码编辑器首选项",
    "Code Snippets ":"代码片段",
    "Contents":"内容",
    "Each file that the editor can open and edit is referred to as a \"document\", e.g. each event in an object is a separate document, the vertex and fragment shaders are two documents, a room\u0027s Creation Code is a document, and so on.":"编辑器可以打开和编辑的每个文件都称为 \" 文档\"，例如对象中的每个事件都是一个单独的文档，顶点和片段着色器是两个文档，房间的创建代码是一个文档，等等。",
    "Editing Code":"编辑代码",
    "Editor Frame":"编辑器框架",
    "Feather Data Types":"羽毛数据类型",
    "Feather Directives":"羽毛指令",
    "Feather Features":"羽毛特点",
    "Finally you have a drop-down to change the language of the document (where it says \"{}GML{}\" for a GML Code document). When switching between GML Code and GML Visual, only the focused event will be modified. The languages that appear in the list will depend on the type of document that is open.":"最后，您可以通过一个下拉菜单来更改文档的语言 (其中显示 \"{}GML{}\" 表示 GML 代码文档)。当在 GML Code 和 GML Visual 之间切换时，只有焦点事件会被修改。列表中显示的语言取决于打开的文档的类型。",
    "Further Reading":"进一步阅读",
    "Gutter":"装订线",
    "Here you can change which asset you are working on, the document within that asset being edited, and focus on a particular variable or function definition in the active document.":"您可以在此处更改正在处理的资产、正在编辑的资产中的文档，并关注活动文档中的特定变量或函数定义。",
    "Horizontal Scrollbar":"水平滚动条",
    "Hovering over a part of the minimap will temporarily display the code at that position, as seen on the left in the image above. The preview will continue to be displayed until your mouse cursor leaves the minimap area.":"将鼠标悬停在小地图的一部分上将暂时显示该位置的代码，如上图左侧所示。预览将继续显示，直到鼠标光标离开小地图区域。",
    "If your game contains any&nbsp;{}Included Files{}&nbsp;or {}Extension{} files of the formats given below, they will be editable in the {}Code Editor{}&nbsp;through the right-click menu:":"如果您的游戏包含下列格式的任何 {} 包含文件 {} 或 {} 扩展 {} 文件，则可以通过右键菜单在 {} 代码编辑器 {} 中编辑它们：",
    "JSDoc Script Comments":"JSDoc 脚本注释",
    "Navigation Bar":"导航栏",
    "Notes":"笔记",
    "Read these pages to learn more about writing code in the {}Code Editor{}:":"阅读这些页面，了解有关在 {} 代码编辑器 {} 中编写代码的更多信息：",
    "Shaders":"着色器",
    "The gutter is a vertical column that appears to the left of your code, where the line numbers are displayed:":"装订线是出现在代码左侧的垂直列，其中显示行号：",
    "The horizontal scrollbar appears at the bottom of the frame, to scroll left or right. This has the following parts:":"水平滚动条出现在框架底部，可向左或向右滚动。这有以下部分：",
    "The leftmost drop-down menu controls the zoom level of all {}Code Editor{}s in the current session. This does not persist across sessions, as such it is only meant for temporary use during the current IDE session. To change the size of your text permanently, modify the&nbsp;{}Code Editor Preferences{}&nbsp;or the DPI in the&nbsp;{}General Preferences{}.":"最左侧的下拉菜单控制当前会话中所有 {} 代码编辑器 {} 的缩放级别。这不会跨会话持续存在，因此它仅适用于当前 IDE 会话期间的临时使用。要永久更改文本大小，请修改 {} 代码编辑器首选项 {} 或 {} 常规首选项 {} 中的 DPI。",
    "The rightmost edge of the Editor Frame displays a vertical scrollbar, which has some additional functionality beyond just scrolling.":"编辑器框架的最右边缘显示一个垂直滚动条，除了滚动之外，它还有一些附加功能。",
    "The {}Code Editor{} always opens in a new workspace tab, containing the editor itself, with a frame around it:":"{} 代码编辑器 {} 始终在新的工作区选项卡中打开，其中包含编辑器本身，周围有一个框架：",
    "Then, the current line and column number of the text cursor are displayed (\"{}Ln Y, Col X{}\"). Clicking on this opens the \"{}Go To Line{}\" dialog (which can also be opened with {}CTRL/CMD + G{}).":"然后，显示文本光标的当前行号和列号 (\"{}Ln Y, Col X{}\")。点击此按钮将打开 \"{}Go To Line{}\" 对话框 (也可以使用 {}CTRL/CMD + G{} 打开)。",
    "This is the most important part of the Editor Frame.":"这是编辑器框架中最重要的部分。",
    "This page covers all parts of the Editor Frame. For information on writing code inside the editor, see&nbsp;{}Editing Code{}&nbsp;and {}Code Completion{}.":"此页面涵盖了编辑器框架的所有部分。有关在编辑器内编写代码的信息，请参阅 {} 编辑代码 {} 和 {} 代码完成 {}。",
    "Timelines":"时间线",
    "To the right of the scrollbar itself, you will see \"{}OVR{}\" if you pressed {}insert{} to enable Overwrite Mode. When in Insert Mode, nothing is shown here.":"如果您按 {}insert{} 启用覆盖模式，您将在滚动条右侧看到 \"{}OVR{}\"。当处于插入模式时，此处不显示任何内容。",
    "Vertical Scrollbar":"垂直滚动条",
    "Workspace Tab Menu":"工作区选项卡菜单",
    "You can enable the \"{}Show diagnostics on scrollbar{}\" {}preference{} to display diagnostics (i.e. errors, warnings and suggestions) as small lines on the scrollbar:":"您可以启用 \"{} 在滚动条上显示诊断信息 {}\"{} 首选项 {}，以在滚动条上以小线形式显示诊断信息 (即错误、警告和建议)：",
    "You will mostly use this&nbsp;to edit&nbsp;{}Object Events{}&nbsp;and&nbsp;{}Scripts{}, however it is also used for:":"您主要使用它来编辑 {} 对象事件 {} 和 {} 脚本 {}，但它也可用于：",
    "{}&nbsp;Right-clicking the workspace tab for the {}Code Editor{} will display the following options:":"{} 右键点击{} 代码编辑器 {} 的工作区选项卡将显示以下选项：",
    "{}Asset Selection{}: The first drop-down lets you change the asset being edited. This can be any of the assets listed at the top of the page. You can click the&nbsp;{}&nbsp;button to add a new asset from a list of supported assets.{} {} {}{}{}{}ALT/OPT&nbsp;{}{}+ 1{}{} opens this dropdown, and {}{}{}{}{}{}ALT/OPT{}{}{}{} + SHIFT&nbsp;+ 1{}{} opens the \"Create Asset\" menu. ":"{} 资产选择 {}：第一个下拉列表可让您更改正在编辑的资产。这可以是页面顶部列出的任何资产。您可以点击 {} 按钮从支持的资源列表中添加新资源。{}{}{}{}{}{}ALT/OPT{}{}+ 1{}{} 打开此下拉列表，然后 {}{}{}{}{}{}ALT/OPT{}{}{}{}+ SHIFT + 1{}{} 打开 \" 创建资源 \" 菜单。",
    "{}By default, this contains a minimap next to the scrollbar (which can be disabled or resized in the {}Code Editor Preferences{}). This displays a preview of your code, to give you a general idea of the code structure, so you can jump between different parts of the document.":"{} 默认情况下，滚动条旁边包含一个小地图 (可以在 {} 代码编辑器首选项 {} 中禁用或调整其大小)。这将显示代码的预览，让您大致了解代码结构，以便您可以在文档的不同部分之间跳转。",
    "{}Contextual{}: Moving right, the contextual rail will show the&nbsp;{}&nbsp;{}Quick Fixes{}&nbsp;button when the text cursor is placed over a&nbsp;{}syntax error{}.":"{} 上下文 {}：向右移动，当文本光标置于 {} 语法错误 {} 上时，上下文栏将显示 {}{}Quick Fixes{} 按钮。",
    "{}Copy Full Path{}: Copies the full path to the asset being edited to your clipboard":"{} 复制完整路径 {}：将正在编辑的资源的完整路径复制到剪贴板",
    "{}Creation code{} of a room, and the creation code of a {}room instance{}":"房间的 {} 创建代码 {} 以及 {} 房间实例 {} 的创建代码",
    "{}Declaration Selection{}: The third drop-down lets you jump to a declaration within the open document, for example, a variable or a function being declared.{} {} {}{}{}{}{}{}{}ALT/OPT{}{}{}{}{}&nbsp;+ 3{}{} opens this dropdown. ":"{} 声明选择 {}：第三个下拉列表可让您跳转到打开文档中的声明，例如正在声明的变量或函数。{}{}{}{}{}{}{}{}{}ALT/OPT{}{}{}{}{}+ 3{}{} 打开此下拉菜单。",
    "{}Document Selection{}: The second drop-down lets you change the document being edited. This is most useful in objects, as each event is a different document, you can change the event in focus.&nbsp;You can click the&nbsp;{}&nbsp;button to add a new document (which, in case of an object, adds a new event).{} {} For Shaders, this shows the Vertex and Fragment Shader files, and for Timelines it shows the moments.{} {} {}{}{}{}{}{}{}ALT/OPT{}{}{}{}{}&nbsp;+ 2{}{} opens this dropdown, and {}{}{}{}{}{}ALT/OPT{}{}{}{} + SHIFT&nbsp;+ 2{}{} opens the \"Create Document\" menu. ":"{} 文档选择 {}：第二个下拉列表可让您更改正在编辑的文档。这在对象中最有用，因为每个事件都是不同的文档，您可以更改焦点事件。您可以点击 {} 按钮添加新文档 (如果是对象，则添加新事件)。{}{} 对于着色器，这会显示顶点和片段着色器文件，对于时间轴，它会显示时刻 .{}{}{}{}{}{}{}{}{}ALT/OPT{}{}{}{}{}+ 2{}{} 打开此下拉菜单，然后 {}{}{}{}{}{}ALT/OPT{}{}{}{}+ SHIFT + 2{}{} 打开 \" 创建文档 \" 菜单。",
    "{}Extension{} files":"{} 扩展 {} 文件",
    "{}Folding{}: Folding buttons ({}) appear on the edge of the gutter, allowing you to fold documents, {}{}{} bracket blocks and regions within a document. {} {}Additionally, {}switch{} cases and {}multiline comments{} are also foldable.{} {} ":"{} 折叠 {}：折叠按钮 ({}) 显示在装订线边缘，允许您折叠文档、{}{ }{} 括号块和文档内的区域。{}{} 此外，{}switch{} 大小写和 {} 多行注释 {} 也是可折叠的。{}{}",
    "{}Included Files Supported Formats{}{}Included Files Supported Formats{}":"{} 包含的文件支持的格式 {}{} 包含的文件支持的格式 {}",
    "{}Line Numbers{}: The rightmost rail within the gutter shows line numbers for the open document.":"{} 行号 {}：装订线内最右侧的栏显示打开文档的行号。",
    "{}Open in Explorer{}:&nbsp;{}Shows the asset being edited in your operating system\u0027s file browser{}":"{} 在资源管理器中打开 {}：{} 显示正在操作系统的文件浏览器中编辑的资源 {}",
    "{}Orientation{}: The bar then contains a drop-down menu to detach the Navigation Bar into its own draggable window, or attach it to any of the four sides of the frame. Clicking this button will cycle through each option, or you can click on the arrow to select the option you need. {} {}Changing this will also update its corresponding {}preference{}, meaning any future {}Code Editor{} windows will use this new orientation. Inversely, changing the preference will update the orientation used in editor windows.{} {} ":"{}方向 {}：该栏包含一个下拉菜单，用于将导航栏分离到其自己的可拖动窗口中，或将其附加到框架四个边中的任意一侧。单击此按钮将循环显示每个选项，或者您可以单击箭头选择您需要的选项。{}{} 更改此设置还将更新其相应的 {} 首选项 {}，这意味着未来的任何 {} 代码编辑器 {} 窗口都将使用此新方向。相反，更改首选项将更新编辑器窗口中使用的方向。{}{}",
    "{}Show in Asset Browser{}:&nbsp;{}Selects the asset being edited in {}The Asset Browser{}{}":"{} 在资源浏览器中显示 {}：{} 选择正在 {} 资源浏览器 {}{} 中编辑的资源",
    "{}Show in Inspector{}:&nbsp;{}Shows the asset being edited in the&nbsp;{}The Inspector{}{}":"{} 在检查器中显示 {}：{} 显示正在 {} 检查器 {}{} 中编辑的资源",
    "{}Splitter{}: The final, rightmost button on this bar is the Splitter. Clicking and dragging this in either direction will let you split the {}Code Editor{} into a duplicate view, which will display the same document(s) open in the main editor.":"{}拆分{}：此栏上最后一个、最右侧的按钮是 \"拆分\"。单击并向任一方向拖动它可以将 {} 代码编辑器 {} 拆分为一个重复视图，该视图将显示在主编辑器中打开的相同文档。",
    "{}The Code Editor{}":"{} 代码编辑器 {}",
    "{}The gutter is further divided into different \"rails\", which are the columns from left to right:":"{} 装订线进一步分为不同的 \" 轨道\"，即从左到右的列：",
    "{}The scrollbar also allows overscroll, allowing you to scroll past the end of the document (or the last document) to make editing more convenient. This can be enabled from the {}preferences{}.":"{} 滚动条还允许过度滚动，让您可以滚动到文档末尾 (或最后一个文档)，以便更方便地进行编辑。可以从 {} 首选项 {} 启用此功能。",
    "{}The&nbsp;{}Code Editor{}&nbsp;is used to edit text files in your&nbsp;{}GameMaker{} projects.":"{}{} 代码编辑器 {} 用于编辑 {}GameMaker{} 项目中的文本文件。",
    "{}These are the {}Code Editor{}-specific options:":"{} 这些是 {} 代码编辑器 {} 特定的选项：",
    "{}This bar contains the following parts:":"{} 该栏包含以下部分：",
    "{}Togglables{}: The left-most gutter is highlighted and contains {}bookmarks{} and {}breakpoints{}. When editing a GML document, clicking on this rail next to a line of code will create a breakpoint.":"{} 可切换{}：最左侧的装订线突出显示，包含 {} 书签 {} 和 {} 断点 {}。编辑 GML 文档时，单击代码行旁边的此栏将创建一个断点。",
    "{}{}NOTE{}{}&nbsp;Changing the active document when you have split views open will remove those split views and reset the editor to a single view.":"{}{} 注意{}{} 当您打开拆分视图时更改活动文档将会删除这些拆分视图并将编辑器重置为单个视图。",
    "{}{}NOTE{}{}&nbsp;Closing an editor window will automatically save any unsaved changes in open documents.":"{}{} 注意{}{} 关闭编辑器窗口将自动保存打开文档中所有未保存的更改。",
    "{}{}NOTE{}{}&nbsp;The&nbsp;{}Code Editor{}&nbsp;is currently opt-in. Enable it in the&nbsp;{}Code Editor Preferences{}.{} {} While it is disabled, assets with text documents like {}Objects{}, {}Scripts{}, {}Notes{} etc. will open their respective editors, which make use of the&nbsp;{}Legacy Code Editor{}. ":"{}{} 注意{}{} 当前可选择加入 {} 代码编辑器 {}。在 {} 代码编辑器首选项 {} 中启用它。{}{} 禁用该功能后，包含 {} 对象 {}、{} 脚本 {}、{} 注释 {} 等文本文档的资源将打开其各自的编辑器，它使用 {} 旧版代码编辑器 {}。"
}