{
    "Animated Tiles":"动画瓦片",
    "Another feature is that you can switch the grid view on or off by clicking the {}&nbsp;button, as well as set the colour for the grid to be used (clicking the {}&nbsp;button). When the grid is active it will show a coloured outline for each of the tiles in the grid, respecting the settings for separation, etc...":"另一个特点是，你可以通过点击{}&nbsp;按钮打开或关闭网格视图，以及设置要使用的网格颜色（点击{}&nbsp;按钮）。当网格处于激活状态时，它将为网格中的每块瓦片显示一个彩色的轮廓，并尊重分隔等的设置。",
    "As mentioned in the section on&nbsp;{}Editors{}&nbsp;above, there are are further tools available to edit tile sets and generate special {}brushes {}(combinations of tiles that can be painted into a room),&nbsp;{}animated {}tiles, and&nbsp;{}auto tile{}&nbsp;tiles (which are special tiles that will connect up automatically when placed in a room). Each of these editors is explained in depth from the following pages:":"如上文{}编辑器{}一节所述，还有进一步的工具可用于编辑瓦片集和生成特殊的{}画笔{}（可被画进房间的瓦片集合）、{}动画{}瓦片和{}自动瓦片{}&nbsp;（这是特殊的瓦片，放在房间里会自动连接起来）。这些编辑器中的每一个都会从以下几页中得到深入解释。",
    "Auto Tiles":"自动瓦片",
    "By default when you open a tile set the {}Tile Set Properties{} window will also be shown (see below), but if you close it then you can click the button here to reopen it again.":"默认情况下，当你打开一个瓦片集时，{}瓦片集属性{}窗口也会显示出来（见下图），但如果你关闭它，那么你可以点击这里的按钮重新打开它。",
    "Due to how tiles are rendered they need to be prepared beforehand with a border around each one to \"smear\" the edges. The image shown below illustrates how tiles are generally mapped by the device graphic drivers, with the red line around the tile showing where the U,V coordinates are mapped to (The letters \"U\" and \"V\" are used to describe the 2D texture mesh because \"X\", \"Y\" and \"Z\" are already used to describe room and object spatial coordinates):":"由于瓦片的渲染方式，它们需要事先准备好每个瓦片的边框，以便 \"涂抹 \"其边缘。下面的图片说明了设备图形驱动对磁贴的映射方式，磁贴周围的红线显示了U、V坐标的映射位置（字母 \"U \"和 \"V \"用于描述2D纹理网格，因为 \"X\"、\"Y \"和 \"Z \"已经用于描述房间和物体的空间坐标）。",
    "Each of the buttons in the {}Editors {}section will open a different editor for specific tile set functionality. You can create tile set {}brushes {}based on multiple tiles together, {}animated tiles{}, using different tiles as individual frames, and you can also create {}auto tiles{} that will \"join\" together based on the tiles that surround them. Each of these editors is explained in detail in the sections linked at the end of this page.":"{}编辑器{}部分的每一个按钮都会为特定的瓦片集功能打开一个不同的编辑器。你可以在多个瓦片的基础上创建瓦片集{}刷子{}，{}动画瓦片{}，使用不同的瓦片作为单独的框架，你也可以创建{}自动瓦片{}，根据周围的瓦片 \"连接 \"在一起。这些编辑器中的每一个都会在本页末尾链接的章节中详细解释。",
    "Here you can give a name to your tile set. Names can only be alpha-numeric and may only use the underbar \"_\" symbol, and they cannot start with a number.":"在这里你可以给你的瓦片集起一个名字。名称只能是字母数字，只能使用下划线\"_\"符号，而且不能以数字开头。",
    "Here you can select the {}sprite{} asset from which to create our tile set. Clicking on the main button will open the Asset Explorer where you can choose the sprite you wish to use for the tile set:":"在这里你可以选择{}精灵{}资产来创建我们的瓦片集。点击主按钮将打开资产资源管理器，你可以选择你希望用于瓦片集的精灵:",
    "Next, you can chose the {}texture group{} that you wish the tileset resource to belong to. Basically, a texture group (previously defined in the {}Texture Group Manager{}) is something that you can set up so that all the image assets that you need for specific rooms or levels of your game can be stored together. So, for example, you can have all your level 1 images in one texture group, all your level 2 images in another etc... and {}GameMaker{} will try to place all those grouped assets&nbsp;on the same {}texture page{} to reduce texture page swapping while your game is running on the chosen target platform.":"接下来，你可以选择你希望瓦片集资源所属的{}纹理组{}。基本上，纹理组（先前在{}纹理组管理器{}中定义）是你可以设置的，这样你需要的所有图像资产就可以储存在一起，用于游戏的特定房间或关卡。因此，举例来说，你可以把所有第1层的图片放在一个纹理组中，把所有第2层的图片放在另一个组中，等等......而{}GameMaker{}会尝试把所有这些分组的资产&nbsp;放在同一个{}纹理页{}上，以减少你的游戏在所选目标平台上运行时的纹理页交换。",
    "Shown above is a tile being draw scaled down into 6 screen pixels, and this shows that when you overlap a little into the next screen pixel, the graphics driver has to make a choice to either drop that texel, or it try and fill it with what it thinks is a valid texel. Let\u0027s just say that in this case it decides to draw the overlapped texel into the screen pixel, and, since it\u0027s now clearly outside our tile it gets this pixel from either the next tile, or the little bits of space you provided around the tiles, which means that when it shrinks you\u0027ll get cracks between tiles \"glitches\" in how they are drawn and this is where a lot of confusion arises... Each graphics driver and device actually does this in its own way, meaning that the results can be unpredictable and look terrible... but if you\u0027re careful and plan ahead you can work around it.":"上面显示的是一个被缩减为6个屏幕像素的瓦片，这表明，当你把一个小的重叠到下一个屏幕像素时，图形驱动必须做出选择，要么放弃这个texel，要么尝试用它认为有效的texel填充它。让我们说，在这种情况下，它决定把重叠的texel画进屏幕像素，而且，由于它现在明显在我们的瓦片之外，它从下一个瓦片或你在瓦片周围提供的一点点空间中获得这个像素，这意味着当它缩小时，你会在瓦片之间得到裂缝，在它们如何被绘制时出现 \"闪失\"，这就是出现很多混乱的地方... 每个图形驱动程序和设备实际上都以自己的方式来做这件事，这意味着结果可能是不可预测的，看起来很糟糕......但如果你小心谨慎，提前计划，你可以绕过它。",
    "So, if we are \"just\" moving into a new screen pixel then, because the graphics drivers use the center of the pixel to decide what to draw with, it\u0027ll pick a texel surrounding the tile, not a texel on the tile itself.":"所以，如果我们 \"只是 \"移动到一个新的屏幕像素，那么，因为图形驱动使用像素的中心来决定用什么来画，它将选择一个围绕瓦片的texel，而不是瓦片本身的texel。",
    "The Brush Builder":"笔刷生成器",
    "The Tile Set Editor":"瓦片集编辑器",
    "The final option in the tile set properties is {}Disable Source Sprite Export{}. This is checked by default, and what it does is flags the source sprite asset to be omitted when the texture page for your project is being generated. This works under the assumption that a sprite used as a tile set will not be getting used for anything else, and so only needs to be exported once. However if you are using the base sprite resource for anything other than tiles, then you would want to un-check this so that the base sprite {}and {}the tile set are both added into the texture page on compile.":"瓦片集属性中的最后一个选项是{}Disable Source Sprite Export{}。这个选项是默认勾选的，它的作用是在为你的项目生成纹理页面时，将源精灵资产标记为省略。这样做的前提是，作为瓦片集的精灵不会被用于其他用途，所以只需要导出一次。然而，如果你将基本精灵资源用于除瓦片以外的其他用途，那么你就应该取消勾选，以便在编译时将基本精灵{}和{}瓦片集都添加到纹理页面中。",
    "These are the most common ways that people create tile sets - either all jammed up together or with little spaces separating them out, and {}GameMaker{} can handle both types. Essentially all tile sets must be comprised of images that fit within a clearly defined grid, with each cell of the grid being the {}exact same size{} (note that while the images shown above are all made up of square tiles, a tile set can be made from rectangular tiles too).":"这些是人们创建瓦片集最常见的方式--要么全部塞在一起，要么用小空间把它们分开，{}GameMaker{}可以处理这两种类型。基本上，所有的瓦片集都必须由符合明确定义的网格的图片组成，网格的每个单元都是{}完全相同的尺寸{}（注意，虽然上面显示的图片都是由方形瓦片组成的，但瓦片集也可以由矩形瓦片组成）。",
    "These are the tools you can use to preview the sprite selected for the tile set. These buttons control the current preview zoom level and you can use them to zoom in or out and clicking the {}&nbsp;button will reset the preview to be 1:1 with the tile set sprite being edited. You can also click the {}Window Fit{} button {}&nbsp;to make the entire tile set fit within the current preview window (this will zoom in/out as appropriate to make it fit). Note that you can also zoom in and out using the {}&nbsp;/&nbsp;{} and the Mouse Wheel {}, and pressing {}&nbsp;/&nbsp;{}&nbsp;+&nbsp;{}&nbsp;will set the canvas to be 1:1 with the tile set sprite.":"这些是你可以用来预览为瓦片集选择的精灵的工具。这些按钮控制当前预览的缩放级别，你可以用它们来放大或缩小，点击{}&nbsp;按钮将重置预览，使其与正在编辑的瓦片集精灵成1:1。你也可以点击{}Window Fit{}按钮{}&nbsp;来使整个瓦片集适合于当前的预览窗口（这将适当地放大/缩小以使其适合）。注意，你也可以用{}&nbsp;/&nbsp;{}和鼠标滚轮{}来放大和缩小，按{}&nbsp;/&nbsp;{}&nbsp;+&nbsp;{}&nbsp;会把画布设置成与瓦片组精灵1:1。",
    "This section is the tile set Preview window. To navigate around the preview, you can use the same basic controls as for general Workspaces, ie: Use the middle mouse button {}&nbsp;and drag to pan the preview (or alternatively use the {}&nbsp;+ {}&nbsp;combination), and you can scroll horizontally with the mouse wheel {}&nbsp;or zoom in and out using the&nbsp;{}&nbsp;/&nbsp;{}&nbsp;key and the mouse wheel {}. You can also use the different buttons in the {}Preview Toolbox{} to change the zoom and enable/disable the grid cell overlay.":"这一部分是瓦片集预览窗口。要在预览中导航，你可以使用与一般工作区相同的基本控制，即：使用鼠标中键{}&nbsp;和拖动来平移预览（或者使用{}&nbsp;+{}&nbsp;组合），你可以用鼠标滚轮{}&nbsp;水平滚动，或者使用&nbsp;{}&nbsp;/&nbsp;{}&nbsp;键和鼠标滚轮{}放大和缩小。你还可以使用{}预览工具箱{}中的不同按钮来改变缩放，并启用/禁用网格单元的覆盖。",
    "When creating your tile sets, keep in mind that {}the top left grid cell must {}always {}be empty{} as this is the tile that {}GameMaker{} will use for \"empty\" tiles in a room and for erasing existing tiles (and even if you have pixels in that part of the image they will be ignored).":"在创建你的瓦片集时，请记住，{}左上角的网格单元必须{}永远{}是空的{}，因为这是{}GameMaker{}将用于房间里的 \"空 \"瓦片和擦除现有瓦片的瓦片（即使你在图像的那一部分有像素，它们也会被忽略）。",
    "When you first create a tile set resource the Tile Set Editor window will open with the following options:":"当你第一次创建一个瓦片集资源时，瓦片集编辑器窗口将打开，有以下选项：",
    "With high end games if you draw from a single texture (not on a texture page or texture atlas), you have the option of using a texture mode called {}clamp {}and what this does is repeats the last row of texels infinitely off into the distance, allowing you to scale without problems as it forces the hardware to get the last row of pixels no matter what. This is what the {}Output Border {}settings here do for you:":"在高端游戏中，如果你从一个单一的纹理（不是在一个纹理页或纹理图集上）绘制，你可以选择使用一种叫做{}clamp {}的纹理模式，它的作用是将最后一排纹理无限地重复到远处，让你可以顺利地缩放，因为它迫使硬件无论如何都要获得最后一排的像素。这就是{}Output Border {}设置的作用。",
    "{}A {}tile set{} is a graphic resource for drawing levels and other static components of your game. A tile set is comprised of a single image that is then split into different \"cells\" (tiles), and each tile can then be placed into the room editor to create a complete image. Below you can see two example sprites that can be used as tile sets:":"{}一个{}瓦片集{}是一种用于绘制关卡和其他游戏静态组件的图形资源。瓦片集由一张图片组成，然后被分割成不同的 \"单元\"（瓦片），然后每张瓦片可以被放置到房间编辑器中以创建一个完整的图像。下面你可以看到两个可以作为瓦片集使用的精灵例子。",
    "{}As you can see it picks the center of the&nbsp;{}texel{}&nbsp;to map directly when drawing the image in the room. Now at a scale of 1:1, this is all well and good, but what will happen when we scale this tile down? The issue with scaling down is that when you shrink the image, the UVs also scale down and try to fit into a more compressed space, but this obviously can\u0027t happen, so the graphics driver picks which texels to draw based on the available pixel centers.":"{}正如你所看到的，当在房间里绘制图像时，它选择了&nbsp;{}texel{}&nbsp;的中心来直接映射。现在，在1:1的比例下，这一切都很好，但当我们将这块瓦片缩小时，会发生什么？缩小比例的问题是，当你缩小图像时，UV也会缩小，并试图适应一个更压缩的空间，但这显然不可能发生，所以图形驱动会根据可用的像素中心来选择要绘制的texels。",
    "{}Editors{}{}Editors{}":"{}编辑器{}{}编辑器{}",
    "{}NOTE{}: This may not always be necessary and the performance increase from this method will depend on whether the target device is CPU bound or GPU bound.":"{}注意{}：这可能并不总是必要的，这种方法的性能提升将取决于目标设备是CPU绑定还是GPU绑定。",
    "{}Name{}{}Name{}":"{}名称{}{}名称{}",
    "{}Preview Toolbox{}{}Preview Toolbox{}":"{}预览工具箱{}{}预览工具箱{}",
    "{}Preview{}{}Preview{}":"{}预览{}{}预览{}",
    "{}Properties{}{}Properties{}":"{}属性{}{}属性{}",
    "{}Shown above is a \"fixed\" tile sprite and you can see it now has a repeated section around each tile meaning that when the hardware overruns, it will always pick the last texel from the tile rather than one of the spaces or the tile after that. So, when creating a tile set, keep in mind that if you are going to be zooming the game view in or out or are going to be rendering the tiles scaled, you may need to have a higher Output Border width or height than the default value of 2.":"{}上面显示的是一个 \"固定 \"的瓦片精灵，你可以看到它现在在每个瓦片周围都有一个重复的部分，这意味着当硬件超限时，它将总是从瓦片中选取最后一个texel，而不是其中一个空格或后面的瓦片。因此，在创建瓦片集时，请记住，如果你要放大或缩小游戏视图，或者要按比例渲染瓦片，你可能需要有一个比默认值2更高的输出边界宽度或高度。",
    "{}Sprite{}{}Sprite{}":"{}精灵{}{}精灵{}",
    "{}You can also click on the {}New Sprite{} button {}&nbsp;button to create a new sprite asset (which will open the {}Sprite Editor{} for the new asset within the workspace for editing), or you can edit the currently selected sprite using the {}Edit Sprite{} button&nbsp;{}, or even choose to edit the sprite image itself in the {}Image Editor{} by pressing the {}&nbsp;button.":"{}你也可以点击{}New Sprite{}按钮{}&nbsp;按钮来创建一个新的精灵资产（这将在工作区中为新资产打开{}Sprite Editor{}进行编辑），或者你可以使用{}Edit Sprite{}按钮&nbsp;{}来编辑当前选中的精灵，甚至可以选择在{}Image Editor{}中按下{}&nbsp;按钮来编辑精灵图片本身。",
    "{}{}The {}Tile Set Properties{} window is for designating the base tile size (default is 16px square), the offset amount and the separation between tiles (these last two options are for use with sprites like the one shown in the example image further up this page where there are gaps between the individual parts of the tiles). You can also set the {}Output Border{} values for the tile set image, which controls how the image will be stored on disk and add extra pixels around each tile as required.":"{}{}{}瓦片集属性{}窗口用于指定基本瓦片尺寸（默认为16px正方形）、偏移量和瓦片之间的间隔（后两个选项用于精灵，如本页更上方示例图片中所示，瓦片的各个部分之间存在间隙）。你还可以为磁贴集图像设置{}输出边框{}值，它控制图像在磁盘上的存储方式，并根据需要在每个磁贴周围添加额外的像素。"
}