{
    "For example, assume you want to make a guard and that this guard should move 20 time steps to the left, then 10 upwards, then 20 to the right, then 10 downwards and then finally stop. To achieve this you can make a timeline where you start with setting a motion to the left. You would then create moment 20 (a \"moment\" is just another way of saying \"game step\" or \"game frame\") and set a motion upward, then at moment 30 a motion to the right, at moment 50 a motion downwards and finally at moment 60 you would stop the motion. Once that is done, you can assign this timeline to the guard object and the guard instance will do exactly what you planned when placed in a room. You could even set an alarm in the time line so that it is repeated after a certain length of time and in this way your guard can patrol an area. You can also use a time line to control your game more globally, for example by creating&nbsp;an invisible controller object, then a time line that at certain moments creates enemies, and then assigning it to the controller object and placing an instance into the room. This is an easy way to get timed spawns of the enemies in a space shoorter game or something like that.":"例如，假设您要设置一个后卫，并且该后卫应该向左移动 20 步，然后向上移动 10 步，然后向右移动 20 步，然后向下移动 10 步，最后停止。要实现这一点，可以创建一个时间轴，从左侧开始设置运动。然后你会创建 20 分钟 (\" 一瞬间 \" 只是 \" 游戏步骤 \" 或 \" 游戏画面 \" 的另一种说法) 并向上设置一个运动，然后在 30 分钟时向右运动，在 50 分钟时向下运动，最后在 60 分钟时停止运动。完成此操作后，可以将此时间轴指定给保护对象，保护实例将完全按照放置在房间中时的计划执行。你甚至可以在时间线上设置一个警报，这样在一段时间后它会重复，这样你的警卫就可以在一个区域巡逻。也可以使用时间线更全局地控制游戏，例如，通过创建一个不可见的控制器对象，然后创建一个在某些时刻创建敌人的时间线，然后将其指定给控制器对象并将实例放入房间。这是一个简单的方法来获得敌人的时间生成在空间推进器游戏或类似的东西。",
    "Here you give your timeline resource a {}name{}. This must only contain alpha-numeric characters or the \"_\" under-bar and cannot start with a number, as it will be used to reference your timeline through code. This name will also be the unique timeline ID which can be used in GML Visual actions or code functions to identify the timeline.":"在此为时间线资源指定 {} 名称 {}。此名称只能包含字母数字字符或 \"_\" 下划线，并且不能以数字开头，因为它将用于通过代码引用时间线。此名称也将是唯一的时间线 ID，可用于 GML 可视操作或代码函数以标识时间线。",
    "On adding a new moment, you may be asked to choose between&nbsp;{}GML Visual{}&nbsp;and&nbsp;{}GML Code{}. See&nbsp;{}GameMaker Language{} for more information.":"添加新时刻时，可能会要求您在 {}GML 可视化 {} 和 {}GML 代码 {} 之间进行选择。有关详细信息，请参阅 {}GameMaker 语言 {}。",
    "The Timeline Editor":"时间线编辑器",
    "The timeline editor permits you to use {}&nbsp;+ {}&nbsp;select all moments between the first click {}&nbsp;and the second click {}, or you can use&nbsp;{}&nbsp;/&nbsp;{}&nbsp;+ {}&nbsp;to click on single moments to select them independently. Timeline moments can be edited using the right mouse button {}&nbsp;menu on one of the selected elements:":"时间线编辑器允许您使用 {}+{} 选择第一次单击 {} 和第二次单击 {} 之间的所有时刻，或者您可以使用 {}/{}+{} 单击单个时刻来独立选择这些时刻。可以使用选定元素之一上的鼠标右键 {} 菜单编辑时间轴时刻：",
    "To create a time line, right click {}&nbsp;on {}Asset Browser{} and select \"Create Timeline\". This will open the window pictured at the top of this page with the following sections:":"要创建时间线，请在{1}资源浏览器{2}上右键单击{}，然后选择\"创建时间线\"。这将打开本页顶部的窗口，其中包含以下部分：",
    "To help you understand what your timeline is doing it is permitted that you give moments a name to identify them. This is simply a string and will not be used in the game code or anywhere else, as it\u0027s purely for organising and understanding what your timeline does. To add a name/description to your moment, you need to use the {}/// @description{} format on the first line of the code block, for example: {} ":"为了帮助您了解您的时间线正在执行的操作，允许您为时刻命名以标识它们。这只是一个字符串，不会在游戏代码或其他任何地方使用，因为它纯粹用于组织和理解您的时间线。要在此刻添加名称 / 说明，您需要在代码块的第一行使用 {}///@description{} 格式，例如：{}",
    "Which would look like this:":"看起来是这样的：",
    "You can set the {}moment {}value here. The moment value is calculated as the number of game steps after the timeline has started. So if you have a timeline with moments at positions 0 and 60, then moment 0 will be triggered when the timeline is {}started {}and moment 60 will happen 60 steps {}later{}. If your room speed is set to 60 too, then moment 60 will happen one second after the timeline is started. You can do a double click {}&nbsp;on the moment value or you can use the right button {}&nbsp;menu and select \" {}change{}\" (see the section on the button menu below) to change it. To add a new moment, simply click the {}Add {}button at the bottom of the editor. Adding new moments will open the {}code editor{} (or action editor) where you can add the functions or GML Visual that you want to call in that moment. ":"您可以在此处设置 {} 时刻 {} 值。时刻值计算为时间线开始后的游戏步数。因此，如果您有一条时间线，时间线的位置分别为 0 和 60，则当时间线 {}开始 {} 时将触发时刻 0，而时刻 60 将在 60 步 {} 后 {} 发生。如果您的房间速度也设置为 60，则时刻 60 将在时间线开始后一秒发生。您可以双击 {} 力矩值，也可以使用右键 {} 菜单并选择 \"{} 更改 {}\"( 请参阅下面按钮菜单中的部分) 进行更改。要添加新时刻，只需单击编辑器底部的 {} 添加 {} 按钮即可。添加新时刻将打开 {} 代码编辑器 {}( 或动作编辑器)，您可以在其中添加当时要调用的函数或 GML 可视化动作。",
    "{}Add{}: This option permits you to add a new moment to the timeline. It will be added directly after the last moment, so if the last moment in your timeline is 120, the next one you add will be 121. You can&nbsp;change the moment position by double clicking {}&nbsp;on the moment value in the editor or by right-clicking {}&nbsp;and choosing \"{}Change{}\".":"{}添加{}：此选项允许您向时间线添加新时刻。它将直接添加到最后一刻之后，因此，如果您的时间轴中的最后一刻是 120，则您添加的下一个时间轴将是 121。通过在编辑器中双击力矩值 {} 或右键单击 {} 并选择 \"{} 更改 {}\"，可以更改力矩位置。",
    "{}Change Description{}:&nbsp;Change the descriptive name for the selected timeline moment. This is the same as slow double clicking {}&nbsp;on the timeline description in the editor window.":"{}更改描述{}：更改所选时间线时刻的描述性名称。这与在编辑器窗口中缓慢双击{}时间线说明相同。",
    "{}Change Moment{}: Change the value for the selected timeline moment. This is the same as slow double clicking {}&nbsp;on the timeline value in the editor window.":"{}更改时刻{}：更改所选时间线时刻的值。这与在编辑器窗口中缓慢双击{}时间线值相同。",
    "{}Convert to GML Visual / Code{}:&nbsp;Timeline moments will be created using the method chosen when you created the project, either using code or using GML Visual actions. With this option you can convert from one to the other, regardless of the project type.":"{}转换为 GML 可视化 / 代码{}：将使用创建项目时选择的方法创建时间表时刻，可以使用代码或 GML 可视化操作。使用此选项，无论项目类型如何，都可以从一个项目转换为另一个项目。",
    "{}Cut {}/ {}Copy {}/ {}Paste{}:&nbsp;These options permit you to cut, copy or paste one or more timeline moments. You can use the standard keyboard shortcuts here too:&nbsp;{}&nbsp;/&nbsp;{}&nbsp;+ \"{}X{}\",&nbsp;{}&nbsp;/&nbsp;{}&nbsp;+ \"{}C{}\", and {}&nbsp;/&nbsp;{}&nbsp;+ \"{}V{}\".":"{}剪切{}/{}复制{}/{}粘贴{}：这些选项允许您剪切、复制或粘贴一个或多个时间线时刻。您也可以在此处使用标准键盘快捷键：{}/{}+\"{}X{}\"、{}/{}+\"{}C{}\"和{}/{}+\"{}V{}\"。",
    "{}Duplicate{}:&nbsp;This will duplicate all the selected timeline moments and add them consecutively to the end of the current timeline.":"{}重复{}：这将复制所有选定的时间线时刻，并将它们连续添加到当前时间线的末尾。",
    "{}Edit{}:&nbsp;This opens the current timeline moment for editing.":"{}编辑{}：这将打开当前时间线时刻进行编辑。",
    "{}In most games you will want certain things to happen at precise moments in time. Now, you can try to achieve this by using the alarm events but when things get too complicated this won\u0027t work any more, especially as you are limited to only twelve alarms. That\u0027s why we have the {}timeline {}asset. In a timeline you specify which actions must happen at certain moments in game time, and you can use all the actions that are also available for an object in its different events or code to define this. Once you create a time line you can then assign it to an object, and the instance of that object will then execute the actions at the indicated moments of time when placed or created within a room.":"{}在大多数游戏中，您会希望某些事情在准确的时间发生。现在，您可以尝试通过使用报警事件来实现这一点，但当事情变得太复杂时，这将不再有效，尤其是当您仅限于十二个报警。这就是为什么我们有{}时间线{}资源。在时间轴中，您可以指定在游戏时间的特定时刻必须执行的操作，并且可以使用对象在其不同事件或代码中也可用的所有操作来定义此操作。创建时间线后，可以将其指定给对象，然后该对象的实例将在房间中放置或创建时在指定的时间执行操作。",
    "{}Merge{}:&nbsp;If you select two or more moments from a timeline you can choose to merge them. This will create a single timeline moment at the position of the first moment selected with all the code and actions together concurrently.":"{}合并{}：如果从时间线中选择两个或更多时刻，则可以选择合并它们。这将在选定的第一个时刻的位置创建一个单独的时间线时刻，同时包含所有代码和操作。",
    "{}Moment Name{}{}Moment Name{}":"{}时刻名称{}{}时刻名称{}",
    "{}Moment{}{}Moment{}":"{}时刻{}{}时刻{}",
    "{}Name{}{}Name{}":"{}名称{}{}名称{}",
    "{}Remove{}:&nbsp;This will remove the selected moment (or moments) from the timeline.":"{}删除{}：这将从时间轴中删除选定的时刻(或多个时刻)。",
    "{}Select All{}:&nbsp;With this option you can select all the moments in a timeline. Selected moments can then be removed, merged, duplicated, cut, or copied.":"{}全选{}：使用此选项，您可以选择时间线中的所有时刻。然后可以删除、合并、复制、剪切或复制选定的力矩。"
}