{
    "At each iteration, it moves your instance by&nbsp;{}point_distance(0, 0, dx, dy)/num_iterations{}&nbsp;pixels in the given direction, and then checks for collisions. If&nbsp;{}num_iterations{} is 4, and you want to move {}(8, 0){},&nbsp; it will move your instance by 2 pixels each iteration before checking for collisions.":"在每一次迭代中，它都会按 {}point_distance(0, 0, dx, dy) / num_iterations{} 像素向指定方向移动你的实例，然后检查是否有碰撞。如果 {}num_iterations{} 是 4，而你想移动 {}(8, 0){}，&nbsp; 它将在检查碰撞之前，每次迭代将你的实例移动 2 像素。",
    "How Does It Work?":"它是如何工作的？",
    "If a collision is found during an iteration, it will try to move around it by moving your instance the same amount in a direction perpendicular to {}dx, dy{}, or toward the vector given in the optional {}xoff, yoff{} arguments.":"如果在迭代过程中发现了碰撞，它将尝试在垂直于{}dx, dy{}的方向上移动你的实例，或者朝着可选的{}xoff, yoff{}参数中给出的矢量移动，从而绕过它。",
    "If, at any iteration, the function finds a collision in the direction&nbsp;{}dx, dy{} and is able to move around it (either in a perpendicular direction or in the {}xoff, yoff{} direction), movement in that other direction will be counted as an iteration.":"如果在任何迭代中，函数在&nbsp;{}dx, dy{}方向发现了碰撞，并且能够绕过它（无论是在垂直方向还是在{}xoff, yoff{}方向）移动，在该其他方向的移动将被算作一次迭代。",
    "It allows your instance to move while navigating slopes or small steps that would otherwise prevent it from being able to move.":"它允许您的实例在导航坡度或小步骤时移动，否则它将无法移动。",
    "The above code executes the&nbsp;{}{}move_and_collide{}{}&nbsp;function in the calling instance. It tries to move it using the custom {}speed_x{} and {}speed_y{} variables,&nbsp;and tries to avoid instances of {}obj_terrain{}. The instances that the calling instance collides with are stored in a temporary array {}_colliding_instances{}&nbsp;and shown using a for loop and&nbsp;{}{}show_debug_message{}{}.":"上述代码在调用实例中执行了{}{}move_and_collide{}{}&nbsp;函数。它试图使用自定义的{}speed_x{}和{}speed_y{}变量来移动它，并试图避免{}obj_terrain{}的实例。调用实例所碰撞的实例被存储在一个临时数组{}_colliding_instances{}&nbsp;并通过for循环和{}{}show_debug_message{}{}来显示。",
    "The above code will try to move the calling instance to the right 8 pixels and avoid instances of any object (indicated by the&nbsp;{}all{}&nbsp;keyword). Since the {}num_iterations{} argument is not provided, the number of iterations is 4.":"上述代码将尝试把调用的实例移到右边8个像素处，并避开任何对象的实例（用&nbsp;{}all{}&nbsp;关键字表示）。由于没有提供{}num_iterations{}参数，迭代次数为4。",
    "The distance to try to move along the X axis":"试图沿X轴移动的距离",
    "The distance to try to&nbsp;move along the Y axis":"试图沿Y轴移动的距离",
    "The function returns an array containing the IDs of the instances it collided with.":"该函数返回一个包含与之碰撞的实例ID的数组。",
    "The function will move your instance step-by-step, checking for collisions at each step/iteration. The {}obj{} argument is the object or instance it should avoid (like a wall object), and by default the function moves your instance in 4 steps (which you can change with the {}num_iterations{} argument).":"该函数将一步一步地移动你的实例，在每一步 / 迭代中检查是否有碰撞。{}obj{} 参数是它应该避开的对象或实例（比如墙体对象），默认情况下，该函数以 4 步移动你的实例（你可以通过 {}num_iterations{} 参数来改变）。",
    "The object index or instance ID to avoid, or the keyword&nbsp;{}all{} to avoid all objects":"要避免的对象索引或实例ID，或者用关键字&nbsp;{}all{}来避免所有对象。",
    "This function moves the instance&nbsp;by the given amount of distance on the X and Y axes, while avoiding the given object.":"这个函数在X和Y轴上移动给定距离的实例，同时避免给定的对象。",
    "{}{}NOTE{}{}&nbsp;This function uses the sprite collision mask of the instance to check for collisions (see {}The Sprite Editor{}&nbsp;for more info).":"{}{}NOTE{}{}&nbsp;该函数使用实例的精灵碰撞遮罩(sprite mask)来检查碰撞（详见{}The Sprite Editor{}&nbsp;）。",
    "{}{}OPTIONAL{}{}&nbsp;The number of steps to take, e.g. if {}(dx, dy){} is {}(10, 0){} and the number of steps to take is 5, then every iteration the instance will move the instance by 10/5 = 2 pixels before checking collisions. The default value is 4.":"{}{}OPTIONAL{}{}&nbsp;的步数，例如，如果{}(dx, dy){}是{}(10, 0){}，步数是5，那么每次迭代时，在检查碰撞之前，实例将移动10/5=2像素。默认值是4。",
    "{}{}OPTIONAL{}{}&nbsp;The x component of the direction in which to move in case of a collision":"{}{}OPTIONAL{}{}&nbsp;发生碰撞时，移动方向的X分量。",
    "{}{}OPTIONAL{}{}&nbsp;The y component of the direction in which to move in case of a collision":"{}{}OPTIONAL{}{}&nbsp;在发生碰撞时，移动方向的Y分量。"
}