{
    "A few things to note about tiles that are being used in animations:":"关于在动画中使用的瓦片，有几件事需要注意：",
    "Animated Tiles":"动画瓦片",
    "If the tile doesn\u0027t have its own animation and is used in multiple other animations, then it will not animate at all. You will need to explicitly specify an animation with it as the first tile.":"如果这块瓦片没有自己的动画，并且在其他多个动画中使用，那么它将根本不会有动画。你将需要明确地指定一个动画，把它作为第一块瓦片。",
    "If the tile doesn\u0027t have its own animation but is used in only one other animation, then it will use that animation starting at the first position that tile is present in the animation.":"如果瓦片没有自己的动画，但只在其他一个动画中使用，那么它将从该瓦片在动画中出现的第一个位置开始使用该动画。",
    "If the tile has its own animation specified (so there is an animation where it is set as the first tile) then it will use that animation.":"如果这块瓦片有自己指定的动画（所以有一个动画，它被设置为第一块瓦片），那么它将使用该动画。",
    "Tiles are generally considered to be static cells within the game room, however with {}GameMaker{} it is possible to animate them, just as you would a sprite. Why not just use sprites, you ask? Well, sprites have a certain processing overhead due to them being associated with a bounding box and the way in which they are rendered, but tiles have a much lower processing overhead and so are faster to render. This does come at a price however, in that with tile set animations you are limited to creating animations that must be a power of two in length - ie: of 2, 4, 8, 16, etc... frames - and they must obviously be created within the tile grid, {}and {}they must all animate at the same speed (on a per-tile set basis). However, even with these limitations, animated tiles are a powerful feature that can be used to add life and colour to otherwise static environments and backgrounds.":"瓦片通常被认为是游戏室中的静态单元，然而在{}GameMaker{}中，我们可以对它们进行动画处理，就像你对精灵一样。你问，为什么不直接使用精灵呢？嗯，精灵有一定的处理开销，因为它们与一个边界框相关联，以及它们被渲染的方式，但瓦片的处理开销要低得多，所以渲染起来也更快。然而，这也是有代价的，在瓦片集动画中，你只能创建长度为2的幂的动画--即：2、4、8、16......帧--而且它们显然必须在瓦片网格内创建，{}而且{}它们必须以相同的速度（以每个瓦片集为基础）进行动画。然而，即使有这些限制，动画瓦片也是一个强大的功能，可以用来为其他静态环境和背景添加生命和色彩。",
    "To create a tile animation you first have to add an animation to the animation library by clicking the {}Add Animation {}button {}, which will add an empty animation strip to the library and request that you select a number of frames to be used:":"要创建一个瓦片动画，你首先要通过点击{}添加动画{}按钮{}来添加一个动画到动画库中，这将添加一个空的动画条到库中，并要求你选择要使用的帧数：",
    "To create a tile animation you must first have a tile set that has the required tiles all within the one sprite image (but not as sprite frames, so a single large sprite frame with all the animation images within it), and then in the {}Tile Set Editor{} you click on the {}Tile Animation{} button to bring up the Animation Editor:":"要创建一个瓦片动画，你必须先有一个瓦片集，其中所需的瓦片都在一个精灵图像中（但不是作为精灵帧，所以一个大的精灵帧中有所有的动画图像），然后在{}瓦片集编辑器{}中点击{}瓦片动画{}按钮，调出动画编辑器：",
    "{}If you then go back to the tile set image on the left of the editor you can click {}&nbsp;on any tile to add it into the animation and the frame will advance to the next one. Clicking {} on successive tiles will fill up the animation, which you can then preview by clicking on the \"play\" button beside the frames:":"{}如果你回到编辑器左边的瓦片集图像，你可以点击{}&nbsp;在任何瓦片上添加它到动画中，帧会前进到下一个。在连续的瓦片上点击{}将填满动画，然后你可以通过点击帧旁边的 \"播放 \"按钮来预览：",
    "{}Once you have done that your animation will become part of the animation library and when you enter the {}Room Editor{} you can select it and place it within the room. Note that if you select any of the tiles from an animation to place in a room, that tile will animate from the selected tile onwards, so you can \"desynchronise\" an animation by placing separate frames within the room and they will all animate. The only caveat to this is that the animation speed will always be the same, since it is defined for the whole tile set and not individual animations within the library.":"{}一旦你这样做了，你的动画将成为动画库的一部分，当你进入{}房间编辑器{}时，你可以选择它并把它放在房间里。请注意，如果你从一个动画中选择任何一块瓦片放置在房间里，该瓦片将从被选择的瓦片开始动画化，所以你可以通过在房间里放置单独的帧来 \"不同步 \"一个动画，它们将全部动画化。唯一需要注意的是，动画速度将永远是相同的，因为它是为整个瓦片集定义的，而不是为库中的单个动画定义的。",
    "{}The example image above is a single image with all animation frames contained within it, but it should be noted that the image could also contain other non-animation tiles too, since you can use a single massive tile set and then \"cherry pick\" the parts of it that you want to create the animation from. For example, you could have a large landscape tile set with trees, earth and water, and within the tile set have multiple tiles to be animated to make the water ripple.":"{}上面的例子是一个包含所有动画帧的单一图像，但应该注意的是，这个图像也可以包含其他非动画的瓦片，因为你可以使用一个庞大的瓦片集，然后 \"挑 \"出你想创建动画的部分。例如，你可以有一个包含树木、土地和水的大型景观瓦片集，在瓦片集中，有多个瓦片要做动画，使水产生涟漪。",
    "{}You will then be presented with a view of each empty animation frame, with the initial frame highlighted for you:":"{}然后你会看到每个空的动画帧的视图，并为你突出显示初始帧："
}