{
    "Auto Tiles":"自动图块",
    "Before you start using the auto tile feature however, it is very important that you have set up the tile set sprite correctly and that you choose an appropriate type of auto tile. The types available to you are {}47 tile {}auto tiles, or {}16 tile {}auto tiles, with (in general) 16 tiles being used for top down or landscapes (since they give nicer transitions) and 47 being used for platformer/side on views or topdown where walls require multiple connections, but that is by no means a hard and fast rule and will depend on how you want your final project to look.":"然而，在你开始使用自动图块功能之前，非常重要的一点是，你已经正确地设置了图块组精灵，并且选择了适当的自动图块类型。你可以选择的类型是{}47瓦{}自动图块，或{}16瓦{}自动图块，（一般来说）16瓦用于俯视或风景（因为它们提供了更好的过渡），47瓦用于平台/侧视或俯视的墙需要多个连接，但这绝不是一个硬性规定，将取决于你希望你的最终项目是如何看。",
    "The image below shows a typical 47 tile and 16 tile tile set for autotiling:":"下面的图片显示了一个典型的47瓦和16瓦的自动图块组合：",
    "The {}Auto Tile{} feature is an incredibly powerful tool that can be used to make level building much easier, whether it is for a top down or side on view project. Essentially, you create an auto tile {}library{}, and then whenever you lay down a tile from that library it will \"connect\" with those tiles that are around it to create a seamless wall or platform.":"{}自动图块{}功能是一个非常强大的工具，可以用来使水平面的建设更加容易，无论是自上而下还是从侧面看项目。从本质上讲，你可以创建一个自动图块{}库{}，然后每当你从该库中铺设一块图块时，它就会与周围的图块 \"连接 \"起来，以创建一个无缝的墙或平台。",
    "{}If you make a mistake, simply select the autotile that you want to remove and select the \"empty\" tile from the tile set. After you have added them all in you can check the tiles against the template by clicking the \"Show Template\" button {}&nbsp;at the top, and this will toggle the template overlay on the final autotile, as shown in the image below:":"{}如果你犯了一个错误，只需选择你想删除的自动图块，并从图块组中选择 \"空 \"图块。当你把它们全部加入后，你可以通过点击顶部的 \"显示模板 \"按钮{}&nbsp;来检查图块与模板的关系，这将在最后的自动图块上切换模板覆盖，如下图所示：",
    "{}If you want to make a 16 tile autotile, the proceedure is exactly the same as that explained above, only instead of using the 47 tile template you use the 16 tile template:":"{}如果你想制作一个16瓦的自动图块，程序和上面解释的完全一样，只是不使用47瓦的模板，而使用16瓦的模板。",
    "{}In the template, the light grey area represents the outside edge of the tile being used and the darker grey is the \"fill\" area. To add a tile into the template, simply click on the first available template cell and then select the tile to add from the left:":"{}在模板中，浅灰色区域代表正在使用的图块的外边缘，深灰色是 \"填充 \"区域。要在模板中添加图块，只需点击第一个可用的模板单元，然后从左边选择要添加的图块：",
    "{}Note that the tile set sprite being used has ALL the tiles we require, and can also have other tiles, since you can pick and choose which ones to be in the auto tile. You can now click {}&nbsp;on the 47 tile button in the Templates area to create a new 47 tile library entry and it will bring up the template to use for selecting the tiles you need:":"{}注意，正在使用的图块集精灵有我们需要的所有图块，也可以有其他图块，因为你可以挑选哪些图块放在自动图块中。你现在可以点击{}&nbsp;模板区的47瓦按钮，创建一个新的47瓦库条目，它将调出模板，用于选择你需要的图块：",
    "{}Now, just looking at the images doesn\u0027t really tell you how they will fit together so we\u0027ll open the {}Autotile Editor{} from the {}Tile Set Editor{} and add them. The Autotile Editor looks like this:":"{}现在，只看图片并不能真正告诉你它们将如何组合在一起，所以我们将从{}图块集编辑器{}中打开{}自动图块编辑器{}，并添加它们。自动图块编辑器看起来像这样：",
    "{}Please note that the behaviour of an autotile around the room edges will depend on the {}Open Or Closed Edges{} button {}. By default when an auto tile is placed along the edge of a room, it will choose a tile as if the outside of the room was empty (ie: it\u0027ll give the room an \"edge\"). However if you click this button, the autotile will tile the room as if the area outside was filled with tiles and so choose tiles that blend and have no \"edge\".":"{}请注意，房间边缘的自动图块的行为将取决于{}开放或封闭边缘{}按钮{}。默认情况下，当自动图块沿着房间边缘放置时，它将选择一块图块，就像房间外面是空的一样（即：它将给房间一个 \"边缘\"）。然而，如果你点击这个按钮，自动图块将在房间里铺设图块，就像外面的区域被图块填满一样，所以选择的图块是混合的，没有 \"边缘\"。",
    "{}We now have some auto tiles in our auto tile library taken from a tile set. These can be used in the room editor by simply creating a tile map layer and then selecting one of the auto tiles from the library (which will select automatically the auto tile brush from the top of the room editor) and painting in your room. The tiles will now \"auto-magically\" connect up to create properly sequenced tile maps.":"{}我们现在的自动图块库里有一些自动图块，取自一个图块集。这些图块可以在房间编辑器中使用，只需创建一个图块地图层，然后从库中选择一个自动图块（这将自动选择房间编辑器顶部的自动图块刷），并在你的房间中绘画。图块现在将 \"自动神奇地 \"连接起来，以创建正确的图块地图顺序。"
}