{
    "At the top right you can see the currently selected tool, and you can also set the size of the brush that you want to paint with. The default size is 1, which is a single tile, but if you set it to higher values then you can paint (and erase) with a larger brush composed of the selected tile repeated, as shown in the image below:":"在右上方，你可以看到当前选择的工具，你也可以设置你想用的画笔的大小。默认的大小是1，也就是一个图块，但是如果你把它设置成更高的数值，那么你就可以用一个由所选图块重复组成的更大的画笔来画（和擦除），如下图所示。",
    "Below the tools, you can find two different sections for selecting any {}{}auto tile{}{} or {}{}animated{} tiles{} that have been created using the current tile set image. A single sprite that is used for a tile set can have many, many, single cell images in it, and these can be combined in the Animation or Autotile editor to create custom brushes which will show up in these sections and can be used in conjunction with regular static tiles to create brushes (note that an animated tile will animate regardless of whether you have selected it from the library or from the base tile set).":"在工具下面，你可以找到两个不同的部分，用于选择任何{}{}自动图块{}{}或{}{}动画{}图块{}，这些图块是用当前图块组图像创建的。一个用于图块组的单一精灵可以有很多很多的单格图像，这些图像可以在动画或自动图块编辑器中组合起来，创建自定义的刷子，这些刷子将显示在这些部分，可以与普通的静态图块一起使用，创建刷子（注意，无论你是从库中还是从基本图块组中选择，一个动画图块都会产生动画）。",
    "By default when you \"paint\" tiles onto a {}tile map{} layer in the room editor, you select a single tile and paint with that. However, tile sets are almost always designed to have sections that fit together in different ways to form whole areas or items. For example, an RPG tile set may have landscape feature tiles that can be connected to create larger or smaller features - like trees and buildings - depending on the number of tiles used. Now, placing multiple features like this on a room layer would require you to go back and forth many times to change tile, which is not good for your workflow. To resolve this, {}GameMaker{} enables you to create tile {}Brushes {}in the Tile Set editor, available when you click {}&nbsp;on the {}Brush Builder{} button:":"默认情况下，当你在房间编辑器的{}图块地图{}层上 \"涂抹 \"图块时，你会选择一块图块，然后用它涂抹。然而，图块集几乎总是被设计成有一些部分，以不同的方式组合在一起，形成整个区域或项目。例如，一个RPG图块组可能有景观特征图块，可以连接起来形成更大或更小的特征--如树木和建筑--这取决于使用的图块数量。现在，在一个房间层上放置这样的多个特征，需要你来回多次更换图块，这对你的工作流程不利。为了解决这个问题，{}GameMaker{}使你能够在图块集编辑器中创建图块{}刷{}，当你点击{}&nbsp;上的{}Brush Builder{}按钮时，就可以使用。",
    "Clicking the Flip tool with the left mouse button {}&nbsp;(or using the keyboard shortcut \"{}X{}\" ) will flip the tile or tiles currently selected for drawing along the {}horizontal {}axis, without changing drawing tool (if you have a custom brush selected for drawing, the whole brush will flip). If you have no tile selected for drawing, but do have a group of tiles selected in the brush window, then the flip tool will Flip the selected tiles.":"用鼠标左键{}&nbsp;（或使用键盘快捷键\"{}X{}\"）点击翻转工具，将沿{}水平{}轴翻转当前选择的图块或图块，而不改变绘图工具（如果你选择了一个自定义画笔进行绘图，整个画笔将翻转）。如果你没有选择要画的图块，但在画笔窗口中选择了一组图块，那么翻转工具将翻转所选的图块。",
    "Clicking the Mirror tool with the left mouse button {}&nbsp;(or using the keyboard shortcut \" {}Y{}\" ) will mirror the tile(s) currently selected for drawing along the {}vertical {}axis, without changing drawing tool (if you have a custom brush selected for drawing, the whole brush will mirror). If you have no tile selected for drawing, but do have a group of tiles selected in the brush window, then the Mirror tool will mirror the selected tiles.":"用鼠标左键{}&nbsp;（或使用键盘快捷键\"{}Y{}\"）点击镜像工具，将沿{}垂直{}轴镜像当前选择的图块，而不改变绘图工具（如果你选择了一个自定义画笔进行绘图，整个画笔将被镜像）。如果你没有选择要绘制的图块，但在画笔窗口中选择了一组图块，那么镜像工具将镜像所选的图块。",
    "Clicking the Rotate tool with the left mouse button {}&nbsp;(or using the keyboard shortcut \" {}Z{}\" ) will rotate the tile(s) currently selected for drawing 90° {}clockwise{}, without changing drawing tool (if you have a custom brush selected for drawing, the whole brush will rotate). If you have no tile selected for drawing, but do have a group of tiles selected in the brush window, then the Rotate tool will rotate the selected tiles.":"用鼠标左键{}&nbsp;（或使用键盘快捷键\"{}Z{}\"）点击 \"旋转 \"工具，将把当前选择的图块旋转90°{}逆时针{}，而不改变绘图工具（如果你选择了一个自定义画笔进行绘图，整个画笔将旋转）。如果你没有选择要画的图块，但在画笔窗口中选择了一组图块，那么旋转工具将旋转所选的图块。",
    "Clicking this tool enables the {}Auto tiling{} paint style. When this is active you can select any tile from the Autotile Libraries tab, and then paint it into the Brushes window and {}GameMaker{} will automatically change it to match the surrounding tiles, as long as you have correctly set up the {}Auto Tile Tab{}. Note that selecting a tile from the tile set that is not part of the autotile libraries will reset the drawing tool to the standard Pencil tool.":"点击这个工具可以启用{}自动图块{}的绘画风格。当这个功能被激活时，你可以从自动图块库标签中选择任何图块，然后在画笔窗口中绘画，{}GameMaker{}会自动改变它以匹配周围的图块，只要你正确设置了{}自动图块标签{}。请注意，从图块集中选择一个不属于自动图块库的图块，将重置绘图工具为标准的铅笔工具。",
    "Once you have set up all the brushes you require, you can then use them to paint tiles onto any tile map layer within the {}Room Editor{}.":"一旦你设置了所有你需要的画笔，你就可以用它们在{}房间编辑器{}内的任何图块地图层上绘制图块。",
    "The Tile Set Brush Builder":"图块集笔刷生成器",
    "The following image shows our previously mentioned landscape features as an example of three custom brushes made from a single tile set:":"下图显示了我们之前提到的景观特征，作为一个例子，三个定制的刷子由一个图块集制成：",
    "This is the pencil tool. It uses the selected tile to paint in the Brushes window with the left mouse button {}&nbsp;and you can erase with the right mouse button {}.":"这就是铅笔工具。它使用选定的图块，用鼠标左键{}&nbsp;在画笔窗口中作画，你可以用鼠标右键{}擦除。",
    "This is the selection tool, which can be used to define an area of the Brushes window for working on. You can click the left mouse button {}&nbsp;and then drag the mouse to create a rectangular area, or you can press&nbsp;{}&nbsp;/&nbsp;{} + {}&nbsp;to add multiple selections and {}&nbsp;+ {}&nbsp;to clear a part of the selection. To clear the whole selection you can press {}. When you have an area of a Brushes window selected, the rest of the tools (Pencil, Flip, Rotate, etc...) will only work within the selected area. Note that you can also select tiles in the window then copy (&nbsp;{}&nbsp;/&nbsp;{}+ \"{}C{}\"), cut (&nbsp;{}&nbsp;/&nbsp;{} + \"{}X{}\") and paste (&nbsp;{}&nbsp;/&nbsp;{} + \" {}{}{}V{}{}{}\") them, which will then switch the tool to the Pencil and permit you to \"paint\" with them.":"这是选择工具，可以用来定义画笔窗口的一个区域，以便进行工作。你可以点击鼠标左键{}&nbsp;，然后拖动鼠标来创建一个矩形区域，或者你可以按&nbsp;{}&nbsp;/&nbsp;{}+{}&nbsp;来添加多个选区。+ {}&nbsp;来添加多个选区，{}&nbsp;+ {}&nbsp;来清除一部分选区。要清除整个选择，你可以按{}。当你选择了画笔窗口中的一个区域，其余的工具（铅笔、翻转、旋转等......）将只在所选区域内工作。注意，你也可以在窗口中选择图块，然后复制（&nbsp;{}&nbsp;/&nbsp;{}+\"{}C{}\"），剪切（&nbsp;{}&nbsp;/&nbsp;{}+\"{}X{}\"）和粘贴（&nbsp; {}&nbsp;/&nbsp;{}+\"{}{}V{}{}{}\"），然后将工具切换到铅笔，允许你用它们 \"画\"。",
    "With the eraser tool you can use the left mouse button {}&nbsp;to erase a given tile in the Brushes window. Essentially, all this does is set the tile index to 0, which is the reserved \"empty\" tile.":"使用橡皮擦工具，你可以使用鼠标左键{}&nbsp;来擦除画笔窗口中的一个特定的图块。从本质上讲，这只是把图块的索引设置为0，也就是保留的 \"空 \"图块。",
    "{}AutoTile{}":"{}自动图块{}",
    "{}Eraser{}":"{}橡皮擦{}",
    "{}Flip{}":"{}翻转{}",
    "{}In the {}Brush Builder{} you have the original tile set on the left and a blank \"canvas\" on the right. You can now select any tile from the left and paint it on the right to create custom \"brushes\" which you can then use in the room editor. Note that you can click and hold the left mouse button {}&nbsp;then drag on the tile set to select multiple tiles to paint into the brush canvas and you can also hold down&nbsp;{}&nbsp;/&nbsp;{} + {}&nbsp;to add specific individual tiles or hold down {}&nbsp;+ {}&nbsp;to remove specific tiles.":"{}在{}刷子生成器{}中，左边是原始图块集，右边是空白的 \"画布\"。你现在可以从左边选择任何图块，然后在右边涂抹，创建自定义的 \"画笔\"，然后你可以在房间编辑器中使用。注意，你可以点击并按住鼠标左键{}&nbsp;，然后在图块集上拖动，选择多块图块画到画笔画布上，你也可以按住&nbsp;{}&nbsp;/&nbsp;{}&nbsp;来添加图块。+ {}&nbsp;来添加特定的单个图块，或者按住{}&nbsp;+ {}&nbsp;来删除特定的图块。",
    "{}Mirror{}":"{}镜像{}",
    "{}On the right you can see three features that we\u0027ve made (highlighted with an orange box in the image). Notice how we\u0027ve left a gap of one tile between each feature - this is because {}any touching group of tiles will be treated as a single brush{} in the room editor, so we leave a gap of one tile to show that each set is a distinct brush we want to create. While creating your brushes, you paint with the left mouse button {}&nbsp;and delete with the right mouse button {}. You can also zoom the tile sheet or the brush canvas using {}&nbsp;/&nbsp;{}&nbsp;and the mouse wheel {}&nbsp;when the mouse is over one of the windows, or you can pan around using&nbsp;{}&nbsp;+ {}&nbsp;or the middle mouse button {}&nbsp;and dragging. Note that you can also use the zoom tools in the {}Toolbox{} within the editor windows to change the zoom levels of either window as well as toggle the grid visibility and colour.":"{}在右边，你可以看到我们所做的三个特征（在图片中用橙色方框突出）。注意我们在每个特征之间留了一个图块的间隙--这是因为{}在房间编辑器中，任何触摸的图块集都会被当作一个画笔{}，所以我们留了一个图块的间隙，以表明每一组都是我们要创建的一个不同的画笔。在创建画笔时，你用鼠标左键{}&nbsp;涂抹，用鼠标右键{}删除。你也可以用{}&nbsp;/&nbsp;{}&nbsp;和鼠标滚轮{}&nbsp;当鼠标在其中一个窗口上时，放大图块表或画布，或者你可以用&nbsp;{}&nbsp;+ {}&nbsp;或鼠标中键{}&nbsp;和拖动来平移。请注意，你也可以使用编辑器窗口内{}工具箱{}中的缩放工具来改变任一窗口的缩放级别，以及切换网格的可见性和颜色。",
    "{}Pencil{}":"{}铅笔{}",
    "{}Rotate{}":"{}旋转{}",
    "{}Selection{}":"{}选区{}",
    "{}The toolbox is where you can select the tool to use for many different tasks in the Tile Set editor, some of which will depend on whether you have anything defined in your {}auto tile{} library. A brief outline of each tool is given below (note that when you have selected a tile layer in the Room Editor, then this toolbox is displayed at the top of the room workspace, along with additional drawing tools):":"{}工具箱是你可以在图块集编辑器中选择用于许多不同任务的工具，其中一些将取决于你是否在{}自动图块{}库中定义了什么。下面给出了每个工具的简要概述（注意，当你在房间编辑器中选择了一个图块层，那么这个工具箱就会显示在房间工作区的顶部，同时还有其他绘图工具）。"
}