{
    "A random value between&nbsp;{}Min{} and {}Max{}&nbsp;is chosen as the delay.&nbsp;The emitter waits this amount of time before it bursts its first {}Particle Count{} particles.":"选择{}最小值{}和{}最大值{}之间的随机值作为延迟。发射器在爆发第一个{}粒子计数{}粒子之前等待此时间。",
    "A random value ranging from&nbsp;{}Min{} to&nbsp;{}Max{} is chosen for every subsequent burst&nbsp;of {}Particle Count{} particles. The emitter will use the same interval all the time if you set&nbsp;{}Min{} and {}Max{}&nbsp;to the same value.":"为 {} 粒子计数 {} 粒子的每次后续爆发选择范围从 {} 最小值 {} 到 {} 最大值 {} 的随机值。如果将 {} 最小值 {} 和 {} 最大值 {} 设置为相同的值，则发射器将始终使用相同的间隔。",
    "Alternatively, you can also use a custom sprite to be used as the texture for a particle. The {}Frame{} setting determines the image index of the sprite to be used, if the sprite has multiple sub-images.":"或者，也可以使用自定义精灵作为粒子的纹理。如果精灵有多个子图像，则{}框架{}设置确定要使用的精灵的图像索引。",
    "Checking {}Relative{} will set each particle\u0027s orientation to be relative to its direction. With this enabled, the final angle of a particle\u0027s image will be its movement direction + its orientation.":"选中{}相对{}会将每个粒子的方向设置为相对于其方向。启用此选项后，粒子图像的最终角度将是其运动方向+其方向。",
    "Colour":"颜色",
    "Delay &amp; Delay units":"延迟单位",
    "Direction":"方向",
    "Distribution":"分布",
    "Emitter Settings":"发射器设置",
    "Enabled":"启用",
    "Enabling {}Additive{} makes particles created by this emitter drawn using additive blending.":"启用{}加法{}使由该发射器创建的粒子使用加法混合绘制。",
    "Every frame, a random value between 0 and the {}Wiggle{} value is added to, or subtracted from, the direction of the particle. This can be used to add random fluctuations to the particle\u0027s direction.":"每一帧，粒子方向都会增加或减去介于 0 和{}摆动{}值之间的随机值。这可用于将随机波动添加到粒子的方向。",
    "Every frame, a random value between 0 and the {}Wiggle{} value is added to, or subtracted from, the orientation of the particle. This can be used to add random fluctuations to the particle\u0027s orientation.":"每一帧，粒子的方向都会加上或减去介于 0 和{}摆动{}值之间的随机值。这可用于将随机波动添加到粒子的方向。",
    "Every frame, a random value between 0 and the {}Wiggle{} value is added to, or subtracted from, the size of the particle. This can be used to add random fluctuations to the particle\u0027s size.":"每一帧，粒子大小都会增加或减去介于 0 和{}摆动{}值之间的随机值。这可以用来增加粒子大小的随机波动。",
    "Every frame, a random value between 0 and the {}Wiggle{} value is added to, or subtracted from, the speed of the particle. This can be used to add random fluctuations to the particle\u0027s speed.":"每一帧，粒子的速度都会加上或减去介于 0 和{}摆动{}值之间的随机值。这可以用来增加粒子速度的随机波动。",
    "Every particle is created with a random direction between {}Minimum{} and {}Maximum{}&nbsp;(where both are angles expressed in degrees).":"每个粒子的创建方向都是随机的，介于{}最小值{}和{}最大值{}之间(其中两者都是以度数表示的角度)。",
    "Gravity":"重力",
    "Here you can assign a preset to be emitted by each particle. A particle can emit a preset at two defined points in time:":"在此可以指定要由每个粒子发射的预设。粒子可以在两个定义的时间点发射预设：",
    "If this value is set to 0 the emitter will not create any particles.":"如果将该值设置为 0，则发射器将不会创建任何粒子。",
    "If you link different emitters (which can be in different Particle System assets)&nbsp;to the same preset, then changing the particle properties in any of these emitters will change them in the other emitters as well.":"如果链接不同的发射器（可以位于不同的粒子系统资源中）对于相同的预设，那么更改这些发射器中任何一个的粒子财产都会更改其他发射器中的粒子。",
    "In case of a positive value this setting determines the number of particles to be created:&nbsp;":"如果是正值，此设置将确定要创建的粒子数：",
    "In {}Burst{} mode the emitter creates the number of particles&nbsp;set under {}Particle Count{}&nbsp;{}exactly once{}.":"在{}爆炸{}模式中，发射器创建粒子数在{}粒子计数{}下设置只有{}一次{}。",
    "In&nbsp;{}Stream{} mode the emitter&nbsp;{}streams{}&nbsp;the number of particles set under {}Particle Count{} {}continuously{}. The emitter creates&nbsp;{}Particle Count{} particles every step&nbsp;(or frame).":"在{}流{}模式发射器下，{}流{}在{6}连续{7}设置{}粒子计数{}下的粒子数。发射器创建{}粒子计数{}每一步的粒子数（或框架）。",
    "Interval &amp; Interval units":"间隔间隔单位",
    "Library":"库",
    "Life":"寿命",
    "Mode":"模式",
    "Orientation":"方向",
    "Particle Count":"粒子计数",
    "Particle Settings":"粒子设置",
    "Preview":"预览",
    "Preview Colour":"预览颜色",
    "Scale":"比例",
    "See&nbsp;{}{}Particle Emitter Distribution Constant{}{}.":"请参阅{}{}粒子发射器分布常数{}{}。",
    "See&nbsp;{}{}Particle Emitter Shape Constant{}{}.":"请参阅{}{}粒子发射器形状常数{}{}。",
    "See:&nbsp;{}Shared Emitters{}":"请参阅：{}共享发射器{}",
    "Selecting a preset from the library using \"Select Particles\" in&nbsp;{}The Inspector{}&nbsp;applies this preset to the emitter and&nbsp;links the emitter to it, which is indicated by the highlighted yellow Link/Unlink icon {}.":"使用中的\"选择粒子\"从库中选择预设{}检查器{}将此预设应用于发射器将发射器链接到它，这由高亮显示的黄色链接/取消链接图标{}指示。",
    "Shape":"形状",
    "Size":"大小",
    "Speed":"速度",
    "Subparticles":"副粒子",
    "Textures":"纹理",
    "The library allows you to store the particle emitters that you create as&nbsp;{}presets{}, and also comes with some built-in presets.":"该库允许您将创建的粒子发射器存储为{}预设{}，还附带了一些内置预设。",
    "The texture is the image or sprite that a particle uses. By default&nbsp;{}GameMaker{}&nbsp;includes a selection of textures that you can use for a particle (see {}Overview of Particle Type Shapes{}).":"纹理是粒子使用的图像或精灵。默认情况下，{}GameMaker{} 包括可用于粒子的纹理选择(请参见{}粒子类型形状概述{})。",
    "The values for {}Min{} and {}Max{} are expressed in {}Delay units{}: {}Seconds{} (the default)&nbsp;or {}Frames{}.":"{}最小值{}和{}最大值{}的值以{}延迟单位{}表示：{}秒{}(默认值)或{}帧{}。",
    "The values for {}Min{} and {}Max{} are expressed in {}Interval units{}: {}Seconds{} (the default)&nbsp;or {}Frames{}.":"{} 最小值 {} 和 {} 最大值 {} 的值以 {} 间隔单位 {} 表示：{} 秒 {}( 默认值) 或 {} 帧 {}。",
    "The&nbsp;{}Emitter Properties{}&nbsp;are shown in {}The Inspector{}&nbsp;when an emitter is selected in {}The Particle System Editor{}. Here, the properties of the emitter and its associated particle type can be changed.":"当在{4}粒子系统编辑器{5}中选择发射器时，{}发射器属性{}将显示在{}检查器{}中。在这里，可以更改发射器及其关联粒子类型的属性。",
    "These two settings set the delay for an emitter set to {}Stream{} mode:&nbsp;":"这两个设置将设置 {} 流 {} 模式的发射器延迟：",
    "These two settings set the interval between consecutive bursts&nbsp;of particles for an emitter set to {}Stream{} mode:&nbsp;":"这两个设置将设置 {} 流 {} 模式的发射器粒子连续爆发之间的间隔：",
    "This setting changes the colour used for drawing the emitter preview. The colour\u0027s alpha can be changed to draw the preview with transparency.":"此设置更改用于绘制发射器预览的颜色。可以更改颜色的 Alpha 以绘制具有透明度的预览。",
    "This setting determines the colour of a particle over its lifetime. Every particle created by the emitter starts with the colour on the left, then changes to the colour in the middle and ends with the colour on the right. Every colour includes an alpha channel that affects the transparency of the particle.":"此设置确定粒子在其生命周期内的颜色。发射器创建的每个粒子从左侧的颜色开始，然后更改为中间的颜色，最后以右侧的颜色结束。每种颜色都包括一个影响粒子透明度的 Alpha 通道。",
    "This setting determines the direction in which the particles move.":"此设置确定粒子移动的方向。",
    "This setting determines the distribution of the particles over the shape, i.e. where they are created.":"此设置确定粒子在形状上的分布，即粒子的创建位置。",
    "This setting determines the final size of the particles. The size is applied after the scale.":"此设置确定粒子的最终大小。在缩放之后应用大小。",
    "This setting determines the gravity applied to all particles created by this emitter. You can set the gravity\u0027s&nbsp;{}Force{}, which is applied in the given {}Direction{}.":"该设置确定应用于该发射器创建的所有粒子的重力。您可以设置重力的{}力{}，它在给定的{}方向{}上应用。",
    "This setting determines the lifetime of the particle, expressed in steps. Upon creation, each particle is assigned a random lifetime between the {}Minimum{} and {}Maximum{} values, and that is how many steps/frames the particle lasts.":"此设置确定粒子的寿命，以步长表示。创建后，将为每个粒子指定一个介于{}最小{}和{}最大{}值之间的随机寿命，这就是粒子持续的步数/帧数。",
    "This setting determines the orientation of the particle. As opposed to the direction the particle moves in, the orientation is the rotation of the particle\u0027s image (similar to an instance\u0027s&nbsp;{}{}image_angle{}{}).":"此设置确定粒子的方向。与粒子移动的方向相反，方向是粒子图像的旋转(类似于实例的 {}{}image_angle{}{})。",
    "This setting determines the shape of the particle emitter. The emitter creates particles inside this shape.":"此设置确定粒子发射器的形状。发射器在该形状内创建粒子。",
    "This setting determines the speed of the particles in the direction they are moving. Every particle is created with a random speed between {}Minimum{} and {}Maximum{}.":"此设置确定粒子在其移动方向上的速度。每个粒子都是以介于{}最小值{}和{}最大值{}之间的随机速度创建的。",
    "This setting determines the {}X{} and {}Y{} scale of the particles. This scale factor is applied to the particle texture first, before {}Size{}.":"此设置确定粒子的 {}X{} 和 {}Y{} 比例。该比例因子首先应用于粒子纹理，然后应用于{}大小{}。",
    "This setting enables or disables the emitter.&nbsp;It corresponds to the visibility setting&nbsp;{} in the emitter list shown next to {}The Canvas{}.":"此设置启用或禁用发射器。它对应于{}画布{}旁边显示的发射器列表中的可见性设置{0}。",
    "This setting enables or disables the preview of the emitter\u0027s&nbsp;shape&nbsp;on {}The Canvas{}.":"此设置启用或禁用发射器在{}画布{}上的形状预览。",
    "Using a {}Gaussian{}&nbsp;distribution there is a greater chance of particles being created closer to the centre of the shape.":"使用{}高斯{}分布——在形状中心附近产生粒子的可能性更大。",
    "Using a {}Linear{} distribution the particles are created randomly all over the shape with no preference for the centre or the edges. The chance of a particle appearing is the same everywhere.":"使用{}线性{}分布，粒子在整个形状上随机创建，而不首选中心或边缘。粒子出现的几率在任何地方都是一样的。",
    "Using an&nbsp;{}Inverse Gaussian{}&nbsp;distribution there is a greater chance of particles being created near the edges of the shape.":"使用{}逆高斯{}分布——在形状的边缘附近产生粒子的可能性更大。",
    "When the emitter is disabled, it\u0027s paused, meaning that enabling it will continue it from the same state when it was disabled.":"当发射器被禁用时，它将暂停，这意味着启用它将使其从禁用时的相同状态继续。",
    "You can also set a negative value. This means that a particle will be created with a chance of 1 out of \"{}Particle Count{}\", e.g. with the Particle Count set to&nbsp;{}-10{}, there is a 1 out of 10 chance that a particle will be created.":"您也可以设置一个负值。这意味着创建粒子时，\"{}粒子计数{}\"中有 1 的几率，例如，将\"粒子计数\"设置为 {}-10{}，有十分之一的几率会产生一个粒子。",
    "{}Emitter Properties{}":"发射器属性",
    "{}Every step{}&nbsp;when in&nbsp;{}Stream{} mode":"{}每一步{}：当处于{}流{}模式时",
    "{}Every step{}&nbsp;when in&nbsp;{}Stream{} mode,&nbsp;{}or{}&nbsp;at a custom&nbsp;{}interval{}{} {}set under&nbsp;{}Interval &amp; Interval units{}":"处于{}流{}模式时，{0}每一步{1}{}或{}按照在{}间隔和间隔单位{}下设置的自定义{}间隔{}{}",
    "{}Increment{} is the value that gets added every step, e.g. if this value is set to 0.01, the size of every particle will increase by 0.01 every step.":"{}增量{}是每一步增加的值，例如，如果将该值设置为 0.01，则每个粒子的大小将每一步增加 0.01。",
    "{}Increment{} is the value that gets added to the particle\u0027s direction every step.":"{}增量{}是每一步添加到粒子方向的值。",
    "{}Increment{} is the value that gets added to the particle\u0027s orientation every step.":"{}增量{}是每一步添加到粒子方向的值。",
    "{}Increment{} is the value that gets added to the particle\u0027s speed every step.":"{}增量{}是粒子每一步的速度增加的值。",
    "{}On Death{}: You can set the type and count of particles to be created at the end of a particle\u0027s lifetime.":"{}当死亡{}：您可以设置要在粒子生命周期结束时创建的粒子的类型和数量。",
    "{}On Update{}:&nbsp;You can set the type and count of particles to be created on each frame while a particle is alive.":"{}当更新{}：您可以设置粒子处于活动状态时要在每帧上创建的粒子的类型和计数。",
    "{}Once{}&nbsp;when in {}Burst{} mode":"{}爆炸{}模式下,{}一次{}",
    "{}{}NOTE{}{}&nbsp;In {}Burst{} mode&nbsp;{}The Particle System Editor{}&nbsp;will burst the given number of particles only {}once{}. You can click the&nbsp;{}Restart Animation{}&nbsp;button to make the editor play it again.":"{}{}注意{}{}在{}爆发{}模式下，{}粒子系统编辑器{}只会爆发给定数量的粒子{}一次{}。 您可以点击{}重新启动动画{}按钮让编辑器再次播放。",
    "{}{}NOTE{}{}&nbsp;In {}Burst{} mode&nbsp;{}The Particle System Editor{}&nbsp;will burst the given number of particles repeatedly, but in-game this will happen only{}&nbsp;once{}.":"{}{}注意{}{} 在{}爆炸{}模式下{}粒子系统编辑器{}将重复地爆发给定数量的粒子，但在游戏中，这种情况只会发生{}一次{}。"
}