{
    "Compiler Errors":"编译器错误",
    "Error Reporting":"错误报告",
    "Runner Errors":"运行器错误",
    "Syntax Errors":"语法错误",
    "The first form of error reporting is the&nbsp;{}Syntax Error{}. This is an error in your code that {}GameMaker{} has caught before you have tried to compile it and these will be shown in the IDE, either in the code editor or in the {}Syntax Errors Output Window{}:":"错误报告的第一种形式是{}语法错误{}。这是您的代码中的一个错误，{} GameMaker {}在您尝试编译它之前已经捕获了这个错误，这些错误将在 IDE 中显示，或者在代码编辑器中，或者在{}语法错误输出窗口{}中显示:",
    "The following pages outline all the different Syntax, Runner, and Compiler errors that you can get and what they mean:":"下面的页面概述了所有不同的语法、运行程序和编译器错误，以及它们的含义:",
    "This section covers all the errors you may get for your game\u0027s GML code.":"本节涵盖了您的游戏的 GML 代码可能出现的所有错误。",
    "{}If the game compiles and an error occurs, you\u0027ll get a {}Runner Error{}. This type of error will show&nbsp;an onscreen message, much like the one shown below:":"{}如果游戏编译后发生错误，您将得到一个{}运行程序错误{}。这种类型的错误将显示一个屏幕上的消息，非常类似于下面所示的:",
    "{}Most runner error messages follow the same outline, with a message stating the type of error, the instance and event in which the error was encountered, then a series of runner details that explain the error in a lot more depth and, finally, a list of all the declared global, instance and local variables in your game at that point. At the very bottom is the {}Abort {}button which will abort the game, as well as the {}Copy {}button (which copies the error into the clipboard) and the {}Clear {}button which clears the error messages from the window. The information provided by the error reporting here is very important as it detects and reports the large, syntax related bugs that are going to cause your finished game to crash, but note that it won\u0027t report more subtle bugs, nor does it give feedback on performance... for that you need to use the the {}Debugger{}.":"{}大多数的运行器错误消息都遵循相同的提纲，包括错误类型、错误发生的实例和事件，然后是一系列运行器详细信息，更加深入地解释错误，最后是一个列表，列出所有在你的游戏中声明的全局、实例和局部变量。在最底部是{}中止{}按钮，它将中止游戏，以及{}复制{}按钮(复制错误到剪贴板)和{}清除{}按钮，清除错误消息从窗口。这里的错误报告所提供的信息非常重要，因为它检测并报告了与语法相关的大错误，这些错误会导致最终的游戏崩溃，但是请注意，它不会报告更多细微的错误，也不会对性能提供反馈... ... 因此，你需要使用{}调试器{}。",
    "{}The next level of error reporting is the {}Compiler Error{}. These types of errors are more general than runner errors and may be due to some subtle error in the game code, which cause the it crash while it\u0027s {}Compiling{}, before it even gets a chance to run. These too will be reported in the Compiler Errors Output Window:":"{}下一级错误报告是{}编译器错误{}。这些类型的错误比运行程序错误更加普遍，可能是由于游戏代码中的一些细微错误，这些错误导致它在{}编译{}时崩溃，甚至在它有机会运行之前就崩溃了。这些也将在编译器错误输出窗口中报告:"
}