{
    "In this way you can better control texture page memory usage on platforms with low memory issues. Note that textures pages are created on demand from the WAD, and so you can either call this at the start of the game to load all textures scaled, or you can call it at specific times to load specific textures, in which case you\u0027d probably want to call {}{}draw_texture_flush(){}{} before calling this function, then use the pre-fetch functions to get the correct texture pages into memory.":"通过这种方式，可以更好地控制具有低内存问题的平台上的纹理页面内存使用。请注意，纹理页面是根据Wad的需要创建的，因此您可以在游戏开始时调用它来加载所有缩放的纹理，或者可以在特定时间调用它以加载特定纹理，在这种情况下，您可能需要在调用此函数之前调用{}{}draw_texture_flush(){}{}，然后使用预取函数获取正确的纹理页面到内存中。",
    "In this way you can better control texture page memory usage on platforms with low memory issues. Note that textures pages are created on demand from the WAD, and so you can either call this at the start of the game to load all textures scaled, or you can call it at specific times to load specific textures, in which case you\u0027d probably want to call&nbsp;{}{}draw_texture_flush{}{} before calling this function, then use the pre-fetch functions to get the correct texture pages into memory.":"通过这种方式，您可以更好地控制内存不足问题的平台上的纹理页内存使用情况。请注意，纹理页面是根据 WAD 的需求创建的，因此您可以在游戏开始时调用它来加载所有缩放的纹理，也可以在特定时间调用它来加载特定纹理，在这种情况下，您可以可能想在调用此函数之前调用 {}{}draw_texture_flush{}{}，然后使用预取函数将正确的纹理页面获取到内存中。",
    "The above code will flush all textures from memory, then set the texture scaling to 2 (so texture pages are half size) and then finally pre-fetch the texture page that the sprite \"spr_Trees\" is contained within.":"上述代码将刷新内存中的所有纹理，然后将纹理缩放设置为2(使纹理页面大小为一半)，最后预取精灵\"spr_Trees\"所在的纹理页面。",
    "The above code will flush all textures from memory, then set the texture scaling to 2 (so texture pages are half size) and then finally pre-fetch the texture page that the sprite {}spr_Trees{}&nbsp;is contained within.":"上述代码将从内存中刷新所有纹理，然后将纹理缩放设置为 2( 因此纹理页面大小减半)，最后预取精灵 {}spr_Trees{} 所在的纹理页面。",
    "The input value must be a power of two value and will work such that:":"输入值必须是两个值的幂，并且将满足以下条件：",
    "The scale factor to use (1, no scale, 2, half scale, 4, quarter scale, etc.)":"使用的比例因子 (1，无比例，2，半比例，4，四分之一比例等)",
    "The scale factor to use (1, no scale, 2, half scale, 4, quarter scale, etc...)":"要使用的比例因子(1、无比例、2、半比例、4、四分之一比例等)",
    "This function allows you to control the scaling of the texture pages on load from the WAD file that is part of your final game executable.":"此功能允许您控制从 WAD 文件加载时纹理页面的缩放，该文件是最终游戏可执行文件的一部分。",
    "This function allows you to control the scaling of the texture pages on load from the WAD file that is part of your final game executable. The input value must be a power of two value and will work such that:":"此函数允许您控制从WAD文件(作为最终游戏可执行文件的一部分)加载时纹理页面的缩放。输入值必须是两个值的幂，并且可以：",
    "This function only works for PNG textures. You can change the texture format using&nbsp;{}Texture Groups{}.":"此功能仅适用于 PNG 纹理。您可以使用 {} 纹理组 {} 更改纹理格式。",
    "To half textures all the time use {}texture_global_scale(2){}":"始终使用 {}texture_global_scale(2){} 将纹理减半",
    "To half textures all the time use&nbsp;{}{}texture_global_scale{}(2){}":"要始终将纹理减半，请使用 {}{}texture_global_scale{}(2){}",
    "To quarter them use {}texture_global_scale(4){}, etc...":"要使其四分之一，请使用 {}texture_global_scale(4){} 等 ...",
    "To quarter them use {}{}texture_global_scale{}(4){}, etc.":"要四分之一它们，请使用 {}{}texture_global_scale{}(4){} 等。",
    "To set the texture pages to be 1:1 use {}texture_global_scale(1){}":"若要将纹理页面设置为 1:1，请使用 {}texture_global_scale(1){}",
    "To set the texture pages to be 1:1 use&nbsp;{}{}texture_global_scale{}(1){}":"要将纹理页面设置为 1:1，请使用 {}{}texture_global_scale{}(1){}"
}