{
    "By default {}GameMaker{} will run and debug using the built in {}Virtual Machine (VM){}, which is more or less the same as running on the desktop OS being used. However {}GameMaker{} is a {}cross platform engine{} and you can test, debug and compile executable packages of your projects on a number of different target platforms (the exact platforms available will depend on the details of your licence). To change the current target platform you can click {} on the Targets button {}&nbsp;to open the {}Targets Window{}, which will look something like this (exact details will vary based on your licence type):":"默认情况下{}GameMaker{}将使用内置的{}虚拟机(VM){}运行和调试，这与正在使用的桌面操作系统上运行的情况大致相同。但是{}GameMaker{}是一个{}跨平台引擎{}，您可以在许多不同的目标平台上测试，调试和编译项目的可执行包(可用的确切平台将取决于您的许可证的详细信息)。要更改当前目标平台，您可以单击目标按钮{}上的{}以打开{}目标窗口{}, 该窗口看起来像这样(确切的详细信息将根据您的许可证类型而有所不同):",
    "Compiling for Testing":"为测试而编译",
    "Compiling your game for testing can be done by simply pressing the Play button&nbsp;{} at the top of the IDE, which will launch the game for testing using the specified target. You can also run the game in {}Debug Mode{} by testing using the Debug button {}. This will run the game, but also open up the {}Debug Window{}, where you can monitor how your game performs and see any issues (see the section on {}Debugging{} for more information).":"编译你的游戏进行测试，只需按下IDE顶部的Play按钮&nbsp;{}，就可以使用指定的目标启动游戏进行测试。 你也可以通过使用调试按钮{}测试{}，在调试模式{}下运行游戏。 这将运行游戏，但也会打开{}调试窗口{}，在那里你可以监控你的游戏表现，并看到任何问题（更多信息见{}调试{}部分）。",
    "Target Settings":"目标设置",
    "{}At the top, beside the Targets button, you have the current settings which tells you the platform and the specific settings actually being used, and then the rest of the window is taken up with the details and options for all the available targets which you can select to use instead. Each section of this window is explained below:&nbsp;":"{}在顶部，在\"目标\"按钮旁边，您有当前设置，该设置告诉您实际使用的平台和特定设置，然后窗口的其余部分将讨论所有可用目标的详细信息和选项，您可以选择使用这些详细信息和选项。此窗口的每个部分解释如下：",
    "{}Compiling{}":"{}编译{}",
    "{}Compiling{} your game can mean one of two things: compiling it for testing, or compiling it to create a final&nbsp;{}{}executable package{}{}&nbsp;for a specific target platform. This page aims to explain both of those options in detail.":"{}编译{}你的游戏可能意味着两件事中的一件。 编译它以进行测试，或编译它以创建一个最终的&nbsp;{}{}可执行包{}{}&nbsp;用于特定的目标平台。 本页旨在详细解释这两个选项。",
    "{}{}NOTE{}{}&nbsp;Before doing a final build of your project for release, you should {}always clear the Asset Compiler {}Cache{}{} (using the \"broom\" icon {}&nbsp;at the top of the IDE). {}GameMaker{} will cache many of your game files to keep compilation speed to a minimum and these can sometimes get corrupted, so it is safer to clear that cache before doing a release build.":"{}{}注意{}{}在完成项目的最终版本发布之前，您应该{}总是清除资源编译器 {}缓存{}{} (使用 IDE 顶部的“扫帚”图标{})。{} GameMaker {}会缓存很多游戏文件，以将编译速度保持在最低限度，这些文件有时会被破坏，所以在进行发布版本构建之前清除缓存更安全。"
}