{
    "Apart from these compile errors, you can also get syntax errors. These will be detected as you add your GML Visual actions or code and are shown in the {}Syntax Errors Output Window{}, similar to the image shown below:":"除了这些编译错误，你还可能遇到语法错误。这些将在您添加 GML 可视化操作或代码时被检测到，并显示在{}语法错误输出窗口{}中，如下图所示：",
    "As an additional tool for debugging compiled games, there are certain {}command line parameters{} that can be used when you run the final game package on Windows. For information on how this works please see {}here{}.":"作为调试已编译游戏的额外工具，当您在 Windows 上运行最终游戏包时，可以使用某些{}命令行参数{}。有关其工作原理的信息，请在此处查看{}。",
    "Debugging":"调试",
    "Debugging Preferences":"调试首选项",
    "If you need to check things more carefully, you can run the game in {}Debug Mode{} by clicking the debug run button {}. When you do, the {}Debug Module{} will open along with your game. This module permits you to monitor how everything is working in your game, from the global performance, right down to the values of individual variables in individual instances. You can find out further information about the Debug Module and its possibilities and how to use it from the following page:":"如果你需要更仔细地检查一下，你可以点击调试运行按钮{}在{}调试模式{}下运行游戏。完成后，{}调试模块{}将与您的游戏一起打开。这个模块允许你监控游戏中所有事物的运行情况，从全局性能到单个实例中单个变量的值。您可以从以下页面了解有关调试模块及其可能性以及如何使用它的更多信息：",
    "Introduction To {}GameMaker{}":"{}GameMaker 简介{}",
    "Note that when you use the Debug Module, you can also add {}Breakpoints {}to your code or GML Visual. A breakpoint is a point in the game loop where you want the debug module to pause and let you step through the actual game code a line at a time. You can add breakpoints using the key \"F9\", and they will be shown in the {}Output Window{}&nbsp;where you can enable/disable them as required.":"请注意，在使用调试模块时，还可以在代码或 GML Visual 中添加{}Breakpoints{}。断点是游戏循环中的一个点，你希望调试模块暂停并让你逐行浏览实际的游戏代码。您可以使用密钥 \"F9\" 添加断点，它们将显示在{}输出窗口{}中，您可以根据需要启用/禁用断点。",
    "Now, you can check a lot of these things yourself by adding in so-called \"debug code\" to your games to display on the screen the information you require, or you can have it that it shows messages when there is an error, but this is often a lot of work and if you aren\u0027t sure where the problem is in the first place then it can be a time consuming case of trial and error to track down your bug. For that, {}GameMaker{} has a special test mode called {}Debug Mode{} which will start the {}Debug Module{}, and there is also a comprehensive {}error reporting system{} which displays messages on {}Compiling{}&nbsp;to help you track down any problems with your game.":"现在，你可以通过在游戏中添加所谓的 \"调试代码\" 来在屏幕上显示你需要的信息，或者你可以让它在出现错误时显示消息，但这通常需要大量的工作，如果你一开始不确定问题出在哪里，那么追踪错误可能是一个耗时的反复试验。为此，{}GameMaker{}有一个名为{}调试模式{}的特殊测试模式，它将启动{}调试模块{}，还有一个全面的{}错误报告系统{}它在{}Comilil{}上显示消息，以帮助您追踪游戏中的任何问题。",
    "The Debugger":"调试器",
    "The Output Window":"输出窗口",
    "The sections below cover the different ways that you can debug your game:":"以下部分介绍了调试游戏的不同方式：",
    "There are also a set of preferences related to debugging and using the debug tools. You can find more information from the following page:":"还有一组与调试和使用调试工具相关的首选项。您可以从以下页面找到更多信息：",
    "When an error occurs during the compiling and execution of a project this is reported with a message in the {}Compile Errors Output Window{}, much like the one shown below:":"如果在编译和执行项目期间发生错误，则会在{}编译错误输出窗口{}中报告此错误并显示一条消息，如下所示：",
    "When programming your game, whether using {}GML Code{}&nbsp;or&nbsp;{}GML Visual{}, it can be very easy to make mistakes - using the wrong variables, passing the wrong arguments, or using the wrong functions are just some of the most common errors we all make - and these mistakes are not always detected by the {}syntax{} checker that is included with the script/action editor. That means that these mistakes will only become apparent when you actually run or compile your game, and even then it can sometimes be difficult to know exactly what is going wrong. It can therefore be of vital importance to know how your game is performing on the chosen device, as well as see what instances are in the room, what global variables have been created and a whole host of other details. Checking these things is called \"{}debugging your code{}\", and any errors or issues you may find are called \"{}bugs{}\".":"在编程游戏时，无论使用{}GML Code{}还是{}GML Visual{}，都很容易犯错误——使用错误的变量、传递错误的参数或使用错误的函数只是我们所有人犯的一些最常见的错误——而且脚本/动作编辑器附带的{}语法{}检查器并不总是能检测到这些错误。这意味着只有当你实际运行或编译游戏时，这些错误才会变得明显，即便如此，有时也很难确切知道出了什么问题。因此，了解游戏在所选设备上的表现以及查看房间里有哪些实例、创建了哪些全局变量以及大量其他细节可能至关重要。检查这些内容称为 \"{}调试你的代码{}\"，你可能发现的任何错误或问题都被称为 \"{}bugs{}\"。",
    "You can also generate a&nbsp;{}debug overlay{}&nbsp;when you are test running your game which will show additional debug information about the performance of your game as it is being run, and you can also output&nbsp;{}debug messages{}&nbsp;to the compile console where you can supply your own text to help debug the behaviour of your games. For more information see the following pages: {}{}":"您还可以在测试运行游戏时生成{}调试叠加层{}，该叠加层将在游戏运行时显示有关游戏性能的更多调试信息，还可以将{}调试消息{}输出到编译控制台，您可以在其中提供自己的文本来帮助调试游戏的行为。有关更多信息，请参阅以下页面：{}{}",
    "{}Additional Tools{}{}Additional Tools{}":"{}其他工具{}{}其他工具{}",
    "{}As with the compiler errors, the syntax errors window will direct you to the object, the event and the specific lines that are giving the issue, and will often be shown with a brief explanation of what the error is.":"{}与编译器错误一样，语法错误窗口将引导您找到对象、事件和出现问题的特定行，并且通常会显示错误的简要说明。",
    "{}Debug Mode{}{}Debug Mode{}":"{}调试模式{}{}调试模式{}",
    "{}Debugging{}":"{}调试{}",
    "{}Error Reporting{}{}Error Reporting{}":"{}错误报告{}{}错误报告{}",
    "{}Most compiler error messages follow the same outline, with a message stating the object that the error has occurred in, then the Event along with the line number, and then finally a short description of the error itself. This type of information being provided by the error reporting is very important as it detects and reports the syntax and language related bugs that are going to cause your finished game to crash, but it won\u0027t report more subtle bugs, nor does it give feedback on performance. For those types of things you should use Debug Mode (explained below).":"{}大多数编译器错误消息遵循相同的大纲，一条消息说明错误发生在哪个对象，然后是事件和行号，最后是错误本身的简短描述。错误报告提供的此类信息非常重要，因为它可以检测并报告语法和语言相关的错误，这些错误会导致你完成的游戏崩溃，但它不会报告更细微的错误，也不会提供性能反馈。对于这些类型的东西，你应该使用调试模式(如下所述)。"
}