{
    "For more information, examples, tutorials, and links to helpful forums and other great resources, visit the {}GameMaker&nbsp;website{}.":"欲了解更多信息、实例、教程以及有用的论坛和其他重要资源的链接，请访问{}GameMaker&nbsp;网站{}。",
    "For those that are new to the world of programming or who have never used any game creation tool before, {}GameMaker{} offers an intuitive and easy to use {}GML Visual{} interface of actions that allow you to start creating your own games very quickly using visual scripting:":"对于那些刚进入编程世界或从未使用过任何游戏创作工具的人来说，{}GameMaker{}提供了一个直观和易于使用的{}GML Visual{}动作界面，使你能够使用可视化脚本迅速开始创作自己的游戏。",
    "If you are a more experienced - or less visual - programmer, then you can use the {}proprietary{}&nbsp;scripting language {}GML {}to create your games:":"如果你是一个更有经验的--或不太形象的--程序员，那么你可以使用{}专有的{}&nbsp;脚本语言{}GML{}来创建你的游戏。",
    "Introduction To {}GameMaker{}":"介绍{}GameMaker{}",
    "This help file will tell you all you need to know about {}GameMaker{} and how you can create your own games with it. However, please realise that even with a program like {}GameMaker{}, designing computer games is not completely effortless - so no \"make me a MMORPG\" button here! Be aware too that there are many aspects to making games and that they are all equally important: game-play, graphics, sounds, user interaction, etc... But, the most important aspect of all, is patience. While {}GameMaker{} is a powerful tool, it cannot do everything for you at the touch of a button so start small with simple examples and you will find that not only is creating games great fun, but that learning to use {}GameMaker{} to do it is also very rewarding!":"本帮助文件将告诉你关于{}GameMaker{}的所有信息，以及你如何用它创建自己的游戏。然而，请注意，即使有了{}GameMaker{}这样的程序，设计电脑游戏也不是完全不费吹灰之力的--所以这里没有 \"给我做个MMORPG \"的按钮。也请注意，制作游戏有许多方面，它们都同样重要：游戏玩法、图形、声音、用户互动等等。但是，最重要的方面，是耐心。虽然{}GameMaker{}是一个强大的工具，但它不可能一键完成所有的事情，所以从简单的例子开始，你会发现，不仅创造游戏是非常有趣的，而且学习使用{}GameMaker{}来做游戏也是非常有价值的。",
    "{}GameMaker{} comes with a number of powerful tools, like a complete {}Image Editor{} for creating your own {}sprites{} and the ability to use {}tile sets{} and you can also import images that you have made in any external editor, including Spine skeleton animations and SWF format vector files. Once you have your images it\u0027s simply a question of assigning them to objects in the {}Object Editor{}, adding some code or GML Visual actions, and then placing instances of these objects into a game room in the {}Room Editor{}. There are also additional tools for creating {}Paths{}, {}Sequences{}, {}Shaders {}and a whole lot more. You\u0027ll find the IDE is also incredibly flexible, and it can be customised to your needs, should the default IDE setup not cover something you require, using the different {}Preferences{}.":"{}GameMaker{}配备了许多强大的工具，比如一个完整的{}图像编辑器{}，用于创建你自己的{}精灵{}和使用{}瓦片{}的能力，你还可以导入你在任何外部编辑器中制作的图像，包括Spine骨架动画和SWF格式矢量文件。一旦你有了你的图像，就只需要在{}物体编辑{}中把它们分配给物体，添加一些代码或GML 视觉动作，然后在{}房间编辑器{}中把这些对象的实例放入游戏室。还有一些额外的工具用于创建{}路径{}、{}序列{}、{}着色器{}和更多。你会发现这个IDE非常灵活，如果默认的IDE设置没有涵盖你所需要的东西，你可以使用不同的{}首选项{}来定制你的需求。",
    "{}GameMaker{} is a tool designed to empower you and your team to make new and innovative games as well as prototype ideas in the fastest and most intuitive way possible across multiple target platforms. It is intended primarily as a tool for making 2D games - although 3D games are perfectly doable - and comes with a number of tools and editors to help you realize your dreams and ideas, with your final project being ported across multiple platforms from the same initial base resources. {}":"{}GameMaker{}是一个工具，旨在使你和你的团队能够以最快和最直观的方式在多个目标平台上制作新的和创新的游戏以及原型想法。 它主要是作为制作2D游戏的工具--尽管3D游戏是完全可以做到的--并配有一些工具和编辑器来帮助你实现你的梦想和想法，你的最终项目可以从相同的初始基础资源移植到多个平台。 {}",
    "{}You can even combine both and mix&nbsp;GML functions with GML Visual actions, giving you a great deal of flexibility when it comes to how you write things. This is all laid out in an intuitive fashion, with different aspects of your game \"{}chaining{}\" together in the {}IDE{} to give you a unique and very visual representation of the workflow.":"{}你甚至可以把两者结合起来，把GML函数和GML视觉动作混合起来，在你写东西的时候给你很大的灵活性。 这一切都以一种直观的方式布置，你的游戏的不同方面\"{}链{}\" 在{}IDE{}中一起给你一个独特的、非常直观的工作流程的表示。"
}