{
    "&nbsp; &nbsp;{} The RMB {}&nbsp;menu for shaders contains the following option (as well as those listed further up this page):":"{}着色器的鼠标右键{}菜单包含以下选项(以及本页上方列出的选项)：",
    "A script resource is simply a container for one or more functions you have written. For example, say you want to have all your enemy objects create a number of different instances when they die - like some gold, an explosion and some blood as well as play a sound. Now you could add all the required code into each object that requires it, but in general you\u0027d be better off creating a single function in script resource and then calling that. This means that you only have to add one line of code into the objects to call this new scripted function, and if you wish to change something you only need to change it once in the script and all the objects will automatically run the new code, rather than have to go through every object and change the same thing in multiple places.":"脚本资源只是您编写的一个或多个函数的容器。例如，假设您想让所有敌人的对象在死亡时创建许多不同的实例-例如一些黄金，爆炸和一些血液以及播放声音。现在，您可以将所有所需的代码添加到需要它的每个对象中，但通常情况下，最好在脚本资源中创建一个函数，然后调用该函数。这意味着您只需在对象中添加一行代码即可调用此新脚本函数，如果您希望更改某些内容，则只需在脚本中更改一次，所有对象将自动运行新代码，而不是必须遍历每个对象并在多个地方更改同一件事。",
    "A sequence asset is essentially a collection of other resources that perform a dynamic animation over time. They can contain sprites, instances, sounds and other things, and each of these can be set to move or change colour, or start/stop over time within the sequence itself by assigning the assets to specific {}tracks {}within the sequence. These tracks can then have different attributes applied to them which can be static or change over time. All editing of a sequence takes place in the {}Sequence Editor{} which is comprised of:":"序列资源本质上是随时间执行动态动画的其他资源的集合。它们可以包含精灵、实例、声音和其他东西，并且可以通过将资源分配给序列中的特定{}轨道{}来设置它们以移动或更改颜色，或者随时间推移开始/停止。然后，这些轨道可具有不同的属性应用于它们，这些属性可以是静态的或随时间改变的。序列的所有编辑都在{}序列编辑器{}中进行，该编辑器包括：",
    "All games that you make in {}GameMaker{} need at least one room to run (but can have many, many more) , and a room is basically a space where you place instances of the objects that make up your game and where the action of the game will take place. However the Room Editor is one of the most powerful of resources available to you, since it permits you to not only add instances of objects, but to set up the \"view\" into the game room, add the backgrounds and tiles that are drawn to create the game world, create extra special effects that are independent of the object/instance system, and as well as run code independently of an object. Rooms can also be set to {}inherit {}properties from other rooms, meaning that you can create a single room with a load of tiles, for example, and then make another room that inherits these tiles, so that you don\u0027t have to re-create them again.":"您在{}GameMaker{}中制作的所有游戏至少需要一个房间才能运行(但可以有很多，更多)，并且一个房间基本上是一个空间，您可以在其中放置组成游戏的对象的实例，并且游戏的动作将发生。然而，房间编辑器是你可用的最强大的资源之一，因为它允许你不仅添加对象的实例，但设置 \"视图\" 到游戏室，添加背景和图块，绘制创建游戏世界，创建独立于对象/实例系统的额外特殊效果，以及独立于对象运行代码。房间也可以设置为{}从其他房间继承{}属性，这意味着您可以创建一个带有图块负载的房间，例如，然后创建另一个继承这些图块的房间，这样您就不必再次重新创建它们。",
    "All objects have a set of properties which you can specify in the object editor, like the sprite, whether it uses {}physics{} or not, or whether it is a \"child\" object of another one. They also have a series of built-in variables that can then be used in actions, scripts and code. These built-in variables are used to define the position of the instance when placed in the game room, the animation speed, the direction of movement and a whole host of other things. To control how the object behaves over time, each game frame is split into a series of events, so you can add code or actions into a specific event and it will only run when the event is triggered, and events can be triggered by things like mouse button presses or collisions with other instances.":"所有对象都有一组属性，您可以在对象编辑器中指定这些属性，例如sprite，无论它是否使用{}physics{}，或者它是否是另一个对象的 \"子\" 对象。它们还具有一系列内置变量，然后可以在动作，脚本和代码中使用。这些内置变量用于定义放置在游戏室中的实例的位置，动画速度，移动方向以及其他所有内容。为了控制对象随着时间的推移的行为，每个游戏帧被拆分为一系列事件，因此您可以将代码或操作添加到特定事件中，并且只有在事件触发时才会运行，并且事件可以通过诸如鼠标按钮按下或与其他实例发生冲突之类的事情来触发。",
    "All target platforms":"所有目标平台",
    "An animation curve is a resource that contains one or more curves that represent how a value changes over time, and can use {}linear interpolation{} or {}catmull-rom interpolation{} to go between values in the curve. The values you set can be between -1 and 1 on the vertical axis and the duration along the horizontal axis is always normalised form 0 to 1, making it easy to target different time ranges using multipliers in your game code. Animation curves are comprised of \"channels\" and each channel can have its own curve settings, which permits you to - for example - describe a spacial position with two channels for the x/y position, or a colour gradient with 4 channels to represent a colour format. Animation curve assets can be used when working with sequences and can also be accessed using code, making them a powerful tool when creating your games.":"动画曲线是一种资源，其中包含一条或多条曲线，这些曲线表示值随时间的变化，并且可以使用{}线性插值{}或{}catmull-rom插值{}在曲线中的值之间切换。您设置的值可以在垂直轴上介于-1和1之间，并且沿水平轴的持续时间始终从0到1归一化，从而可以轻松地在游戏代码中使用乘数来定位不同的时间范围。动画曲线由 \"通道\" 组成，每个通道都可以有自己的曲线设置，这允许您(例如) 描述一个空间位置，其中两个通道用于x/ y位置，或者一个颜色渐变具有4个通道来表示一种颜色格式。动画曲线资源可以在处理序列时使用，也可以使用代码访问，使它们成为创建游戏时的强大工具。",
    "An important feature of the asset browser is the ability to colour assets so they are more immediately recognisable within the list. You can do this by clicking the right mouse button {}&nbsp;on the asset list node on the left and then selecting a colour from the colour picker palette that pops up. If you do this on a folder, then this will also colour any asset contained within the folder:":"资源浏览器的一个重要特性是能够为资源着色，以便在列表中更立即识别它们。可以通过在左侧的资源列表节点上单击鼠标右键{}，然后从弹出的选色器调色板中选择一种颜色。如果您在文件夹上执行此操作，则也会为文件夹中包含的任何资源着色：",
    "As mentioned in various of the sections above, the asset browser gives you the ability to add tags to individual assets as well as to group folders. Tags are a very powerful tool, not only for organising and filtering the assets listed in the asset browser, but also when programming your game in general, as you can use assigned tags in code.":"如上面各节所述，资源浏览器使您能够为单个资源和群组文件夹添加标签。标签是一个非常强大的工具，它不仅用于组织和筛选资源浏览器中列出的资源，还可以在对游戏进行一般编程时使用，因为你可以在代码中使用分配的标签。",
    "Asset Types":"资源类型",
    "At some point while creating your games you may need an instance of one of your objects to follow a path through a level. Now, this can be done by simply creating an array of positions within the room and then having the instance move between them, but that can be a chore to set up and is difficult to change, test and adapt for different things. That is when you\u0027d want to create a path resource.":"在创建游戏的某个时候，您可能需要一个对象的实例来遵循关卡的路径。现在，这可以通过简单地创建房间内的位置数组，然后让实例在它们之间移动来完成，但这可能是设置的琐事，并且很难更改，测试和适应不同的事情。那是当你想要创建路径资源时。",
    "Clicking the Asset Filter button will open the following window:":"单击资源筛选按钮将打开以下窗口:",
    "Config Editor":"配置编辑器",
    "Extensions are additional files and code that you can add to extend the {}GameMaker{} functionality as well as add assets to your game from the {}Marketplace{}. The format for an extension will vary depending on the final target platform, although in general they are written in C++, C# or JavaScript.":"扩展名是可以添加的附加文件和代码，以扩展{}GameMaker{}功能，以及从{}Marketplace{}向游戏添加资源。 扩展的格式将因最终目标平台而异，尽管它们通常用C++、C#或JavaScript编写。",
    "Finally, tags can also be used in your project code to identify any asset and then act on it, making it a very powerful tool as you can code behaviours based on a tag or group of tags. For example, imagine you have a project with a \"{}Die On Touch{}\" tag. When programming the project, you can check this tag and code functionality that is appropriate, then later the artists and level designers can create new assets of any type and tag them with the \"{}Die On Touch{}\" tag then use the asset when designing a level. Any code that has been programmed to use this tag will automatically include these new assets.":"最后，还可以在项目代码中使用标签来识别任何资源，然后对其进行操作，这使其成为一个非常强大的工具，因为您可以根据一个或一组标签对行为进行编程。例如，假设你有一个带有 \"{}Die On Touch{}\" 标签的项目。在对项目进行编程时，你可以检查这个标签和代码功能是否合适，然后美术师和关卡设计者可以创建任何类型的新资源并使用 \"{}Die On Touch{}\" 标签对其进行标记，然后在设计关卡时使用该资源。任何编程为使用此标签的代码都将自动包含这些新资源。",
    "For more information on using tags in the project code, please see the section on {}Assets And Tags{}.":"有关在项目代码中使用标签的更多信息，请参阅{}资源和标签{}部分。",
    "Game Options":"游戏选项",
    "How you colour things is up to you - it can be by asset type, or by use, or by any other criteria!":"您如何为事物着色取决于您自己-可以根据资源类型，使用或任何其他标准!",
    "In general, {}WAV{} files are used for any short sound effects as even though they are generally larger files they will play instantaneously due to the fact that they do not need any type of decoding for playing. {}MP3{} and {}OGG{} files should be used for background music or any effect that plays over a longer period of time or that has a rather large file size. These files are much smaller than a WAV file and but do have a {}CPU overhead{} associated with them as they have to be decoded before being played.":"通常，{}WAV{}文件用于任何简短的音效，因为尽管它们通常是较大的文件，但由于它们不需要任何类型的解码即可播放，因此它们会立即播放。{}MP3{}和{}OGG{}文件应用于背景音乐或任何播放时间较长或文件大小相当大的效果。这些文件比 WAV 文件小得多，但确实有{}CPU 开销{}，因为在播放之前必须对它们进行解码。",
    "In most games you will want certain things to happen at certain moments in time. Now, you can try to achieve this by using the {}Alarm Events{} in an instance, but when things get too complicated this won\u0027t work any more, especially as you are limited to only twelve alarms. That\u0027s why we have the timeline resource. In a timeline you specify which actions must happen at any specific moment in game time, and you can use all the actions that are available for an object in its different events as well as code. Once you create a time line you can then assign it to an object, and the instance of that object will then execute the actions and code at the indicated moments of time when placed or created within a room.":"在大多数游戏中，你会希望某些事情在某些时刻发生。现在，您可以尝试通过在实例中使用{}Alarm Events{}来实现此目的，但是当事情变得过于复杂时，这将不再起作用，尤其是因为您只能使用十二个警报。这就是为什么我们有时间表资源。在时间轴中，您可以指定哪些动作必须在游戏时间的任何特定时刻发生，并且可以在对象的不同事件和代码中使用所有可用的动作。创建时间线后，可以将其分配给一个对象，然后该对象的实例将在房间内放置或创建时在指定的时刻执行操作和代码。",
    "Included Files":"包含的文件",
    "Individual assets can also be coloured independently of the group colour by using the RMB&nbsp; {} on the asset note or by using the palette at the bottom of the RMB {}&nbsp;menu (although this can be disabled from the {}Asset Browser Preferences{}) and note that you can use {}&nbsp;or {} / {}&nbsp;along with the left mouse button {}&nbsp;to select multiple assets and assign the colour to all of them at once:":"通过使用资源票据上的鼠标右键{}或使用鼠标右键{}菜单底部的调色板，也可以独立于组颜色对单个资源进行着色(尽管可以从{}资源浏览器首选项{}中禁用此选项)，并注意您可以使用{}或{}/{}与鼠标左键{}一起选择多个资源并一次将颜色分配给所有资源:",
    "It is important to note that assets that are created while tags are part of the active filter {}will be given those tags automatically{}. This means that if you are viewing all assets under the \"Level 1\" tag - for example - all new assets created with this filter active will also have the \"Level 1\" tag added to them upon creation.":"需要注意的是，在过滤器处于活动状态时{}创建的资源将自动获得{}这些标签。这意味着，如果您正在查看\"Level 1\"标记下的所有资源(例如，在此过滤器处于活动状态时创建的所有新资源也将在创建时添加\"Level 1\"标签)。",
    "Mac and Ubuntu (Linux)":"Mac 和 Ubuntu( Linux)",
    "Note that you can have sequences within sequences to create complex animations and effect, and sequences can also be accessed and changed through code to give you as much control as possible over how they will be displayed and used in your game.":"请注意，您可以在序列中使用序列来创建复杂的动画和效果，也可以通过代码访问和更改序列，以便尽可能多地控制它们在游戏中的显示和使用方式。",
    "Notes are simply code editor windows which permit you to write anything. They are designed as a place to keep code snippets, game information, to-do lists, team communications, etc...":"笔记只是代码编辑器窗口，允许你写任何东西。它们被设计成一个保存代码片段、游戏信息、待办事项列表、团队沟通等的地方...",
    "Now you know how the Asset Browser works, you should get to know the different types of asset that you can add to it. Below we give an overview of each of the different asset types available for you to use in your projects:":"现在你知道资源浏览器是如何工作的，你应该了解你可以添加到它的不同类型的资源。下面，我们概述了可用于您的项目的每种不同资源类型:",
    "Objects are a special resource that we use to control aspects of a game and to do specific things. Most of the time they have {}sprites{}&nbsp;associated with them so that you see them in the game room, but sometimes they are used as a \"behind the scenes\" controller to do things related to the user or for timing, etc... They can be given behaviours and they can react to certain events as well as to each other, and most of the things you see in a game are based on objects and their interactions. Note that we say \"based on\" because you don\u0027t actually place objects directly into the game room, but rather you place {}instances {}of these objects, which are basically copies (or clones if you prefer) of the object resource. This is a very important thing to remember as instances and objects are not the same thing and each have their own set of functions that can affect them.":"对象是一种特殊的资源，我们用来控制游戏的各个方面并做特定的事情。大多数时候它们都有{}精灵{}与它们相关联，这样你就可以在游戏室里看到它们，但有时它们被用作 \"幕后\" 控制器来做与用户相关的事情或用于计时等...它们可以被赋予行为，它们可以对某些事件以及彼此做出反应，并且您在游戏中看到的大多数事物都是基于对象及其交互的。请注意，我们之所以说 \"基于\"，是因为您实际上并没有将对象直接放置到游戏室中，而是放置了这些对象的{}实例{}，这些对象基本上是对象资源的副本(或克隆)。这是一件非常重要的事情，要记住，因为实例和对象不是同一个东西，并且每个对象都有自己的功能集，可以影响它们。",
    "Objects are in a very real sense the building blocks of your game, and together with rooms will form the core of any project that you create.":"对象在一个非常真实的意义上是你的游戏的基础，和房间一起将构成任何项目的核心，你创建。",
    "One final thing to note with the asset list is that you can select folders and assets then click {}&nbsp;and drag them to move them out of - or into - any other folder group in the asset list, and you can also delete any or all of the folder groups if they are not required, keeping the assset list tidy and only showing the required elements for the project.":"资源列表中最后要注意的一点是，您可以选择文件夹和资源，然后单击{}并将其拖出资源列表中的任何其他文件夹组或将其移出或移入资源列表中的任何其他文件夹组，如果不需要，也可以删除任何或所有文件夹组，从而保持资源列表整洁并仅显示项目所需的元素。",
    "RMB Menu":"鼠标右键菜单",
    "Room Manager":"房间管理器",
    "Shaders are a very powerful tool that can be used to manipulate the graphics that your game renders to the screen, permitting incredibly fast effects that can range from, for example, adding a subtle colour hue to a sprite, right up to full screen distortion effects. Basically it\u0027s a two-part program that runs directly on the graphics card itself, making it very fast since the GPU is doing all the work and freeing up CPU cycles for your game code. The full shader is comprised of a vertex shader program, and a fragment shader program (also known as a pixel shader). Both of these tiny programs work together in order to manipulate what the graphics card renders to the screen. This then permits you to manipulate in real time the position, colour, and alpha values that are actually rendered into the display buffer.":"着色器是一款非常强大的工具，可用于操纵游戏在屏幕上渲染的图形，从而实现极快的效果，例如，为精灵添加微妙的色调，直至全屏失真效果。基本上，它是一个由两部分组成的程序，可以直接在显卡本身上运行，因此速度非常快，因为GPU可以完成所有工作，并为游戏代码腾出CPU周期。完整着色器由顶点着色器程序和片段着色器程序(也称为像素着色器)组成。这两个小程序协同工作，以操纵显卡呈现给屏幕的内容。然后，这允许您实时操作实际渲染到显示缓冲区中的位置、颜色和 Alpha 值。",
    "Sprites are generally the visual representations of objects within the games you create. As such, a sprite is an image drawn using the {}GameMaker{} {}Image Editor{}, or made with any external drawing program and imported into {}GameMaker{}. The image used doesn\u0027t have to be of a single static thing either... it can be a \"strip\" image too, ie: multiple images in a a single file which can then be used to make a single animated sprite. For example, the following 10 images form a sprite for a character who is waving his arms while skydiving.{} {} And the actual finished animation would look like this when placed in a game: ":"精灵通常是你创建的游戏中对象的视觉表现形式。因此，精灵是使用{}GameMaker{}{}图像编辑器{}绘制的图像，或者使用任何外部绘图程序制作并导入到{}GameMaker{}的图像。所使用的图像也不一定是单一的静态图像... 它也可以是 \"条带\" 图像，即：单个文件中的多个图像，然后可以用来制作单个动画精灵。例如，以下 10 张图片构成了一个在跳伞时挥舞双臂的角色的精灵。{}{}放置在游戏中时，实际完成的动画会如下所示：",
    "Tags":"标签(Tags)",
    "The Asset Browser":"资源浏览器",
    "The Asset Browser is where you\u0027ll create and organise the assets for your game as well as modify certain other aspects like platform specific settings and configurations. Below you can find explanations of each of the different sections.":"资源浏览器是您创建和组织游戏资源以及修改某些其他方面(如平台特定设置和配置) 的地方。下面你可以找到每个不同部分的解释。",
    "The Editors":"资源编辑",
    "The RMB {}&nbsp;menu for fonts contains the following option (as well as those listed further up this page):":"字体的鼠标右键{}菜单包含以下选项(以及在此页面上进一步列出的选项):",
    "The RMB {}&nbsp;menu for objects contains the following option (as well as those listed further up this page):":"对象的鼠标右键{}菜单包含以下选项(以及在此页面上进一步列出的选项):",
    "The RMB {}&nbsp;menu for rooms contains the following option (as well as those listed further up this page):":"房间的鼠标右键{}菜单包含以下选项(以及在本页上方列出的选项)：",
    "The RMB {}&nbsp;menu for scripts contains the following option (as well as those listed further up this page):":"脚本的鼠标右键{}菜单包含以下选项(以及在此页面上进一步列出的选项):",
    "The RMB {}&nbsp;menu for sprites contains the following options (as well as those listed further up this page):":"精灵的鼠标右键{}菜单包含以下选项(以及在此页面上进一步列出的选项):",
    "The RMB {}&nbsp;menu for tilesets contains the following option (as well as those listed further down this page):":"用于图块集的鼠标右键{}菜单包含以下选项(以及在此页下方列出的选项)：",
    "The RMB&nbsp; {}&nbsp;menu for sounds contains the following options (as well as those listed further up this page):":"鼠标右键{}声音菜单包含以下选项(以及本页上方列出的选项)：",
    "The Search Bar is where you can type in some text and use it to filter what is shown in the main asset list below. For example&nbsp;typing \"room\" will show you all the assets that contain \"room\" in their name. To reset the asset list back to it\u0027s default view, simply delete any text from the search bar.":"搜索栏是您可以键入一些文本并使用它来过滤下面主资源列表中显示的内容的地方。例如，键入 \"room\" 将向您显示名称中包含 \"room\" 的所有资源。要将资源列表重置回默认视图，只需从搜索栏中删除任何文本即可。",
    "The Zoom Controls can be used to make the contents of the asset browser larger or smaller, with a minimum of 50% to a maximum of 250% of the current DPI of the {}GameMaker{} IDE. If you wish to reset this to the default 100%, then simply double-click {}&nbsp;on the percentage value to the left of the slider. Note that there are a couple of preferences available to deal with how this works in the {}Asset Browser Preferences{}.":"缩放控件可用于使资源浏览器的内容更大或更小，其中最小50% 到最大{}GameMaker{}IDE当前DPI的250%。如果您希望将其重置为默认100%，则只需双击滑块左侧百分比值上的{}。请注意，在{}资源浏览器首选项{}中，有几个首选项可用于处理此操作方式。",
    "The assets that you can add here are listed further down in this section of the manual.":"您可以在此处添加的资源将在本手册的本节中进一步列出。",
    "The basic idea of the path resource is rather simple - you define a path by drawing it in the path editor, then you can place an action (or code) in an event of an object to tell the object to follow that particular path in the game room. You can set the speed to follow the path and a number of other actions relating to the position and orientation of the path within the room too.":"路径资源的基本思想相当简单-您可以通过在路径编辑器中绘制路径来定义路径，然后可以在对象事件中放置一个动作(或代码)，以告诉对象在游戏室中遵循该特定路径。您也可以设置跟随路径的速度，以及与房间内路径的位置和方向相关的许多其他动作。",
    "The core of your game will be created from assets added to the {}Asset Browser{} located by default on the right of the {}IDE{}. This is where you can add everything that your game requires to run, including a game room, {}sprites{}, objects, paths and a number of other things. A basic game in {}GameMaker{} will require a room to run in (new projects will always be created with a room asset already created), and usually at least one object and a sprite, although you\u0027ll likely use a lot more!":"游戏的核心将从默认情况下位于{}IDE{}右侧的{}资源浏览器{}中添加的资源创建。在这里，您可以添加游戏需要运行的所有内容，包括游戏室 ，{}sprites{}, 对象，路径和许多其他内容。一个基本的游戏在{}GameMaker{}将需要一个房间运行(新项目将总是创建一个房间资源已经创建)，通常至少有一个对象和一个精灵，虽然你可能会使用更多!",
    "The extras menu permits you to open the following windows (each of which is discussed separately on the linked pages):":"extras菜单允许您打开以下窗口(每个窗口在链接的页面上分别讨论):",
    "The information bar at the bottom of the Asset Browser shows you how many assets are in the asset list in total, as well as the number of assets that are currently selected. This section will also show any tags that have been used to filter the asset list (see below for more information on tags), and you can click on them to remove the tag filter if required.":"资源浏览器底部的信息栏显示资源列表中总共有多少资源，以及当前选择的资源数量。本部分还将显示用于筛选资源列表的所有标签(有关标签的更多信息，请参见下文)，如果需要，您可以单击它们以删除标签过滤器。",
    "This section of the asset browser is used to give you various methods to quickly access important or frequently used assets, and is split into the following sections:":"资源浏览器的这一部分用于为您提供各种方法来快速访问重要或常用资源，分为以下几个部分：",
    "This section of the asset browser lists all the different assets that you are using in your game. By default - when you create a new project - this will be populated with numerous folder groups labelled with the different kinds of assets that can be added, but these can be renamed or even removed and you don\u0027t have to store assets of the same kind in each group. For example, you may find it more useful to ceate a group of assets for each level of your game rather than for each kind of asset, so you can create folder groups called \"Level 1\", \"Level 2\", etc... and store all the different assets for each level in the same folder. How you organise things really is up to you!":"资源浏览器的这一部分列出了您在游戏中使用的所有不同资源。默认情况下(创建新项目时)，将使用许多文件夹组来填充该文件夹组，这些文件夹组标有可添加的不同类型的资源，但是这些资源可以重命名甚至删除，并且您不必在每个组中存储同类资源。例如，您可能会发现为游戏的每个级别设置一组资源比为每种资源设置一组资源更有用，因此您可以创建名为\"Level 1\"、\"Level 2\"等的文件夹组，并将每个级别的所有不同资源存储在同一个文件夹中。你如何组织事物真的取决于你自己！",
    "Tile sets are taken from the sprite resources, but are classified as a separate resource since {}GameMaker{} will handle them differently when creating your game. Basically a tile set is a single image that {}GameMaker{} will break into separate sections based on the values you give for the various settings. You can then use these in the room editor (or procedurally through code) to generate a tile map in your room. They are great for designing any static items in your room, like terrain, walls, backdrops, etc... as they don\u0027t have the same overhead that objects have.":"拼贴集取自精灵资源，但被归类为单独的资源，因为{}GameMaker{}在创建游戏时会以不同的方式处理它们。基本上，拼贴集是一张单张图像，{}GameMaker{}将根据您为各种设置提供的值将其分成不同的部分。然后，您可以在房间编辑器中使用它们(或通过代码按程序进行)在房间中生成图块地图。它们非常适合设计房间中的任何静态物品，例如地形、墙壁、背景等... 因为它们的头顶不像物体那样。",
    "To create a tag you need to use the RMB&nbsp;{} menu on an asset and then select the {}Edit Tags{}&nbsp;option. This will bring up the {}Tag Editor{} where you can type in the tag you want to use, and then either press&nbsp;{} or type a comma&nbsp;to apply it:":"要创建标签，您需要使用资源上的 鼠标右键{}菜单，然后选择{}编辑标签{}选项。这将打开{}标签编辑器{}，您可以在其中键入要使用的标签，然后按{}或键入逗号来应用它：",
    "When working with the Asset Browser, you can use the right mouse button {}&nbsp;on any resource or folder to open a menu of options:":"使用资源浏览器时，可以在任何资源或文件夹上使用鼠标右键{}来打开选项菜单:",
    "When you want to draw text in your game this text will be drawn in a standard Arial 12 points font by default, but to make more interesting or unique looking texts you will probably want to use different fonts. This is where the {}Font Editor{} is used. Here you can select a font that you have on your computer and import it into {}GameMaker{} for use in your game, setting various attributes like size and weight or style. Once imported and added as a resource, you can then set it for drawing using the appropriate code or actions.":"当你想在游戏中绘制文本时，默认情况下，该文本将以标准Arial 12点字体绘制，但为了制作更有趣或外观独特的文本，你可能会想要使用不同的字体。这是使用{}字体编辑器{}的地方。在这里，您可以选择计算机上的字体，然后将其导入{}GameMaker{}以用于游戏，设置各种属性，例如大小，重量或样式。一旦导入并添加为资源，您就可以使用适当的代码或操作将其设置为绘图。",
    "With the Add Asset button you can choose to add a new asset to the asset list. Clicking this will open the following window:":"使用 \"添加资源\" 按钮，您可以选择将新资源添加到资源列表中。单击此按钮将打开以下窗口:",
    "You can also select one or more asset type to filter and only the assets that are in the project of those types will be shown in the asset list. Selecting \"Any Type\" will reset the filter. You can also filter using any tags that you have assigned (tags are discussed further down in this section of the manual). Note that if you have selected any filter other than \"Any Type\" then the filter button will change colour to give a visual indication that filtering is active.":"您还可以选择一个或多个要筛选的资源类型，并且只有这些类型的项目中的资源才会显示在资源列表中。选择 \"任意类型\" 将重置过滤器。您还可以使用已分配的任何标签进行过滤(标签将在本手册的本节中进一步讨论)。请注意，如果您选择了除 \"任何类型\" 以外的任何过滤器，则 \"过滤器\" 按钮将更改颜色，以显示过滤器处于活动状态的视觉指示。",
    "You can choose which of the two views above to use by clicking either the {}&nbsp;list icon or {}&nbsp;grid icon, and you can also click the {}&nbsp;Import icon to import an already existing asset from another project. If you don\u0027t want to import anything, then simply select the asset you want to create and click the Create button at the bottom. Note that you are not limited to adding only a single asset here, as you can set the number to create at the bottom of the window, and then click Create and that number of the chosen asset will be added to the asset browser for you. All assets created in this way will be added to the bottom of the asset list, outside of any folders, and also will be opened in the current workspace ready for editing.":"您可以通过单击{}列表图标或{}网格图标来选择要使用的上述两个视图中的哪一个，还可以单击{}导入图标从另一个项目导入现有资源。如果您不想导入任何内容，则只需选择要创建的资源，然后单击底部的创建按钮。请注意，您不仅限于此处仅添加单个资源，因为您可以在窗口底部设置要创建的数字，然后单击 \"创建\"，所选资源的编号将为您添加到资源浏览器中。以这种方式创建的所有资源将被添加到资源列表的底部，在任何文件夹之外，并且还将在当前工作区中打开，准备进行编辑。",
    "You can find out more about adding animation curves from the section on {}Animation Curves{}.":"您可以从{}动画曲线{}部分中找到有关添加动画曲线的更多信息。",
    "You can find out more about adding extensions from the section on the {}Extension Editor{}.":"您可以从{}扩展编辑器{}的部分中找到有关添加扩展的更多信息。",
    "You can find out more about adding notes from the section on the {}Notes Editor{}.":"您可以从{}注释编辑器{}的部分中找到有关添加注释的更多信息。",
    "You can find out more about adding paths from the section on the {}Path Editor{}.":"您可以从{}路径编辑器{}中的部分找到有关添加路径的更多信息。",
    "You can find out more about adding sequences from the section on the {} {}{}Sequences Editor{}.":"您可以从{}{}{}序列编辑器{}的一节中了解有关添加序列的详细信息。",
    "You can find out more about adding shaders from the section on the {}Shader Editor{}.":"您可以在{}着色器编辑器{}的部分中找到有关添加着色器的更多信息。",
    "You can find out more about adding sounds from the section on the {}Sound Editor{}.":"你可以在{}Sound Editor{}的章节中找到有关添加声音的更多信息。",
    "You can find out more about adding sprites from the section on the {}Sprite Editor{}.":"您可以从{}精灵编辑器{}的部分中找到更多有关添加精灵的信息。",
    "You can find out more about adding tilesets from the section on the {}Tile Set Editor{}.":"您可以从{}图块集编辑器{}的部分了解有关添加平铺集的详细信息。",
    "You can find out more about adding timelines from the section on the {}Timeline Editor{}.":"您可以从{}时间线编辑器{}的部分中找到有关添加时间轴的更多信息。",
    "the {}Canvas {}- where you place the assets that make up the sequence&nbsp;":"{}画布{}-在其中放置构成序列的资源",
    "the {}Track Panel{}&nbsp;- where you place assets to create asset tracks, as well as create parameter tracks to manipulate the assets over time":"{}跟踪面板{}-用于放置资源以创建资源跟踪，以及创建参数跟踪以随时间操作资源",
    "{} If you want a more in-depth guide as to how to use the different editors listed above then you please refer to the following section of the manual:":"{}如果您想获得有关如何使用上面列出的不同编辑器的更深入的指南，请参阅手册的以下部分：",
    "{} A sprite like this is usually a {}PNG{} format file, but {}GameMaker{} will also accept vector sprites in {}SWF{} format, and {}Spine {}sprites in {}JSON{} format (with their accompanying texture {}atlas{} file).":"{}像这样的精灵通常是{}PNG{}格式的文件，但是{}GameMaker{}也会接受{}SWF{}格式的vector精灵，和{}sprite{}JSON{}格式的{}sprites(带有随附的纹理{}atlas{}文件)。",
    "{} Above is an example sprite that would be used as a tile set to create walls. As you can see, it can be \"split\" into 64x64pixel chunks, which would then placed into the room editor.":"{}上面是一个示例精灵，它将用作创建墙的图块集。如您所见，可以将其 \"拆分\" 为64x64像素块，然后将其放入房间编辑器中。",
    "{} Once the asset has been created it will be opened in the workspace and you can rename it to something that is appropriate to your game, but note that asset names can only be alpha-numeric, cannot start with a number, and can only use the underscore \"_\" as an additional character. You can also use the right button menu to create new folder groups to contain assets using the {}Create Group{} option, and these can be named anything you wish. If you want to rename any asset or folder group, then you can do a slow double-click {}&nbsp;on them or use the RMB {}&nbsp;menu option {}Rename{}.":"{}创建资源后，将在工作区中打开该资源，您可以将其重命名为适合您的游戏的名称，但请注意，资源名称只能是字母数字，不能以数字开头，并且只能使用下划线\"_\"作为附加字符。您还可以使用右键菜单创建新的文件夹组，以便使用{}创建组{}选项包含资源，这些资源可以命名为任何所需的名称。如果要重命名任何资源或文件夹组，则可以对其进行慢速双击{}或使用\"鼠标右键\"{}菜单选项{}\"重命名{}\"。",
    "{} To add a new asset to the list you can use the {}Add Asset{} button at the top of the Asset Browser, or you can open the right mouse button {}&nbsp;menu anywhere in the asset list and then select the resource to create:":"{}要向列表中添加新资源，可以使用资源浏览器顶部的{}添加资源{}按钮，也可以在资源列表中的任意位置打开鼠标右键{}菜单，然后选择要创建的资源：",
    "{} {}{}Sounds{}{}Sounds{}{}":"",
    "{} {}{}Tilesets{}{}Tilesets{}{}":"",
    "{}Add Asset{}{}Add Asset{}":"{}添加资源{}{}添加资源{}",
    "{}Add Existing From My Library{} - Add assets to the asset list from an item in your Marketplace library. Please note that Marketplace assets created using a version anterior to 2.3.0 will require conversion as the project file format changed with the 2.3.0 update.":"{}添加我的库中的现有资源{}-将商城库中某件商品中的资源添加到资源列表中。请注意，使用 2.3.0 之前的版本创建的 Marketplace 资源将需要转换，因为项目文件格式在 2.3.0 更新中发生了变化。",
    "{}Add Existing{} - Add existing assets from a different {}GameMaker{} project folder. Please note that assets created using a version anterior to 2.3.0 will require conversion as the project file format changed with the 2.3.0 update. This means it may be preferable to import the entire project and converting everything then saving it to a new location if the assets are imported frequently into other projects.":"{}添加现有资源{}从其他{}GameMaker{}项目文件夹中添加现有资源。请注意，使用2.3.0之前版本创建的资源将需要转换，因为项目文件格式随2.3.0更新而改变。这意味着，如果经常将资源导入到其他项目中，最好导入整个项目并转换所有内容，然后将其保存到新位置。",
    "{}Animation Curves{}{}Animation Curves{}":"{}动画曲线{}{}动画曲线{}",
    "{}Asset List{}{}Asset List{}":"{}资源列表{}{}资源列表{}",
    "{}Assign Audio Group{} - When you select this option, you will be presented with a list of the available audio groups, and you can then choose one to add the sound to or create a new one, if required. If multiple sounds are selected in the Asset Browser - or you have selected a group folder of sounds - then all the sounds will be added to the chosen audio group. See {}here{}&nbsp;for more information on audio groups.":"{}分配音频组{}-当您选择此选项时，您将看到可用音频组的列表，然后您可以选择一个来添加声音或创建一个新的音频组(如果需要)。如果在资源浏览器中选择了多个声音-或者您选择了一组声音文件夹-则所有声音都将添加到所选的音频组中。有关音频组的更多信息，请参见{}此处{}。",
    "{}Assign Texture Group{} - When you select this option, you will be presented with a list of the available texture groups, and you can then choose one to add the font to or create a new one, if required. If multiple fonts are selected in the Asset Browser - or you have selected a group folder of fonts - then all of them will be added to the chosen texture group. See {}here{}&nbsp;for more information on texture groups.":"{}分配纹理组{}-当您选择此选项时，您将看到可用纹理组的列表，然后您可以选择一个来添加字体或创建新的字体(如果需要)。如果在资源浏览器中选择了多种字体-或者您选择了一组字体文件夹-则所有字体都将添加到所选的纹理组中。有关纹理组的更多信息，请参见{}此处{}。",
    "{}Assign Texture Group{} - When you select this option, you will be presented with a list of the available texture groups, and you can then choose one to add the sprite to or create a new one, if required. If multiple sprites are selected in the Asset Browser - or you have selected a group folder of sprites - then all the sprites will be added to the chosen texture group. See {}here{}&nbsp;for more information on texture groups.":"{}分配纹理组{}-当您选择此选项时，您将看到可用纹理组的列表，然后您可以选择一个来添加精灵或创建一个新的精灵(如果需要)。如果在资源浏览器中选择了多个精灵，或者您选择了一组精灵文件夹，则所有精灵都将添加到所选的纹理组中。有关纹理组的更多信息，请参见{}此处{}。",
    "{}Assign Texture Group{} - When you select this option, you will be presented with a list of the available texture groups, and you can then choose one to add the tileset to or create a new one, if required. If multiple tilesets are selected in the Asset Browser - or you have selected a group folder of tilesets - then all of them will be added to the chosen texture group. See {}here{}&nbsp;for more information on texture groups.":"{}指定纹理组{} - 选择此选项时，将显示可用纹理组的列表，然后您可以选择一个来添加图块集或创建新纹理组(如果需要)。如果在资源浏览器中选择了多个分片集，或者您选择了分片集的组文件夹，则所有分片集都将添加到所选纹理组中。有关纹理组的更多信息，请参见{}此处{}。",
    "{}Colour Swatches{} - Here you can select a new colour for the asset to use. If used on a folder group, all assets within the folder will get the chosen colour, and if used on one or more assets, this will override any colour set in for the folder group (unless you have overridden this option in the {}Asset Browser Preferences{}).":"{}色板{}-在这里，您可以为要使用的资源选择新颜色。如果在文件夹组中使用，则文件夹中的所有资源将获得选定的颜色，如果在一个或多个资源上使用，这将覆盖为文件夹组中设置的任何颜色(除非您已在{}资源浏览器首选项{}中重写了此选项)。",
    "{}Contract All{} - Contract all the folder groups in the asset list.":"{}收缩所有{}-收缩资源列表中的所有文件夹组。",
    "{}Convert to GML Visual / GML{} - This will convert the selected script to GML Visual or GML. If the script is GML, then it will be placed within an {}Execute Code{}&nbsp;action, while GML Visual will be translated directly into GML code (as shown in the section {}Changing GML Visual To Code{}).":"{}转换为GML Visual/ GML{}-这会将所选脚本转换为GML Visual或GML。如果脚本是GML，则将其放置在{}执行代码{}操作中，而GML Visual将直接转换为GML代码(如{}将GML Visual更改为代码{}部分所示)。",
    "{}Create Child Room{} - This will create a new room as a child of the room selected. Child rooms are new room assets that inherit the properties, layers and layer contents from the parent room, and will be shown linked to the parent room in the {}Room Manager{}.":"{}创建子房间{}-这将创建一个新房间作为所选房间的子房间。子房间是新的房间资源，从父房间继承属性，图层和图层内容，并将在{}房间管理器{}中显示链接到父房间。",
    "{}Create Group{} - Add a new folder group to the asset list.":"{}创建组{}-将新的文件夹组添加到资源列表中。",
    "{}Create Sprite From Image(s){} - Selecting this option will open a file explorer where you can select one or more images from which to create a sprite. If you select multiple images, then the sprite will be created with multiple frames, one for each image selected.":"{}从图像创建精灵{}-选择此选项将打开一个文件资源管理器，您可以在其中选择一个或多个图像，从中创建精灵。如果选择多个图像，则将创建具有多个帧的子画面，每个选定的图像一个。",
    "{}Create {}- Create a new asset. On selecting this you will be presented with a list of the available asset types that can be created for you to select one. Note that if you open this menu on a specific asset, there will be an additional option to create a resource if the same type listed just below so you don\u0027t have to look for the asset type in the list.":"{}创建{}-创建新资源。选择此选项后，您将看到可创建的可用资源类型列表，供您选择一个。请注意，如果您在特定资源上打开此菜单，如果下面列出的类型相同，则将有一个额外的选项来创建资源，这样您就不必在列表中查找资源类型。",
    "{}Delete {}- Delete the selected asset(s) from the project. This cannot be undone!":"{}删除{}-从项目中删除选定的资源。这是无法撤消的!",
    "{}Dope Sheet{} - which is where you add/remove/edit the keyframes of each track and control how they behave over time.":"{}摄影表{}-您可以在此处添加/删除/编辑每个轨迹的关键帧，并控制它们在一段时间内的行为。",
    "{}Duplicate {}- Create a duplicate of the asset or assets that have been selected.":"{}重复{}-创建已选择的一个或多个资源的副本。",
    "{}Edit (All) {}- Open the resource properties editor for the selected asset(s) or folder group (note that you can double click {}&nbsp;on a single asset too to open it for it editing).":"{}编辑(全部){}-打开所选资源或文件夹组的资源属性编辑器(请注意，您也可以双击单个资源上的{}将其打开进行编辑)。",
    "{}Edit Tags{} - This will open the Tag editor where you can add or remove tags to the selected asset(s) or folder group(s).":"{}编辑标签{}-这将打开标签编辑器，您可以在其中向选定的资源或文件夹组添加或删除标签。",
    "{}Expand All{} - Expand all the folder groups in the asset list.":"{}展开全部{}-展开资源列表中的所有文件夹组。",
    "{}Expand Children{} - Expand the currently selected folder group along with any sub-folders it may contain.":"{}展开子项{}-展开当前选定的文件夹组以及它可能包含的任何子文件夹。",
    "{}Extensions{}{}Extensions{}":"{}扩展{}{}扩展{}",
    "{}Extras{}{}Extras{}":"{}附加{}{}附加{}",
    "{}Favourite {}- Flag&nbsp;an asset or assets as being a favourite, adding it to the Quick Access section at the top of the Asset browser.":"{}收藏夹{}-将一个或多个资源标记为收藏夹，并将其添加到资源浏览器顶部的快速访问部分。",
    "{}Favourites{}: Once you have added some assets to the asset list, you may have some that you access frequently at any given time and so to make things easier you can flag these assets as \"favourites\", which will add them to this list and let you quickly find them. To flag an asset as a {}favourite{} use the right mouse button {}&nbsp;on it and select Favourite from the pop-up menu. Note that you can use the right mouse button {}&nbsp;again to {}unfavourite {}any asset, and if you use the button on the main Favourites folder, you can select {}Clear All{} to remove everything.":"{}收藏夹{}: 一旦您将一些资源添加到资源列表中，您可能会在任何给定时间经常访问一些资源，因此为了使事情变得更容易，您可以将这些资源标记为 \"收藏夹\"，这将将它们添加到此列表中，并让您快速找到它们。要将资源标记为{}收藏夹{}，请使用鼠标右键{}，然后从弹出菜单中选择收藏夹。请注意，您可以再次使用鼠标右键{}来{}不喜欢{}任何资源，如果您使用主收藏夹文件夹上的按钮，则可以选择{}清除所有{}以删除所有内容。",
    "{}Filter{}{}Filter{}":"{}过滤器{}{}过滤器{}",
    "{}Fonts{}{}Fonts{}":"{}字体{}{}字体{}",
    "{}Game Options{}: Here you can quickly access the various different {}Game Options{} for your project. These control various different aspects of the project related to setting up and compiling for the different target platforms (what Game Options are available will depend on what licence type you have). You can find more information on each of the options listed from the section on the {}Game Options{}.":"{}游戏选项{}：在这里你可以快速访问你的项目的各种不同的{}游戏选项{}。它们控制着与为不同的目标平台设置和编译相关的项目的各个不同方面(可用的游戏选项将取决于您拥有的许可证类型)。您可以在{}Game Options{}的部分中找到有关每个选项的更多信息。",
    "{}GameMaker{} supports the following shader languages:":"{}GameMaker{}支持以下着色器语言:",
    "{}Here you can choose how to filter and display the assets listed in the asset browser. You can order them from A - Z or from Z - A as well as choose to order the groups first and then the assets within the groups, or order everything altogether. If you select the {}Custom Order{} filter, then you can select one or more assets and drag them up or down the asset browser tree and position them as you require (note that the \"Groups First\" option will be disabled).":"{}在这里，您可以选择如何过滤和显示资源浏览器中列出的资源。您可以从A- Z或Z- A订购它们，也可以选择先订购组，然后再订购组中的资源，或者全部订购。如果选择{}自定义订单{}过滤器，则可以选择一个或多个资源，并在资源浏览器树中向上或向下拖动它们，并根据需要对其进行定位(请注意，\"组优先\" 选项将被禁用)。",
    "{}Information{}{}Information{}":"{}信息{}{}信息{}",
    "{}NOTE{} Tiles are always square, so if you need anything other than that, you should be using an instance with a sprite or an asset layer in the room editor.":"{}注意{}图块始终是正方形的，因此，如果您需要其他任何东西，则应该在房间编辑器中使用带有sprite或资源层的实例。",
    "{}NOTE{}: If you are adding fonts to your game, make sure you have the licence necessary to re-distribute it, unless it is public domain or copyright free.":"{}注意{}: 如果您要在游戏中添加字体，请确保您拥有重新分发它所需的许可证，除非它是公共领域或无版权的。",
    "{}Note that when opening the colour picker palette from a node like this, you can then right-click {}&nbsp;on any of the colour swatches to generate a custom colour to use.":"{}请注意，当从这样的节点打开颜色选择器调色板时，您可以在任何色板上右键单击{}以生成要使用的自定义颜色。",
    "{}Notes{}{}Notes{}":"{}注释{}{}注释{}",
    "{}Objects{}{}Objects{}":"{}对象{}{}对象{}",
    "{}Open All Event Scripts{} - Selecting this option will open all the assigned events for the object in a new workspace as script tabs.":"{}打开所有事件脚本{}-选择此选项将在新工作区中以脚本选项卡的形式打开该对象的所有分配事件。",
    "{}Open In Image Editor{} - This will open the sprite in the Image Editor for editing, without opening the Sprite Editor first.":"{}在图像编辑器中打开{}-这将在图像编辑器中打开精灵进行编辑，而无需先打开精灵编辑器。",
    "{}Open In New Asset Browser{} - This option is only available for folder groups, and it will open the group in a new Asset browser window containing only the contents of the parent group the option was selected for.":"{}在新的资源浏览器中打开{}-此选项仅对文件夹组可用，并且它将在新的资源浏览器窗口中打开该组，该窗口仅包含该选项为其选择的父组的内容。",
    "{}Open In Sound Mixer{} - This will open all the selected sounds in the {}Sound Mixer{}.":"{}在调音台中打开{}-这将在{}调音台{}中打开所有选定的声音。",
    "{}Open in Explorer{} - This will open the file explorer on the location of the file that has been stored for the resource in your project folder.":"{}在资源管理器中打开{}-这将在已为资源存储的文件在项目文件夹中的位置上打开文件资源管理器。",
    "{}Paths{}{}Paths{}":"{}路径{}{}路径{}",
    "{}Quick Access{}{}Quick Access{}":"{}快速访问{}{}快速访问{}",
    "{}Recent{}: Here you can find a list of the most recently used assets. By default a maximum of 10 assets will be listed here, but you can change this from the {}Asset Browser Preferences{}.":"{}最近的{}: 在这里您可以找到最近使用的资源列表。默认情况下，此处最多列出10个资源，但是您可以从{}资源浏览器首选项{}中进行更改。",
    "{}Regenerate Font{} - With this option you can force {}GameMaker{} to regenerate the font cache. This is usually only required should the font become corrupted or have changed on the system.":"{}重新生成字体{}-使用此选项，您可以强制{}GameMaker{}重新生成字体缓存。通常只有在系统上字体损坏或已更改时才需要这样做。",
    "{}Rename {}- Rename the asset or the folder group.":"{}重命名{}-重命名资源或文件夹组。",
    "{}Room Order{}: From here you can change the order that your rooms will run in. All projects require at least one room to run and the room at the top of the list is the \"home\" room and will be the first room entered when the game initially starts (it is flagged with a \"home\" icon {}). To quickly change room order, simply click {}&nbsp;and drag the room up or down the list and then release the mouse button to place it at the new position. If you click the \"home\" icon, then you will open the {}Room Manager{} and if you use the right mouse button {}&nbsp;on a room you can create a {}child {}room. For more information on room order and child rooms please see the page on the {}Room Manager{}.":"{}房间顺序{}: 从这里您可以更改房间运行的顺序。所有项目都需要至少一个房间来运行，并且列表顶部的房间是 \"家庭\" 房间，并且将是游戏最初开始时进入的第一个房间(用 \"家庭\" 图标{}标记)。要快速更改房间顺序，只需单击{}并在列表中向上或向下拖动房间，然后释放鼠标按钮将其放置在新位置。如果单击 \"主页\" 图标，则将打开{}房间管理器{}，如果在房间上使用鼠标右键{}，则可以创建{}子{}房间。有关房间创建和子房间的更多信息，请参见{}房间管理器{}上的页面。",
    "{}Rooms{}{}Rooms{}":"{}房间{}{}房间{}",
    "{}Saved Filters{}: When using the filtering options, you may want to save the selection you\u0027ve made for future reference. To do that, set up the filter as explained further up this page, and then click the right mouse button {}&nbsp;on this option and select {}Save Filter{}. The filter will be saved to this list and you can rename it if required. To use the filter, simply double click {}&nbsp;on it or use the right mouse button {}&nbsp;menu option {}Apply Filter{}. You can also {}Delete {}and {}Rename {}saved filters from the RMB {}&nbsp;menu.":"{}保存的过滤器{}: 使用过滤选项时，您可能希望保存所做的选择，以备将来参考。为此，请按照本页的进一步说明设置过滤器，然后单击此选项上的鼠标右键{}并选择{}保存过滤器{}。过滤器将保存到此列表中，如果需要，您可以重命名它。要使用过滤器，只需在其上双击{}或使用鼠标右键{}菜单选项{}应用过滤器{}。您也可以从RMB{}菜单中{}删除{}和{}重命名{}保存的过滤器。",
    "{}Scripts{}{}Scripts{}":"{}脚本{}{}脚本{}",
    "{}Search Bar{}{}Search Bar{}":"{}搜索栏{}{}搜索栏{}",
    "{}Sequences{}{}Sequences{}":"{}序列{}{}序列{}",
    "{}Shader Type{} - Here you can set the type of shader language that is being used for the shader resource.":"{}Shader Type{}-您可以在此处设置用于着色器资源的着色器语言的类型。",
    "{}Shaders{}{}Shaders{}":"{}着色器{}{}着色器{}",
    "{}Sounds{}{}Sounds{}":"{}声音{}{}声音{}",
    "{}Sprites{}{}Sprites{}":"{}精灵{}{}精灵{}",
    "{}Tags{}: All assets in the Asset Browser can be assigned user-defined {}Tags{}. These will then be listed here and you can use them to filter the assets shown in the asset list and you can double-click {}&nbsp;any tag (or use the right mouse button {}&nbsp;option {}Filter By Tag{}) to apply that tag to the asset list filter. Any applied tags are shown at the bottom of the asset browser in the {}Information {}section. For more information on tags, see further down in this page.":"{}标签{}: 资源浏览器中的所有资源都可以分配用户定义的{}标签{}。然后，这些将在此处列出，您可以使用它们来过滤资源列表中显示的资源，并且可以双击{}任何标记(或使用鼠标右键{}选项{}按标记{}筛选) 将该标记应用于资源列表过滤器。任何已应用的标记显示在资源浏览器的底部的{}信息{}部分。有关标签的更多信息，请参阅此页中的更多内容。",
    "{}The exact options available to you will depend on the context that has been clicked, and below we show the contents when the menu is opened on an asset or folder group in the Asset List (other contexts will show some of these but not all):":"{}可供您使用的确切选项将取决于所点击的上下文，下面我们将显示资源列表中资源或文件夹组上打开菜单时的内容(其他上下文将显示其中的一部分，但不是全部)：",
    "{}Tilesets{}{}Tilesets{}":"{}图块集{}{}图块集{}",
    "{}Timelines{}{}Timelines{}":"{}时间线{}{}时间线{}",
    "{}You can assign multiple tags to a single item, and you can also use {}&nbsp;or {} / {}&nbsp;along with the left mouse button {}&nbsp;to select multiple assets and assign a tag to all of them at once. Once added, all tags will be visible under the Quick Access menu and also in the Filter options (as explained in the sections above), and so can be used to quickly filter the asset list and show only those items with the chosen tag or tags.":"{}您可以为单个项目分配多个标签，也可以使用{}或{}/{}以及鼠标左键{}来选择多个资源，并一次为所有资源分配一个标签。添加后，所有标签将在 \"快速访问\" 菜单下以及 \"过滤器\" 选项中可见(如以上各节所述)，因此可用于快速过滤资源列表并仅显示具有所选标签的项目。",
    "{}You can find out more about adding fonts from the section on the {}Font Editor{}.":"{}您可以从{}字体编辑器{}的部分中找到有关添加字体的更多信息。",
    "{}You can find out more about adding objects from the section on the {}Object Editor{}.":"{}您可以在{}对象编辑器{}的部分中找到有关添加对象的更多信息。",
    "{}You can find out more about adding rooms from the section on the {}Room Editor{}.":"{}您可以从{}房间编辑器{}上的部分中找到有关添加房间的更多信息。",
    "{}You can find out more about adding scripts from the section on the {}Script Editor{}.":"{}您可以在{}脚本编辑器{}的部分中找到有关添加脚本的更多信息。",
    "{}Zoom Controls{}{}Zoom Controls{}":"{}缩放控件{}{}缩放控件{}",
    "{}{}Asset List{}{}Asset List{}{}":"",
    "{}{}NOTE{}{}&nbsp;Assigning a tag to a folder group will {}not {}automatically assign it to the assets inside it.":"{}{}注意{}{}将标签分配给文件夹组将{}不会{}自动将其分配给其中的资源。",
    "{}{}Sound is an important part of any game, both for adding depth to the gameplay and giving feedback in the form of sound effects, and for adding atmosphere in the form of music. {}GameMaker{} accepts {}WAV{}, {}MP3 {}and {}OGG{} format files.":"{}{}声音是任何游戏的重要组成部分，它既可以增加游戏的深度，也可以以音效的形式提供反馈，也可以以音乐的形式增加氛围。{}GameMaker{}接受{}WAV{}、{}MP3{}和{}OGG{}格式的文件。",
    "{}{}{}图块集{}{}图块集{}{}":"",
    "拼贴集取自精灵资源，但被归类为单独的资源，因为{}GameMaker{}在创建游戏时会以不同的方式处理它们。基本上，拼贴集是一张单张图像，{}GameMaker{}将根据您为各种设置提供的值将其分成不同的部分。然后，您可以在房间编辑器中使用它们(或通过代码按程序进行)在房间中生成图块地图。它们非常适合设计房间中的任何静态物品，例如地形、墙壁、背景等... 因为它们的头顶不像物体那样。":"图块集取自精灵资源，但被归类为单独的资源，因为{}GameMaker{}在创建游戏时会以不同的方式处理它们。基本上，图块集是一张单张图像，{}GameMaker{}将根据您为各种设置提供的值将其分成不同的部分。然后，您可以在房间编辑器中使用它们(或通过代码按程序进行)在房间中生成图块地图。它们非常适合设计房间中的任何静态物品，例如地形、墙壁、背景等... 因为它们的头顶不像物体那样。",
    "用于拼贴集的Rmb{}菜单包含以下选项(以及在此页下方列出的选项)：":"用于图块集的Rmb{}菜单包含以下选项(以及在此页下方列出的选项)："
}