{
    "A Filter only uses shaders and can be previewed in the Room Editor.":"滤镜仅使用着色器，可以在房间编辑器中预览。",
    "A Filter/Effect (or FX) layer is used to apply a visual filter or effect to some layers. You can select an effect from the \"Effect Type\" drop-down list, which will show you its parameters in the Layer Properties window allowing you to modify how it looks and behaves.":"滤镜/效果(或FX)层用于将视觉滤镜或效果应用于某些层。你可以从\"效果类型\"下拉列表中选择一种效果，它会在图层属性窗口中显示它的参数，允许你修改它的外观和行为。",
    "All the Filters and Effects in the&nbsp;{}\"Effect Type\"{} drop-down list are documented on this page:&nbsp;{}FX Types &amp; Parameters{}.":"{}\"效果类型\"{}下拉列表中的所有滤镜和效果都记录在此页上： {}滤镜效果类型和参数{}。",
    "An Effect also has internal code for managing itself in addition to shaders. Due to this, they can\u0027t be previewed in the Room Editor, and only appear functional at runtime (in-game).":"除着色器外，效果还具有用于管理自身的内部代码。因此，它们不能在房间编辑器中预览，并且只在运行时(游戏中)显示功能。",
    "By adding the filter/effect&nbsp;in&nbsp;{}at least one room{} through the IDE":"通过 IDE 在{}中添加滤镜/效果",
    "By calling {}{}fx_create(){}{} with the filter/effect name as a&nbsp;string&nbsp;{}literal{}":"通过在滤镜/效果名称为字符串{4}文本{5}的情况下调用 {}{}fx_create(){}{}",
    "Effect Types":"效果类型",
    "Filter vs. Effect":"滤镜与效果",
    "Filter/Effect Layers":"滤镜/效果层",
    "Filters and Effects":"滤镜和效果",
    "Filters/effects that take a texture image, require that image to be on a separate texture page. You can set this through the {}sprite editor{}.":"使用纹理图像的滤镜/效果需要该图像在单独的纹理页面上。您可以通过{}精灵编辑器{}设置。",
    "Filters/effects will not work when the {}application surface is disabled{}. It\u0027s enabled by default, and you shouldn\u0027t usually require disabling it, however you may do so to gain performance on mobile devices. In such cases you wouldn\u0027t be able to use filters/effects as they require the surface texture for shader manipulations.":"禁用{}应用程序表面{}时滤镜/效果将不起作用。它在默认情况下是启用的，您通常不应该要求禁用它，但您可以这样做以在移动设备上获得性能。在这种情况下，您将无法使用滤镜/效果，因为它们需要材质球操纵的表面纹理。",
    "For example, \"{}Colourise{}\" is a Filter, where \"{}Windblown Particles{}\" is an Effect.":"例如，\"{}上色{}\"是滤镜，其中\"{}风吹颗粒{}\"是一种效果。",
    "For example, selecting the \"Screen Shake\" effect will allow you to change its magnitude, shake speed and apply a sprite as its noise texture:":"例如，选择“画面抖动”效果将允许您更改其幅度、抖动速度并应用精灵作为其噪波纹理：",
    "In the Room Editor, you can add a new Filter/Effect layer by clicking on the {}&nbsp;button, which will add a new layer and open up its properties below:":"在房间编辑器中，您可以通过点击{} 按钮来添加新的滤镜/效果层，这将添加一个新的层并在下面打开它的属性：",
    "Limitations":"局限性",
    "Please note that there are currently only two ways to ensure that GameMaker loads a particular filter/effect in your game:":"请注意，目前只有两种方法可以确保 GameMaker 在您的游戏中加载特定的滤镜/效果：",
    "Read&nbsp;{}Filter and Effect Functions{} for more information.":"有关详细信息，请阅读 {}滤镜和效果函数{}。",
    "Runtime Usage":"运行时使用",
    "Selecting a room layer will allow you to apply a filter/effect to it in the Inspector, and if that layer is a non-FX layer (e.g. Instance Layer, Asset Layer, etc.) then the effect will only be applied to that layer and not to any other layers below it.":"选择房间层将允许您在检查器中对其应用滤镜/效果，如果该层是非FX层(例如，实例层、资源层等)。则该效果将仅应用于该层，而不会应用于其下的任何其他层。",
    "Single-Layer FX":"单层FX",
    "There are some limitations to keep in mind when using filters/effects:":"在使用滤镜/效果时需要记住一些限制：",
    "There is currently one limitation to keep in mind:":"目前有一个限制需要牢记：",
    "This means that to use a specific filter/effect at runtime, it must have either been added into a room first (so GameMaker knows you are going to use it) or specified explicitly in an {}{}fx_create(){}{} call.":"这意味着要在运行时使用特定滤镜/效果，必须先将其添加到房间中(以便 GameMaker 知道您要使用它)，或者在{}{}fx_create(){}{}调用中显式指定。",
    "To create filters/effects that are applied to only one layer, see:&nbsp;{}Single-Layer FX{}.":"要创建仅应用于一个层的滤镜/效果，请参阅：{}单层FX{}。",
    "While you can create an FX layer&nbsp;to apply a filter to multiple layers, you are also able to assign a filter to one specific layer only, through the {}Inspector{}.":"虽然您可以创建一个FX层以将滤镜应用到多个层，但您也可以通过{}检查器{}将滤镜仅分配给一个特定的层。",
    "You can add and control effects at runtime using the {}Filter/Effect GML Functions{}.":"您可以在运行时使用{}滤镜/效果 GML 函数{}添加和控制效果。",
    "You can also click on the&nbsp;{} icon to enable/disable the FX for the selected layer.":"您也可以单击{}图标来启用/禁用所选层的FX。",
    "{}Adding an FX layer will apply the selected effect&nbsp;to all other layers that are&nbsp;{}below{}&nbsp;the FX layer, as demonstrated in this visual:":"{}添加FX层会将所选效果应用于FX层以下的所有其他层，如下面的图示所示：",
    "{}NOTE{} Modifying the {}depth of a layer{} or {}an instance{} at runtime may change which FX layers are applied on it, by either making its depth higher than an FX layer\u0027s depth (essentially going&nbsp;{}under{}&nbsp;the FX layer and being affected) or making its depth lower than an FX layer\u0027s depth (going&nbsp;{}above{}&nbsp;the FX layer and not being affected).":"{}注意{} 在运行时修改层或{4}实例{5}的{}深度{}可能会更改应用于其上的FX层的深度，方法是使其深度高于FX层的深度(本质上是位于FX层{}下{}并受到影响)，或者使其深度低于FX层的深度(位于FX层的{}上方{}且不受影响)。",
    "{}This means that all \"affected\" layers will have the selected filter applied to them (here, \"Desaturate\") as they are below an FX layer. Any layers above the FX layer will be unaffected. A&nbsp;layer may be affected by multiple effect layers that are present above it anywhere in the layer order.":"{}这意味着所有\"受影响\"的层都将应用选定的滤镜(这里是\"去饱和化\")，因为它们位于FX层之下。FX层以上的任何层都不会受到影响。层可能受层顺序中位于其上方任意位置的多个效果层的影响。",
    "{}{}IMPORTANT{}{}&nbsp;There are some filters/effects that can {}only be applied to single layers{} (such as \"Blend\") and will only appear for non-FX layers.":"{}{}重要{}{} 有些滤镜/效果{}只能应用于单个图层{}(如\"混合\")，并且只会显示在非 FX 层上。"
}