{
    "Below you can find an overview of each of the available layer types as well as the editable properties for that layer:":"下面您可以找到每个可用层类型的概述以及该层的可编辑属性：",
    "Everything that goes into the room you create in the {}Room Editor{} is placed on a {}layer{}. Layers can be added, removed, and sorted from the Layer&nbsp;Editor, and come in a variety of different types, each with their own set of options and way of working. You aren\u0027t limited to the number of each type of layer, and can have multiple tile layers, or path layers, or instance layers, etc... Each type of layer has its own {}properties window{} where you can set different things depending on the layer type. You can also toggle the layer\u0027s visibility, with invisible layers {}not {}being processed at runtime (but you can make them visible again at any time using the appropriate {}layer function{}).":"进入您在{}房间编辑器{}中创建的房间的所有内容都放置在一个{}层{}上。层可以从层编辑器中添加、删除和排序，并且有各种不同的类型，每种类型都有自己的一组选项和工作方式。您不受每种类型的层的数量限制，可以有多个瓦片层、路径层或实例层等。每种类型的层都有自己的{}属性窗口{}，您可以在其中根据层类型设置不同的设置。您还可以切换层的可见性，在运行时处理不可见层{}而不是{}(但您可以随时使用适当的{}层函数{}使它们再次可见)。",
    "Filter/Effects":"滤镜/效果",
    "If you choose a sprite instead, then you can tile that image horizontally or vertically, choose whether to stretch the image so it fills the whole room, and offset the image as you wish. Additionally, if you want to have the background scroll in a direction, you can set the horizontal and/or vertical speed too (each game step it will move along the given axis by the number of pixels that you set here), and you can also re-position the background image by setting the x and y offset values. You can also set the animation speed for the background if the sprite resource that you have selected has multiple sub-images, although this is locked by default to the value that you set in the Sprite Editor for the image used. Finally you can set the depth for the layer explicitly, although again by default this is locked and you can simply drag and reorder the layer order in the Layer Editor to change this value.":"如果您选择的是精灵，则可以水平或垂直平铺图像，选择是否拉伸图像以填充整个房间，并根据需要对图像进行偏移。此外，如果你想让背景在一个方向上滚动，你也可以设置水平和/或垂直速度(游戏的每一步都会沿着你在这里设置的像素数沿给定轴移动)，你也可以通过设置x和y偏移值来重新定位背景图像。如果选定的精灵资源具有多个子图像，也可以设置背景的动画速度，尽管默认情况下该速度锁定为您在精灵编辑器中为使用的图像设置的值。最后，您可以显式设置层的深度，尽管默认情况下该深度再次处于锁定状态，您只需在层编辑器中拖动并重新排序层顺序即可更改此值。",
    "If you right-click {}&nbsp;on any layer you get the layer menu:":"如果在任意层上右击{} ，则会出现层菜单：",
    "In the layer properties shown within the {}Inspector{}, you can apply a filter or effect to the selected layer. This will be applied as a \"single layer\" effect, i.e. its effect will only be applied on that particular layer and not on other layers below it.":"在{}检验器{}中显示的层属性中，可以将滤镜或效果应用于选定的层。这将作为\"单层\"效果应用，即其效果将仅应用于该特定层，而不会应用于其下的其他层。",
    "Layer Types And Properties":"图层类型和属性",
    "Note that you can drag layers up or down in the window to re-order them, and you can select and move multiple layers too using either {}&nbsp;+ {}&nbsp;to select from one layer to another (including all those in between) or {}&nbsp;/&nbsp;{} + {}&nbsp;to select layers one at a time. If you place the layers on top of a layer folder, they will be moved and set as sub-layers of the folder you dropped them on to. You can also lock layers so that they cannot be edited by mistake using the lock button {}.":"请注意，您可以在窗口中向上或向下拖动层以重新排序，也可以使用 {}+{} 从一个层选择到另一个层 (包括中间的所有层) 或使用 {}/{}+{} 一次选择一个层来选择和移动多个层。如果将层放置在层文件夹的顶部，它们将被移动并设置为放置它们的文件夹的子层。您还可以使用锁定按钮 {} 锁定层，以防止错误地编辑它们。",
    "Note that you can toggle the inheritance for a background from this window too by clicking the button at the very top.":"请注意，您也可以通过单击最上面的按钮从该窗口切换背景的继承。",
    "To help with ordering your layers and keeping them tidy, you can create groups of layers in a layer folder by clicking the folder icon {}. You can also delete one or more selected layers by clicking the delete button {}. All layers will have a {}depth {}value, which defines where in the draw order that layer will be placed when its contents are&nbsp;{}rendered{}&nbsp;in the room. Layers are drawn from the {}highest {}depth to the {}lowest{}, so a layer at a depth of -100 will be drawn {}over {}a layer with a depth of 200.":"为了帮助您对层进行排序并使其保持整洁，您可以通过单击文件夹图标{}在层文件夹中创建层组。您还可以通过单击删除按钮{}来删除一个或多个选定的层。所有层都将有一个{}深度{}值，该值定义当该层的内容在房间中{}呈现{}时，该层将被放置在绘制顺序中的位置。层从{}最高{}深度到{}最低{}绘制，因此深度为-100的层将在深度为200的层{}以上{}绘制。",
    "When you create a new background layer it does not have a sprite set by default and so&nbsp;{}GameMaker{}&nbsp;fills the layer with a solid colour instead (you can click the preview box to open the colour picker and change the colour used). When using a simple colour, none of the other layer settings are used in-game.":"创建新的背景层时，默认情况下它没有精灵设置，因此 {}GameMaker{} 会用纯色填充该层(您可以单击预览框打开颜色选择器并更改所使用的颜色)。当使用简单的颜色时，游戏中不会使用其他任何层设置。",
    "You can add a new background layer by clicking on the {}&nbsp;button. This will add the new layer, and then open up the background properties window:":"您可以通过单击{} 按钮来添加新的背景层。这将添加新层，然后打开背景属性窗口：",
    "{}Assets{}{}Assets{}":"{}资源{}{}资源{}",
    "{}Backgrounds{}{}Backgrounds{}":"{}背景{}{}背景{}",
    "{}Filter/Effect{}{}Filter/Effect{}":"{}滤镜/效果{}{}滤镜/效果{}",
    "{}Here you can open the layer properties window for the selected layer, delete the layer, rename the layer, or add a {}sub layer{}. If you choose to add a sub layer, the new layer will be created under it, tabbed to the right. You can then choose to have the sub layer inherit its properties from the parent layer, and also set whether it should inherit the visibility from the parent layer.":"{}您可以在此打开所选层的层属性窗口、删除层、重命名层或添加{}子层{}。如果选择添加子层，则会在子层下创建新层，并将其放置在右侧的选项卡中。然后，可以选择让子层继承父层的属性，还可以设置子层是否应该继承父层的可见性。",
    "{}Instances{}{}Instances{}":"{}实例{}{}实例{}",
    "{}Paths{}{}Paths{}":"{}路径{}{}路径{}",
    "{}The image above shows the layer editor, with the current layers being listed at the top, and the different buttons for creating layers at the bottom. You can rename any layer from this editor by doing a slow double click on the name (note that you cannot use anything except letters numbers and the underbar \"_\" character for names) and you can also switch its visibility on or off by clicking the eye icon {}. If the room has inherited layers from a parent room, you can toggle the inheritance from the button at the bottom, but note that this will affect all layers (see {}here{} for more information on inheritance). You can also use {}&nbsp;or {}&nbsp;/&nbsp;{} and left click {}&nbsp;on multiple layers to select them for duplication or deletion (these options are also available from the right mouse {}&nbsp;menu).":"{}上图显示了层编辑器，当前层在顶部列出，用于创建层的不同按钮在底部。您可以通过在名称上缓慢地双击来重命名此编辑器中的任何层(请注意，您不能使用除字母、数字和下划线\"_\"字符以外的任何名称)，您还可以通过单击眼睛图标{}来打开或关闭其可见性。如果房间继承了父房间的层，您可以通过底部的按钮切换继承，但请注意，这将影响所有层(有关继承的更多信息，请参阅{}此处{})。您也可以使用{}或{}/{}，然后在多个层上左键单击{}以选择要复制或删除的层(这些选项也可以从鼠标右键{}菜单中选择)。",
    "{}{}IMPORTANT{}{}&nbsp;There is a minimum and maximum layer depth of -16000 to 16000. Anything placed on a layer outside that range will not be drawn although all events will still run as normal for anything on the layer.":"{}{}重要{}{} 有一个最小和最大的层深在-16000到16000之间。放置在该范围之外的层上的任何内容都不会被绘制，尽管该层上的所有事件仍将正常运行。",
    "{}{}NOTE{}{}&nbsp;In the actual editor window where you place the different assets on their layers, you can hold down \"{}P{}\" + click anywhere to instantly select an asset and skip to the layer that it has been placed on.":"{}{}备注{}{} 在放置不同资源的实际编辑窗口中，您可以按住\"{}P{}\"并在任意位置单击，以立即选择资源并跳到已放置该资源的层。"
}