{
    "A Filter/Effect (or FX) layer is used to apply a visual filter or effect to some layers. Adding an FX layer and selecting an effect from the \"Effect Type\" drop-down menu will apply that effect to all layers that are&nbsp;{}below{}&nbsp;the selected FX layer, as demonstrated in this visual:":"滤镜/效果(或FX)层用于将视觉滤镜或效果应用于某些层。添加一个FX层并从\"效果类型\"下拉菜单中选择一种效果会将该效果应用于所选FX层以下的所有层，如下图所示：",
    "At the top of the room editor, when you have a tile layer selected, you will see a set of tools that are specific to tiles:":"在房间编辑器的顶部，当您选择了图块层时，您将看到一组特定于图块的工具：",
    "Below the instance name you have buttons to set whether the instance is to inherit from the parent room, change the object that you want it to be an instance of or even open up the {}Object Editor{}, should you wish to change anything there. There is a button to check and edit variables through the {}Object Variable{} window and you can change the initial characteristics of this instance too, setting a colour to blend it with (white by default), or rotating and flipping it. You can also scale the instance along either or both the axis, and set its position within the room, as well as the image speed and initial frame for the sprite to use.":"在实例名称下面有按钮，用于设置实例是否继承自父房间、更改要作为其实例的对象，甚至打开{}对象编辑器{}(如果您希望在那里更改任何内容)。有一个按钮可以通过{}对象变量{}窗口检查和编辑变量，您还可以更改此实例的初始特征，设置与之混合的颜色(默认情况下为白色)，或旋转和翻转它。您还可以沿其中一个或两个轴缩放实例，并设置其在房间内的位置，以及精灵要使用的图像速度和初始帧。",
    "Below you can find an overview of each of the available layer types as well as the editable properties for that layer:":"下面您可以找到每个可用层类型的概述以及该层的可编辑属性：",
    "Clicking the Flip tool with the left mouse button {}&nbsp;(or using the keyboard shortcut \"{}X{}\" ) will flip the tile currently selected for drawing along the {}horizontal {}axis, without changing drawing tool (if you have a custom brush selected for drawing, the whole brush will flip). If you have no tile selected for drawing, but do have a group of tiles selected on a layer, then the flip tool will Flip the selected tiles.":"使用鼠标左键{}单击翻转工具(或使用键盘快捷键\"{}X{}\")将沿{}水平{}轴翻转当前选定要绘制的图块，而不会更改绘制工具(如果您选择了要绘制的自定义画笔，则整个画笔将翻转)。如果没有选定要绘制的图块，但在某个层上选择了一组图块，则翻转工具将翻转选定的图块。",
    "Clicking the Mirror tool with the left mouse button {}&nbsp;(or using the keyboard shortcut \" {}Y{}\" ) will mirror the tile currently selected for drawing along the {}vertical {}axis, without changing drawing tool (if you have a custom brush selected for drawing, the whole brush will mirror). If you have no tile selected for drawing, but do have a group of tiles selected on a layer, then the Mirror tool will mirror the selected tiles.":"使用鼠标左键{}(或使用键盘快捷键\"{}Y{}\")单击镜像工具将沿{}垂直{}轴镜像当前选定要绘制的图块，而不会更改绘制工具(如果您选择了要绘制的自定义画笔，则整个画笔将镜像)。如果没有选定要绘制的图块，但在某个层上选择了一组图块，则镜像工具将镜像选定的图块。",
    "Clicking the Rotate tool with the left mouse button {}&nbsp;(or using the keyboard shortcut \" {}Z{}\" ) will rotate the tile currently selected for drawing 90° {}clockwise{}, without changing drawing tool (if you have a custom brush selected for drawing, the whole brush will rotate). If you have no tile selected for drawing, but do have a group of tiles selected on a layer, then the Rotate tool will rotate the selected tiles.":"使用鼠标左键{}单击旋转工具(或使用键盘快捷键\"{}Z{}\")将当前选定用于绘制的图块{}顺时针{}旋转90°，而不会更改绘制工具(如果您选择了用于绘制的自定义画笔，则整个画笔将旋转)。如果没有选定要绘制的图块，但在某个层上选择了一组图块，则旋转工具将旋转选定的图块。",
    "Clicking this tool enables the Auto tiling paint style. When this is active you can select any tile from the Autotile Libraries tab, and then paint it into the room layer and {}GameMaker{} will automatically change it to match the surrounding tiles, as long as you have correctly set up the {}Auto Tile Tab{}. Note that selecting a tile from the tile set that is not part of the autotile libraries will reset the drawing tool to the standard Pencil tool.":"单击此工具可启用自动图块绘制样式。激活后，您可以从自动图块图库选项卡中选择任何图块，然后将其绘制到房间层中，{}GameMaker{}将自动更改它以匹配周围的图块，只要您正确设置了{}自动图块选项卡{}。请注意，从图块集中选择不属于自动图块库的图块会将绘制工具重置为标准铅笔工具。",
    "Double-clicking {}&nbsp;on any instance - either in the room editor itself or in the properties list - will open a new window to let you modify aspects of that single unique instance:":"在房间编辑器本身或属性列表中，双击任何实例上的{} 将打开一个新窗口，您可以在其中修改该单一唯一实例的各个方面：",
    "Everything that goes into the room you create in the {}Room Editor{} is placed on a {}layer{}. Layers can be added, removed, and sorted from the Layer&nbsp;Editor, and come in a variety of different types, each with their own set of options and way of working. You aren\u0027t limited to the number of each type of layer, and can have multiple tile layers, or path layers, or instance layers, etc... Each type of layer has its own {}properties window{} where you can set different things depending on the layer type. You can also toggle the layer\u0027s visibility, with invisible layers {}not {}being processed at runtime (but you can make them visible again at any time using the appropriate {}layer function{}).":"进入您在{}房间编辑器{}中创建的房间的所有内容都放置在一个{}层{}上。层可以从层编辑器中添加、删除和排序，并且有各种不同的类型，每种类型都有自己的一组选项和工作方式。您不受每种类型的层的数量限制，可以有多个图块层、路径层或实例层等。每种类型的层都有自己的{}属性窗口{}，您可以在其中根据层类型设置不同的设置。您还可以切换层的可见性，在运行时处理不可见层{}而不是{}(但您可以随时使用适当的{}层函数{}使它们再次可见)。",
    "Filter/Effects":"滤镜/效果",
    "Finally you can give the instance some creation code which will run directly after the object creation event code, and is unique to this instance (so you can, say, set a variable in the object which all instance will have then modify it in the creation code so that it\u0027s a unique value for one instance). Clicking this will chain a {}script window{}&nbsp;to the instance where you can add any functions or modify any variables and this code will be run directly after the instance has been created and the instance {}Create Event{} has been run. Note that you can toggle inheritance of creation code on or off {}independently {}of the instance inheritance.":"最后，您可以为实例提供一些创建代码，该代码将在对象创建事件代码之后直接运行，并且对该实例是唯一的(因此，您可以在对象中设置一个变量，然后所有实例都将在创建代码中对其进行修改，使其成为一个实例的唯一值)。单击此选项会将一个{}脚本窗口{}链接到实例，您可以在其中添加任何函数或修改任何变量，此代码将在创建实例并运行实例{}创建事件{}之后直接运行。请注意，您可以独立于实例继承{}打开或关闭创建代码的继承。",
    "If you choose a sprite instead, then you can tile that image horizontally or vertically, choose whether to stretch the image so it fills the whole room, and offset the image as you wish. Additionally, if you want to have the background scroll in a direction, you can set the horizontal and/or vertical speed too (each game step it will move along the given axis by the number of pixels that you set here), and you can also re-position the background image by setting the x and y offset values. You can also set the animation speed for the background if the sprite resource that you have selected has multiple sub-images, although this is locked by default to the value that you set in the Sprite Editor for the image used. Finally you can set the depth for the layer explicitly, although again by default this is locked and you can simply drag and reorder the layer order in the Layer Editor to change this value.":"如果您选择的是精灵，则可以水平或垂直图块图像，选择是否拉伸图像以填充整个房间，并根据需要对图像进行偏移。此外，如果你想让背景在一个方向上滚动，你也可以设置水平和/或垂直速度(游戏的每一步都会沿着你在这里设置的像素数沿给定轴移动)，你也可以通过设置x和y偏移值来重新定位背景图像。如果选定的精灵资源具有多个子图像，也可以设置背景的动画速度，尽管默认情况下该速度锁定为您在精灵编辑器中为使用的图像设置的值。最后，您可以显式设置层的深度，尽管默认情况下该深度再次处于锁定状态，您只需在层编辑器中拖动并重新排序层顺序即可更改此值。",
    "If you right click {}&nbsp;in the room editor window while manipulating a path then you\u0027ll get the following options:":"如果在操作路径时在房间编辑器窗口中右键单击{} ，则会出现以下选项：",
    "If you right-click {}&nbsp;on any layer you get the layer menu:":"如果在任意层上右击{} ，则会出现层菜单：",
    "In the layer properties shown within the {}Inspector{}, you can apply a filter or effect to the selected layer. This will be applied as a \"single layer\" effect, i.e. its effect will only be applied on that particular layer and not on other layers below it.":"在{}检验器{}中显示的层属性中，可以将滤镜或效果应用于选定的层。这将作为\"单层\"效果应用，即其效果将仅应用于该特定层，而不会应用于其下的其他层。",
    "It is worth noting that each asset on the&nbsp;layer is automatically flagged for exporting when the game is made. However, especially when working with {}inheritance{}, it may be that you don\u0027t want specific assets to be added to the room in the final game. If that is the case, then simply un-checking the \"{}Export{}\" checkbox to the left of the asset in the layer properties list will prevent it from being exported as part of the executable. It is important to note, however, that if you have any code that references that asset, then the game will not run correctly, so use this feature with care.":"值得注意的是，在制作游戏时，层上的每个资源都会被自动标记为要导出。但是，尤其是在处理{}继承{}时，您可能不希望在最终游戏中将特定资源添加到房间中。如果是这种情况，则只需取消选中层属性列表中资源左侧的\"{}导出{}\"复选框即可阻止其作为可执行文件的一部分导出。但是，重要的是要注意，如果您有任何引用该资源的代码，则游戏将无法正确运行，因此请谨慎使用此功能。",
    "It is worth noting that each asset on the&nbsp;layer is automatically flagged for exporting when the game is made. However, especially when working with {}inheritance{}, it may be that you don\u0027t want specific sprites to be added to the room in the final game. If that is the case, then simply un-checking the \"{}Export{}\" checkbox to the left of the sprite in the layer properties list will prevent it from being exported as part of the executable. It is important to note, however, that if you have any code that references that asset, then the game will not run correctly, so use this feature with care.":"值得注意的是，在制作游戏时，层上的每个资源都会被自动标记为要导出。然而，尤其是在处理{}继承{}时，你可能不希望在最终游戏中将特定的精灵添加到房间中。如果是这种情况，那么只需取消选中层属性列表中精灵左侧的\"{}导出{}\"复选框将阻止它作为可执行文件的一部分导出。但是，重要的是要注意，如果您有任何引用该资源的代码，则游戏将无法正确运行，因此请谨慎使用此功能。",
    "It is worth noting that each instance on a layer is automatically flagged for exporting when the game is made. However, especially when working with inheritance, it may be that you don\u0027t {}want {}specific instances to be added to the room in the final game (or you may have a debug instance in every room and simply want to exclude it from the final game). If that is the case, then simply un-checking the \"{}Export{}\" checkbox to the left of the instance in the list will prevent it from being exported as part of the executable. It is important to note, however, that if you have any code that references the instance, {}then the game will not run correctly{}, so use this feature with care.":"值得注意的是，当制作游戏时，层上的每个实例都会自动标记为要导出。然而，特别是在处理继承时，您可能不{}希望{}在最终游戏中将多个特定实例添加到房间中(或者您可能在每个房间中都有一个调试实例，只是希望将其从最终游戏中排除)。如果是这种情况，则只需取消选中列表中实例左侧的\"{}导出{}\"复选框即可阻止将其作为可执行文件的一部分导出。但是，需要注意的是，如果您有任何引用该实例的代码，则{}游戏将无法正常运行{}，因此请谨慎使用此功能。",
    "It is worth noting that you can also add points to the path by clicking the left mouse button&nbsp;{}, as well as remove points using the right mouse button {}, or select a point by clicking on it and dragging it around, {}all within the actual room editor{}, making creating and editing paths very easy (although you can still edit the path in the {}Path Editor{} as normal too). If you hold down {}&nbsp;/&nbsp;{} + {}&nbsp;on different path points, then they will all be selected and you can move them together or delete them all from the menu option (explained below).":"值得注意的是，您还可以通过单击鼠标左键{}将点添加到路径中，也可以使用鼠标右键删除点{}，或者通过单击并拖动一个点来选择它，所有这些都是在{}实际的房间编辑器{}中进行的，这使得创建和编辑路径非常容易(尽管您仍然可以像往常一样在{}路径编辑器{}中编辑路径)。如果您在不同的路径点上按住{}/{}+{}，则它们都将被选中，您可以将它们一起移动或从菜单选项中全部删除(如下所述)。",
    "Layer Types And Properties":"图层类型和属性",
    "Note that if you use the&nbsp;Selection Tool&nbsp;{} to select a group of tiles in the room editor canvas and then either cut or copy them, they will temporarily become the current brush for painting.":"请注意，如果您使用选择工具{}在房间编辑器画布中选择一组图块，然后剪切或复制它们，它们将暂时成为当前绘画画笔。",
    "Note that the Tile Editing window permits you to zoom in and out on the tile with the mouse wheel or the buttons at the top, and you can pan using the {}&nbsp;middle mouse button or {}&nbsp;+ {}. Note that there is a grid option too which can be toggled on or off to delimit the tiles in the window, and you can set the colour of the grid as well, although tiles will {}always{}&nbsp;be snapped to the grid whether it is visible or not.":"请注意，图块编辑窗口允许您使用鼠标滚轮或顶部的按钮来放大和缩小图块，并且您可以使用鼠标中键{}或{}+{}进行平移。请注意，也有一个网格选项，可以打开或关闭它来分隔窗口中的图块，您也可以设置网格的颜色，尽管图块将{}始终{} 对齐到网格上，无论它是否可见。",
    "Note that you can drag layers up or down in the window to re-order them, and you can select and move multiple layers too using either {}&nbsp;+ {}&nbsp;to select from one layer to another (including all those in between) or {}&nbsp;/&nbsp;{} + {}&nbsp;to select layers one at a time. If you place the layers on top of a layer folder, they will be moved and set as sub-layers of the folder you dropped them on to. You can also lock layers so that they cannot be edited by mistake using the lock button {}.":"请注意，您可以在窗口中向上或向下拖动层以重新排序，也可以使用 {}+{} 从一个层选择到另一个层 (包括中间的所有层) 或使用 {}/{}+{} 一次选择一个层来选择和移动多个层。如果将层放置在层文件夹的顶部，它们将被移动并设置为放置它们的文件夹的子层。您还可以使用锁定按钮 {} 锁定层，以防止错误地编辑它们。",
    "Note that you can toggle the inheritance for a background from this window too by clicking the button at the very top.":"请注意，您也可以通过单击最上面的按钮从该窗口切换背景的继承。",
    "Once you place an asset in the room, you have a certain amount of control over how it looks by double clicking {}&nbsp;on it to open the asset properties window:":"将资源放入房间后，您可以通过在其上双击{}以打开资源属性窗口来对其外观进行一定程度的控制：",
    "The Tile Editing window also permits you to select {}Brushes{}, {}Animated Tiles{} and {}Auto Tiles{} from the Libraries tab, all of which are covered in the section on the {}Tile Set Editor{}.":"图块编辑窗口还允许您从库选项卡中选择{}画笔{}、{}动画图块{}和{}自动图块{}，所有这些都在{}图块集编辑器{}上的一节中介绍。",
    "The fill tool permits you to fill an entire tilemap layer or a selection of tiles with the current tile brush. The brush you use can be a single tile or a composite brush made up of multiple tiles, or even a tile from the animation library and clicking {}&nbsp;on a layer will then fill in the tiles using the chosen brush. If you have not used the Selection Tool then the fill will work on all consecutive {}empty {}tiles, or all consecutive tiles {}of the same index{}. If you have a selection within the layer, then fill will be constrained to within that selection.":"填充工具允许您用当前的拼贴画笔填充整个拼贴图层或选定的拼贴。您使用的画笔可以是单个图块或由多个图块组成的复合画笔，甚至可以是动画库中的图块，然后单击层上的{} 将使用所选的画笔填充图块。如果您尚未使用选择工具，则填充将在所有连续的{}空的{}图块上进行，或在{}同一索引{}的所有连续图块上进行。如果在层中有选区，则填充将被约束为在该选区内。",
    "The layer list can be ordered by clicking {}&nbsp;and dragging an instance in the list to the position required, but it is worth noting that this is purely for organisational purposes within the room editor and if you want to set a specific creation order, please use the {}Creation Order Window{}, which can be opened from the {}Room Properties{} window, or from the {}Room context menu{}.":"可以通过单击{} 并将列表中的实例拖动到所需位置来对层列表进行排序，但值得注意的是，这纯粹是出于房间编辑器内的组织目的，如果您想要设置特定的创建顺序，请使用{}创建顺序窗口{}，该窗口可以从{}房间属性{}窗口或从{}房间上下文菜单{}打开。",
    "This is the pencil tool. It uses the selected tile to paint in the Room Editor with the left mouse button {}&nbsp;and you can erase with the right mouse button {}. Note that the index value for the tile is shown at the bottom in the Room Status Bar in the Room Editor, and if you have multiple tiles selected for painting (ie: a {}brush{}) then a list of all the tile indices used will be shown.":"这是铅笔工具。它使用选定的图块在房间编辑器中使用鼠标左键{}进行绘制，您可以使用鼠标右键{}进行擦除。请注意，图块的索引值显示在房间编辑器中房间状态栏的底部，如果您选择了多个图块进行绘制(即：{}画笔{})，则将显示所有使用的图块索引的列表。",
    "This is the selection tool, which can be used to define an area of the tile layer for working on. You can click the left mouse button {}&nbsp;and then drag the mouse to create a rectangular area, or you can press&nbsp;{}&nbsp;/&nbsp;{} + {}&nbsp;to add multiple selections and {}&nbsp;+ {}&nbsp;to clear a part of the selection. To clear the whole selection you can press {}. When you have an area of a tile layer selected, the rest of the tools (Pencil, Flip, Rotate, etc...) will only work within the selected area. Note that you can also copy ({}&nbsp;/&nbsp;{}+ \"{}C{}\"), cut ({}&nbsp;/&nbsp;{} + \"{}X{}\") and paste ({}&nbsp;/&nbsp;{} + \" {}{}{}V{}{}{}\") selected tiles within the room editor which will then switch the tool to the Pencil and permit you to paint the room layer with the selected tiles.":"这是选择工具，可用于定义要处理的图块层区域。您可以单击鼠标左键 {}，然后拖动鼠标创建一个矩形区域，也可以按 {}/{}+{} 添加多个选项，按 {}+{} 清除部分选项。要清除整个选择，您可以按 {}。当您选择了一个图块层的一个区域时，其余的工具 (铅笔、翻转、旋转等)。将仅在选定区域内工作。请注意，您还可以在房间编辑器中复制 ({}/{}+\"{}C{}\")、剪切 ({}/{}+\"{}X{}\") 和粘贴 ({}/{}+\"{}{}{}V{}{}{}\") 选定的图块，然后将工具切换到铅笔，并允许您使用选定的图块绘制房间层。",
    "To help with ordering your layers and keeping them tidy, you can create groups of layers in a layer folder by clicking the folder icon {}. You can also delete one or more selected layers by clicking the delete button {}. All layers will have a {}depth {}value, which defines where in the draw order that layer will be placed when its contents are&nbsp;{}rendered{}&nbsp;in the room. Layers are drawn from the {}highest {}depth to the {}lowest{}, so a layer at a depth of -100 will be drawn {}over {}a layer with a depth of 200.":"为了帮助您对层进行排序并使其保持整洁，您可以通过单击文件夹图标{}在层文件夹中创建层组。您还可以通过单击删除按钮{}来删除一个或多个选定的层。所有层都将有一个{}深度{}值，该值定义当该层的内容在房间中{}呈现{}时，该层将被放置在绘制顺序中的位置。层从{}最高{}深度到{}最低{}绘制，因此深度为-100的层将在深度为200的层{}以上{}绘制。",
    "To learn more about Filter/Effect layers, read {}Filter and Effects{}.":"要了解有关滤镜/效果层的更多信息，请阅读{}滤镜和效果{}。",
    "When the layer properties window opens it will also open the {}Tile Editing{} window, which shows the tile set being used (if you close this window by mistake, you can open it again from the {}Room {}&gt; {}Tile Editing{} menu at the top of the IDE). You can click {}&nbsp;on any tile to select it as the current {}brush {}and then draw them to the layer in the room editor by clicking {}&nbsp;on the room canvas, or, if you want to draw multiple tiles together you can select them as a group by clicking the left mouse {}&nbsp;and dragging to select them from the tileset before drawing. If the range of tiles that you want to draw together is not in a block, then you can hold down&nbsp;{}&nbsp;/&nbsp;{}&nbsp;and then select individual tiles using the left mouse button {}&nbsp;and create a custom brush that way (you can also remove tiles from a custom brush using {}&nbsp;+&nbsp;{}). Note that creating custom brushes this way is temporary and designed for one-off uses, however you can use the {}Editing Mode{} in the&nbsp;{}Brushes{}&nbsp;tab to create permanent brushes that will be stored in the tile set asset:":"当层属性窗口打开时，它还将打开{}图块编辑{}窗口，其中显示正在使用的图块设置(如果您错误地关闭了此窗口，您可以从IDE顶部的{}房间{}{}图块编辑{}菜单中再次打开它)。您可以单击任何图块上的{}将其选为当前的{}画笔{}，然后通过单击工作室画布上的{}将它们绘制到房间编辑器中的层，或者，如果要将多个图块绘制在一起，您可以在绘制之前通过单击鼠标左键{}并从图块集中拖动选择它们作为一组来选择它们。如果要一起绘制的图块范围不在块中，则可以按住{}/{}，然后使用鼠标左键{}选择各个图块并创建自定义画笔(也可以使用{}{}从自定义画笔中删除图块)。请注意，以这种方式创建自定义笔刷是临时的，仅供一次性使用，但您可以使用{}笔刷{}选项卡中的{}编辑模式{}来创建将存储在图块集资源中的永久笔刷：",
    "When you create a new background layer it does not have a sprite set by default and so&nbsp;{}GameMaker{}&nbsp;fills the layer with a solid colour instead (you can click the preview box to open the colour picker and change the colour used). When using a simple colour, none of the other layer settings are used in-game.":"创建新的背景层时，默认情况下它没有精灵设置，因此 {}GameMaker{} 会用纯色填充该层(您可以单击预览框打开颜色选择器并更改所使用的颜色)。当使用简单的颜色时，游戏中不会使用其他任何层设置。",
    "When you select the Line Tool, clicking {}&nbsp;then dragging and releasing will create a line of tiles between where you clicked and where you released. If you have an area of the tile map layer selected using the Selection Tool, then the line will only be added within the selection bounds. Lines can be drawn using a single tile brush, a composite brush of various tiles, or an animated tile from the library.":"选择线条工具时，单击{}，然后拖动并释放将在您单击的位置和释放的位置之间创建一条图块线条。如果使用选择工具选择了图块地图层的一个区域，则该线将仅添加到选择范围内。可以使用单个拼贴画笔、各种拼贴的复合画笔或库中的动画拼贴来绘制线条。",
    "When you select the Rectangle Tool, clicking {}&nbsp;then dragging and releasing will create a filled rectangle of tiles with the top left corner being where you click and the bottom right corner being where you release. If you have an area of the tilemap layer selected using the Section Tool, then the rectangle will only be added within the selection bounds. Rectangles can be drawn using a single tile brush, a composite brush of various tiles, or an animated tile from the library.":"当您选择矩形工具时，单击{}，然后拖动并释放将创建一个填充的矩形图块，左上角是您单击的位置，右下角是您释放的位置。如果使用截面工具选择了图块图层的一个区域，则该矩形将仅添加到选择范围内。可以使用单个拼贴画笔、各种拼贴的复合画笔或库中的动画拼贴绘制矩形。",
    "While placing assets on the asset layer they will snap to the grid snap values set at the top of the room editor for the grid, but if you want to place them freehand, simply switch off the grid or use the keys {}&nbsp;/&nbsp;{}&nbsp;and the left mouse button {}. While those keys are held down, you will be free to place the asset anywhere, without it snapping to the grid resolution.":"将资源放置在资源层上时，它们将捕捉到在房间编辑器顶部为网格设置的网格捕捉值，但如果您想要徒手放置它们，只需关闭网格或使用键{}/{}和鼠标左键{}。在按住这些键的同时，您可以自由地将资源放置在任何位置，而不会捕捉到栅格分辨率。",
    "With the eraser tool you can use the left mouse button {}&nbsp;to erase a given tile in the room editor. Essentially, all this does is set the tile index to 0, which is the reserved \"empty\" tile.":"使用橡皮擦工具，您可以使用鼠标左键{}擦除房间编辑器中的给定图块。实际上，所有这些操作都是将图块索引设置为0，即保留的\"空\"图块。",
    "With this tool you can enable/disable {}inheritance{} for specific tiles on a given layer. For this to work, the room must first be a child room and the layer must have it\u0027s inheritance switched {}on {}in the layer properties. When in this state, the room editor will colour all inherited tiles red by default, and clicking the right mouse button {}&nbsp;will switch off inheritance for that tile, and clicking the left mouse button {}&nbsp;will switch it back on again. In this way you can re-use elements from \"base\" rooms, only selectively changing the tiles that you require while inheriting all the rest.":"使用此工具，您可以为给定层上的特定图块启用/禁用{}继承{}。要实现这一点，房间必须首先是一个子房间，并且层的继承必须在层属性{}中{}打开。在此状态下，房间编辑器将默认将所有继承的图块涂成红色，单击鼠标右键{}将关闭该图块的继承，单击鼠标左键{}将重新打开它。通过这种方式，您可以重复使用\"基本\"房间中的元素，只需有选择地更改所需的图块，同时继承所有其余的图块。",
    "You can add a new Filter/Effect layer by clicking on the {}&nbsp;button. This will add the new layer, and then open up the asset layer properties window:":"您可以通过单击{} 按钮添加新的滤镜/效果层。这将添加新层，然后打开资源层属性窗口：",
    "You can add a new asset layer by clicking on the {}&nbsp;button. This will add the new layer, and then open up the asset layer properties window:":"您可以通过单击{}按钮来添加新的资源层。这将添加新层，然后打开资源层属性窗口：",
    "You can add a new background layer by clicking on the {}&nbsp;button. This will add the new layer, and then open up the background properties window:":"您可以通过单击{} 按钮来添加新的背景层。这将添加新层，然后打开背景属性窗口：",
    "You can add a new instance layer by clicking on the {}&nbsp;button. This will add the new layer, and then open up the instance properties window:":"您可以通过点击{} 按钮来添加新的实例层。这将添加新层，然后打开实例属性窗口：",
    "You can add a new path layer by clicking on the {}&nbsp;button. This will add the new layer, and then open up the path properties window:":"您可以通过单击{}按钮来添加新的路径层。这将添加新层，然后打开路径属性窗口：",
    "You can add a new {}tile map{} layer by clicking on the {}&nbsp;button. This will add the new layer, and then open up the {}Tile Map Layer Properties{} window and the {}Tile Editing&nbsp;{}window:":"您可以通过单击{}按钮添加新的{0}图块地图{1}层。这将添加新的层，然后打开{}图块地图层属性{}窗口和{}图块编辑{}窗口：",
    "You can create Single-Layer FX using&nbsp;{}The Inspector{}.":"您可以使用{}检查器{}创建单层FX。",
    "{}An asset layer contains graphical assets (sprites, sequences and particle systems) that are placed into the room independently of instances, and you can place them by either dragging them in from the {}Asset Browser{} or by selecting the one you want in the Asset Browser and then using {}&nbsp;+ {}&nbsp;to \"paint\" them. Sprite assets are similar to tiles, only they can be fully animated - if the sprite used has sub-images they will be shown - without the restrictions that are in place for tiles, ie: they aren\u0027t forced to a grid and animations can be any length and speed. Sequences are \"collections\" of sprites, sounds and instances that will play when the room is entered. Particle systems contain emitters that \"emit\" particles according to predefined formulas which results in an animation.":"{}资源层包含独立于实例放置到房间中的图形资源(精灵、序列和粒子系统)，您可以通过将它们从{}资源浏览器{}拖入其中，或通过在资源浏览器中选择所需资源，然后使用 {}+{} 对其进行绘制来放置它们。精灵资源类似于图块，只是它们可以完全动画-如果使用的精灵有子图像，它们将被显示-没有图块的限制，即：它们不会强制到网格，动画可以是任何长度和速度。序列是当进入房间时将播放的精灵、声音和实例的\"集合\"。粒子系统包含发射器，这些发射器根据预定义的公式发射粒子，从而生成动画。",
    "{}An asset layer is simply a graphical asset (sprite or sequence) that has been placed into the room independently of instances, and you can place them by either dragging them in from the {}Asset Browser{} or by selecting the one you want in the Asset Browser and then using {}&nbsp;+ {}&nbsp;to \"paint\" them. Sprite assets are similar to tiles, only they can be fully animated - if the sprite used has sub-images they will be shown - without the restrictions that are in place for tiles, ie: they aren\u0027t forced to a grid and animations can be any length and speed. Sequences are \"collections\" of sprites, sounds and instances that will play when the room is entered.":"{}资源层只是一个独立于实例放置到房间中的图形资源(精灵或序列)，您可以通过将它们从{}资源浏览器{}拖入其中，或通过在资源浏览器中选择所需资源，然后使用{}+{} 对它们进行绘制来放置它们。精灵资源类似于图块，只是它们可以完全动画-如果使用的精灵有子图像，它们将被显示-没有图块的限制，即：它们不会强制到网格，动画可以是任何长度和速度。序列是当进入房间时将播放的精灵、声音和实例的\"集合\"。",
    "{}Assets{}{}Assets{}":"{}资源{}{}资源{}",
    "{}AutoTile{}":"{}自动图块{}",
    "{}Backgrounds{}{}Backgrounds{}":"{}背景{}{}背景{}",
    "{}By default the instance will have a name like \"{}inst_38B0BFF{}\", but this can be changed to anything you want as long as the name uses only alpha-numeric characters and the under-bar \"_\" (and no spaces). However it\u0027s worth noting that the name given here (whether it\u0027s one you give, or the default one that the IDE gives) is considered a {}constant{}&nbsp;and so {}must be {}unique {}to the instance{}. This also means that it can be used in code n your game to identify the instance, but only if you are in the same room as the instance.":"{}默认情况下，实例的名称类似于\"{}Inst_38B0BFF{}\"，但只要名称仅使用字母数字字符和下划线\"_\"(且没有空格)，就可以将其更改为您想要的任何名称。然而，值得注意的是，此处给出的名称(无论是您给出的名称，还是IDE给出的默认名称)被认为是一个{}常量{} ，因此{}对于实例{}必须是{}唯一的{}。这也意味着可以在游戏代码中使用它来标识实例，但前提是您与实例在同一个房间内。",
    "{}Eraser{}":"{}橡皮擦{}",
    "{}Fill{}":"{}填充{}",
    "{}Filter/Effect{}{}Filter/Effect{}":"{}滤镜/效果{}{}滤镜/效果{}",
    "{}Flip{}":"{}翻转{}",
    "{}From here you can give the asset a unique name, set whether it is to inherit from the parent room, or change the sprite or sequence that you want it to display. For sequeunces, you can set the animation speed and the initial&nbsp;{}playhead{}&nbsp;frame, as well as the colour to blend with it (white by default) and the position in the room.&nbsp;You can change the characteristics of sprite assets too, setting a colour to blend it with (white by default), or rotating and flipping it. You can also scale sprites along either or both the axis, and set their position within the room. If the sprite has sub-images, you can choose the animation speed as well as set the initial frame to be shown.":"{}您可以在此处为资源指定唯一的名称，设置是否从父房间继承，或更改您希望其显示的精灵或序列。对于保留效果，您可以设置动画速度和初始 {}播放头{} 帧，以及要与之混合的颜色(默认情况下为白色)以及在房间中的位置。 您还可以更改精灵资源的特征，将其设置为与之混合的颜色(默认情况下为白色)，或旋转和翻转。您还可以沿其中一个或两个轴缩放精灵，并设置它们在房间内的位置。如果精灵有子图像，您可以选择动画速度以及设置要显示的初始帧。",
    "{}From here you can give the asset a unique name, set whether it is to inherit from the parent room, or change the sprite, sequence or particle system that you want it to display. For sequences, you can set the animation speed and the initial&nbsp;{}playhead{}&nbsp;frame, as well as the colour to blend with it (white by default) and the position in the room.&nbsp;You can change the characteristics of sprite assets too, setting a colour to blend it with (white by default), or rotating and flipping it. You can also scale sprites along either or both the axis, and set their position within the room. If the sprite has sub-images, you can choose the animation speed as well as set the initial frame to be shown. Finally, for particle systems, you can also set the blend colour and the rotation of the entire particle system.":"{}您可以在此处为资源指定唯一的名称，设置它是否继承自父房间，或更改您希望其显示的精灵、序列或粒子系统。对于序列，您可以设置动画速度和初始{}播放头{}帧，以及要与其混合的颜色(默认情况下为白色)以及在房间中的位置。您还可以更改精灵资源的特征，将其设置为与之混合的颜色(默认情况下为白色)，或旋转和翻转。您还可以沿其中一个或两个轴缩放精灵，并设置它们在房间内的位置。如果精灵有子图像，您可以选择动画速度以及设置要显示的初始帧。最后，对于粒子系统，还可以设置整个粒子系统的混合颜色和旋转。",
    "{}Here you can open the layer properties window for the selected layer, delete the layer, rename the layer, or add a {}sub layer{}. If you choose to add a sub layer, the new layer will be created under it, tabbed to the right. You can then choose to have the sub layer inherit its properties from the parent layer, and also set whether it should inherit the visibility from the parent layer.":"{}您可以在此打开所选层的层属性窗口、删除层、重命名层或添加{}子层{}。如果选择添加子层，则会在子层下创建新层，并将其放置在右侧的选项卡中。然后，可以选择让子层继承父层的属性，还可以设置子层是否应该继承父层的可见性。",
    "{}Here you can reverse the path direction (this will have little visible effect, but reverses the order in which the path points are counted so the start point becomes the end point and vice-versa), as well as flip them horizontally or vertically. You can also delete the selected point from this menu. Note that you can hold down \"{}T{}\", \" {}S{}\" or \"{}R{}\" then click {}&nbsp;and drag to translate, scale or rotate the entire path.":"{}在这里，您可以反转路径方向(这几乎没有什么可见的效果，但颠倒了计算路径点的顺序，使起点成为终点，反之亦然)，以及水平或垂直翻转它们。您还可以从此菜单中删除选定点。请注意，您可以按住\"{}T{}\"、\"{}S{}\"或\"{}R{}\"，然后单击{} 并拖动以平移、缩放或旋转整个路径。",
    "{}Here you can select the path from the Asset Browser to use for the layer and then change the defined connection type (either using {}smooth interpolation{}&nbsp;or straight), as well as whether it is closed or not and the precision with which the path should be created. Note too that you can toggle the {}inheritance{} here, and that you can set the path to be a specific colour (default is red) to make seeing them better in the editor. If you have no path resource defined, you can click the {}New {}button to create one. Path layers also have a depth value associated with them (locked by default) even though nothing is actually {}rendered{} in your game when using them.":"{}在此处，您可以从资源浏览器中选择要用于层的路径，然后更改定义的连接类型(使用{}平滑插值法{}或直线)，以及它是否闭合以及创建路径的精度。还请注意，您可以在此处切换{}继承{}，并且可以将路径设置为特定的颜色(默认为红色)，以便在编辑器中更好地看到它们。如果您尚未定义路径资源，则可以单击{}新建{}按钮来创建路径资源。路径层也有一个与其关联的深度值(默认情况下锁定)，即使在使用它们时游戏中实际上没有任何东西被{}渲染{}。",
    "{}In the {}Tile Map Layer Properties{} you can toggle the inheritance for the layer, change the tile set that is being used and set the x or y offset for the layer if you want the layer grid to not align exactly with the (0, 0) position of the room. You can also set the depth that the layer should be {}rendered{} at (which has it\u0027s own unique inheritance button) and you can \"lock\" this depth too, which will prevent any further editing after it has been created.":"{}如果希望层网格不与房间的(0，0)位置完全对齐，则可以在{}图块地图层属性{}中切换层的继承，更改正在使用的图块集并设置层的x或y偏移量。你也可以设置这个层应该被{}渲染{}的深度(它有自己独特的继承按钮)，你也可以\"锁定\"这个深度，这将阻止在它被创建之后的任何进一步的编辑。",
    "{}Inheritance{}":"{}继承{}",
    "{}Instances{}{}Instances{}":"{}实例{}{}实例{}",
    "{}Layer Types And Properties{}":"{}图层类型和属性{}",
    "{}Line{}":"{}线{}",
    "{}Mirror{}":"{}镜像{}",
    "{}Paths{}{}Paths{}":"{}路径{}{}路径{}",
    "{}Pencil{}":"{}铅笔{}",
    "{}Rectangle{}":"{}矩形{}",
    "{}Rotate{}":"{}旋转{}",
    "{}Selection{}":"{}选择{}",
    "{}The image above shows the layer editor, with the current layers being listed at the top, and the different buttons for creating layers at the bottom. You can rename any layer from this editor by doing a slow double click on the name (note that you cannot use anything except letters numbers and the underbar \"_\" character for names) and you can also switch its visibility on or off by clicking the eye icon {}. If the room has inherited layers from a parent room, you can toggle the inheritance from the button at the bottom, but note that this will affect all layers (see {}here{} for more information on inheritance). You can also use {}&nbsp;or {}&nbsp;/&nbsp;{} and left click {}&nbsp;on multiple layers to select them for duplication or deletion (these options are also available from the right mouse {}&nbsp;menu).":"{}上图显示了层编辑器，当前层在顶部列出，用于创建层的不同按钮在底部。您可以通过在名称上缓慢地双击来重命名此编辑器中的任何层(请注意，您不能使用除字母、数字和下划线\"_\"字符以外的任何名称)，您还可以通过单击眼睛图标{}来打开或关闭其可见性。如果房间继承了父房间的层，您可以通过底部的按钮切换继承，但请注意，这将影响所有层(有关继承的更多信息，请参阅{}此处{})。您也可以使用{}或{}/{}，然后在多个层上左键单击{}以选择要复制或删除的层(这些选项也可以从鼠标右键{}菜单中选择)。",
    "{}The image above shows the layer editor, with the current layers being listed at the top, and the different buttons for creating layers at the bottom. You can rename any layer from this editor by doing a slow double click on the name (note that you cannot use anything except letters numbers and the underbar \"_\" character for names) and you can also switch its visibility on or off by clicking the eye icon {}. If the room has inherited layers from a parent room, you can toggle the inheritance from the button at the bottom, but note that this will affect all layers (see&nbsp;{}Room Inheritance{}&nbsp;for more information on inheritance). You can also use {}&nbsp;or {}&nbsp;/&nbsp;{} and left click {}&nbsp;on multiple layers to select them for duplication or deletion (these options are also available from the right mouse {}&nbsp;menu).":"{}上图显示了层编辑器，当前层在顶部列出，用于创建层的不同按钮在底部。您可以通过在名称上缓慢地双击来重命名此编辑器中的任何层(请注意，您不能使用除字母、数字和下划线\\\"_\\\"字符以外的任何名称)，您还可以通过单击眼睛图标{}来打开或关闭其可见性。如果房间继承了父房间的层，您可以通过底部的按钮切换继承，但请注意，这将影响所有层(有关继承的更多信息，请参阅{}房间继承{})。您也可以使用{}或{}/{}，然后在多个层上左键单击{}以选择要复制或删除的层(这些选项也可以从鼠标右键{}菜单中选择)。",
    "{}This means that all \"affected\" layers will have the selected filter applied to them (here, \"Desaturate\") as they are below an FX layer. Any layers above the FX layer will remain unaffected.":"{}这意味着所有\"受影响\"的层都将应用选定的滤镜(这里是\"去饱和化\")，因为它们位于FX层之下。FX层上方的任何层都将保持不受影响。",
    "{}This window simply shows a list of all the instances that are currently on the layer. You can add more instances to a layer by opening up the {}Asset Browser{} and then dragging objects from there into the room, or alternatively you can select an instance from the Asset Browser and then press and hold {}&nbsp;to preview the resource \"in-situ\", and if you additionally click the left mouse button {}&nbsp;you can add the instance and even \"paint\" it into the room layer by maintaining the button pressed and moving the mouse.":"{}此窗口仅显示当前层上的所有实例的列表。您可以通过打开{}资源浏览器{}并将对象从其中拖动到房间来向层添加更多实例，或者也可以从资源浏览器中选择一个实例，然后按住{} 以\"就地\"预览资源，如果另外单击鼠标左键{} ，则可以添加实例，甚至通过按住按钮并移动鼠标将其\"绘制\"到房间层中。",
    "{}Tile Maps{}{}Tile Maps{}":"{}图块地图{}{}图块地图{}",
    "{}{}IMPORTANT{}{}&nbsp;There is a minimum and maximum layer depth of -16000 to 16000. Anything placed on a layer outside that range will not be drawn although all events will still run as normal for anything on the layer.":"{}{}重要{}{} 有一个最小和最大的层深在-16000到16000之间。放置在该范围之外的层上的任何内容都不会被绘制，尽管该层上的所有事件仍将正常运行。",
    "{}{}NOTE{}{}&nbsp;In the actual editor window where you place the different assets on their layers, you can hold down \"{}P{}\" + click anywhere to instantly select an asset and skip to the layer that it has been placed on.":"{}{}注意{}{} 在放置不同资源的实际编辑窗口中，您可以按住\"{}P{}\"并在任意位置单击，以立即选择资源并跳到已放置该资源的层。"
}