{
    "An important thing to note when using this function is that it grants you certain permissions for that file, for the duration of your game. So, once you get the file path from the user, you can access it again and again without having to ask. However, since this function is for reading a file, the permissions granted are {}only for reading{} and saving will not be permitted by the OS. Should you need to read and write to the file, you can get permission using the function {}{}get_save_filename(){}{}.":"在使用此函数时需要注意的一点是，它授予您在游戏期间对该文件的某些权限。因此，一旦您从用户那里获得了文件路径，您就可以一次又一次地访问它，而不必询问。但是，由于此函数用于读取文件，所以授予的权限{}仅用于读取{} ，操作系统不允许保存。如果需要读写文件，可以使用函数{}{} get_save_filename(){}{}获得权限。",
    "The above code will ask the user to select a text file for opening and then check the returned file name and path, and if it exists will open the file for reading.":"上面的代码将要求用户选择一个文本文件打开，然后检查返回的文件名和路径，如果它存在将打开文件读取。",
    "The file type filter and/or name.":"文件类型筛选器和/或名称。",
    "The suggested filename to use.":"建议使用的文件名。",
    "This function opens a dialogue and asks the player for a filename to open with the given filter. The filter has the form \"{}name1|mask1|name2|mask2|...{}\", where the mask may contain the different options with a semicolon between them and you can also use a \"*\" to mean any string. For example: \"{}bitmaps|*.bmp;*.wmf{}\", would ask the user to select the name of a bitmap file from the system, but only those that have the two specified extensions ({}bmp{} and {}png{}). this function does {}not{} open the file itself! It only returns a string with the full name and path of the file. If the user presses \"{}Cancel{}\" an empty string \"\" is returned.":"这个函数打开一个对话框，要求玩家用给定的过滤器打开一个文件名。过滤器的形式是\"{}name1|mask1|name2|mask2|…\"{}\"，其中掩码可以包含不同的选项，它们之间用分号分隔，您也可以使用\"*\"表示任何字符串。例如:\"{}位图|*.bmp;Wmf{}\"，会要求用户从系统中选择位图文件的名称，但只能选择那些具有两个指定扩展名({}bmp{}和{}png{})的位图文件。这个函数{}不会{}打开文件本身!它只返回一个包含文件全名和路径的字符串。如果用户按\"{}取消{}\"，则返回空字符串\"\"。",
    "{}NOTE{}: This function is only valid on the Windows and macOS targets.":"{}注意{} : 此函数仅对 Windows 和 macOS 目标有效。"
}