{
    "Before calling any of the stats functions listed below, you must make sure that the user is logged in (see the User functions listed above) then setup the stats system and add the user to it using these functions:":"在调用下面列出的任何统计函数之前，你必须确保用户已经登录(参见上面列出的用户函数)，然后设置统计系统，并使用以下函数将用户添加到其中:",
    "The following functions are used with the 2013 (Event-Based) Stats system:":"2013 统计系统使用以下功能:",
    "The following functions are used with the 2017 (Title-Managed) Stats system:":"2017(标题管理)统计系统使用了以下功能:",
    "Xbox One Stats (achievements and leaderboards) are functional when using UWP and have some special functions for dealing with them, although they also use some of the standard built-in functions for leaderboards. The 2017 Xbox Live stats system simplifies the whole procedure for making achievements and leaderboards, permitting you to create and use the different systems from within {}GameMaker{}. The main difference between the 2017 (Title-Managed) system and previous systems is that you no longer have to define all of the stats you use in game on the Partner Center, and you do not need to tie achievement unlocking to a stat event/rule either (as they are unlocked by a direct function call instead).":"Xbox One的统计数据(成就和排行榜)在使用UWP时是有功能的，并且有一些处理它们的特殊功能，尽管它们也使用了一些用于排行榜的标准内置功能。2017年Xbox Live统计系统简化了制作成就和排行榜的整个过程，允许你在{}GameMaker{}中创建和使用不同的系统。2017年(标题管理)系统与之前系统的主要区别是，你不再需要在伙伴中心上定义你在游戏中使用的所有统计数据，你也不需要将成就解锁与统计事件/规则绑定(因为它们是通过直接函数调用解锁的)。",
    "{}NOTE{}&nbsp;Although there is no manifest file required with this system, you can still set up some stats on XDP/Partner Center. Ones setup there will be considered {}featured stats{} which means you can have global leaderboards and the stats turn up on the games dashboard page. For more information, please see&nbsp;{}this article from Microsoft{}.":"{}注意{}虽然该系统不需要清单文件，但您仍然可以在XDP/Partner Center上设置一些统计信息。其中一个设置将被认为是{}特征统计{}，这意味着你可以拥有全局排行榜和统计出现在游戏仪表盘页面上。有关更多信息，请参阅来自Microsoft{}的&nbsp;{}这篇文章。",
    "{}xboxlive_stats_setup{}{}&nbsp;(For Event-Based (2013) stats only){}":"{}xboxlive_stats_setup{}{} (仅针对基于事件的统计(2013)){}"
}