{
    "Finally there is the option to set the size of the {}texture page{}. The default (and most compatible) size is 2048x2048, but you can choose from anywhere between 256x256 up to 8192x8192.&nbsp;There is also a button marked {}{}Preview&nbsp;{}{}which will generate the texture pages for this platform and then open a window so that you can see how they look. This can be very useful if you wish to see how the texture pages are structured and to prevent having texture pages larger (or smaller) than necessary. For more information on texture pages, please see {}here{}.":"最后，可以选择设置{}纹理页面{}的大小。默认（最兼容）大小为2048 x 2048，但您可以在256 x 256和8192 x 8192之间的任意位置进行选择。还有一个标记为{}{}预览{}{}的按钮，它将生成此平台的纹理页面，然后打开一个窗口，以便您可以看到它们的外观。如果希望了解纹理页面的结构以及防止纹理页面大于或小于所需的页面，这将非常有用。有关纹理页面的详细信息，请参阅{}此处{}。",
    "GX.games Game Options":"GX.games 游戏选项",
    "Game Options":"游戏设置",
    "General":"常规",
    "Graphics":"图形",
    "The GX.games Game Options allow you to modify the properties for your&nbsp;game. The following sections are provided:":"Gx.games 游戏选项允许您修改游戏的属性。它提供了以下部分：",
    "You then have the following options:":"然后，您可以选择以下选项：",
    "{}Display cursor{}: Controls whether the mouse cursor is&nbsp;visible when your game starts. Useful for games that don\u0027t require mouse input or use a {}custom mouse sprite{}.":"{}显示光标{} : 控制游戏开始时鼠标光标是否可见。对于不需要鼠标输入或使用{}自定义鼠标精灵{}的游戏非常有用。",
    "{}Edit Game on Opera{}: This opens GX.games DevCloud and takes you to your game\u0027s \"Game details\" page. This is only clickable when you\u0027re logged in and your game is uploaded.":"{}在 Opera 上编辑游戏{} : 这将打开 GX.games DevCloud 并进入“游戏详细信息”页面。只有当你登录并且你的游戏已经上传后才可点击。",
    "{}Game Name{}: This is your game\u0027s name (title) on GX.games.{} {} {}IMPORTANT{}&nbsp;In order for the upload to GX.games to succeed, it\u0027s important that you only use allowed characters in the game\u0027s name (which, by default, is set to your GameMaker project\u0027s name, so make sure to either choose a valid project name or change the game\u0027s name manually afterwards).{} {} If you upload a game with a title that has forbidden characters, you will get this error:&nbsp;{}{}Incorrect Data. Check the output{}{}{} {} The allowed characters are: {} {}a-z, A-Z (with a support of local schemas such as å){} {}0-9{} {}whitespace{} {}: - ! ? . , \u0027 &amp; ( ){} {} ":"{}游戏名称{}：这是你的游戏在上传到 Gx.games 上时游戏的名称（标题）。{}{}{}IMPORTANT{} 为了成功上传到 Gx.games，请务必只在游戏名称中使用允许的字符(默认情况下，该字符设置为 GameMaker 项目的名称，因此请确保选择有效的项目名称，或者稍后手动更改游戏名称)。{}{}如果您上传的游戏标题中包含禁止使用的字符，则会出现以下错误：{}{}Incorrect Data. Check the output{}{}{}{}允许的字符包括：{}{}a-z、A-Z（支持方言字母，例如å）{}{}0-9{}{}空白区域{}{}: - ! ? . , \u0027 ; ( ) {}{}",
    "{}Here you can change the following details related to how your game will be displayed:":"{}这里您可以更改下列与游戏显示方式相关的细节:",
    "{}Internal Share URL{}: This opens the private version of your game, only when it has been enabled on GX.games DevCloud.":"{}私人分享 URL{} : 这将打开您的游戏的私有版本，只有当它已经在 GX.games DevCloud 上启用时才能点击。",
    "{}Interpolate colours between pixels{}: Turns on {}linear interpolation{}, which basically \"smooths\" pixels. For crisp pixel graphics, it should be off, but if you have nice alpha blends and smoothed edged graphics it is better left on. This is on&nbsp;by default.":"{}在像素之间插入颜色{} : 打开{}线性插值{} ，基本上是“平滑”像素。对于清晰的像素图形，它应该关闭，但如果你有很好的Alpha混合和平滑的边缘图形，它最好开启。这是默认开启的。",
    "{}Next Version:{}&nbsp;This is the version number used for your next GX.games upload. You can only change this after your game has been uploaded to GX.games. You do not need to modify this manually for each upload, as GameMaker will automatically increment the last digit of the version number for you.":"{}下一版本：{}这是用于下一次 Gx.games 上传的版本号。您只能在游戏上传到 Gx.games 后才能更改此设置。您不需要为每次上传手动修改此内容，因为 GameMaker 将自动递增版本号的最后一位。",
    "{}Public Share URL{}: This opens the public version of your game, only when it has been enabled on GX.games DevCloud.{} {} Both of these URLs can be shared with others to allow them to play your game. ":"{}公共分享 URL {} : 这将打开您的游戏的公共版本，只有在 GX.games DevCloud 上启用时才会打开。{}这两个 URL 都可以与其他人共享，以允许他们玩你的游戏。",
    "{}Register on GX.games{}: Click on this button to register a new entry on GX.games. This is only valid when \"{}Select game{}\" is set to \"{}New game{}\".":"{}在 Gx.games 上注册{}：单击此按钮可在 Gx.games 上注册一个新的游戏条目。仅当“{}选择游戏{}”设置为“{}新游戏{}”时，此选项才有效。",
    "{}Scaling{}: Your game can be configured to scale the draw canvas automatically to {}maintain the aspect ratio {}within the browser, or you can select to have it run {}full scale{}. The full scale option will not full screen the game in the browser, but rather stretch what is drawn to fit the canvas size, as defined by the first room of the game.&nbsp;This is set to keep aspect ratio&nbsp;by default.":"{}缩放比例{}：您的游戏可以配置为自动缩放绘图画布以{}在浏览器中保持纵横比{}，或者您可以选择使其运行{}满比例{}。满比例选项将不会在浏览器中完全显示游戏，而是拉伸绘制的内容以适应画布大小，如游戏第一个房间所定义的画布。默认情况下，此选项设置为保持纵横比。",
    "{}Select game{}: From this list, you can either select an existing game to update, or choose to upload a new game.":"{}选择游戏{}：从此列表中，您可以选择要更新的现有游戏，或者选择上传新游戏。",
    "{}Select group{}: Before uploading a new game, you can select the studio that the game will belong to.":"{}选择组{} : 在上传新游戏之前，您可以选择游戏所属的工作室。",
    "{}This window shows your GX.games sign-in status. You can click on the&nbsp;{}&nbsp;Refresh icon to log in using your Opera account.":"{}此窗口显示您的 Gx.games 登录状态。您可以单击{}刷新图标以使用 Opera 帐户登录。",
    "{}Version{}: This is the version of the game that was last uploaded. You can only change this field before your game has been uploaded to GX.games.":"{}版本{}：这是上次上传的游戏版本。您只能在游戏上传到 Gx.games 之前更改此字段。"
}