{
    "Allow flipped landscape&nbsp;orientation":"允许翻转横向方向",
    "Allow flipped portrait&nbsp;orientation":"允许翻转纵向方向",
    "Allow landscape&nbsp;orientation":"允许横向",
    "Allow portrait&nbsp;orientation":"允许纵向",
    "Check if CocoaPods is installed, if it isn\u0027t,&nbsp;{}GameMaker{} will install it.":"检查CocoaPods是否安装，如果没有，{}GameMaker{}将安装它。",
    "Check if the Podfile and Podfile.lock files exist and create them if not.&nbsp;These files are required if you are adding CocoaPods to an {}iOS extension{} using the {}Extension Editor{}. The files contain specific,&nbsp;pre-generated macros required by {}GameMaker{} to setup any listed CocoaPods when building your game.":"检查Podfile和Podfile.lock文件是否存在，如果不存在则创建它们。如果使用{}扩展编辑器{}将CocoaPods添加到{}iOS扩展{}，则需要这些文件。这些文件包含{}GameMaker{}在构建游戏时设置任何列出的CocoaPods所需的特定预生成宏。",
    "Execute the {}pod install{} command.":"执行{}pod install{}命令。",
    "Finally there is the option to set the size of the {}texture page{}. The default (and most compatible) size is 2048x2048, but you can choose from anywhere between 256x256 up to 8192x8192.&nbsp;There is also a button marked {}Preview {}which will generate the texture pages for this platform and then open a window so that you can see how they look. This can be very useful if you wish to see how the texture pages are structured and to prevent having texture pages larger (or smaller) than necessary. For more information on texture pages, please see {}here{}.":"最后，可以选择设置{}纹理页面{}的大小。默认（最兼容）大小为2048 x 2048，但您可以从256 x 256和8192 x 8192之间的任意位置进行选择。还有一个标记为{}预览{}的按钮，它将生成此平台的纹理页面，然后打开一个窗口，以便您可以看到它们的外观。如果希望了解纹理页面的结构以及防止纹理页面大于或小于所需的页面，这将非常有用。有关纹理页面的详细信息，请参阅{}此处{}。",
    "Finally, you have the option to generate a&nbsp;{}Podfile{}&nbsp;and a&nbsp;{}Podfile.lock{}. These files are required if you are adding CocoaPods to an {}iOS extension{} using the {}Extension Editor{}. The files contain specific macros required by {}GameMaker{} to setup any listed CocaoPods when building your game. Clicking the buttons will create the files with the macros pre-generated, and also open a file explorer on the location of the files, should you wish to manual edit them. There is also a button that will take you to the following&nbsp;guide:":"最后，您可以选择生成{} Podfile {}和{} Podfile.lock {}。如果使用{}扩展编辑器{}将 CocoaPods 添加到{} iOS 扩展{} ，则需要这些文件。文件包含特定的宏所需的{}Gamemaker{}设置任何列出的CocoaPods时，构建您的游戏。单击这些按钮将创建带有预生成宏的文件，如果您希望手动编辑这些文件，还可以打开文件资源管理器中的文件位置。还有一个按钮可以带你到下面的指南:",
    "Flipped Landscape":"横向翻转",
    "Flipped Portrait":"竖向翻转",
    "General":"常规",
    "Graphics":"图形",
    "Icons":"图标",
    "Images":"图像",
    "It is worth noting that {}GameMaker{} has a {}Project Image Generator{} tool which can be used to automatically create all the images required for all the different target platforms your game is being compiled to. If you use this tool, you should revise the images created to ensure that they are what you require. The tool will generate Icons as well as Images (see the section below).":"值得注意的是，{} GameMaker {}有一个{}项目图像生成器{}工具，可用于自动创建所有不同目标平台所需的图像。如果您使用这个工具，您应该修改所创建的图像，以确保它们是您所需要的。该工具将生成图标以及图像(见下一节)。",
    "Landscape":"横向",
    "Lastly, you can {}Enable broadcast networking{}. When enabled,&nbsp;{}GameMaker{}&nbsp;will add the multicast entitlement ({}com.apple.developer.networking.multicast{}) to broadcast or multicast messages that you send in your game.":"最后，您可以{}启用广播网络{}。启用后，{}GameMaker{}将向您在游戏中发送的广播或多播消息添加多播权限({}com.apple.developer.networking.multicast{})。",
    "Next, there is the {}{}{}CocoaPods{} checkbox. Check it to automatically let&nbsp;{}GameMaker{}&nbsp;use the {}CocoaPods{} dependency manager. When enabled,&nbsp;{}GameMaker{} will perform the following steps&nbsp;on building your project:":"接下来是{}{}{}CocoaPods{}复选框。选中它可以自动让{}GameMaker{}使用{}CocoaPods{}依赖管理器。启用后，{}GameMaker{}将在构建项目时执行以下步骤：",
    "Next, you can check or un-check the option to {}Defer Home Indicator Output{}. When this is checked, the home bar will always be shown at low a alpha, and the first swipe wakes the bar and the second swipe takes you home. If the option is un-checked, then the bar is not shown in-game, but the first edge swipe will take you home. Default is un-checked.":"接下来，可以选中或取消选中{}延迟主指示器输出{}的选项。选中此选项后，主栏总是显示为低 alpha 值，第一次滑动会唤醒主栏，第二次滑动会带您回家。如果选项未选中，那么游戏中将不显示条形图，但是第一次边缘滑动将带您回到主页。默认为取消勾选。",
    "Portrait":"竖向",
    "The following&nbsp;guide contains more information&nbsp;on using CocoaPods, including manual installation and creation of the Podfile and Podfile.lock files:&nbsp;":"以下指南包含有关使用CocoaPods的更多信息，包括手动安装和创建Podfile和Podfile.lock文件：",
    "The second thing to do is fill in the {}Build Settings{} for your game. To start with you set the allowed&nbsp;{}Orientation{}s that your game can be run on for the best user experience. The available options are:":"第二件事是填写游戏的{}构建设置{}。首先，您可以设置游戏可以运行的允许{}方向{}，以获得最佳用户体验。可用选项包括：",
    "The second thing to do is fill in the {}Product Information{} about your game, including its {}Display Name{}, its {}Bundle ID{} and the {}Version{} info. Note that the Bundle ID must be in the correct reverse URL format for the final build of the game to work correctly, EG: {}com.[Company].[GameName]{}. Here you can also give the {}Team Identifier{} that you wish to use for signing the final application that {}GameMaker{} creates for you. Setting it here will override the Team ID that you have supplied in the {}iOS Preferences{}.":"要做的第二件事是填写有关游戏的{}产品信息{} ，包括其{}显示名称{}、其{}Bundle ID {}和{}版本{}信息。注意，要使游戏的最终版本正确工作，包 ID 必须采用正确的反向 URL 格式，例如: {}com.[公司名].[游戏名]{}。这里还可以提供您希望用于为{} GameMaker {}为您创建的最终应用程序签名的{}团队标识符{}。在此处设置它将重写在{} iOS 首选项{}中提供的团队 ID。",
    "This section outlines the different options available to you that control how your iOS game projects will be compiled. The different sections are:":"本节概述了可用于控制如何编译您的 iOS 游戏项目的不同选项。不同的章节是:",
    "You can also set how the launch screen should be displayed from the following options:":"您还可以通过以下选项设置启动屏幕的显示方式:",
    "You can check or uncheck the option to {}Defer Home Indicator Output{}. When this is checked, the home bar will always be shown at a low alpha, and the first swipe wakes the bar and the second swipe takes you home. If the option is unchecked, then the bar is not shown in-game, but the first edge swipe will take you home. Default is unchecked.":"您可以勾选或取消勾选{}延迟主指示器输出{}选项。勾选此选项后，主栏将始终以低alpha显示，第一次滑动将唤醒主栏，第二次滑动将带您回家。如果未勾选此选项，则主栏不会在游戏中显示，但第一次边缘滑动将带您回家。默认为未勾选。",
    "You can then go to the {}Device Support{} section, with the following options available for setting what type of device to target:":"然后您可以转到{}设备支持{}部分，该部分有下列选项可用于设置目标设备的类型:",
    "You can then go to the {}Device Support{} section, with the following options available for the types of device to target:":"然后，您可以转到{}设备支持{}部分，其中包含针对目标设备类型的以下选项：",
    "iOS&nbsp;Game Options":"iOS 游戏选项",
    "{}Both{}: Both iPhone/iPod and iPad":"{}Both{}: iPhone/iPod 和 iPad",
    "{}Crop To Fit{}: This will keep the image 1:1 with the device screen and crop (or pad) the edges as required.":"{}裁剪至适合{} : 这将使图像与设备屏幕保持1:1，并根据需要裁剪(或填充)边缘。",
    "{}Half iPad 1 Textures:{} The iPad 1 has much less texture memory than more recent devices so you can enable this option to reduce the size of textures by half if you want to target this device or get maximum compatibility.":"{}半个 iPad 1的纹理{}: 与最新的设备相比，iPad 1的纹理内存要少得多，所以如果你想要针对这个设备或者获得最大的兼容性，你可以使用这个选项将纹理的大小减少一半。",
    "{}Here you can change the following details related to how your game will be displayed, with the following options available:":"{}这里您可以使用下列选项更改与游戏显示方式相关的下列详细信息:",
    "{}Interpolate colours between pixels{}: Turns on {}linear interpolation{}, which basically \"smooths\" pixels. For crisp pixel graphics, it should be off, but if you have nice alpha blends and smoothed edged graphics it is better left on. This is off by default.{}{}":"{}像素间插值颜色{}：启用{}线性插值{}，基本上是“平滑”像素。对于清晰的像素图形，它应该处于禁用状态，但如果您有漂亮的Alpha混合和平滑的边缘图形，则最好保持启用状态。默认情况下，此选项处于禁用状态。{}{}",
    "{}Keep Aspect Ratio{}: This will maintain the aspect ratio of the image compared to the device screen, adding \"padding\" around the edges where required.":"{}保持长宽比{} : 这将保持图像与设备屏幕的长宽比，在需要的地方边缘添加“填充”。",
    "{}NOTE{} On importing an older project you may be presented with the following warning:{}This comes up because the current iOS target version has changed the format of the required icons since the project was previously loaded. You will be required to re-create all the icons, as they will have been replaced with the generic {}GameMaker{} icons (you can use the above mentioned Project Image Generator tool to do this quickly).":"{}注意{}在导入较旧的项目时，可能会出现以下警告: {}这是因为当前 iOS 目标版本已经更改了所需图标的格式，因为该项目以前已经加载。您将被要求重新创建所有的图标，因为它们将被替换为通用的{} GameMaker {}图标(您可以使用上面提到的项目图像生成器工具来快速完成)。",
    "{}NOTE{}: Be aware that the larger the size of the texture page, the less compatible your game will be with different browsers and devices.":"{}注意{}：请注意，纹理页面越大，您的游戏的兼容性就越低。",
    "{}Scaling{}: Here you can select to scale the draw canvas maintaining the aspect ratio within the device screen - adding \"padding\" around the edges to fit the screen - or you can select to have the draw canvas stretched to fit the device screen.":"{}缩放{} : 在这里你可以选择缩放画布来保持设备屏幕的高宽比——在边缘添加“填充”来适应屏幕——或者你可以选择拉伸画布来适应设备屏幕。",
    "{}Stretch{}: This will stretch the image to fill the device screen (and may distort the image shown).":"{}拉伸{} : 这将拉伸图像以填充设备屏幕(并可能使显示的图像失真)。",
    "{}The first part of the General section covers the {}Product Information{} about your game, including its {}Display Name{}, its {}Bundle Name{}, {}Version{} info and {}Build Number{}. Note that the Bundle Name must be in the correct reverse URL format for the final build of the game to work correctly, e.g.&nbsp;{}com.[Company].[GameName]{}. Here you can also give the {}Team Identifier{} that you wish to use for signing the final application that {}GameMaker{} creates for you. Setting it here will override the Team ID that you have supplied in the {}iOS Preferences{}.":"{} 一般信息部分的第一部分涵盖了游戏的 {} 产品信息 {}，包括其 {} 显示名称 {}、{} 捆绑包名称 {}、{} 版本信息 {} 和 {} 版本号 {}。请注意，捆绑包名称必须采用正确的反向 URL 格式，游戏的最终版本才能正常工作，例如 {}. com.[Company].[GameName]{}。在这里您也可以给予您希望用于签署 {}GameMaker{} 为您创建的最终应用程序的 {13} 团队标识符 {14}。在这里设置它将覆盖您在 {}iOS 偏好 {} 设置中提供的团队 ID。",
    "{}The first part of the General section covers {}Build Settings{} for your game. To start with you set the {}Orientations {}that your game can be run on for the best user experience. The available options are:":"{}常规部分的第一部分介绍了游戏的{}生成设置{}。首先，设置游戏可以运行的{}方向{}，以获得最佳用户体验。现有的选择包括:",
    "{}This section permits you to add separate graphics as {}Launch Screens{} (the image that will be shown briefly while your app loads) for each of the device orientations, as well as the&nbsp;{}Border Colour{}&nbsp;that will be used as the background for launch screens that are not set to fill the full screen.&nbsp;These images must be authored as individual 24bit {}*.png{} images with no transparencies and at an appropriate size. Note that this is&nbsp;{}not{}&nbsp;considered a splash screen and Apple have some fairly strict guidelines on how this should be set up and used. See the developer page on&nbsp;{}Human Interface Guidelines{} for more information.":"{}此部分允许您添加单独的图形作为{}启动屏幕{}(在应用加载时将短暂显示的图像)，以及将用作启动屏幕背景的{}边框颜色{}(未设置为填满整个屏幕)。这些图像必须以单独的24位 * 格式创作{}.png{}图像，没有重叠，大小合适。请注意，这{}不{}被视为闪屏，Apple对如何设置和使用它有一些相当严格的指导方针。有关更多信息，请参阅开发人员页面上的{}人机界面指导方针{}。",
    "{}This section permits you to add separate graphics as {}Launch Screens{} (the image that will be shown briefly while your app loads) for each of the device orientations, as well as the&nbsp;{}Border Colour{}&nbsp;that will be used as the background for launch screens that are not set to fill the full screen.&nbsp;These images must be authored as individual 24bit {}*.png{} images with no transparencies and at an appropriate size. Note that this is&nbsp;{}not{}&nbsp;considered a splash screen and Apple have some fairly strict guidlines on how this should be set up and used. See the developer page on&nbsp;{}Human Interface Guidelines{} for more information.":"{}本节允许您添加单独的图形作为{}启动屏幕{}(图片将在您的应用程序加载时简要显示)的每个设备方向，以及{}边框颜色{} ，将用作背景启动屏幕，而不是设置为填充全屏幕。这些映像必须作为单个24位{} * .png {}图像，没有透明度并且具有适当的大小。请注意，这{}{}被认为是一个启动画面，苹果公司有一些相当严格的指导方针，这应该如何设置和使用。有关更多信息，请参见{}个人机界面指南{}上的开发人员页面。",
    "{}This section permits you to add the various different icons required by the various iPhone and iPad devices and the different parts of the iOS App Store. These icons should be authored as 24bit {}*.png{} images at the size specified for each one.":"{}本节允许您添加各种不同的图标，需要各种 iPhone 和 iPad 设备和 iOS 应用程序商店的不同部分。这些图标应该为24位的{} *.png {}图像，其大小为每个图像指定。",
    "{}iOS{}&nbsp;Game Options":"{}iOS{}&nbsp;游戏设置",
    "{}iPad{}: iPad devices":"{}IPad{}: iPad 设备",
    "{}iPhone or iPod Touch{}: iPhone 6&nbsp;and above or iPod Touch devices":"{} iPhone or iPod Touch {} : iPhone 6及以上或 iPod Touch 设备",
    "{}{}IMPORTANT{}{}&nbsp;The CocoaPods checkbox can be found in&nbsp;{}GameMaker{}&nbsp;versions 2022.11 and higher. Older versions and LTS releases show two buttons instead; {}Podfile{} and {}Podfile.lock{}, to generate the respective files. Check the&nbsp;{}iOS and tvOS: Using Cocoa Pods{} guide for more information.":"{}{}重要{}{}提示CocoaPods复选框可以在{}GameMaker{} 2022.11及更高版本中找到。旧版本和LTS版本显示两个按钮; {}Podfile{}和{}Podfile.lock{}，以生成相应的文件。查看{}iOS和tvOS：使用Cocoa Pods{}指南了解更多信息。",
    "{}{}NOTE{}{}&nbsp;Be aware that the larger the size of the texture page, the less compatible your game will be with different browsers and devices.":"{}{}注意{}{}请注意，纹理页面的大小越大，您的游戏与不同浏览器和设备的兼容性就越差。",
    "{}{}NOTE{}{}&nbsp;On importing an older project you may be presented with the following warning:{}This comes up because the current iOS target version has changed the format of the required icons since the project was previously loaded. You will be required to re-create all the icons, as they will have been replaced with the generic {}GameMaker{} icons (you can use the above mentioned Project Image Generator tool to do this quickly).":"{}{}注意{}{}在导入旧项目时，您可能会看到以下警告：{}出现此警告是因为当前iOS目标版本自上次加载项目以来已更改了所需图标的格式。您将需要重新创建所有图标，因为它们将被通用{}GameMaker{}图标替换(您可以使用上述项目图像生成器工具快速完成此操作)。"
}