{
    "Finally there is the option to set the size of the {}texture page{}. The default (and most compatible) size is 2048x2048, but you can choose from anywhere between 256x256 up to 8192x8192.&nbsp;There is also a button marked {}{}Preview&nbsp;{}{}which will generate the texture pages for this platform and then open a window so that you can see how they look. This can be very useful if you wish to see how the texture pages are structured and to prevent having texture pages larger (or smaller) than necessary. For more information on texture pages, please see {}here{}.":"最后，可以选择设置{}纹理页面{}的大小。默认（最兼容）大小为2048 x 2048，但您可以从256 x 256和8192 x 8192之间的任意位置进行选择。还有一个标记为{}{}预览{}{}的按钮，它将生成此平台的纹理页面，然后打开一个窗口，以便您可以看到它们的外观。如果希望了解纹理页面的结构以及防止纹理页面大于或小于所需的页面，这将非常有用。有关纹理页面的详细信息，请参阅{}此处{}。",
    "Finally you have the option to {}Disable file system sandbox{}. Checking this will disable the {}GameMaker{} sandboxing for saving and loading files, permitting your games to access files from anywhere on the system running the game. This option is unchecked by default, as we recomend that you maintain the {}GameMaker{} sandbox for files on all systems and when checked, some save/load areas may still not be available depending on the OS-level permissions. For more information on the sandbox, please see the pages on the {}GameMaker{} {}File System{}.":"最后，您可以选择{}禁用文件系统沙盒{}。选中此项将禁用{}GameMaker{}沙盒以保存和加载文件，从而允许您的游戏从运行游戏的系统上的任何位置访问文件。默认情况下取消选中此选项，因为我们建议您为所有系统上的文件保留{}GameMaker{}沙盒，如果选中此选项，则某些保存/加载区域可能仍不可用，具体取决于OS-级别的权限。有关沙盒的详细信息，请参阅{}GameMaker{}{}文件系统{}上的页面。",
    "Finally, you need to select its {}App Category{} (for more information, see {}here{}).":"最后，您需要选择其{}应用程序类别{}（有关详细信息，请参阅{}此处{}）。",
    "For DMG packages, you can supply an {}Installer Background{} image which will appear as the background of the DMG installer.":"对于DMG软件包，您可以提供{}安装程序背景{}图片，该图片将显示为DMG安装程序的背景。",
    "General":"常规",
    "Graphics":"图形",
    "Here you also need to give the {}Team Identifier{} that you wish to use for signing the final application that {}GameMaker{} creates for you. Setting it here will overide the Team ID that you have supplied in the {}macOS Preferences{}. After the Team Identifier you also have the option to supply the {}Signing Identifier{}, which is required by Apple for all non-appstore applications (like Steam games, for example).":"在此，您还需要提供{}团队标识符{}，以便用于签署{}GameMaker{}为您创建的最终应用程序。在此处设置此项将覆盖您在{}macOS首选项{}中提供的团队ID。在团队标识符之后，您还可以选择提供{}签名标识符{}，这是苹果对所有非应用商店应用程序（例如Steam游戏）所必需的。",
    "Here you also need to give the {}Team Identifier{} that you wish to use for signing the final application that {}GameMaker{} creates for you. Setting it here will override the Team ID that you have supplied in the {}macOS Preferences{}. After the Team Identifier you also have the option to supply the {}Signing Identifier{}, which is required by Apple for all non-appstore applications (like Steam games, for example).":"在此，您还需要给予{}团队标识符{}，您希望使用该标识符对{}GameMaker{}为您创建的最终应用程序进行签名。在此设置该标识符将覆盖您在{}macOS首选项{}中提供的团队ID。在团队标识符之后，您还可以选择提供{}签名标识符{}，这是Apple对所有非appstore应用程序所要求的(例如Steam游戏)。",
    "Images":"图像",
    "It is worth noting that {}GameMaker{} has a {}Project Image Generator{} tool which can be used to automatically create all the images required for all the different target platforms your game is being compiled to. If you use this tool, you should revise the images created to ensure that they are what you require.":"值得注意的是，{}GameMaker{}具有{}项目图像生成器{}工具，可用于自动创建正在编译游戏的所有不同目标平台所需的所有图像。如果使用此工具，则应修改创建的图像，以确保这些图像符合您的要求。",
    "Packaging":"包装",
    "Social":"社交",
    "The next option is for enabling {}Steam {}in your game. If you enable this option, make sure you have the Steamworks SDK installed (see {}here{}), and that you have added the {}Steam app ID{} into the {}General Options{} for the game.":"下一个选项用于在游戏中启用{}Steam{}。如果启用此选项，请确保已安装Steamworks SDK（请参阅{}此处{}），并且已将{}Steam应用程序ID{}添加到游戏的{}常规选项{}中。",
    "Then you have the option to {}Disable file system sandbox{}. Checking this will disable the {}GameMaker{} sandboxing for saving and loading files, permitting your games to access files from anywhere on the system running the game. This option is unchecked by default, as we recommend that you maintain the {}GameMaker{} sandbox for files on all systems and when checked, some save/load areas may still not be available depending on the OS-level permissions. For more information on the sandbox, please see the pages on the {}GameMaker{} {}File System{}.":"然后，您可以选择{}禁用文件系统沙箱{}。选中此选项将禁用保存和加载文件的{}GameMaker{}沙箱，允许您的游戏从运行游戏的系统上的任何位置访问文件。默认情况下，此选项未选中，因为我们建议您为所有系统上的文件维护{}GameMaker{}沙箱，如果选中，某些保存/加载区域可能仍然不可用，具体取决于操作系统级别的权限。有关沙箱的详细信息，请参阅{}GameMaker{}{}文件系统{}上的页面。",
    "This section outlines the different options available to you that control how your macOS game projects will be compiled. The different sections are:":"本节概述了可用于控制如何编译macOS游戏项目的不同选项。不同的部分包括：",
    "You can select the architectures that your final YYC build will support. \"{}Min Version{}\" is the minimum version of macOS that the game can be played on.":"您可以选择您的最终YYC版本将支持的架构。\"{}最低版本{}\"是可以在其上玩游戏的macOS的最低版本。",
    "macOS Game Options":"macOS 游戏选项",
    "{}Allow Fullscreen Switching{}: With this ticked the user can switch from fullscreen to windowed and back again using the standard macOS shortcuts. This is off by default.":"{}允许全屏切换{}：选中此选项后，用户可以使用标准的macOS快捷方式从全屏切换到窗口，然后再次切换到窗口。默认情况下，此选项处于禁用状态。",
    "{}Allow Menu And Dock In Fullscreen{}: When checked, this option will show the OS menu and dock if the game is in fullscreen mode. This is off by default.":"{}允许菜单和停靠全屏{}：选中此选项后，如果游戏处于全屏模式，此选项将显示“操作系统”菜单并停靠。默认情况下，此选项处于禁用状态。",
    "{}Allow window resize{}: Checking this permits the user to change the size of the game window (the Borderless Window option needs to be off for this to work). This option is off by default.":"{}允许调整窗口大小{}:选中此选项将允许用户更改游戏窗口的大小(需要关闭“无边框窗口”选项才能正常工作)。默认情况下，此选项处于禁用状态。",
    "{}Display Cursor{}: When this is checked the regular macOS cursor will be show, and un-checking it will mean that no cursor is shown unless you have created one in your game code. This is off by default.":"{}显示光标{}：选中此项后，将显示常规的macOS光标，取消选中此项表示除非您在游戏代码中创建了光标，否则不会显示任何光标。默认情况下，此选项处于禁用状态。",
    "{}Enable Retina{}: Checking this will set the back buffer to be at the higher (actual) resolution when the game is run on a retina enabled monitor, while un-checking it will set the back buffer to be at the apparent (lower) resolution. What this means is that the initial game window will be set to twice the width and height that the room/view port that the first room is set to. However, this does NOT scale the application surface to suit, and so if you want your game to make the most of the retina display you should also set the application surface to be the same as the window size (note that this will double the pixels along the width and height, so only enable this and scale the application surface if your game will benefit from the increased resolution). {} {} This option is off by default, and enabling it will not show any difference when you run or debug&nbsp;the game using VM,&nbsp;as the runner is pre-built in that case. It will only work&nbsp;if you build an executable through VM, or use YYC for testing or building the game, as that will rebuild the runner with your customised Game Options. ":"{}启用Retina{}：在启用Retina的显示器上运行游戏时，如果选中此选项，则会将后置缓冲区设置为较高（实际）分辨率，而取消选中此选项，则会将后置缓冲区设置为较低（实际）分辨率。这意味着，初始游戏窗口将设置为第一个房间所设置的房间/视口宽度和高度的两倍。但是，这不会按比例缩放应用程序表面，因此，如果希望游戏充分利用视网膜显示，还应将应用程序表面设置为与窗口大小相同（请注意，这会使沿宽度和高度的像素增加一倍，因此，只有在游戏分辨率提高时，才会启用该功能并缩放应用程序表面）。{}{}默认情况下，此选项处于禁用状态，并且在使用VM运行或调试游戏时，启用此选项将不会显示任何差异，因为在这种情况下，运行器是预先构建的。只有通过VM构建可执行文件，或者使用YYC进行测试或构建游戏时，它才有效，因为这将使用自定义的游戏选项重建运行器。",
    "{}Enable Retina{}: Checking this will set the back buffer to be at the higher (actual) resolution when the game is run on a retina enabled monitor, while un-checking it will set the back buffer to be at the apparent (lower) resolution. What this means is that the initial game window will be set to twice the width and height that the room/view port that the first room is set to. However, this does NOT scale the application surface to suit, and so if you want your game to make the most of the retina display you should also set the application surface to be the same as the window size (note that this will double the pixels along the width and height, so only enable this and scale the application surface if your game will benefit from the increased resolution).{} {} This option is off by default, and enabling it will not show any difference when you run or debug&nbsp;the game using VM,&nbsp;as the runner is pre-built in that case. It will only work&nbsp;if you build an executable through VM, or use YYC for testing or building the game, as that will rebuild the runner with your customised Game Options. ":"{}启用 Retina{}：在启用 Retina 的显示器上运行游戏时，如果选中此选项，则会将后置缓冲区设置为较高（实际）分辨率，而取消选中此选项，则会将后置缓冲区设置为较低（实际）分辨率。这意味着，初始游戏窗口将设置为第一个房间所设置的房间 / 视口宽度和高度的两倍。但是，这不会按比例缩放应用程序表面，因此，如果希望游戏充分利用视网膜显示，还应将应用程序表面设置为与窗口大小相同（请注意，这会使沿宽度和高度的像素增加一倍，因此，只有在游戏分辨率提高时，才会启用该功能并缩放应用程序表面）。{}{}默认情况下，此选项处于禁用状态，并且在使用 VM 运行或调试游戏时，启用此选项将不会显示任何差异，因为在这种情况下，运行器是预先构建的。只有通过 VM 构建可执行文件，或者使用 YYC 进行测试或构建游戏时，它才有效，因为这将使用自定义的游戏选项重建运行器。",
    "{}If you wish the finished game to be App Store Ready then you need to check the {}Build for Mac App Store{} option, but be aware that this will only function if you are a registered Developer and have the necessary certificates. Under that are the app {}Permissions {}which you should only check if they are true as Apple can reject your app if they are checked when they are not needed or vice-versa. These options simply permit your game to use the {}http_{} and {}url_{} functions. It is worth noting that if you wish to support GamePads in your game then the option to create an App Store ready package should be {}off{}.":"{}如果您希望完成的游戏是App Store Ready，则需要选中{}Build for Mac App Store{}选项，但请注意，只有在您是注册开发人员并且拥有必要的证书时，此选项才起作用。下面是app{}权限{}，您应该只检查它们是否为真，因为如果在不需要时检查了您的应用程序，苹果可以拒绝它们，反之亦然。这些选项只允许您的游戏使用{}http_{}和{}url_{}功能。值得注意的是，如果您希望在游戏中支持GamePad，则创建App Store就绪包的选项应为{}关闭{}。",
    "{}In the {}Product Information {}section, the first thing to do is fill in the {}Display Name {}of your game then fill in its {}Version Number{}, {}App ID{}, {}App Output file{} and the {}Copyright{} details. The App Output is the location to which your game installation files go to on your Mac development machine. When you create your {}.app.zip{}, that file can go anywhere (the location you specify when doing the save dialogue is not the only copy made of that {}.app.zip{}), but the {}.pkg{} and other files are left in this folder, permitting you to test local installations via Terminal in such a way as to simulate Mac Store purchasing, etc...":"{}在{}产品信息{}部分，首先要填写游戏的{}显示名称{}，然后填写其{}版本号{}、{}应用程序ID{}、{}应用程序输出文件{}和{}版权{}详细信息。“应用程序输出”是Mac开发计算机上游戏安装文件的目标位置。创建{}.app.zip{}时，该文件可以到达任何位置（执行“保存”对话时指定的位置不仅是该{}.app.zip{}的唯一副本），而且{}.pkg{}和其他文件将保留在此文件夹中，允许您通过终端测试本地安装，以模拟Mac Store购买等...",
    "{}In the {}Product Information {}section, the first thing to do is fill in the {}Display Name {}of your game then fill in its, {}App ID{}, {}Version Number{}, {}Build Number{},&nbsp;{}App Output file{} and the {}Copyright{} details. The App Output is the location to which your game installation files go to on your Mac development machine. When you create your {}.app.zip{}, that file can go anywhere (the location you specify when doing the save dialogue is not the only copy made of that {}.app.zip{}), but the {}.pkg{} and other files are left in this folder, permitting you to test local installations via Terminal in such a way as to simulate Mac Store purchasing, etc.":"{} 在 {} 产品信息 {} 部分，首先要做的是填写游戏的 {} 显示名称 {}，然后填写其应用 {} 程序 ID{}，{} 版本号 {}，{} 内部版本号 {}，{} 应用程序输出文件 {} 和 {} 版权 {} 详细信息。应用程序输出是您的游戏安装文件在 Mac 开发机器上的位置。当您创建 {}.app.zip{} 时，该文件可以在任何地方 (您在执行保存对话框时指定的位置不是该 {}. app.zip{} 的唯一副本)，但 {}.pkg{} 和其他文件保留在此文件夹中，允许您通过终端测试本地安装，以模拟 Mac Store 购买等。",
    "{}Interpolate colours between pixels{}: Turns on {}linear interpolation{}, which basically \"smooths\" pixels. For crisp pixel graphics, it should be off, but if you have nice alpha blends and smoothed edged graphics it is better left on. This is off by default.":"{}像素间插值颜色{}：启用{}线性插值{}，基本上“平滑”像素。对于清晰的像素图形，它应该处于关闭状态，但如果您有漂亮的Alpha混合和平滑的边缘图形，则最好保留在上面。默认情况下，此选项处于禁用状态。",
    "{}Interpolate colours between pixels{}: Turns on {}linear interpolation{}, which basically \"smooths\" pixels. For crisp pixel graphics, it should be off, but if you have nice alpha blends and smoothed edged graphics it is better left on. This is on by default.":"{}在像素之间插值颜色{}：打开{}线性插值{}，它基本上是\"平滑\"像素。对于清晰的像素图形，它应该关闭，但如果你有很好的alpha混合和平滑边缘的图形，它最好保持打开。默认情况下，这是打开的。",
    "{}NOTE{}: Be aware that the larger the size of the texture page, the less compatible your game will be on PC\u0027s with lower specifications.":"{}注意{}：请注意，纹理页面越大，您的游戏在PC上的兼容性就越低。",
    "{}Scaling{}: Here you can choose to maintain aspect ratio (so a 4:3 room will be \"letter boxed\" on a 16:9) or to scale fully (stretching the image to fit the full screen). {} {} {}{}WARNING!{} {}Switching off the application surface will disable all the scaling options set in the Windows Game Options until it has been switched back on again. See The Application Surface for further details.{}{} ":"{}缩放比例{}：您可以在此选择保持纵横比（因此4:3的房间将在以16:9的比例“扩容”）或缩放（拉伸图像以适应整个屏幕）。{}{}{}{}警告!{}{}关闭应用程序表面将禁用“Windows游戏选项”中设置的所有缩放选项，直到它再次打开。有关详细信息，请参阅“应用程序表面”。{}{}",
    "{}Scaling{}: Here you can choose to maintain aspect ratio (so a 4:3 room will be \"letter boxed\" on a 16:9) or to scale fully (stretching the image to fit the full screen).{} {} {}{}WARNING!{} {}Switching off the application surface will disable all the scaling options set in the Windows Game Options until it has been switched back on again. See The Application Surface for further details.{}{} ":"{}缩放比例{}：您可以在此选择保持纵横比（因此 4:3 的房间将在以 16:9 的比例\"扩容\"）或缩放（拉伸图像以适应整个屏幕）。{}{}{}{}警告!{}{}关闭应用程序表面将禁用 \"Windows 游戏选项\"中设置的所有缩放选项，直到它再次打开。有关详细信息，请参阅\"应用程序表面\"。{}{}",
    "{}Start Fullscreen{}: If this is checked, the game will start in fullscreen mode otherwise it will start windowed. This is off by default.":"{}全屏开始{}：如果选中此项，游戏将以全屏模式开始，否则将以窗口模式开始。默认情况下，此选项处于禁用状态。",
    "{}The graphics options are those that you should configure to determine how your game will use the graphics card of your target Mac. The following options are included for you to modify:":"{}图形选项是您应该配置的选项，以确定游戏将如何使用目标Mac的显卡。您可以修改以下选项：",
    "{}The images section is where you supply the images that your game requires. For Mac, you need to supply an {}Icon {}file (that must be in {}.png{} format and 1024x1024px) and a {}Splash Screen{} (which can be {}.png{}, {}.bmp{}, {}.jpg{} or {}.gif{} format). The splash screen will be shown while the game loads.":"{}图像部分是您提供游戏所需图像的位置。对于Mac，您需要提供{}图标{}文件（必须是{}.png{}格式，大小是1024 x 1024 px）和{}启动屏{}（可以是{}.png{}、{}.bmp{}、{}.jpg{}或{}.gif{}格式）。游戏加载时将显示启动屏。",
    "{}This option is for using the {}Apple Sign In Extension{} on Mac. You can get this extension from the {}GameMaker Marketplace{}, and the extension itself contains full instructions for use. If you are not using this extension then you should not tick this option.":"{}此选项用于在Mac上使用{}Apple登录扩展{}。您可以从{}GameMaker Marketplace{}获取此扩展，扩展本身包含完整的使用说明。如果不使用此扩展，则不应勾选此选项。",
    "{}Use synchronization to avoid tearing{}: This toggles {}v-sync{} on or off. Note, that if you have a game with a room speed of 120 and the player has a monitor with a refresh rate of 60, turning this option on will lock your game speed to 60 too. This is off by default.":"{}使用同步以避免撕裂{}：这将打开或关闭{}v-sync{}。请注意，如果您有一个房间速度为120的游戏，并且玩家有一个刷新率为60的显示器，则启用此选项也会将您的游戏速度锁定为60。默认情况下，此选项处于禁用状态。",
    "{}macOS{}&nbsp;Game Options":"{}macOS{}&nbsp;游戏设置"
}