{
    "\"{}Min Version{}\" is the minimum version of tvOS that the game can be played on.":"\"{}Min Version{}\" 是可以运行游戏的最低 tvOS 版本。",
    "As mentioned in the section on Icons, you can use the {}Project Image Generator{} to create these images.":"如图标部分所述，可以使用{}项目图像生成器{}创建这些图像。",
    "Below that is the&nbsp;{}CocoaPods{}&nbsp;option. Check it to automate building using the {}CocoaPods{} dependency manager.&nbsp;For detailed information, see the following&nbsp;guide:":"下面是{}CocoaPods{}选项。选中它可以使用{}CocoaPods{}依赖管理器自动构建。有关详细信息，请参阅以下指南：",
    "Finally, you choose to {}Display a cursor{} or not. If checked, the OS will show a cursor whenever the mouse is moved (at the mouse position), and the cursor will fade out and disappear when the mouse is not moved for a period of time. If unchecked, then no cursor will be shown.":"最后，选择{}是否显示光标{}。如果选中此选项，当鼠标移动(在鼠标位置)时，操作系统将显示一个光标，当鼠标一段时间不移动时，光标将淡出并消失。如果未选中，则不显示光标。",
    "General":"常规",
    "Graphics":"图形",
    "Here you also have the option to generate a&nbsp;{}Podfile{}&nbsp;and a&nbsp;{}Podfile.lock{}. These files are required if you are adding CocoaPods to a&nbsp;{}tvOS extension{} using the {}Extension Editor{}. The files contain specific macros required by {}GameMaker{} to setup any listed CocaoPods when building your game. Clicking the buttons will create the files with the macros pre-generated, and also open a file explorer on the location of the files, should you wish to manual edit them.&nbsp;There is also a button that will take you to the following&nbsp;guide:":"最后，您可以选择生成{} Podfile {}和{} Podfile.lock {}。如果使用{}扩展编辑器{}将 CocoaPods 添加到{} iOS 扩展{} ，则需要这些文件。文件包含特定的宏所需的{}Gamemaker{}设置任何列出的CocoaPods时，构建您的游戏。单击这些按钮将创建带有预生成宏的文件，如果您希望手动编辑这些文件，还可以打开文件资源管理器中的文件位置。还有一个按钮可以带你到下面的指南:",
    "Icons":"图标",
    "Images":"图像",
    "It is worth noting that {}GameMaker{} has a {}Project Image Generator{} tool which can be used to automatically create all the images required for all the different target platforms your game is being compiled to.&nbsp;If you use this tool, you should revise the images created to ensure that they are what you require, especially for this platform as the icons required are rectangular and not square. This tool will also generate Images (explained below) as well as Icons.":"值得注意的是，{} GameMaker {}有一个{}项目图像生成器{}工具，可用于自动创建所有不同目标平台所需的图像。如果您使用这个工具，您应该修改所创建的图像，以确保它们是您所需要的。该工具将生成图标以及图像(见下一节)。",
    "Lastly, you can {}Enable broadcast networking{}. When enabled,&nbsp;{}GameMaker{}&nbsp;will add the multicast entitlement ({}com.apple.developer.networking.multicast{}) to broadcast or multicast messages that you send in your game.":"最后，您可以{}启用广播网络{}。启用后，{}GameMaker{}将向您在游戏中发送的广播或多播消息添加多播权限({}com.apple.developer.networking.multicast{})。",
    "Next there is the option to set the size of the {}texture page{}. The default (and most compatible) size is 2048x2048, but you can choose from anywhere between 256x256 up to 8192x8192.&nbsp;There is also a button marked {}Preview {}which will generate the texture pages for this platform and then open a window so that you can see how they look. This can be very useful if you wish to see how the texture pages are structured and to prevent having texture pages larger (or smaller) than necessary. For more information on texture pages, please see {}here{}.":"最后，可以选择设置{}纹理页面{}的大小。默认（最兼容）大小为2048 x 2048，但您可以从256 x 256和8192 x 8192之间的任意位置进行选择。还有一个标记为{}预览{}的按钮，它将生成此平台的纹理页面，然后打开一个窗口，以便您可以看到它们的外观。如果希望了解纹理页面的结构以及防止纹理页面大于或小于所需的页面，这将非常有用。有关纹理页面的详细信息，请参阅{}此处{}。",
    "This section outlines the different options available to you that control how your tvOS game projects will be compiled. The different sections are:":"本节概述了可用于控制如何编译 tvOS 游戏项目的不同选项。不同的章节是:",
    "tvOS&nbsp;Game Options":"tvOS 游戏选项",
    "{}Here you can change the following details related to how your game will be displayed, with the following options available:":"{}这里您可以使用下列选项更改与游戏显示方式相关的下列详细信息:",
    "{}Here you can fill in the {}Product Information{} about your game, including its {}Display Name{}, its {}Bundle ID,{}&nbsp;{}Version {}info and {}Build Number{}. Note that the Bundle ID must be in the correct reverse URL format for the final build of the game to work correctly, e.g.&nbsp;{}com.[Company].[GameName]{}. You can also set the {}App Output{} location on the build Mac, and you can give the {}Team Identifier{} that you wish to use for signing the final application that {}GameMaker{} creates for you. Setting it here will override the Team ID that you have supplied in the {}tvOS Preferences{}.":"{}在这里，您可以填写有关游戏的{}产品信息{}，包括其{}显示名称{}、{}捆绑包ID{}、{}版本信息{}和{}版本号{}。请注意，捆绑包ID必须采用正确的反向URL格式，以便游戏的最终版本正常工作，例如. {}com.[Company].[GameName]{}。您还可以在版本Mac上设置{}应用程序输出{}位置，您可以给予您希望用于签署GameMaker为您创建的最终应用程序的{}团队标识符{}。在此处设置它将覆盖您在{}tvOS首选项{}中提供的团队ID。",
    "{}Here you can fill in the {}Product Information{} about your game, including its {}Display Name{}, its {}Bundle ID{} and the {}Version {}info. Note that the Bundle ID must be in the correct reverse URL format for the final build of the game to work correctly, EG: {}com.[Company].[GameName]{}. You can also set the {}App Output{} location on the build Mac, and you can give the Team Identifier that you wish to use for signing the final application that {}GameMaker{} creates for you. Setting it here will override the Team ID that you have supplied in the {}tvOS Preferences{}.":"{}在这里您可以填写有关您的游戏的{}产品信息{} ，包括其{}显示名称{}、其{}Bundle ID {}和{}版本{}信息。注意，要使游戏的最终版本正确工作，包 ID 必须采用正确的反向 URL 格式，例如: {}com.[公司名].[游戏名]{}。还可以在生成 Mac 上设置{}App输出{}位置，并且可以提供要用于签名{} GameMaker {}为您创建的最终应用程序的 Team Identifier。在此处设置它将重写在{}tvOS 首选项{}中提供的团队 ID。",
    "{}Interpolate colours between pixels{}: Turns on {}linear interpolation{}, which basically \"smooths\" pixels. For crisp pixel graphics, it should be off, but if you have nice alpha blends and smoothed edged graphics it is better left on. This is off by default.":"{}像素间插值颜色{}：启用{}线性插值{}，基本上是“平滑”像素。对于清晰的像素图形，它应该处于禁用状态，但如果您有漂亮的Alpha混合和平滑的边缘图形，则最好保持启用状态。默认情况下，此选项处于禁用状态。",
    "{}NOTE{}: Be aware that the larger the size of the texture page, the less compatible your game will be with different browsers and devices.":"注意: 纹理页面的大小越大，游戏对不同浏览器和设备的兼容性就越差。",
    "{}Scaling{}: Here you can select to scale the draw canvas maintaining the aspect ratio within the device screen - adding \"padding\" around the edges to fit the screen - or you can select to have the draw canvas stretched to fit the device screen.":"{}缩放{} : 在这里你可以选择缩放画布来保持设备屏幕的高宽比——在边缘添加“填充”来适应屏幕——或者你可以选择拉伸画布来适应设备屏幕。",
    "{}This section permits you to add separate graphics as \"Top Shelf\" images and splash screens for each of the different tvOS target sizes. These images must be authored as individual 24bit {}*.png{} images with no transparencies and at the correct size. You can also set a minimum time for showing the splash screens from the drop down menu at the bottom (from 0 to 10 seconds).":"{}此部分允许您为每个不同的 tvOS 目标大小添加单独的图形作为“ Top Shelf”图像和初始屏幕。这些映像必须作为单个24位创作，无透明且大小正确的{}*.png {}图像。您还可以从底部的下拉菜单设置显示启动画面的最短时间(从0到10秒)。",
    "{}This section permits you to add the various different {}Icons {}required by the various devices and the different parts of the App Store. These icons should be authored as 24bit {}*.png{} images at the size specified for each one.":"{}此部分允许您添加各种设备和应用程序商店的不同部分所需的各种不同{}图标{}。这些图标应该编写为24位{} *.png {}图像，其大小为每个图像指定。",
    "{}{}IMPORTANT{}{}&nbsp;The CocoaPods checkbox can be found in&nbsp;{}GameMaker{}&nbsp;versions 2022.11 and higher. Older versions and LTS releases show two buttons instead; {}Podfile{} and {}Podfile.lock{}, to generate the respective files. Check the&nbsp;{}iOS and tvOS: Using Cocoa Pods{} guide for more information.":"{}{}重要{}{} CocoaPods复选框可以在{}GameMaker{} 2022.11及更高版本中找到。旧版本和LTS版本显示两个按钮; {}Podfile{}和{}Podfile.lock{}，以生成相应的文件。查看{}iOS和tvOS：使用Cocoa Pods{}指南了解更多信息。",
    "{}{}NOTE{}{}&nbsp;Be aware that the larger the size of the texture page, the less compatible your game will be with different browsers and devices.":"{}{}注意{}{}请注意，纹理页面的大小越大，您的游戏与不同浏览器和设备的兼容性就越差。"
}