{
    "Finally there is the option to set the size of the {}texture page{}. The default (and most compatible) size is 2048x2048, but you can choose from anywhere between 256x256 up to 8192x8192.&nbsp;There is also a button marked {}{}Preview&nbsp;{}{}which will generate the texture pages for this platform and then open a window so that you can see how they look. This can be very useful if you wish to see how the texture pages are structured and to prevent having texture pages larger (or smaller) than necessary. For more information on texture pages, please see {}here{}.":"最后，可以选择设置{}纹理页面{}的大小。默认（最兼容）大小为2048 x 2048，但您可以从256 x 256和8192 x 8192之间的任意位置进行选择。还有一个标记为{}{}预览{}{}的按钮，它将生成此平台的纹理页面，然后打开一个窗口，以便您可以看到它们的外观。如果希望了解纹理页面的结构以及防止纹理页面大于或小于所需的页面，这将非常有用。有关纹理页面的详细信息，请参阅{}此处{}。",
    "Finally you have the option to {}Disable file system sandbox{}. Checking this will disable the {}GameMaker{} sandboxing for saving and loading files, permitting your games to access files from anywhere on the system running the game. This option is unchecked by default, as we recommend that you maintain the {}GameMaker{} sandbox for files on all systems and when checked, some save/load areas may still not be available depending on the OS-level permissions. For more information on the sandbox, please see the pages on the {}GameMaker{} {}File System{}.":"最后，您可以选择{}禁用文件系统沙盒{}。选中此选项将禁用用于保存和加载文件的{} GameMaker {}沙盒，允许您的游戏从运行游戏的系统上的任何地方访问文件。默认情况下不选中此选项，因为我们建议您为所有系统上的文件都使用{} GameMaker {}沙箱，当选中此选项时，根据操作系统级别的权限，一些保存/加载区域可能仍然不可用。有关沙盒的详细信息，请参阅{} GameMaker {}{}文件系统{}上的页面。",
    "General":"常规",
    "Graphics":"图形",
    "Here you also have the option is for enabling {}Steam {}in your game. If you enable this option, make sure you have the Steamworks SDK installed (see {}here{}), and that you have added the {}Steam app ID{} into the {}General Options{} for the game.":"您还可以选择在游戏中启用{}Steam{}。如果启用此选项，请确保已安装 Steamworks SDK (请参阅{}此处{}) ，并且已将{}Steam app ID{}添加到游戏的{}常规选项{}中。",
    "Images":"图像",
    "It is worth noting that {}GameMaker{} has a {}Project Image Generator{} tool which can be used to automatically create all the images required for all the different target platforms your game is being compiled to. If you use this tool, you should revise the images created to ensure that they are what you require.":"值得注意的是，{}GameMaker{}具有{}项目图像生成器{}工具，可用于自动创建正在编译游戏的所有不同目标平台所需的所有图像。如果使用此工具，则应修改创建的图像，以确保这些图像符合您的要求。",
    "This section outlines the different options available to you that control how your Ubuntu (Linux) game projects will be compiled. The different sections are:":"本节概述了可用于控制如何编译 Ubuntu (Linux)游戏项目的不同选项。不同的章节是:",
    "Ubuntu&nbsp;Game Options":"Ubuntu 游戏选项",
    "{}Allow Fullscreen Switching{}: With this ticked the user can switch from fullscreen to windowed and back again using the standard Ubuntu OS shortcuts. This is off by default.":"{}允许全屏切换{} : 有了这个选项，用户可以使用标准的 Ubuntu OS 快捷方式从全屏切换到窗口，然后再切换回来。默认关闭。",
    "{}Allow window resize{}: Checking this permits the user to change the size of the game window (the Borderless Window option needs to be off for this to work). This option is off by default.":"{}允许窗口调整大小{} : 选中此选项允许用户更改游戏窗口的大小。默认情况下，此选项是关闭的。",
    "{}Allow window resize{}: Checking this permits the user to change the size of the game window. This option is off by default.":"{} 允许调整窗口大小 {}：选中此项允许用户更改游戏窗口的大小。该选项默认关闭。",
    "{}Display Cursor{}: When this option is enabled, the default OS cursor will be shown in your game. If this is disabled, then while the mouse is over the game window, there will be no visible cursor unless you have created one as part of the game project (this is on by default).":"{}显示光标{}：选中此项时，将显示常规窗口光标，取消选中此项表示除非您在游戏代码中创建了光标，否则不会显示任何光标。默认情况下，此选项处于启用状态。",
    "{}Here you can add a {}Splash Screen{} for your game, and set the game {}Icon {}that will be used. The icon must be a 64x64 pixel image in the {}.png{} format, and the splash screen should be at least the same size as the first room in your game (or it\u0027s view port) and be {}.png{} format too. The splash screen will be shown while the game loads, and can be enabled or disabled by checking the {}Use Splash Screen{} option (which is off by default).":"{}在这里您可以为您的游戏添加一个{}启动画面{}，并设置将要使用的{}游戏图标{}。图标必须是中的64x64像素图像{}.PNG{}格式，启动画面的大小应该至少与游戏中的第一个房间(或者它的视图端口)相同，并且是{}.png{}格式。启动画面将在游戏加载时显示，通过选中{}开启启动动画{}选项(默认关闭)可以启用或禁用启动画面。",
    "{}Interpolate colours between pixels{}: Turns on {}linear interpolation{}, which basically \"smooths\" pixels. For crisp pixel graphics, it should be off, but if you have nice alpha blends and smoothed edged graphics it is better left on.This is off by default.":"{}像素间插值颜色{}：启用{}线性插值{}，基本上是“平滑”像素。对于清晰的像素图形，它应该处于禁用状态，但如果您有漂亮的Alpha混合和平滑的边缘图形，则最好保持启用状态。默认情况下，此选项处于启用状态。",
    "{}NOTE{}: Be aware that the larger the size of the texture page, the less compatible your game will be on PC\u0027s with lower specifications.":"{}注意{}：请注意，纹理页面越大，您的游戏在PC上的兼容性就越低。",
    "{}Scaling{}: Here you can choose to maintain aspect ratio (so a 4:3 room will be \"letter boxed\" on a 16:9) or to scale fully (stretching the image to fit the full screen).{} {} {}{}WARNING!{} {}Switching off the application surface will disable all the scaling options set in the Windows Game Options until it has been switched back on again. See The Application Surface for further details.{}{} ":"{}缩放比例{}：您可以在此选择保持纵横比（因此4:3的房间将以16:9的比例“扩容”）或缩放（拉伸图像以适应整个屏幕）。{}{}{}{}警告!{}{}关闭应用程序表面将禁用“Windows游戏选项”中设置的所有缩放选项，直到它再次打开。有关详细信息，请参阅“应用程序表面”。{}{}",
    "{}Start Fullscreen{}: If this is checked, the game will start in fullscreen mode otherwise it will start windowed. This is off by default.":"{}启动全屏{} : 如果选中此选项，游戏将在全屏模式下启动。默认关闭。",
    "{}The graphics options are those that you should configure to determine how your game will use the graphics card of your target Ubuntu machine. The following options are included for you to modify:":"{}图形选项是那些您应该配置来确定您的游戏将如何使用您的目标 Ubuntu 机器的显卡。下列选项可供您修改:",
    "{}This tab is where you set the name of your game as it is to be displayed while running, and can also supply a contact email and a description (short and long), as well as a URL for the homepage of the game or the developer.":"{}这个选项卡是你设置游戏名称的地方，因为它将在运行时显示，也可以提供一个联系电子邮件和描述(短和长) ，以及一个游戏或开发者的网址主页。",
    "{}Ubuntu{}&nbsp;Game Options":"{}Ubuntu{}&nbsp;游戏设置",
    "{}Use synchronization to avoid tearing{}: This toggles {}v-sync{} on or off. Note, that if you have a game with a room speed of 120 and the player has a monitor with a refresh rate of 60, turning this option on will lock your game speed to 60 too. This is off by default.":"{}使用同步以避免撕裂{}：这将打开或关闭{}v-sync{}。请注意，如果您有一个房间速度为120的游戏，并且玩家有一个刷新率为60的显示器，则启用此选项也会将您的游戏速度锁定为60。默认情况下，此选项处于禁用状态。"
}