{
    "Finally there is the option to set the size of the {}texture page{}. The default (and most compatible) size is 2048x2048, but you can choose from anywhere between 256x256 up to 8192x8192.&nbsp;There is also a button marked {}{}Preview&nbsp;{}{}which will generate the texture pages for this platform and then open a window so that you can see how they look. This can be very useful if you wish to see how the texture pages are structured and to prevent having texture pages larger (or smaller) than necessary. For more information on texture pages, please see {}Texture Pages{}.":"最后，您可以选择设置{}纹理页面{}的大小。默认 (也是最兼容的) 大小是 2048x2048，但您可以从 256x256 到 8192x8192 之间的任意大小进行选择。还有一个标记为 {}{} 预览 {}{} 的按钮，它将为该平台生成纹理页面，然后打开一个窗口，以便您可以查看它们的外观。如果您希望了解纹理页面的结构，并防止纹理页面过大 (或过小)，这将非常有用。有关纹理页的更多信息，请参阅 {} 纹理页 {}。",
    "Finally there is the option to set the size of the {}texture page{}. The default (and most compatible) size is 2048x2048, but you can choose from anywhere between 256x256 up to 8192x8192.&nbsp;There is also a button marked {}{}Preview&nbsp;{}{}which will generate the texture pages for this platform and then open a window so that you can see how they look. This can be very useful if you wish to see how the texture pages are structured and to prevent having texture pages larger (or smaller) than necessary. For more information on texture pages, please see {}here{}.":"最后，可以选择设置{}纹理页面{}的大小。默认（最兼容）大小为2048 x 2048，但您可以从256 x 256和8192 x 8192之间的任意位置进行选择。还有一个标记为{}{}预览{}{}的按钮，它将生成此平台的纹理页面，然后打开一个窗口，以便您可以看到它们的外观。如果希望了解纹理页面的结构以及防止纹理页面大于或小于所需的页面，这将非常有用。有关纹理页面的详细信息，请参阅{}此处{}。",
    "Game Options":"游戏设置",
    "General":"常规",
    "Graphics":"图形",
    "Images":"图像",
    "Installer":"安装程序",
    "It is worth noting that {}GameMaker{} has a {}Project Image Generator{} tool which can be used to automatically create all the images required for all the different target platforms your game is being compiled to. If you use this tool, you should revise the images created to ensure that they are what you require.":"值得注意的是，{}GameMaker{}具有{}项目图像生成器{}工具，可用于自动创建正在编译游戏的所有不同目标平台所需的所有图像。如果使用此工具，则应修改创建的图像，以确保这些图像符合您的要求。",
    "Next you can set the {}Windows Sleep Margin{}. This option is related to reducing stuttering when running your game on specific systems. Basically, if your game is running faster than your room speed {}GameMaker{} will \"sleep\" for the remaining time, but this sleep can be quite inaccurate and you can often end of sleeping for longer than necessary, causing your frame to take longer which causes stuttering. To get around this we can sleep for less time, then sit in a tight loop for the remainder of the time to make it more accurate - although the problem with sitting in a loop is that it causes CPU usage to increase, which in turn can cause your CPU temperatures to rise and your fan to run faster. By default, this value is set to 10, and in 99.99% of the cases you\u0027ll be fine with this, but for low end machines or for machines with a lot of background processes running this may not be an ideal solution (or for very high end machines too) and a value of 1 or 15 or something may be required. Note though that this is very much a system specific configuration and what works on your build machine may not be appropriate for another user, and as such if in doubt leave it set to 10.":"接下来，您可以设置{}Windows睡眠边距{}。此选项与在特定系统上运行游戏时减少卡顿有关。基本上，如果您的游戏运行速度快于您的房间速度，{}GameMaker{} 将在剩余时间内“睡眠”，但此睡眠可能非常不准确，并且通常睡眠会超过必要的时间，从而导致花费更长时间，导致卡顿。为了避免这种情况，我们可以减少睡眠时间，然后在剩余时间内保持紧张的循环状态，使其更加准确——尽管循环状态的问题在于它会导致CPU使用量增加，进而会导致CPU温度上升，风扇运行速度加快。默认情况下，此值设置为10，在99.99%的情况下，您可以接受此值，但对于低端计算机或运行大量后台进程的计算机，此值可能不是理想的解决方案（对于非常高端的计算机也是如此），可能需要1或15或其他值。但请注意，这在很大程度上是系统特定的配置，在您的构建计算机上工作的内容可能不适合其他用户，如果有疑问，请将其设置为10。",
    "Next you can set the {}Windows Sleep Margin{}. This option is related to reducing stuttering when running your game on specific systems. Basically, if your game is running faster than your room speed {}GameMaker{} will \"sleep\" for the remaining time, but this sleep can be quite inaccurate and you can often end up sleeping for longer than necessary, causing your frame to take longer which causes stuttering. To get around this we can sleep for less time, then sit in a tight loop for the remainder of the time to make it more accurate - although the problem with sitting in a loop is that it causes CPU usage to increase, which in turn can cause your CPU temperatures to rise and your fan to run faster. By default, this value is set to 10, and in 99.99% of the cases you\u0027ll be fine with this, but for low end machines or for machines with a lot of background processes running this may not be an ideal solution (or for very high end machines too) and a value of 1 or 15 or something may be required. Note though that this is very much a system specific configuration and what works on your build machine may not be appropriate for another user, and as such if in doubt leave it set to 10.":"接下来，您可以设置{}Windows睡眠边距{}。此选项与在特定系统上运行游戏时减少卡顿有关。基本上，如果您的游戏运行速度快于您的房间速度，{}GameMaker{} 将在剩余时间内“睡眠”，但此睡眠可能非常不准确，并且通常睡眠会超过必要的时间，从而导致花费更长时间，导致卡顿。为了避免这种情况，我们可以减少睡眠时间，然后在剩余时间内保持紧张的循环状态，使其更加准确——尽管循环状态的问题在于它会导致CPU使用量增加，进而会导致CPU温度上升，风扇运行速度加快。默认情况下，此值设置为10，在99.99%的情况下，您可以接受此值，但对于低端计算机或运行大量后台进程的计算机，此值可能不是理想的解决方案（对于非常高端的计算机也是如此），可能需要1或15或其他值。但请注意，这在很大程度上是系统特定的配置，在您的构建计算机上工作的内容可能不适合其他用户，如果有疑问，请将其设置为10。",
    "The next option is to {}Enable Steam{} for your game. If you enable this option, make sure you have the Steamworks SDK installed (see {}here{}), and that you have added the {}Steam App ID{} into the {}General Options{} for the game. Note that if you are running {}GameMaker{} on Windows and from the Steam version of the IDE and you are developing games for Steam, then you might also need to check the {}Use alternative launcher for Steam{} application option. What this option does is launch your game when testing using an alternative launcher program to prevent it being flagged by Steam with {}GameMaker{}\u0027s application ID instead of your game\u0027s own application ID. You should only enable this when developing for Steam and if you find you have issues launching your game.":"下一个选项是为你的游戏{}启动Steam{}。如果启用此选项，请确保已安装Steamworks Sdk（请参阅{}此处{}），并且已将{}Steamworks应用程序ID{}添加到游戏的{}常规选项{}中。请注意，如果您正在Windows的Steam版本上运行{}GameMaker{}，并且正在为Steam开发游戏，则可能还需要选中{}使用Steam的备用启动器{}应用程序选项。此选项的作用是在使用替代启动程序进行测试时启动游戏，以防Steam使用{}GameMaker{}的应用程序ID（而不是游戏自己的应用程序ID）标记游戏。只有在为Steam开发时，发现在启动游戏时遇到问题，才应启用此功能。",
    "The penultimate option you have is the option to {}Disable file system sandbox{}. Checking this will disable the {}GameMaker{} sandboxing for saving and loading files, permitting your games to access files from anywhere on the system running the game. This option is unchecked by default, as we recommend that you maintain the {}GameMaker{} sandbox for files on all systems and when checked, some save/load areas may still not be available depending on the OS-level permissions. For more information on the sandbox, please see the pages on the {}GameMaker{} {}File System{}.":"倒数第二个选项是{}禁用文件系统沙盒{}。选中此项将禁用{}GameMaker{}沙盒以保存和加载文件，允许您的游戏从运行游戏的系统上的任何位置访问文件。默认情况下此选项是被取消的，因为我们建议您为所有系统上的文件保留{}GameMaker{}沙盒。如果选中此选项，则依据系统级别的权限，某些保存/加载区域可能将不可用。有关沙盒的详细信息，请参阅{}GameMaker{}{}文件系统{}上的页面。",
    "The {}Options {}section of this window permits you to choose where the game package is to be installed to, either the \"{}%localappdata%{}\" or \"{}%appdata%{}\" folders, as well as whether to set {}Copy exe to output folder{}. In general you should never need this option, but it is supplied for those users that have various DLL\u0027s that communicate with each other and your game, and when enabled it will maintain the game EXE in the output folder when testing, rather than place it in the {}Temp {}folder.":"通过此窗口的{}选项{}部分，您可以选择将游戏安装到“{}%localappdata%{}”或“{}%appdata%{}”文件夹中的位置，以及设置是否{}将exe复制到输出文件夹{}。通常，您永远不需要此选项，但它是为那些具有相互交流您的游戏的各种Dll的用户提供的。在启用此选项后，它将在测试时将EXE保留在输出文件夹中，而不是将其放在{}临时文件夹{}中。",
    "This section outlines the different options available to you that control how your Windows game projects will be compiled. The different sections are:":"本节概述了可用于控制如何编译Windows游戏项目的不同选项。不同的部分包括：",
    "Windows Game Options":"Windows 游戏选项",
    "You can also point to a specific {}License Agreement{} file (an example is supplied with {}GameMaker{}) and a custom {}NSI script file{} (details in the&nbsp;{}NSIS Users Manual{}) should you need one, or click the appropriate buttons to return to the default files supplied with {}GameMaker{}.":"如果需要，您还可以指向特定的{}许可协议{}文件(随 {}GameMaker{} 提供的示例)和自定义的 {}NSIS脚本文件{} (详细信息请参阅 {}NSIS用户手册{})，或者单击相应的按钮返回到随 {}GameMaker{} 提供的默认文件。",
    "You can also point to a specific {}License Agreement{} file (an example is supplied with {}GameMaker{}) and a custom {}NSI script file{} (details {}here{}) should you need one, or click the appropriate buttons to return to the default files supplied with {}GameMaker{}.":"如果需要，您还可以指向特定的{}许可协议{}文件（{}GameMaker{}提供了一个示例）和自定义的{}NSI脚本文件{}（{}此处{}为详细信息），或者单击相应的按钮返回{}GameMaker{}提供的默认文件。",
    "{}Allow Fullscreen Switching{}: With this ticked the user can switch from fullscreen to windowed and back again using the standard Windows shortcuts. This is off by default.":"{}允许全屏切换{}：选中此选项后，用户可以使用标准的Windows快捷方式从全屏切换到窗口，然后再次切换回窗口。默认情况下，此选项处于禁用状态。",
    "{}Allow window resize{}: Checking this permits the user to change the size of the game window (the Borderless Window option needs to be off for this to work). This option is off by default.":"{}允许调整窗口大小{}:选中此选项将允许用户更改游戏窗口的大小(需要关闭“无边框窗口”选项才能正常工作)。默认情况下，此选项处于禁用状态。",
    "{}Borderless Window{}: Checking this will make your game run with a borderless window, removing the normal minimise, maximise and close buttons as well as the game title. This is off by default.":"{}无边框窗口{}：选中此项将使您的游戏在无边框窗口中运行，从而删除正常的最小化、最大化和关闭按钮以及游戏标题。默认情况下，此选项处于禁用状态。",
    "{}Display Cursor{}: When this is checked the regular windows cursor will be show, and un-checking it will mean that no cursor is shown unless you have created one in your game code. This is on by default.":"{}显示光标{}：选中此项时，将显示常规窗口光标，取消选中此项表示除非您在游戏代码中创建了光标，否则不会显示任何光标。默认情况下，此选项处于启用状态。",
    "{}Display Cursor{}: When this is checked the regular windows cursor will be show, and unchecking it will mean that no cursor is shown unless you have created one in your game code. This is on by default.":"{}显示光标{}：选中此选项后，将显示常规的 Windows 光标，取消选中将意味着不会显示任何光标，除非您在游戏代码中创建了一个光标。默认情况下，该选项处于启用状态。",
    "{}Finished{}: The graphic that appears on the \"Finished\" page of the installer. Must be in {}*.bmp{} format and measure 164x314px.":"{}已完成{}：出现在安装程序的“已完成”页面上的图形。必须为{}*.bmp{}格式并且大小为164 x 314 px。",
    "{}Header{}: The graphic that appears while the installer is running. Must be in {}*.bmp{} format and measure 150x57px.":"{}标题{}：安装程序运行时出现的图形。必须为{}*.bmp{}格式并且大小为150 x 57 px。",
    "{}Interpolate colours between pixels{}: Turns on {}linear interpolation{}, which basically \"smooths\" pixels. For crisp pixel graphics, it should be off, but if you have nice alpha blends and smoothed edged graphics it is better left on.This is on by default.":"{}像素间插值颜色{}：启用{}线性插值{}，基本上是“平滑”像素。对于清晰的像素图形，它应该处于禁用状态，但如果您有漂亮的Alpha混合和平滑的边缘图形，则最好保持启用状态。默认情况下，此选项处于启用状态。",
    "{}NOTE{}: Be aware that the larger the size of the texture page, the less compatible your game will be on PC\u0027s with lower specifications.":"{}注意{}：请注意，纹理页面越大，您的游戏在PC上的兼容性就越低。",
    "{}Scaling{}: Here you can choose to maintain aspect ratio (so a 4:3 room will be \"letter boxed\" on a 16:9) or to scale fully (stretching the image to fit the full screen).{} {} {}{}WARNING!{} {}Switching off the application surface will disable all the scaling options set in the Windows Game Options until it has been switched back on again. See The Application Surface for further details.{}{} ":"{}缩放比例{}：您可以在此选择保持纵横比（因此4:3的房间将以16:9的比例“扩容”）或缩放（拉伸图像以适应整个屏幕）。{}{}{}{}警告!{}{}关闭应用程序表面将禁用“Windows游戏选项”中设置的所有缩放选项，直到它再次打开。有关详细信息，请参阅“应用程序表面”。{}{}",
    "{}Scaling{}: Here you can choose to maintain aspect ratio (so a 4:3 room will be \"letter boxed\" on a 16:9) or to scale fully (stretching the image to fit the full screen).{} {} {}{}{}{}WARNING{}{}&nbsp;Switching off the application surface will disable all the scaling options set in the Windows Game Options until it has been switched back on again. See The Application Surface for further details.{}{} ":"{}缩放比例{}：您可以在此处选择保持纵横比(这样4：3的房间将以16：9的比例显示)或完全缩放(拉伸图像以适应整个屏幕)。{}{}{}{}{}{}警告{}{} 关闭应用程序界面将禁用在Windows游戏选项中设置的所有缩放选项，直到再次打开为止。有关更多详细信息，请参阅应用程序界面。{}{}",
    "{}Start Fullscreen{}: If this is checked, the game will start in fullscreen mode otherwise it will start windowed. This is off by default.":"{}全屏开始{}：如果选中此项，游戏将以全屏模式开始，否则将以窗口模式开始。默认情况下，此选项处于禁用状态。",
    "{}The graphics options are those that you should configure to determine how your game will use the graphics card of your target Windows PC. The following options are included for you to modify:":"{}图形选项是您应该配置的选项，以确定您的游戏将如何使用目标为Windows PC的显卡。您可以修改以下选项：",
    "{}The images section is where you supply the images that your game requires. For Windows, you need to supply an {}Icon{} file (that must be in {}.ico{} format) and also a splash screen (which can be {}.png{}, {}.bmp{}, {}.jpg{} or {}.gif{} format). The splash screen will be shown while the game loads, and can be enabled or disabled by checking the {}Use Splash Screen{} option (which is off by default).":"{}图像部分是您提供游戏所需图像的位置。对于Windows，您需要提供{}图标{}文件（必须为{}.ico{}格式）和闪屏（可以为{}.png{}、{}.bmp{}、{}.jpg{}或{}.gif{}格式）。加载游戏时将显示闪屏，并且可以通过选中{}使用闪屏{}选项（默认情况下处于关闭状态）来启用或禁用闪屏。",
    "{}The {}General {}page for Windows games is where you should supply the necessary information for Windows to display when your game has been installed and is running. This information goes in the {}Product Information{} section, and should be filled out completely.":"{}Windows游戏的{}常规{}页面应为Windows提供安装和运行游戏时显示的必要信息。此信息位于{}产品信息{}部分，应完整填写。",
    "{}Use synchronization to avoid tearing{}: This toggles {}v-sync{} on or off. Note, that if you have a game with a room speed of 120 and the player has a monitor with a refresh rate of 60, turning this option on will lock your game speed to 60 too. This is off by default.":"{}使用同步以避免撕裂{}：这将打开或关闭{}v-sync{}。请注意，如果您有一个房间速度为120的游戏，并且玩家有一个刷新率为60的显示器，则启用此选项也会将您的游戏速度锁定为60。默认情况下，此选项处于禁用状态。",
    "{}Windows games can be created with an {}installer {}and here you can define the various settings and graphics that {}GameMaker{} will use when creating it. First of all we have the graphical options which will define the look of the installer itself:":"{}可以使用{}安装程序{}创建Windows游戏，您可以在此处定义{}GameMaker{}在创建时将使用的各种设置和图形。首先，我们有定义安装程序本身外观的图形选项：",
    "{}{}NOTE{}{}&nbsp;Be aware that the larger the size of the texture page, the less compatible your game will be on PC\u0027s with lower specifications.":"{}{}注意{}{} 请注意，纹理页面越大，您的游戏在规格较低的 PC 上的兼容性就越差。",
    "{}{}NOTE{}{}&nbsp;In addition to the Sleep Margin, you can further control your performance and power consumption on Windows by adjusting the {}thread scheduler\u0027s resolution{} at runtime.":"{}{}注意{}{}除了睡眠边距，您还可以通过在运行时调整{}线程调度程序的分辨率{}来进一步控制Windows上的性能和功耗。"
}