{
    "A list of the channels {} {}Red means this channel is not currently doing any work{} {}Yellow means the channel is in initial state (not yet decoding or playing){} {}Green means the track is currently seeking/decoding{} {}Purple means the channel has run out of data{} {} ":"频道列表{}{}红色表示此通道当前未执行任何工作{}{}黄色表示频道处于初始状态(尚未解码或播放){}{}绿色表示音轨当前正在搜索/解码{}{}紫色表示通道已用完数据{}{}",
    "A profiling bar that shows what work the decoding thread is doing {} {}blue means a file is being read for the first time{} {}red means the thread is reading a file to find out where to read from{} {}green means the thread is decoding data{} {}purple means the thread is sleeping until it needs to work{} {} ":"显示解码线程正在执行的工作的性能分析栏{}{}蓝色表示第一次读取文件{}{}红色表示线程正在读取文件，以找出从哪里读取{}{}绿色表示线程正在解码数据{}{}紫色表示线程在需要工作之前处于休眠状态{}{}",
    "How many channels are in it":"里面有多少个频道？",
    "How many times the sync group has failed (this means it\u0027s tried to do too much work)":"同步组失败了多少次(这意味着它尝试做了太多的工作)",
    "Note that for general debugging of audio, you also have the function {}{}audio_debug(){}{}.":"请注意，对于音频的一般调试，您还有函数{}{}audio_debug(){}{}。",
    "Note that for general debugging of audio, you also have the function {}{}audio_debug{}{}.":"请注意，对于音频的一般调试，您还可以使用函数{}{}audio_debug{}{}。",
    "The above code will switch on or off the audio sync group debug overlay showing the sync group indexed in the variable \"sg\" depending on whether the game is run in debug mode or not.":"上述代码将打开或关闭音频同步组调试覆盖，显示变量\"sg\"中索引的同步组，这取决于游戏是否在调试模式下运行。",
    "The group index to debug, or -1 to switch off the debugging.":"要调试的组索引，或-1关闭调试。",
    "This function can be used to display debug information about any given sync group (the group index is the value returned when the group was created using the function {}{}audio_create_sync_group(){}{}). You can call the function with a value of -1 to switch off the overlay.":"其函数可用于显示关于任何给定同步组的调试信息(组索引是使用函数{}{}audio_create_sync_group(){}{}创建组时返回的值)。 可以调用值为-1的函数以关闭覆盖。",
    "This function displays debug information about any given sync group (the group index is the value returned when the group was created using the function {}{}audio_create_sync_group{}{}). You can call the function with a value of -1 to switch off the overlay.":"此函数显示有关任何给定同步组的调试信息(组索引是使用函数{}{}audio_create_sync_group{}{}创建组时返回的值)。您可以使用值 -1 来调用该函数来关闭覆盖。",
    "When you are debugging the audio sync groups, the overlay will show:":"调试音频同步组时，覆盖将显示：",
    "Which sync group&nbsp;is debugging":"正在调试哪个同步组",
    "{}{}NOTE{}{}&nbsp;This functionality is not available for the HTML5 target platform.":"{}{}注意{}{}此函数不适用于HTML5目标平台。"
}