{
    "The above code will draw the first frame of the given skeletal animation sprite, using the \"jump\" animation set, the skin defined as \"skin1\" and at the same scale and position as the instance properties define, but with an alpha of 0.5.":"上面的代码将绘制给定骨骼动画子画面的第一帧，使用 \" 跳转 \" 动画集，蒙皮定义为 \"skin1\"，比例和位置与实例属性定义的相同，但 Alpha 为 0.5。",
    "The alpha of the sprite (from 0 to 1 where 0 is transparent and 1 opaque).":"精灵的alpha(从0到1，其中0表示透明，1表示不透明)。",
    "The animation frame to draw (from 0 to image_number - 1).":"要绘制的动画帧(从0到图像_数字-1)。",
    "The colour with which to blend the sprite.":"用于混合精灵的颜色。",
    "The horizontal scaling of the sprite, as a multiplier: 1 = normal scaling, 0.5 is half etc...":"精灵的水平缩放，作为乘数：1=正常缩放，0.5为一半等。",
    "The index of the sprite to draw.":"要绘制的精灵的索引。",
    "The name of the animation to get the frame from (a string).":"要从中获取帧的动画的名称(字符串)。",
    "The name of the skin to use (a string).":"要使用的皮肤的名称(字符串)。",
    "The rotation of the sprite. 0=normal, 90=turned 90 degrees counter-clockwise etc.":"精灵的旋转。0=正常，90=逆时针旋转90度等。",
    "The vertical scaling of the sprite, as a multiplier: 1 = normal scaling, 0.5 is half etc...":"精灵的垂直缩放，作为乘数：1=正常缩放，0.5为一半等。",
    "The x coordinate of where to draw the sprite.":"绘制精灵的位置的X坐标。",
    "The y coordinate of where to draw the sprite.":"绘制精灵的位置的Y坐标。",
    "This function is {}only{} for use with sprites that have been created using a skeletal animation program like Spine. While you can draw these sprites using the normal draw functions (like {}{}draw_self(){}{}), there are times when you may want to draw a single frame or show a change of skin texture without actually changing the sprite properties. In these cases you can draw the sprite with this function, where you give the sprite index and then the name of the animation to get the frame from (a string, as set within the program used to make the sprite). Next you give the name of the skin to use (again, as set when the sprite was made), and a frame value. The frame value is for telling {}GameMaker{} what part of the animation to show and is a value between 0 and the {}{}image_number{}{}. The rest of the arguments are the same as those used for normal sprite drawing and will change the scale, angle, blend colour and alpha of the final animation frame being drawn.{}{}":"此函数{}仅{}用于使用骨骼动画程序(如Spine)创建的精灵。虽然您可以使用正常的绘制函数(如{}{}draw_self(){}{})绘制这些sprite，但有时您可能希望绘制单个帧或显示外观纹理的变化，而不实际更改sprite属性。在这些情况下，您可以使用此函数绘制sprite，在此函数中，您可以给出sprite索引，然后给出要从中获取帧的动画的名称(字符串，在用于制作sprite的程序中设置)。接下来，给出要使用的皮肤的名称(同样，在创建精灵时设置)和帧值。帧值用于告诉{}GameMaker{}要显示动画的哪一部分，并且是介于0和{}{}image_number{}{}之间的值。其余参数与普通精灵绘制所使用的参数相同，并将更改正在绘制的最终动画帧的比例、角度、混合颜色和alpha.{}{}",
    "{}WARNING!{} Because of the way skeletal animations are interpolated between various \"key\" frames, there is an additional overhead associated with this call and therefore it is recommended that you avoid drawing skeleton based sprites using this method unless absolutely necessary.":"{}警告！{}由于骨架动画在各个\"关键\"帧之间的插值方式，此调用会产生额外的开销，因此建议您避免使用此方法绘制基于骨架的精灵，除非绝对必要。"
}