{
    "Finally, and this is exclusively for use with {}instances{} on layers (although the layer itself can have other elements, they will not be affected by the following functions), you have a couple of functions that can be used to deactivate or reactivate all instances:":"最后，这是专门用于图层上的{}实例{}(尽管该图层本身可以具有其他元素，但它们不会受到以下功能的影响)，但有几个功能可用于取消激活或重新激活所有实例：",
    "General Layer Functions":"常规图层函数",
    "The {}GameMaker{} {}Room Editor{} permits you to add {}layers{} of different assets to your room. These can be tile maps (using tile sets), backgrounds, sprites or sequences, and instances, but note that unlike the room editor, you are {}not{} limited to a single asset type per layer, and can add multiple asset types to the same layer - for example you can have a background and a tile map all on the same layer. Note that each asset that is added to a layer is considered an {}element{}&nbsp;of that layer.":"{}GameMaker{}{}房间编辑器{}允许您将{}层{}不同资源添加到您的房间。这些可以是平铺贴图(使用平铺集)、背景、精灵或序列和实例，但请注意，与房间编辑器不同，您{}不限于每个层的单个资源类型，并且可以向同一层添加多个资源类型。例如，您可以在同一层上拥有背景和平铺贴图。请注意，添加到层的每个资源都被视为该层的{}元素{}。",
    "This section outlines the general functions used when working with room layers, as well as a few functions specific to working with {}{}instance layer{}&nbsp;{}elements:":"本节概述了在处理房间图层时使用的一般函数，以及一些特定于使用{}{}实例层{}{}元素的函数：",
    "We also have a couple of extra functions relating to targeting layers in a different room. It may be that you want to change something in a room that is not the current room, or maybe you want to generate rooms procedurally, or any number of things. To enable this we use the following functions:":"我们还有几个与不同房间中的目标层相关的额外功能。您可能想要更改不是当前房间的房间中的某些内容，或者您可能想要按程序生成房间，或者任何数量的内容。为此，我们使用以下函数：",
    "What you do here is set the target room using the appropriate function and then call the layer functions are normal. These layer functions will now apply {}only{} to the target room and not the current one. When you are finished you\u0027d call the reset function to return the code scope back to the current room again.":"您在这里所做的是使用适当的函数设置目标房间，然后调用层函数是正常的。这些图层功能现在将{}仅{}应用于目标房间，而不应用于当前房间。完成后，您可以调用重置函数将代码范围重新返回到当前房间。",
    "{}WARNING!{} While targeting another room, you can use all the regular layer functions {}except{} you cannot create instances using {}{}{}instance_create_layer(){}{}{} or {}{}{}instance_create_depth(){}{}{}, nor will the layer function {}{}{}layer_add_instance(){}{}{}&nbsp;be available.":"{}警告!{} 将另一个房间作为目标时，您可以使用除此{}之外的所有常规图层函数{}，不能使用 {}{}{}instance_create_layer(){}{}{} 或 {}{}{}instance_create_depth(){}{}{} 创建实例，也不能使用图层函数 {}{}{}layer_add_instance(){}{}{}。"
}