{
    "In this extended example, we will first show you how a simple script function&nbsp;is structured to set some shader uniform data so that when the given layer is drawn, this function will be run and the shader will work correctly. In the example, it is worth noting how we check which event is being called so that the rest of the function is only run on the specific event that we require it to work on - in this case, only on the main draw event:":"在这个扩展示例中，我们首先演示如何构造一个简单的脚本函数来设置一些着色器统一数据，这样绘制给定层时，该函数将运行，并且着色器将正常工作。在本例中，值得注意的是，我们如何检查正在调用的事件，以便函数的其余部分仅运行在本例中需要它工作的特定事件上，仅运行在主绘制事件上：",
    "Now that we have defined our script functions for setting the shader, we then have to assign them to a specific layer so that the layer knows to call them. This would be done in the room creation code, or in the create event or room start event of some controller object (they do not need to be set every step, but rather once at the start of the room, or when the layer is initially created):":"既然我们已经定义了设置着色器的脚本函数，那么我们必须将它们分配给特定层，以便层知道调用它们。这将在房间创建代码中完成，或在某些控制器对象的创建事件或房间开始事件中完成(它们不需要每个步骤都设置，而是在房间开始或最初创建层时设置一次)：",
    "The script function index to assign to the layer":"分配给层的脚本函数索引",
    "The unique ID value of the layer to target (or the layer name as a string)":"目标层的唯一ID值(或作为字符串的层名)",
    "This final code block assigns the scripts to the layer.":"最后一个代码块将脚本分配给层。",
    "We would then have a companion function to reset the shader after all the drawing is done:":"然后，在完成所有绘图后，我们将使用一个配套功能重置着色器：",
    "With this function you can assign a {}script function{} to a layer and it will be called before the layer is rendered. When adding a function to a layer, in this way it will be run at the start of {}each of the different draw events{} so you may want to check in the function assigned which event is currently rendering and adapt the code to suit. This can be done by checking the {}{}event_type{}{} and/or the {}{}event_number{}{} (see the extended example below). Note that the function is {}not{} meant to be called in any draw events or step events, but rather only needs to be called at the start of the room in the {}Room Creation Code{} or in the {}Create Event&nbsp;{}/ {}Room Start Event{} of an instance.":"使用此函数，可以将{}脚本函数{}指定给层，并在渲染该层之前调用该函数。向层添加函数时，以这种方式，它将在{}每个不同的绘制事件{}的开始运行，因此您可能希望签入分配的函数，哪个事件当前正在渲染，并调整代码以适应。这可以通过检查{}{}event_type{}{}和/或{}{}event_number{}{}(参见下面的扩展示例)来完成。请注意，函数{}不是{}意在在任何绘制事件或步骤事件中调用，而只是需要在{}房间创建代码{}或实例的{}创建事件{}/{}房间开始事件{}中的房间开始{}开始时调用。"
}