{
    "If you create a new layer through code using the function {}{}layer_create(){}{} then that function will return the unique ID handle instead (dynamical created layers do not get names unless specified).":"如果您使用函数 {}{}layer_create(){}{} 通过代码创建新层，则该函数将返回唯一的 ID 句柄 (动态创建的层不会获取名称，除非指定)。",
    "In the IDE, all layers have a name and a type, and to be able to edit or change them through code you must get the {}layer ID{} value. This function is used to retrieve this ID by using the name (a string) of the layer (as written in the IDE).":"在 IDE 中，所有层都有名称和类型，为了能够通过代码编辑或更改它们，您必须获取 {} 层 ID{} 值。此函数用于通过使用层的名称 (字符串 )( 如 IDE 中所写) 来检索此 ID。",
    "Note that if you give the name of a layer that does not exist in the current room, the function will return -1.":"请注意，如果您给出当前房间中不存在的图层名称，该函数将返回 -1。",
    "The above code will first get the index of the nearest instance to the given x/y position and store it in a local variable. It then gets the unique instance layer ID for the layer named \"Instances Front\", and moves the found instance onto that layer.":"上面的代码将首先获取距离给定 x/y 位置最近的实例的索引，并将其存储在局部变量中。然后，它获取名为 \"Instances Front\" 的层的唯一实例层 ID，并将找到的实例移动到该层上。",
    "The name of the layer (a string)":"层的名称(字符串)",
    "This function can be used to get the unique ID handle for a given {}layer{}.":"此函数可用于获取给定 {} 层{} 的唯一 ID 句柄。",
    "This function can be used to get the unique ID value for a given {}layer{}. In the IDE, all layers have a name and a type, and to be able to edit or change them through code you must give the {}layer ID{} value. This function is used to retrieve this ID by using the name (a string) of the layer (as written in the IDE). If you create a new layer through code using the function {}{}layer_create(){}{} then that function will return the unique ID value instead (dynamical created layers do not get names). Note that if you give the name of a layer that does not exist in the current room, then you will get an error and the project will crash.":"此函数可用于获取给定{}层{}的唯一ID值。 在 IDE 中，所有层都有名称和类型，要能够通过代码对其进行编辑或更改，必须给出{}层ID{}值。此函数用于使用层的名称(字符串)(如 IDE 中写入的)检索此 ID。如果使用函数{}{}layer_create(){}{}通过代码创建新层，则该函数将返回唯一的ID值(动态创建的层不会获得名称)。请注意，如果给出当前房间中不存在的层的名称，则会出错，项目将崩溃。"
}