{
    "The above code sets the target room to the room \"rm_Game\" and then gets the layer ID for the layer called \"SpriteAssets\" in that room. This layer ID is then used to add 50 random sprite assets to the layer, before the layer target is reset to the current room.":"上述代码将目标房间设置为\"rm_Game\"房间，然后获取该房间中名为\"SpriteAssets\"的层的层ID。然后，在将层目标重置为当前房间之前，使用该层ID向该层添加50个随机精灵资源。",
    "The room to target for all further layer functions":"所有其他层函数的目标空间",
    "The room to target for all further layer functions,&nbsp;or -1 for the current room":"所有其他层功能的目标房间，或当前房间的 -1",
    "This function tells&nbsp;{}GameMaker{} that {}all further layer functions should be applied to the given room{}. In this way you can procedurally change or generate layers and layer contents in a room that is not the current room.":"此函数告诉 {}GameMaker{}，{} 所有其他层函数都应应用于给定房间 {}。通过这种方式，您可以在非当前房间的房间中按程序更改或生成图层和图层内容。",
    "When you are finished adding layers or layer elements to a room, call the function&nbsp;{}{}layer_reset_target_room{}{} to reset the room target or call this function again with a {}room{} argument of {}-1{}.":"当您完成向房间添加图层或图层元素后，调用函数 {}{}layer_reset_target_room{}{} 重置房间目标，或使用 {}-1{} 的 {}room{} 参数再次调用此函数。",
    "When you call this function you are telling {}GameMaker{} that {}all further layer functions should be applied to the given room{}. In this way you can procedurally change or generate layers and layer contents in a room that is not the current room. When you are finished adding layers or layer elements to a room, call the function {}{}layer_reset_target_room(){}{} to reset the room target (or call this function again with a room argument of -1). Note that this function can only be used on {}rooms other than the current room{}, and is designed so that you can add/remove layers and layer elements to rooms other than the room that is currently running.":"调用此函数时，您告诉{}GameMaker{}，{}所有其他层函数都应用于给定房间{}。 这样，您可以在非当前房间的房间中以程序方式更改或生成图层和图层内容。完成向房间添加图层或图层元素后，调用函数{}{}layer_reset_target_room(){}{}重置房间目标(或以房间参数 - 1)再次调用此函数。请注意，此函数只能在{}房间(当前房间{}除外)上使用，并且旨在将图层和图层元素添加到当前运行的房间以外的房间。",
    "{}WARNING!{} While targeting another room, you can use all the regular layer functions {}except{} you cannot create instances using {}{}{}instance_create_layer(){}{}{} or {}{}{}instance_create_depth(){}{}{}, nor will the layer function {}{}{}layer_add_instance(){}{}{} be available.":"{}警告！{}瞄准其他房间时，可以使用所有常规层函数{}，但{}您无法使用{}{}{}instance_create_layer(){}{}{}或{}{}{}instance_create_depth(){}{}{}创建实例，层函数{}{}{}layer_add_instance(){}{}{}{}也不可用。",
    "{}{}WARNING{}{}&nbsp;While targeting another room, you can use all the regular layer functions {}except{} you cannot create instances using&nbsp;{}{}instance_create_layer{}{} or {}{}instance_create_depth{}{}, nor will the layer function&nbsp;{}{}layer_add_instance{}{} be available.":"{}{} 警告{}{} 当定位另一个房间时，您可以使用所有常规图层函数，{} 但 {} 您无法使用 {}{}instance_create_layer{}{} 或 {}{}instance_create_depth{}{} 创建实例，层函数 {}{}layer_add_instance{}{} 也不可用。"
}