{
    "Note that this is generally only for use with legacy projects from previous versions of&nbsp;{}GameMaker{} where you could have draw depths higher or lower than the permitted layer range.":"请注意，这通常仅适用于 {}GameMaker{} 早期版本的旧项目，您的绘制深度可能高于或低于允许的图层范围。",
    "The above code checks to see if the layer Z depth is forced or not and if it is not, it sets the Z depth to 0 and enables it.":"上面的代码检查层Z深度是否被强制，如果不是，它将Z深度设置为0并启用它。",
    "The new Z depth":"新Z深度",
    "This function forces {}all{} layers to be drawn at the specified z depth.":"此函数强制以指定的 z 深度绘制 {} 所有 {} 层。",
    "This function forces {}all{} layers to be drawn at the specified z depth. This {}does not change the order the layers are rendered in{} and they\u0027ll still be drawn in depth order, it simply changes what z value is used. In general you do not need to worry about this, but if you have layers that have a depth outside of the legal range (-16000 to 16000) then they won\u0027t be rendered, so you can force the Z depth to a reasonable value - 0 for example - and they will all be rendered fine. Note that this is generally only for use with legacy projects from previous version of {}GameMaker{} where you could have draw depths higher or lower than the permitted layer range.":"此函数强制{}所有{}层以指定的 z 深度绘制。这{}不会更改层在{}中渲染的顺序，它们仍将按深度顺序绘制，它只是更改所使用的 z 值。一般来说，您不需要担心这一点，但是如果您的层的深度超出法律范围(-16000 到 16000)，那么它们不会被渲染，所以您可以强制 Z 深度为一个合理的值，例如，0，它们都将被渲染良好。请注意，这通常仅用于以前版本的{}GameMaker{}遗留项目，在该版本中，绘制深度可能高于或低于允许的图层范围。",
    "This function will take precedence over the depth set with&nbsp;{}{}gpu_set_depth{}{}&nbsp;in any object instances running within the specified layer.":"在指定层中运行的任何对象实例中，此函数将优先于使用 {}{}gpu_set_depth{}{} 设置的深度。",
    "This {}does not change the order the layers are rendered in{} and they\u0027ll still be drawn in depth order, it simply changes what z value is used. In general you do not need to worry about this, but if you have layers that have a depth outside of the allowed range ({}-16000{} to {}16000{}) then they won\u0027t be rendered, so you can force the Z depth to a reasonable value - 0 for example - and they will all be rendered fine.":"这 {} 不会改变层的渲染顺序 {}，并且仍会按深度顺序绘制它们，它只是更改所使用的 z 值。一般来说，您无需担心这一点，但如果您的图层的深度超出了允许的范围 ({}-16000{} 到 {}16000{})，那么它们将不会被渲染，因此您可以强制 Z 深度为合理的值 (例如 0)，它们都会被渲染得很好。",
    "Whether to enable (set to {}true{} or disable (set to {}false{}) Z depth forcing":"是启用(设置为{}true{})还是禁用(设置为{}false{})Z深度强制",
    "Whether to enable (set to {}true{}) or disable (set to {}false{}) Z depth forcing":"是否启用 (设置为 {}true{}) 或禁用 (设置为 {}false{})Z 深度强制"
}