{
    "Keep in mind that modifying the depth of a layer may change which {}Filters &amp; Effects{} are applied on it, as changing the depth to be&nbsp;lower than an&nbsp;FX layer\u0027s depth will no longer apply its effect on the layer.":"请记住，修改层的深度可能会改变哪些{}过滤器&效果{}应用于它，因为将深度更改为低于FX层的深度将不再将其效果应用于该层。",
    "The above code gets the depth of the layer that the instance running the code is on, and if it is not -100 then the depth is set to -100.":"上面的代码获取运行代码的实例所在的层的深度，如果它不是-100，则深度被设置为-100。",
    "The following image shows a schematic of how depth works for layers:":"下图显示了层的深度工作原理示意图：",
    "The new depth for the layer":"该层的新深度",
    "The unique ID value of the layer to set the depth of (or the layer name as a string)":"层的唯一ID值，用于设置的深度(或层名称为字符串)",
    "This function can be used to change the {}depth{} of the given layer, changing the order in which its contents will be rendered to the screen. You supply the layer ID (which you get when you create the layer using {}{}layer_create(){}{}) or the layer name (as a string - this will have a performance impact) and then give the new depth to set it to (an integer value form -16000 to 16000). The layer depth is defined as being higher when \"further away\" from the camera and lower when \"closer\" to the camera, so if you have three layers with depths -100, 0, 100, the layers will draw in the order 100, 0, -100, so that the \"top\" layer (i.e., the closest to the camera view and so drawn over everything else) will be the layer with the -100 depth.":"此功能可用于更改给定层的{}深度{}，更改其内容将呈现到屏幕的顺序。提供层 ID(使用{}{}layer_create(){}{}创建层时获得的 ID)或层名称(作为字符串，这将产生性能影响)，然后给出新深度以将其设置为(整数值从 16000 到 16000)。层深度被定义为当\"远离\"相机时较高，而当\"更靠近\"相机时较低，因此，如果您有三个具有深度的层(100、0、100)，则层将按100、0、-100的顺序绘制，因此\"顶部\"层(即，最接近相机视图的层，因此在其它所有地方上绘制)将是具有-100深度的层。",
    "{}Note that you can check the depth of a layer at any time using the function {}{}layer_get_depth(){}{}. Also note that the minimum and maximum layer depths are -16000 to 16000, and anything outside of those depths {}will not be rendered{}. If you require a depth outside of that range then you will need to use the function {}{}layer_force_draw_depth(){}{}.":"{}请注意，您可以随时使用函数{}{}layer_get_depth(){}{}检查层的深度。 同时请注意，最小和最大层深度为-16000至16000，超出这些深度{}的任何内容都不会呈现{}。 如果需要超出该范围的深度，则需要使用函数{}{}layer_force_draw_depth(){}{}。"
}