{
    "The above code will create a new layer with a depth value of -100 and assign its ID value to a global variable.":"上面的代码将创建一个深度值为-100的新层，并将其ID值分配给一个全局变量。",
    "The depth that the layer has to be created at.":"必须创建层的深度。",
    "The following image shows a schematic of how depth works for layers:":"下图显示了深度如何作用于层的示意图：",
    "This function is used to create a new layer within the current room. You supply the depth that the new layer is to occupy and the function returns the unique Layer ID value that can then be used to access the layer in further functions. You can also supply an optional \"name\" argument, which will enable you to give the layer a specific name (as a string), and instead of using the layer ID to access the layer, you can use this name string instead, although it should be noted that using name strings will have a greater impact on performance than using just the ID value. If you do not specify the name of the layer, then the created layer will be assigned a name with the format \"{}_layer_XXX{}\", where \"XXX\" is a hex value used to give the layer a unique name.":"此功能用于在当前房间内创建新层。您可以提供新图层要占据的深度，并且该函数返回唯一的图层 ID 值，然后该值可用于在进一步的函数中访问该图层。还可以提供一个可选的\"name\"参数，这将使您能够给层指定一个特定的名称(作为字符串)，而不用使用层 ID 来访问层，而是可以使用这个名称字符串，不过应该注意，使用名称字符串对性能的影响比仅使用 ID 值更大。如果未指定层的名称，则将为创建的层分配一个格式为\"{}_layer_XXX{}\"的名称，其中\"XXX\"是十六进制值，用于给层赋予唯一名称。",
    "When giving a depth value, this will be higher the \"further away\" from the camera the layer is and lower the \"closer\" to the camera the layer is, so if you have three layers with depths -100, 0, 100, the layers will draw in the order 100, 0, -100, so that the \"top\" layer (ie, the closest to the camera view and so drawn over everything else) will be the layer with the -100 depth.":"当给出深度值时，该深度值将越高\"离相机越远\"该层，越低\"离相机越近\"该层，因此，如果您有三个具有深度(100、0、100)的层，这些层将按100、0、- 100的顺序绘制，因此\"顶部\"层(即最接近相机视图的层，因此在其它所有地方绘制)将是具有-100深度的层。",
    "{}It is worth noting that while you {}can{} assign more than one layer to a single depth, {}there is no way that you can guarantee that layers on the same depth will be drawn in any given order{} and as such it is best to assign only one layer to any given depth. Also note that the minimum and maximum layer depths are -16000 to 16000, and anything outside of those depths {}will not be rendered{}. If you require a depth outside of that range then you will need to use the function {}{}layer_force_draw_depth(){}{}.":"{}值得注意的是，虽然{}可以{}为单个深度指定多个层，{}您无法保证以任何给定顺序绘制同一深度上的层{}，因此最好只为任何给定深度指定一层。同时请注意，最小和最大层深度为-16000至16000，超出这些深度{}的任何内容都不会呈现{}。 如果需要超出该范围的深度，则需要使用函数{}{}layer_force_draw_depth(){}{}。",
    "{}OPTIONAL{} The name to give the layer (a string).":"{}可选{}层的名称(字符串)。"
}