{
    "The above code will enable lighting for the whole scene, then define a white light at a specific point in the room space, and then finally turn that light on.":"上述代码将为整个场景启用照明，然后在房间空间的特定点定义白光，然后最终打开该光照。",
    "The colour to use for the light (either a constant, a real or a hex value)":"用于灯光的颜色 (常数、实数或十六进制值)",
    "The colour to use for the light (either a constant, a real or a hex value).":"用于光照的颜色(常数、实数或十六进制值)。",
    "The index number of the light (arbitrary)":"光源的索引号(任意)",
    "The light range (in pixels)":"光线范围(以像素为单位)",
    "The x component of the light position":"灯光位置的 x 分量",
    "The x position of the light":"光照的x位置",
    "The y component of the light position":"灯光位置的 y 分量",
    "The y position of the light":"光照的y位置",
    "The z component of the light position":"灯光位置的 z 分量",
    "The z position of the light":"光照的z位置",
    "This function defines a positional light.":"该函数定义了位置光。",
    "This function is for defining a positional light, where you can define the x, y and z position of the light, the light range and its colour (which will also affect the perceived intensity of the light as certain colours appear \"darker\" than others). You must also give the light an index number which what will be used in other functions to reference it.{}{}":"此函数用于定义位置光照，您可以在其中定义光照的x、y和z位置、光照范围及其颜色(当某些颜色比其他)。您还必须为光照提供一个索引号，其他函数将使用该索引号来引用它。{}{}",
    "You can define the x, y and z position of the light, the light range and its colour (which will also affect the perceived intensity of the light as certain colours appear \"darker\" than others). You must also give the light an index number which is used in other functions to reference it.{}{}":"您可以定义灯光的 x、y 和 z 位置、灯光范围及其颜色 (这也会影响灯光的感知强度，因为某些颜色看起来比其他颜色 \" 更暗 \")。您还必须为灯光指定一个索引号，以便在其他函数中引用它。{}{}",
    "{}NOTE{}: There are only 8 hardware lights available, so only 8 defined lights can be enabled at any one time (although more can be defined).":"{}注意{}：只有8个硬件指示灯可用，因此任何时候只能启用8个定义的指示灯(尽管可以定义更多)。",
    "{}{}NOTE{}{}&nbsp;There are only 8 hardware lights available, so only 8 defined lights can be enabled at any one time (although more can be defined).":"{}{} 注意{}{} 只有 8 个可用的硬件灯光，因此一次只能启用 8 个定义的灯光 (尽管可以定义更多灯光)。"
}