{
    "Asset Browser Preferences":"资源浏览器首选项",
    "{}Apply asset colours in Quick Access{}: When checked, this option will use the colours set for any given asset type to colour the asset in the Quick Access section of the browser. Unchecking this option will not use the asset colour. This is enabled by default.":"{}在快速访问中应用资源颜色{}：选中后，此选项将使用为任何给定资源类型设置的颜色来为浏览器的快速访问部分中的资源着色。取消选中此选项将不使用资源颜色。这在默认情况下是启用的。",
    "{}Automatic response to GML Visual conversion to GameMaker Language{}: When you select the option to convert a GML Visual node to GML, you will be prompted to confirm the change as this cannot be undone. By setting this option to \"OK\" the warning will be suppressed as if you had clicked the \"OK\" button to proceed. The default value is \"Show Message\".":"{}自动响应 GML 可视化转换为 GameMaker 语言{}：当您选择将 GML 可视化节点转换为 GML 的选项时，系统将提示您确认更改，因为此操作无法撤消。通过将此选项设置为 \"OK\"，警告将被忽略，就像您已经单击了 \"OK\" 按钮以继续。默认值为 \"显示消息\"。",
    "{}Automatic response to Room Order group deletion{}: When you delete a group folder containing rooms from the Asset Browser you normally get a warning asking if you are sure and want to proceeed (which lists all the rooms in the group that will be deleted). By setting this option to \"OK\", the message will be supressed as if you had clicked the OK button to proceed and delete all the rooms in the group as well as the group folder itself. The default valueis \"Show Message\".":"{}自动响应房间顺序组删除{}：从资源浏览器中删除包含房间的组文件夹时，通常会收到一条警告，询问您是否确定并要继续(其中列出了组中要删除的所有房间)。通过将此选项设置为\"OK\"，消息将被忽略，就好像您已经单击了OK按钮以继续并删除组中的所有房间以及组文件夹本身。默认值为\"显示消息\"。",
    "{}Automatic response to asset deletion{}: When you delete an asset from the Asset Browser you normally get a warning asking if you are sure you want to proceed. By setting this option to \"OK\" the message will be suppressed as if you had clicked the \"OK\" button to proceed. The default value is \"Show Message\".":"{}自动响应资源删除{}：从资源浏览器中删除资源时，通常会收到一条警告，询问您是否确实要继续。通过将此选项设置为\"OK\"，消息将被忽略，就像您已经单击了\"OK\"按钮以继续。默认值为\"显示消息\"。",
    "{}Automatic response to duplicate group name error{}: When you create a group folder for organising your assets and name it the same as another folder in the browser, you will be shown a message asking if you wish to continue and have two folders with the same name. By setting this option to \"OK\" the warning will be suppressed as if you had clicked the \"OK\" button to proceed. The default value is \"Show Message\".":"{}自动响应重复组名称错误{}：当您创建一个用于组织资源的组文件夹并将其命名为浏览器中的另一个文件夹时，将显示一条消息，询问您是否要继续并拥有两个同名的文件夹。通过将此选项设置为\"OK\"，警告将被忽略，就像您已经单击了\"OK\"按钮以继续。默认值为\"显示消息\"。",
    "{}Automatic response to opening multiple assets{}: As mentioned above in the general Asset Browser preferences, when you open multiple assets at once from the Asset Browser, you can get a warning if the number exceeds the number specified. By setting this option to \"OK\" the warning will be suppressed as if you had clicked the \"OK\" button to proceed. The default value is \"Show Message\".":"{}自动响应打开多个资源{}：如上所述，在常规资源浏览器首选项中提到，当您从资源浏览器一次打开多个资源时，如果数量超过指定的数量，则会收到警告。通过将此选项设置为\"OK\"，警告将被忽略，就像您已经单击了\"OK\"按钮以继续。默认值为\"显示消息\"。",
    "{}Automatic response to setting a room parent via node drag{}: In the Room Manager window \"Inheritance\" section, you can drag a room onto another room to set it as a child of the room it is being dragged on to. When doing this you will&nbsp;get a warning asking if you are sure and want to proceeed. By setting this option to \"OK\", the message will be supressed as if you had clicked the OK button to proceed. The default valueis \"Show Message\".":"{}自动响应通过节点拖动设置房间父级{}：在房间管理器窗口的继承部分，您可以将一个房间拖到另一个房间上，将其设置为被拖动到的房间的子级。执行此操作时，您将收到一条警告，询问您是否确定并要继续。通过将此选项设置为\"OK\"，消息将被忽略，就像您已经单击了OK按钮以继续。默认值为\"显示消息\"。",
    "{}Automatic response to setting a room parent via node drag{}: When you drag a room over another room in the Room Manager and then release it, you will be shown a message asking if you wish to make the room a \"child\" of the room being dropped on. By setting this option to \"OK\" the warning will be suppressed as if you had clicked the \"OK\" button to proceed. The default value is \"Show Message\"":"{}自动响应通过节点拖动设置父房间{}：当您在房间管理器中将一个房间拖到另一个房间上并将其释放时，将显示一条消息，询问您是否希望将该房间设置为所放房间的\"孩子\"。通过将此选项设置为\"OK\"，警告将被忽略，就像您已经单击了\"OK\"按钮以继续。默认值为\"显示消息\"",
    "{}Colour Palette Size{}: Here you can set the number of colours available to you in the asset browser palette for asset groups. The default value is 16, with a minimum value of 16 and a maximum value of 100.":"{}调色板大小{}：您可以在此设置资源浏览器调色板中可用于资源组的颜色数量。默认值为16，最小值为16，最大值为100。",
    "{}Confirm Dialogs{}{}Confirm Dialogs{}":"{}确认对话框{}{}确认对话框{}",
    "{}Create asset dialogue style{}: When you click the \"Add Asset\" button in the Asset Browser, you will be presented with a window showing you the different assets that can be added to your project. This window can be presented in a list view or a grid view, and this setting governs which is shown by default. Default value is grid.":"{}创建资源对话样式{}：当您在资源浏览器中单击\"添加资源\"按钮时，您将看到一个窗口，其中显示了可以添加到项目中的不同资源。此窗口可以在列表视图或网格视图中显示，此设置控制默认显示的内容。默认值为栅格。",
    "{}Create default folders in new project{}: When enabled, this option will have all new projects start with the default asset folders already created, and when disabled, only a room folder will be created with the default room required by all projects. This option is enabled by default.":"{}在新项目中创建默认文件夹{}：如果启用该选项，则所有新项目将从已经创建的默认资源文件夹开始如果禁用，则仅使用所有项目所需的默认房间创建房间文件夹。默认情况下，此选项处于启用状态。",
    "{}Default sort folders first{}: When this is enabled, the asset browser will sort folders first, then any \"loose\" assets second, while if this is disabled then all assets and folders will be sorted together. This is enabled by default.":"{}首先对文件夹进行默认排序{}：启用该选项后，资源浏览器将首先对文件夹进行排序，然后再对任何\"松散\"资源进行排序，而如果禁用该选项，则所有资源和文件夹都将一起进行排序。这在默认情况下是启用的。",
    "{}Default sort order{}: This can be used to set the default sort order for assets in the browser, either alphabetical oder from A to Z or from Z to A. Default is from A to Z.":"{}默认排序顺序{}：可用于设置浏览器中资源的默认排序顺序，按字母顺序从A到Z或从Z到A。默认顺序为从A到Z。",
    "{}Default zoom (%){}: This sets the default zoom percentage for the Asset Browser when you start a new project. The default value is 100%.":"{}默认缩放比例(%){}：这将在您启动新项目时设置资源浏览器的默认缩放百分比。默认值为100%。",
    "{}Expand tree on filter change{}: This option will force the Asset Browser to expand any collapsed tree nodes when yuou change the filter options. Disabling the option will prevent this. Default is enabled.":"{}更改过滤器时展开树{}：当您更改过滤器选项时，此选项将强制资源浏览器展开任何折叠的树节点。禁用该选项将防止出现这种情况。默认为已启用。",
    "{}Group colours override child colours{}: When checked, this will use the top level group colour to colour any assets within the group, ignoring any colour that was set for the individual asset. This is disabled by default.":"{}组颜色优先于子颜色{}：选中后，将使用顶级组颜色为组内的所有资源上色，忽略为单个资源设置的任何颜色。默认情况下，此选项处于禁用状态。",
    "{}Here you can select the behaviour of the confirmation dialogs when working with an asset from the Asset Browser. The available options are:":"{}在此，您可以从资源浏览器中选择使用资源时确认对话框的行为。可用选项包括：",
    "{}Maximum number of assets to open simultaneously without warning{}: You can select multiple assets for opening at a time by using {}&nbsp;/ {}&nbsp;+&nbsp; {} to select them and then right clicking {}&nbsp;and choosing open all. If you have selected more than the number specified in this option, then you will be shown a warning, since having too many assets open at one time can cause issues with performance on lower end machines. The default value is 10.":"{}同时打开的资源的最大数量没有警告{}：您可以选择一次打开多个资源，方法是使用{} /{} + {}选中这些资源，然后用鼠标右键单击{} ，然后选择[全部打开]。如果您选择的数量超过此选项中指定的数量，则会显示一条警告，因为一次打开的资源太多可能会导致低端计算机的性能出现问题。默认值为10。",
    "{}Maximum recently edited items{}: This setting governs the number of assets listed in the \"Recent\" section of the Asset Browser. The default value is 10.":"{}最近编辑的最大项目数{}：此设置控制在资源浏览器的\"最近\"部分中列出的资源数量。默认值为10。",
    "{}Maximum zoom (%){}: This sets the maximum zoom value permitted for the Asset Browser. Default is 250%.":"{}最大缩放比例(%){}：此选项设置资源浏览器允许的最大缩放值。默认值为250%。",
    "{}Minimum zoom (%){}: This sets the minimum zoom value permitted for the Asset Browser. Default is 50%.":"{}最小缩放比例(%){}：此选项设置资源浏览器允许的最小缩放值。默认值为50%。",
    "{}Object double click opens all object events{}: By default double clicking {}&nbsp;on any asset will open that asset for editing, but often when dealing with objects, after the initial setup when you create the new asset, you open it to edit the events only rather than the object properties. Selecting this option will open the different object events in a new workspace, with each event being given its own tab within the new workspace. You can still open the object editor by right clicking {}&nbsp;and selecting Edit. This option is off by default.":"{}对象双击打开所有对象事件{}：默认情况下，在任何资源上双击都会打开该资源进行编辑，但通常在处理对象时，在创建新资源的初始设置后，您只打开它来编辑事件，而不是对象属性。选择此选项将在新工作区中打开不同的对象事件，每个事件在新工作区中都有自己的选项卡。您仍然可以通过右键单击{}并选择编辑来打开对象编辑器。默认情况下，此选项处于禁用状态。",
    "{}Room order ungroup removes the empty group{}: When enabled, ungrouping all the rooms that belong to a group folder will remove the group folder as well. When disabled, the same action will ungroup the rooms but leave the empty group folder in the asset browser. This is enabled by default.":"{}房间顺序取消分组会删除空组{}：启用后，取消分组属于某个组文件夹的所有房间也会删除组文件夹。禁用后，相同的操作将取消对房间进行分组，但会在资源浏览器中保留空组文件夹。这在默认情况下是启用的。",
    "{}Show Quick Access{}: When enabled, this option will show the \"Quick Access\" section at the top of the Asset Browser. This option is enabled by default.":"{}显示快速访问{}：启用后，此选项将在资源浏览器的顶部显示\"快速访问\"部分。默认情况下，此选项处于启用状态。",
    "{}Show tree lines{}: Here you can enable/disable the tree lines that are shown to the side of assets in the Asset Browser. This is checked by default to show the tree lines.":"{}显示树线{}：在此可以启用/禁用在资源浏览器中显示在资源一侧的树线。默认情况下，该选项处于选中状态，以显示树线。",
    "{}Sprite double click opens image editor{}: By default double clicking {}&nbsp;on any asset will open that asset for editing, but often when dealing with sprites, after the initial setup when you create the new asset, you open it to edit the image rather than the sprite properties. Selecting this option will open the image editor for the sprite asset instead of the sprite asset itself. You can still open the sprite editor by right clicking {}&nbsp;and selecting {}Edit{}. This option is off by default.":"{}精灵双击打开图像编辑器{}：默认情况下，在任何资源上双击{}都会打开该资源进行编辑，但通常在处理精灵时，在创建新资源的初始设置后，您会打开它来编辑图像，而不是精灵属性。选择此选项将打开精灵资源的图像编辑器，而不是精灵资源本身。您仍然可以通过右键单击{}并选择{}编辑{}来打开精灵编辑器。默认情况下，此选项处于禁用状态。",
    "{}The {}Asset Browser Preferences{} are used to define certain properties for how the {}Asset Browser{}&nbsp;and its elements function. The main options are:":"{}{}资源浏览器首选项{}用于定义{}资源浏览器{}及其元素的运行方式的某些属性。主要选项包括："
}