{
    "All rules starting from \"{}GM1000{}\" check your syntax for possible fatal errors, and those starting from \"{}GM2000{}\" are best-practice rules that help you prevent bugs in your game.":"从 \"{}GM1000{}\" 开始的所有规则都会检查您的语法中可能出现的致命错误，而从 \"{}GM2000{}\" 开始的规则是帮助您防止游戏中的错误的最佳实践规则。",
    "Base Options":"基本选项",
    "Contents":"目录",
    "Feather":"语法检查",
    "Feather Data Types":"语法检查数据类型",
    "Feather Features":"语法检查特点",
    "Feather provides intelligent code completion and improved syntax checking in your {}GML Code{} scripts, along with smart refactoring options.":"语法检查在您的 {}GML 代码{}脚本中提供了智能代码完成和改进的语法检查，以及智能重构选项。",
    "GM* Rules":"GM* 规则",
    "Highlighting":"高亮",
    "In this dropdown box you can choose between a couple of presets for the&nbsp;{}GM* Rules{}. The following profiles are available:&nbsp;":"在此下拉框中，您可以在 {}GM* 规则{}的几个预设之间进行选择。以下配置文件可用：",
    "JSDoc Script Comments":"JSDoc 脚本注释",
    "Message Severity":"消息严重性",
    "Naming Rules":"命名规则",
    "Profile":"属性",
    "See Also":"另请参阅",
    "Syntax Errors (Feather Messages)":"语法错误(语法检查消息)",
    "The GM2017 rule under \"Message Severity\" must be enabled for naming rules to take effect. By default, it\u0027s disabled.":"必须启用\"消息严重性\"下的 GM2017 规则才能使命名规则生效。默认情况下，它处于禁用状态。",
    "The settings in this section are as follows:":"此部分中的设置如下：",
    "This page contains information on the following parts of Feather:":"本页面包含有关语法检查的以下部分的信息：",
    "This section contains settings for changing the colours used for underlining part of your code to mark an error, warning or suggestion:":"本节包含用于更改部分代码的下划线颜色以标记错误、警告或建议的设置：",
    "You can set a rule as an \"{}Error{}\", \"{}Warn{}\" or \"{}Suggestion{}\", which affects the way that rule-breaking code is reported to you in the Code Editor and the Feather Messages window.":"您可以将规则设置为\"{}错误{}\"、\"{}警告{}\"或\"{}建议{}\"，这会影响在代码编辑器和语法检查消息窗口中向您报告违反规则的代码的方式。",
    "You can set a rule to \"{}Ignore{}\" which will ignore all instances of that rule being broken.":"您可以将规则设置为\"{}忽略{}\"，这将忽略该规则被违反的所有实例。",
    "{}&lt;identifier&gt; Naming Rule{}: You can set naming rules for each type of identifier in the list, such as assets, macros, enums, function parameters, variables, etc.{} {} Each naming rule drop-down has the following options: {} {}{}Naming Style{}: Choose the naming style for the identifier. Your options are: {} {}{}Unconstrained{}: No formatting is forced on this type of identifier.{} {}{}UpperCamelCase{}: {}MyHealth, ObjGrappleHook{}{} {}{}lowerCamelCase{}: {}myHealth, objGrappleHook{}{} {}{}ALL_UPPER{}: {}MY_HEALTH, OBJ_GRAPPLE_HOOK{}{} {}{}all_lower{}: {}my_health, obj_grapple_hook{}{} {} {} {}{}Prefix{}: Text that should appear before the identifier name, which may be {}obj_{} for objects, {}_{} for local variables, etc. depending on your preferences.{} {}{}Suffix{}: Text that should appear after the identifier name.{} {}{}Preserve trailing and leading underscores{}: If enabled, preserves underscores around your asset\u0027s name even after suggestions.{} {} With this, you can use asset names such as {}__objCamera{}, keeping any leading and trailing underscores where they are. {} {} ":"{}<标识符>命名规则{}：您可以为列表中的每种类型的标识设置命名规则，如资源、宏、枚举、函数参数、变量等。{} {}每个命名规则下拉菜单有以下选项：\n{} {}{}命名样式{}：选择标识的命名样式。您可选的选项是：\n{} {}{}无约束{}：此类型的标识符上不强制设置格式。\n{} {}{}驼峰式命名法(首字母大写){}：{}MyHealth，ObjGrappleHook {}{}\n{}{}驼峰式命名法(首字母小写){}：{}myHealth，objGrappleHook {}{}\n{}{}全部大写{}：{}MY_HEALTH, OBJ_GRAPPLE_HOOK {}{}\n{}{}全部小写{}：{}my_health, obj_grapple_hook {}{} {} {}\n{}{}前缀{}：应该出现在标识符名之前的文本，对于对象，可以是{}obj_{}。\n根据您的喜好，将{}_{}用于局部变量等。{}\n{}{}后缀{}：应显示在标识符名后的文本。{}\n{}{}保留尾随和前导下划线{}：如果启用，即使在建议之后，也会在资源名称周围保留下划线。{}{}使用此选项，您可以使用诸如{}__objCamera{}之类的资源名称，并保留所有前导和尾随下划线。\n{} {}",
    "{}All{}: This profile shows everything that Feather can analyze.":"{}全部{}：此配置文件显示了语法检查可以分析的所有内容。",
    "{}Compact Tooltips{}: Enabling this will&nbsp;remove certain tooltip information that appears when hovering over keywords, such as parameter descriptions for functions, ultimately making your tooltips smaller.":"{}压缩工具提示{}：启用此选项将删除将鼠标悬停在关键字上时显示的某些工具提示信息，例如函数的参数说明，最终会使工具提示变小。",
    "{}Document Parse Delay{}: The amount of time Feather waits to check your script after you make a change to it.":"{}文档解析延迟{}：在您更改脚本后，语法检查等待检查脚本的时间量。",
    "{}Enable Feather{}: Enable or disable Feather here. When disabled, no Feather features will be available throughout the IDE.":"{}启用语法检查{}：在此处启用或禁用语法检查。禁用时，语法检查功能在整个 IDE 中都不可用。",
    "{}Enable Strict Type mode{}: When this is enabled, Feather is stricter about ensuring you use the correct data types in your code.":"{}启用严格类型模式{}：启用该模式后，语法检查将更加严格地确保您在代码中使用正确的数据类型。",
    "{}Error Colour{}: The colour used for errors.":"{}错误颜色{}：表示错误的颜色。",
    "{}Identifiier Blocklist{}: This is a space-separated list of identifiers that will be ignored for all naming rules.{} {} For example, say you have a rule to use {}obj_{} as a prefix for objects, but you want your objects {}manager{} and {}network{} to remain as-is and not use the {}obj_{} prefix.{} {} In that case, you would write {}manager network{} into the {}Indentifier Blocklist{} field. Feather will ignore those objects {}and{} any other identifiers (variables, enums, parameters, etc.) with the same names. ":"{}标识符块列表{}：这是一个以空格分隔的标识符列表，所有命名规则都将忽略该列表。{}{}例如，假设您有一条使用{}obj_{}作为对象前缀的规则，但您希望您的对象{}管理器{}和{}网络{}保持原样，而不使用{}obj_{}前缀。{}{}在这种情况下，您可以将{}管理器网络{}写入{}标识符块列表{}字段。Feather将忽略这些对象{}和{}任何其他标识符(变量、枚举、参数等)。同名同姓。",
    "{}None{}: This profile will show no error messages.":"{}无{}：此配置文件不会显示任何错误消息。",
    "{}Prefer multiline JSDoc comment style when creating from Quick Fix{}: When you generate JSDoc comments for a function through the&nbsp;{}Quick Fixes{} menu, the generated JSDoc will either use single-line or multi-line {}comments{}, depending on this option.":"{}从快速修复创建时首选多行 JSDoc 注释样式{}：当您通过{}快速修复{}菜单为函数生成 JSDoc 注释时，生成的 JSDoc 将使用单行或多行{}注释{}，具体取决于此选项。",
    "{}Refactor references to asset name when asset is renamed in Asset Browser{}: Enabling this will ensure that when you rename an asset in your Asset Browser, any mentions of it in your code are also edited so those references don\u0027t break.":"{}在资源浏览器中重命名资源时重构对资源名称的引用{}：启用此选项将确保在资源浏览器中重命名资源时，代码中提及该资源的任何内容也会被编辑，以便这些引用不会中断。",
    "{}Suggestion Colour{}: The colour used for suggestions.":"{}建议颜色{}：建议的颜色。",
    "{}SyntaxErrors{}: If you use this profile, syntax errors will be shown, together with what is shown in the {}None{} profile.":"{}语法错误{}：如果您使用此配置文件，将显示语法错误，以及在{}无配置文件中显示的内容。",
    "{}The base Feather Settings contain the following options:":"{}基本语法检查设置包含以下选项：",
    "{}The maximum number of struct fields that are displayed by tooltips{}: When you hover over a struct reference, a tooltip displays the variables inside that struct, up to the number entered here.":"{}工具提示显示的结构字段的最大数量{}：当您将鼠标悬停在结构引用上时，工具提示会显示该结构中的变量，直到此处输入的数字为止。",
    "{}This section allows you to set naming rules for assets, variables and various other parts of GML Code.":"{}此部分允许您为资源、变量和 GML 代码的其他各个部分设置命名规则。",
    "{}This section contains all the rules Feather uses for checking your code, and lets you adjust the severity of each rule.":"{}此部分包含语法检查用于检查代码的所有规则，并允许您调整每个规则的严重性。",
    "{}TypeErrors{}: This profile also shows type errors in addition to the {}SyntaxErrors&nbsp;{}profile.":"{}类型错误{}：此配置文件除了显示{}语法错误{}配置文件外，还显示类型错误。",
    "{}Warning Colour{}: The colour used for warnings.":"{}警告颜色{}：用于警告的颜色。"
}