{
    "Font Editor&nbsp;Preferences":"字体编辑器首选项",
    "{}Automatic choice for failed content regeneration dialog{}: When you go to regenerate a font asset texture, you are shown a warning. Setting this option to \"OK\" will mean that the font is regenerated without the warning being shown.":"{}自动选择失败的内容重新生成对话框{}：当您重新生成字体资源纹理时，会显示一条警告。将此选项设置为\"OK\"将意味着重新生成字体而不显示警告。",
    "{}Automatic choice for failed font regeneration dialog{}: When regeneration of a font asset texture fails, you are shown a warning. Setting this option to \"OK\" will skip showing the message.":"{}自动选择失败的字体重新生成对话框{}：当字体资源纹理重新生成失败时，系统会向您显示警告。将此选项设置为\"OK\"将跳过显示该消息。",
    "{}Automatic choice for upgrading imported legacy fonts{}: When you import a legacy project, you may get a warning about legacy fonts and the offer to upgrade. Setting this option to \"OK\" will okay the update automatically without showing this message.":"{}自动选择升级导入的旧版字体{}：当您导入旧版项目时，您可能会收到有关旧版字体的警告和升级提醒。将此选项设置为\"OK\"将自动允许更新，而不会显示此消息。",
    "{}The {}Font Editor Preferences{} are used to define how the {}Font Editor{}&nbsp;behaves. The different options available are listed below along with a description of what each one does.":"{}{}字体编辑器首选项{}用于定义{}字体编辑器{}的工作方式。下面列出了可用的不同选项，并对每个选项的功能进行了说明。",
    "{}Update Fonts imported from {}GameMaker{} 1 projects{}: When this is checked, {}GameMaker{} will attempt to update fonts and regenerate their texture. This will happen only if: {} {}This preference is enabled{} {}The font is available on the machine{} {}{}GameMaker{} can locate a matching face in the font family (this is the most likely cause of inconsistency on import){} {} Note that it will also happen if the {}GameMaker{} 1 font does not have a {}Cache{} font texture. If a legacy font cannot be updated, then {}GameMaker{} will default to using the cached font texture, and the Font Editor will no longer permit you to edit the font, showing an option to backup and update to another:{} {} {}Clicking this will enable you to edit the font, either adding the missing font or setting another one, and the backed up font is stored in the font asset folder, as {}&lt;font name&gt;.yy.gms1{} and {}&lt;font name&gt;.png.gms1{}. To restore these files, manually delete the {}&lt;font name&gt;.yy{} files and replace them with these by removing the {}.gms1{} extension from the filenames. {} {}Important!{}{} All assets store their names in the {}.yy{} file, so you must edit these and put the right name of the resource in the {}&lt;name&gt;{} field as well (if different).":"{}更新从{}GameMaker 1(GameMaker:Studio){} 项目导入的字体{}：选中此选项后，{}GameMaker{} 将尝试更新字体并重新生成其纹理。只有在以下情况下才会发生这种情况：{}{}启用此首选项{}{}计算机上有该字体{}{}{}GameMaker{} 可以在字体系列中找到匹配的字体(这很可能是导入时不一致的原因){}{}请注意，如果 {}GameMaker{} 1 字体没有{}缓存{}字体纹理，也会发生这种情况。如果无法更新旧字体，则 {}GameMaker{} 将默认使用缓存的字体纹理，字体编辑器将不再允许您编辑该字体，并显示备份和更新到另一个字体的选项：{}{}{}单击此选项将允许您编辑字体，添加缺少的字体或设置另一个字体，备份的字体将存储在字体资源文件夹中，名称为 {}<字体名称>.yy.gms1{} 和 {}<字体名称>.png.gms1{}。要恢复这些文件，请手动删除 {}<字体名称>.yy{} 文件，并通过从文件名中删除扩展名 {}.gms1{} 来替换它们。<br>{}{}重要！{}{}所有资源都将其名称存储在 {}.yy{} 文件中，因此您必须编辑这些名称，并将资源的正确名称也放入 {}<名称>{} 字段中(如果不同)。"
}