{
    "Background":"背景",
    "Compiling":"编译",
    "Confirm Dialogs":"确认对话框",
    "Debugging":"调试",
    "File Watcher":"文件监视器",
    "GX.games Environments":"GX.games 环境",
    "General Preferences":"常规首选项",
    "Go To":"转到",
    "Help":"帮助",
    "Input":"输入",
    "Output Windows":"输出窗口",
    "Paths":"路径",
    "Power Saving":"节能",
    "Recent Windows":"最近的窗口",
    "Resources":"资源",
    "The options above are the main options available from the {}General {}preferences, but there are a number of extra options available to you in the sub-categories listed below:":"上面的选项是{}常规{}首选项中的主要选项，但在下面列出的子类别中，您还可以使用一些额外的选项：",
    "Workspaces":"工作区",
    "{}Allow empty tabs to be closed via the keyboard shortcut{}: If this is enabled, empty workspace tabs can be closed via its keyboard shortcut (CTRL/CMD + W). When disabled, the empty tabs cannot be closed.":"{}允许通过键盘快捷键关闭空选项卡{}：如果启用此功能，则可以通过其键盘快捷键 (CTRL/CMD+W) 关闭空工作区选项卡。禁用时，不能关闭空选项卡。",
    "{}Allow empty tabs to be closed via the keyboard&nbsp;shortcut{}: You can close any open Tabs using the keyboard shortcut {}&nbsp;/ {}&nbsp;+ {}W{}, but if you disable this option that shortcut will no longer work. This is enabled by default.":"{}允许通过键盘快捷键关闭空选项卡{}：如果启用此功能，则可以通过其键盘快捷键 ({} / {} + {}W{}) 关闭空工作区选项卡。禁用时，不能关闭空选项卡。",
    "{}Allow empty tabs to close via shortcut{}: You can close any open Tabs using the keyboard shortcut {}&nbsp;/ {}&nbsp;+ {}W{}, but if you disable this option that shortcut will no longer work. This is enabled by default.":"{}允许通过快捷键关闭空选项卡{}：您可以使用键盘快捷键{} /{} +{}W{}关闭任何打开的选项卡，但如果禁用此选项，该快捷键将不再起作用。这在默认情况下是启用的。",
    "{}Automatic Response to Exit Confirmation{}: This option permits you to set whether a confirmation message should be shown when you exit {}GameMaker{}. By default this is set to \"show message\", but can be set to skip the message as if you\u0027d clicked OK.":"{}自动响应退出确认{}：此选项允许您设置在退出 {}GameMaker{} 时是否显示确认消息。默认情况下，该选项被设置为“显示消息”，但也可以设置为跳过消息，就像您单击了“确定”一样。",
    "{}Automatic Response to Exit Confirmation{}: This option permits you to set whether a confirmation message should be shown when you exit {}GameMaker{}. By default this is set to {}Show Message{}, but can be set to skip the message as if you\u0027d clicked OK.":"{}自动响应退出确认{}：此选项允许您设置在退出 {}GameMaker{} 时是否显示确认消息。默认情况下，该选项被设置为{}显示消息{}，但也可以设置为跳过消息，就像您单击了\"确定\"一样。",
    "{}Automatic Response to The System Font Changed Dialog{}: This option permits you to set whether a confirmation message should be shown when a system font has been added, removed or edited. By default this is set to \"show message\", but can be set to skip the message as if you\u0027d clicked OK.":"{}自动响应对系统字体更改的对话框{}：此选项允许您设置在添加、删除或编辑系统字体时是否显示确认消息。默认情况下，该选项被设置为“显示消息”，但也可以设置为跳过消息，就像您单击了“确定”一样。",
    "{}Automatic Response to The System Font Changed Dialog{}: This option permits you to set whether a confirmation message should be shown when a system font has been added, removed or edited. By default this is set to {}Show Message{}, but can be set to skip the message as if you\u0027d clicked OK.":"{}自动响应对系统字体更改的对话框{}：此选项允许您设置在添加、删除或编辑系统字体时是否显示确认消息。默认情况下，该选项被设置为{}显示消息{}，但也可以设置为跳过消息，就像您单击了\"确定\"一样。",
    "{}Automatically reload changed files{}: If this is checked, the IDE will automatically scan and check files to see if any of them have been changed outside of {}GameMaker{} and reload them if they have.":"{}自动重新加载更改的文件{}：如果选中此选项，IDE 将自动扫描和检查文件，以查看其中是否有任何文件在 {}GameMaker{} 之外进行了更改，如果有，则重新加载。",
    "{}Case-Insensitive mode for project files (may affect performance){}: Intended to be used to avoid issues with filename case sensitivity on non-Windows devices (macOS and Linux). Such issues can happen when transferring projects from Windows to non-Windows systems, using Git with {}ignore case{} enabled (which you should try disabling first) and/or renaming files only to change the case. This is disabled by default as it\u0027s a performance overhead and should not be required outside of the aforementioned cases.":"{}项目文件不区分大小写模式(可能会影响性能){}：旨在避免非 Windows 设备 (MacOS 和 Linux) 上的文件名区分大小写问题。在将项目从 Windows 传输到非 Windows 系统、使用启用了 {} 忽略大小写 {} 的 Git (您应该先尝试禁用它) 和 / 或仅重命名文件以更改大小写时，可能会发生此类问题。这在默认情况下是禁用的，因为这是一种性能开销，在上述情况之外不应该要求这样做。",
    "{}Case-insensitive mode for project files (may affect performance){}: Intended to be used to avoid issues with filename case sensitivity on non-Windows devices (macOS and Linux). Such issues can happen when transferring projects from Windows to non-Windows systems, using Git with {}ignore case{} enabled (which you should try disabling first) and/or renaming files only to change the case. This is disabled by default as it\u0027s a performance overhead and should not be required outside of the aforementioned cases.":"{}项目文件不区分大小写模式(可能会影响性能){}：旨在避免非 Windows 设备 (MacOS 和 Linux) 上的文件名区分大小写问题。在将项目从 Windows 传输到非 Windows 系统、使用启用了 {} 忽略大小写 {} 的 Git (您应该先尝试禁用它) 和 / 或仅重命名文件以更改大小写时，可能会发生此类问题。这在默认情况下是禁用的，因为这是一种性能开销，在上述情况之外不应该要求这样做。",
    "{}Default Audio Device{}: Here you can choose the default audio device for the {}GameMaker{} IDE to use. You can refresh the list by clicking the Refresh Button&nbsp; {}.":"{}默认音频设备{}：您可以在此处选择供 {}GameMaker{} IDE 使用的默认音频设备。您可以通过单击刷新按钮{}来刷新列表。",
    "{}Default Build Target{}: This is the default build {}target{} to use for projects. The default is {}GX.games{}.":"{}默认构建目标{}：这是用于项目的默认构建{}目标{}。默认为 {}GX.games{}。",
    "{}Disable IDE transition animations{}: The {}GameMaker{} IDE has a number of animated transitions for things like opening windows etc... however they are not to everyone\u0027s taste and you may experience a performance boost if they are disabled on older or under-powered machines if they are disabled. You can disable them here, and they are on by default.":"{}禁用IDE过渡动画{}：{}GameMaker{} IDE 有许多动画过渡，例如打开窗口等。然而，并不是每个人都喜欢它们，如果在较老的或性能不足的计算机上禁用它们，您可能会得到性能提升。您可以在此处禁用它们，默认情况下它们处于打开状态。",
    "{}Disable IDE transition animations{}: The {}GameMaker{} IDE has a number of animated transitions for things like opening windows, etc. However, they are not to everyone\u0027s taste and you may experience a performance boost if they are disabled on older or under-powered machines if they are disabled. You can disable them here, and they are on by default.":"{}禁用IDE转换动画{}：{}GameMaker{}IDE有许多用于打开窗口等操作的动画转换。但是，它们并不适合每个人的口味，如果在较旧或动力不足的计算机上禁用它们，您可能会体验到性能提升。您可以在此处禁用它们，它们默认处于启用状态。",
    "{}Enable DPI Override{}: This option lets you override the default DPI setting with your own. You must first enable the option and then set either the {}Raw DPi Override{} value (the default value is 96) or set the {}Percentage of the native DPi{} (default value 100%), and once changed you will be prompted to restart the IDE, which may require you to save any work being done on the currently open project. Note that the DPi has a minimum percentage of 50% and a maximum of 500%, and if you you mouse over the information icon you can see the recommended maximum setting for the display being used:{} {} {}Note that if you go above the recommended DPi setting for the monitor, you will be shown a notification that permits you to reset the DPI. ":"{}启用 DPI 覆盖{}：此选项允许您使用您自己的设置覆盖默认 DPI 设置。您必须首先启用该选项，然后设置{}原始 DPI 覆盖{}值 (缺省值为 96) 或设置本机 DPI 的 {} 百分比 {}( 缺省值为 100%)，一旦更改，系统将提示您重新启动 IDE，这可能需要您保存在当前打开的项目上所做的任何工作。请注意，DPI 的最小百分比为 50%，最大百分比为 500%，如果您将鼠标悬停在信息图标上，您可以看到正在使用的显示器的建议最大设置：{} {} {} 请注意，如果您超出显示器的建议 DPI 设置，则会显示允许您重置 DPI 的通知。",
    "{}Enable Verbose Logging{} - This option enables verbose logging of network calls.":"{}启用详细记录{}-此选项启用网络呼叫的详细记录。",
    "{}Enable notifications{}: Checking this will enable the IDE to show notifications about new runtimes, etc. This is on by default.":"{}启用通知{}：选中此选项将使 IDE 能够显示有关新运行时的通知，等等...。默认情况下，该选项处于启用状态。",
    "{}Enable notifications{}: Checking this will enable the IDE to show notifications about new runtimes, etc... This is on by default.":"{}启用通知{}：选中此选项将使IDE能够显示有关新运行时的通知，等等...。默认情况下，该选项处于启用状态。",
    "{}IDE Font{}: This option permits you to change the font used throughout the IDE. Default is {}Open Sans{}.":"{}IDE 字体{}：此选项允许您更改在整个 IDE 中使用的字体。默认为 {}Open Sans{}。",
    "{}IDE Language{}: This option permits you to select the language for the IDE from the list of options supplied. Default is {}English{}.":"{}IDE 语言{}：此选项允许您从提供的选项列表中选择 IDE 的语言。默认为 {}English{}。",
    "{}IDE Skin{}: Here you can select from the different skins that the IDE can use. By default {}GameMaker{} comes with two skins, one light and one dark, and the initial setup uses the dark skin.":"{}IDE 外观{}：您可以在此处从 IDE 可以使用的不同外观中进行选择。默认情况下，{}GameMaker{} 有两种皮肤，一种浅色和一种深色，初始设置使用深色皮肤。",
    "{}IDE Skin{}: Here you can select from the different skins that the IDE can use. By default {}GameMaker{} comes with two skins, one light and one dark, and the initial setup uses the {}Dark{} skin.":"{}IDE 外观{}：您可以在此处从 IDE 可以使用的不同外观中进行选择。默认情况下，{}GameMaker{} 有两种皮肤，一种浅色和一种深色，初始设置使用{}深色{}皮肤。",
    "{}Logout on exit{}: If this option is checked then the IDE will automatically log out the user session when {}GameMaker{} is closed. This is primarily aimed at Education users, as - when checked - this means that whenever the program shuts down the user would be logged out and so free up the session seat for other users to use. This is off by default.":"{}退出时注销{}：如果选中此选项，则在关闭 {}GameMaker{} 时，IDE 将自动注销用户会话。这主要是针对教育用户，因为-选中-意味着每当程序关闭时，用户将被注销，从而释放会话席位供其他用户使用。默认情况下，此选项处于禁用状态。",
    "{}Maximum Framerate of the&nbsp;{}GameMaker{} Editor{}: This option permits you to set the maximum framerate that the {}GameMaker{} IDE will update at, permitting you to set the framerate to match the update speed of your monitor. Default value is 60.":"{}GameMaker{} 的最大帧速率{}编辑器{}：此选项允许您设置 {}GameMaker{}IDE 更新时的最大帧速率，允许您设置帧速率以匹配显示器的更新速度。默认值为 60。",
    "{}Maximum Framerate of {}GameMaker{} Editor{}: This option permits you to set the maximum framerate that the {}GameMaker{} IDE will update at, permitting you to set the framerate to match the update speed of your monitor. Default value is 60.":"{}GameMaker{} 的最大帧速率{}编辑器{}：此选项允许您设置 {}GameMaker{}IDE 更新时的最大帧速率，允许您设置帧速率以匹配显示器的更新速度。默认值为 60。",
    "{}Notification timeout (ms){}: This sets the length of time (in milliseconds) that a notification is shown for. Default is 6000.":"{}通知超时(毫秒){}：设置显示通知的时间长度(以毫秒为单位)。默认为 6000。",
    "{}Open new assets for edit on creation{}: If this is checked, every time you create a new resource in {}The Asset Browser{}, the corresponding asset editor will be opened automatically. This is checked by default and un-checking it will mean that you have to manually open all newly created assets.":"{}创建时打开新资源以进行编辑{}：如果选中此选项，则每次在{}资源浏览器{}中创建新资源时，都会自动打开相应的资源编辑器。默认情况下，该选项处于选中状态，取消选中意味着您必须手动打开所有新创建的资源。",
    "{}Open new assets for edit on dragging files into IDE{}: Certain assets (like sprites or sounds) can be dragged onto the main Workspace in the {}GameMaker{} IDE and will be detected and added as a new asset in {}The Asset Browser{}. By default the corresponding asset editor will also be opened for editing when this happens, but un-checking this option will prevent the editors from being opened and you will be required to open them manually.":"{}在将文件拖入 IDE 时打开新资源以进行编辑{}：某些资源(如精灵或声音)可以拖到 {}GameMaker{} IDE 中的主工作区，并将被检测并作为新资源添加到{}资源浏览器{}中。默认情况下，发生这种情况时，也会打开相应的资源编辑器进行编辑，但取消选中此选项将阻止打开编辑器，并要求您手动打开它们。",
    "{}Open new resources for edit on creation{}: If this is checked, every time you create a new resource in the Asset Browser, the corresponding resource editor will be opened automatically. This is checked by default and un-checking it will mean that you have to manually open all newly created resources.":"{}创建时打开新资源进行编辑{}：如果选中此选项，则每次在资源浏览器中创建新资源时，都会自动打开相应的资源编辑器。这在默认情况下是选中的，取消选中意味着您必须手动打开所有新创建的资源。",
    "{}Open new resources for edit on dragging files into IDE{}: Certain resources (like sprites or sounds) can be dragged onto the main Workspace in the {}GameMaker{} IDE and will be detected and added as a new resource in the Asset Browser. By default the corresponding resource editor will also be opened for editing when this happens, but un-checking this option will prevent the editors from being opened and you will be required to open them manually.":"{}在将文件拖动到IDE时打开新资源以进行编辑{}：某些资源(如精灵或声音)可以拖到 {}GameMaker{} IDE 中的主工作区，并将被检测并作为新资源添加到资源浏览器中。默认情况下，当发生这种情况时，也会打开相应的资源编辑器进行编辑，但取消选中此选项将阻止打开编辑器，您将需要手动打开它们。",
    "{}Opt-in To Feedback Surveys{}: When this option is checked, you are telling {}GameMaker{} that you wish to participate in feedback surveys, meaning that occasionally while working a message will be shown about the area you are working on and request a rating and feedback. This option is on by default.":"{}选择参与反馈调查{}：选中此选项后，您就是在告诉 {}GameMaker{} 您希望参与反馈调查，这意味着在您工作时，偶尔会显示一条关于您正在工作的领域的消息，并请求评级和反馈。默认情况下，此选项处于启用状态。",
    "{}Show Project Tool Output{} - When this option is checked, the&nbsp;{}Project Tool&nbsp;Output{}&nbsp;window will be shown when you convert projects with&nbsp;{}Project Tool{}.":"{}显示项目工具输出{} - 选中此选项后，当您使用 {}Project Tool{} 转换项目时，将显示 {2}Project Tool 输出{3}窗口。",
    "{}Show Project Tool Output{} - When this option is checked, the&nbsp;{}ProjectTool&nbsp;Output{}&nbsp;window will be shown when you convert projects with&nbsp;{}ProjectTool{}.":"{}显示项目工具输出{}-选中此选项后，当您使用{}ProjectTool{}转换项目时，将显示{}ProjectTool输出{}窗口。",
    "{}Show welcome screen on startup{}: This is on by default and simply tells {}GameMaker{} to show a brief splash screen when you start the program. Un-checking this will prevent the splash screen from showing.":"{}启动时显示欢迎屏幕{}：这在默认情况下是打开的，只是告诉 {}GameMaker{} 在你启动程序时会显示一个简短的启动屏幕。取消选中此选项将阻止显示初始屏幕。",
    "{}Sign out on exit{}: If this option is checked then the IDE will automatically log out the user session when {}GameMaker{} is closed. This is primarily aimed at Education users, as - when checked - this means that whenever the program shuts down the user would be logged out and so free up the session seat for other users to use. This is off by default.":"{}退出时注销{}：如果选中此选项，则在关闭 {}GameMaker{} 时，IDE 将自动注销用户会话。这主要是针对教育用户，因为-选中-意味着每当程序关闭时，用户将被注销，从而释放会话席位供其他用户使用。默认情况下，此选项处于禁用状态。",
    "{}The {}General Preferences{} are used to define the general behaviour of the {}GameMaker{} {}IDE{}. The most general ones are listed on the main page while many others are split into multiple sub-categories, explained further down this page.":"{}{} 常规首选项 {} 用于定义 {}GameMaker{} {}IDE{} 的常规行为。最常见的是在主页上列出的，而许多其他的则被分成多个子类别，本页下面将对此进行进一步解释。",
    "{}Use US Date Format{}: This setting changes the format used to display dates in the IDE. When enabled, dates are displayed as e.g. \"Thursday, April 27, 2023\", when disabled, dates are displayed as e.g. \"27 April 2023\" instead. By default this preference is unchecked.":"{}使用美国日期格式{}：此设置更改用于在 IDE 中显示日期的格式。启用时，日期显示为例如。\"Thursday, April 27, 2023\"，禁用时，日期显示为例如 \"27 April 2023\"。默认情况下，此首选项处于未选中状态。"
}