{
    "{} The {}{}GML Visual{}{} Preferences are used to define how the Visual editor looks and feels. The different options available are listed below along with a description of what each one does.":"{}{}{}GML 可视化{}{}首选项用于定义可视化编辑器的外观和感觉。下面列出了可用的不同选项，并对每个选项的功能进行了说明。",
    "{}Automatic response to {}GML Visual{} conversion to GameMaker Language{}: When you convert a {}{}GML Visual{}{} event or script into GML code, you will by default get a message warning you about what you are about to do and asking if you want to continue. Setting this option to \"OK\" will simply okay the change without showing the message.":"{}自动响应 {}GML 可视化{}转换为 GameMaker 语言{}：当您将 {}{}GML 可视化{}{}事件或脚本转换为 GML 代码时，默认情况下，您将收到一条消息，警告您要执行的操作，并询问您是否要继续。将此选项设置为\"OK\"将简单地接受更改，而不显示消息。",
    "{}Automatic response to {}GML Visual{} node deletion{}: When you delete a {}{}GML Visual{}{} event node, you will by default get a message warning you about what you are about to do and asking if you want to continue. Setting this option to \"OK\" will simply okay the deletion without showing the message.":"{}自动响应 {}GML 可视化{}节点删除{}：删除 {}{}GML 可视化{}{}事件节点时，默认情况下会收到一条消息，警告您要执行的操作，并询问您是否要继续。将此选项设置为 \"OK\" 将只允许删除，而不会显示消息。",
    "{}Default size for {}GML Visual{} toolbox action thumbnails{}: This setting will be used to define the default size for all action icons in the toolbox (default 32px).":"{}{}GML 可视化{}工具箱操作缩略图的默认大小{}：此设置将用于定义工具箱中所有操作图标的默认大小(默认 32px)。",
    "{}GML Visual{}&nbsp;Preferences":"GML 可视化首选项",
    "{}Hide {}{}GML Visual{}{} node overview panel{}: Here you can choose to hide the overview panel of the Action Code Editor. By default this is disabled and enabling it will remove the plain text list of action chains from the editor.":"{}隐藏 {}{}GML 可视化{}{}节点概述面板{}：您可以在此处选择隐藏操作代码编辑器的概述面板。默认情况下，这是禁用的，启用它将从编辑器中删除操作链的纯文本列表。",
    "{}Maximum number of recently used actions to display{}: In the action toolbox there is a library at the top which holds the actions you have most recently used. You can use this option to change the maximum number of recent actions that will be shown (default 5).":"{}可显示的最近使用的操作的最大数量{}：在操作工具箱的顶部有一个库，其中包含您最近使用的操作。您可以使用此选项更改将显示的最近操作的最大数量(默认为 5)。",
    "{}Maximum size for {}GML Visual{} toolbox action thumbnails{}: At the bottom of the Action Toolbox you have a slider for changing the size of the {}{}GML Visual{}{} icons. This setting will be used to define the maximum permitted size (default 64px).":"{}{}GML 可视化{}工具箱操作缩略图的最大大小{}：在操作工具箱的底部有一个滑块，用于更改 {}{}GML 可视化{}{}图标的大小。此设置将用于定义允许的最大大小(默认为 64px)。",
    "{}Minimum size for {}GML Visual{} toolbox action thumbnails{}: At the bottom of the Action Toolbox you have a slider for changing the size of the {}{}GML Visual{}{} icons. This setting will be used to define the minimum permitted size (default 16px).":"{}{}GML 可视化{}工具箱操作缩略图的最小大小{}：在操作工具箱的底部有一个滑块，用于更改 {}{}GML 可视化{}{}图标的大小。此设置将用于定义允许的最小大小(默认为 16px)。",
    "{}Mouse down time to start dragging nodes (ms){}: When you click on a node and drag it, you will be re-positioning the node within the action code. However if you hold the mouse down for a moment and then move, you will be moving the node position within the workspace but not within the order of the code. This setting sets the number of milliseconds to have to wait with the mouse button pressed before the node can be moved (not re positioned). Default is 350.":"{}按下鼠标开始拖动节点的时间(毫秒){}：当您单击并拖动节点时，您将在操作代码中重新定位该节点。但是，如果您按住鼠标一段时间然后移动，您将在工作区内移动节点位置，但不是在代码的顺序内。此设置设置在按下鼠标按钮后可以移动(而不是重新定位)节点之前必须等待的毫秒数。默认为 350。",
    "{}Thickness of the chain that connects {}GML Visual{} actions{}: This defines the thickness of the chain graphic that links the different actions in a {}{}GML Visual{}{} code block (default 3px).":"{}连接 {}GML 可视化{}操作的链的厚度{}：这定义了连接 {}{}GML 可视化{}{}代码块中的不同操作的链图形的厚度(默认为 3px)。",
    "{}{}GML Visual{} toolbox default location{}: By default the GML Visual toolbox (where all the different action libraries are held) is placed on the right of the Editor, but you can use this option to have it default to the left.":"{}{}GML 可视化{}工具箱默认位置{}：默认情况下，GML 可视化工具箱(保存所有不同动作库的位置)放置在编辑器的右侧，但您可以使用此选项将其默认放置在左侧。",
    "{}{}GML Visual{}&nbsp;node overview visibility mode{}: A node \"overview\" is the short descriptive text that appears beside certain actions in the Action Workspace, for example this Destroy Instance action:{} {} {}You can choose to enable these always, enable them only if the action is collapsed (the default setting), or disable them altogether. ":"{}{}GML 可视化{}节点概述可见性模式{}：节点\"概述\"是出现在操作工作区中某些操作旁边的简短描述性文本，例如此销毁实例操作：{} {} {}您可以选择始终启用这些操作、仅在该操作折叠时启用它们(默认设置)或完全禁用它们。"
}