{
    " {}Anchor point colour{}:&nbsp;Set the colour for the different anchor points on the spline/arc. Default is ( {}ARGB{}) #FFFF0000. ":"{}锚点颜色{}：设置样条线/圆弧上不同锚点的颜色。默认为 ({}ARGB{}) #FFFF0000。",
    " {}Automatic response to committing changes on tool change{}:&nbsp;When you change draw tools after editing a frame, by default a message shows to ask if you want to commit the changes made. By setting this option to \"OK\" you can remove this message and permit frame edition to be committed without further messages being shown when you change tools. If you choose \"No\", then frame edition will be silently cancelled when you change tools. Default is \"Show message\". ":"{}对提交工具更改的自动响应{}：在编辑框架后更换绘图工具时，默认情况下会显示一条消息，询问您是否要提交所做的更改。通过将此选项设置为\"OK\"，您可以删除此消息并允许提交框架编辑，而不会在您更改工具时显示进一步的消息。如果您选择\"否\"，那么当您更换工具时，框架编辑将被静默取消。默认为\"显示消息\"。",
    " {}Automatic response to deleting frames{}:&nbsp;When you delete a frame by default a message shows to ask if you are sure you want to do this. By setting this option to \"OK\" you can remove this message and permit frame deletion without further messages being shown. Default is \"Show message\". ":"{}删除帧的自动响应{}：默认情况下删除帧时，会显示一条消息，询问您是否确实要执行此操作。通过将此选项设置为\"OK\"，您可以删除此消息并允许在不显示其他消息的情况下删除帧。默认为\"显示消息\"。",
    " {}Automatic response to group selected warning{}:&nbsp;If you select multiple layers in the layer editor and then try to draw or edit then you will be shown a message by default to inform you that it is not possible. You can select \"OK\" here to remove this message and silently fail to edit the images together until only a single layer is selected. Default is \"Show message\". ":"{}自动响应分组选定警告{}：如果您在层编辑器中选择多个层，然后尝试绘制或编辑，则默认情况下会显示一条消息，通知您这是不可能的。您可以在此处选择\"确定\"以删除此消息，并且在仅选择一个层之前，不会同时编辑图像。默认为\"显示消息\"。",
    " {}Automatic response to locked layer warning{}:&nbsp;If you try to edit a locked layer you\u0027ll get a message by default informing you that you can\u0027t do this. If you set this option to \"OK\" then no message will be shown and the edition will silently fail. ":"{}自动响应锁定的层警告{}：如果您尝试编辑锁定的层，默认情况下会收到一条消息，通知您无法执行此操作。如果将此选项设置为\"OK\"，则不会显示任何消息，编辑将静默失败。",
    " {}Automatic response to replacing images during strip import{}:&nbsp;When you select Import Strip from the Image drop down menu, you will get a message warning you that you will be overwriting any images already in the sprite resource, with the option to continue or not. You can set here whether to show this message, or have the IDE simply choose the \"Yes\" or \"No\" option. The default value is \"Show Message\". ":"{}在条带导入期间自动响应替换图像{}：当您从图像下拉菜单中选择导入条带时，您将收到一条消息，警告您将覆盖精灵资源中已有的任何图像，并提供是否继续的选项。您可以在此处设置是否显示此消息，或者让 IDE 简单地选择\"是\"或\"否\"选项。缺省值为\"显示消息\"。",
    " {}Canvas block size{}:&nbsp;When you have selected {}Block Pattern{} for the background, you can set the size of the individual block here. Default is 16px, with a minimum value of 2px and a maximum of 256px permitted. ":"{}画布块大小{}：背景选择了{}块图案{}后，可以在这里设置单个块的大小。默认为 16px，最小值为 2px，最大允许为 256px。",
    " {}Canvas primary colour{}:&nbsp;If you have {}Single Colour{} chosen for the background, then the colour used is this one. You can click the colour swatch to open the colour editor and change it. When using the {}Block Pattern{} option, this sets the first colour for alternate blocks. Default colour is ( {}ARGB{}) #FFC3C3C3. ":"{}画布原色{}：如果您选择了{}单色{}作为背景，则使用的颜色是这一种。您可以单击色样打开颜色编辑器并对其进行更改。当使用{}块图案{}选项时，这将设置交替块的第一种颜色。默认颜色为 ({}ARGB{}) #FFC3C3C3。",
    " {}Canvas secondary colour (block pattern style){}:&nbsp;If you have {}Block Pattern{} chosen for the background, then the colour used to alternate with colour 1 (above) is this one. You can click the colour swatch to open the colour editor and change it. Default colour is (ARGB) #FF808080. ":"{}画布第二色(方块图案样式){}：如果您选择了{}方块图案{}作为背景，则用于与颜色1(上图)交替的颜色是此颜色。您可以单击色样打开颜色编辑器并对其进行更改。默认颜色为 (ARGB) #FF808080。",
    " {}Canvas style{}:&nbsp;Here you set the \"style\" for the background, which can either be \" {}Block Pattern{}\" or \" {}Single Colour{}\". Single colour simply sets the background to the colour of your choice (using the Colour 1 setting, as explained below) while block pattern is the default setting (which can also be edited using the rest of the dialogue options shown below). Default is \" {}Block Pattern{}\". ":"{}画布样式{}：您可以在这里设置背景的样式，可以是\"{}块图案{}\"或\"{}单色{}\"。单色只需将背景设置为您选择的颜色(使用颜色1设置，如下所述)，而块图案是默认设置(也可以使用下面显示的其余对话框选项进行编辑)。默认设置为\"{}块模式{}\"。",
    " {}Control point colour{}:&nbsp;Set the colour for each of the control point \"handles\" on an anchor point. Default is (ARGB) #FFFF0000. ":"{}控制点颜色{}：设置锚点上每个控制点\"手柄\"的颜色。默认为 (ARGB) #FFFF0000。",
    " {}Display Grid{}:&nbsp;If this is checked then the Image Editor will open with the image grid on. Default is off. ":"{}显示网格{}：如果选中此选项，则打开图像编辑器时会打开图像网格。默认设置为禁用。",
    " {}Grid Settings preferences are used to set how the image grid will be presented, with the following options available: ":"{}网格设置首选项用于设置图像网格的显示方式，可用选项如下：",
    " {}Grid horizontal spacing (px){}: This value sets the spacing for the horizontal lines of the image grid. The default value is 1px. ":"{}网格水平间距(像素){}：此值设置图像网格水平线的间距。默认值为 1px。",
    " {}Grid line Colou{}r:&nbsp;Here you can set the colour (including alpha value) for the image grid. Default is ( {}ARGB{}) #FF000000. ":"{}网格线颜色{}：在这里可以设置图像网格的颜色(包括 Alpha 值)。默认为 ({}ARGB{}) #FF000000。",
    " {}Grid vertical spacing (px){}:&nbsp;This value sets the spacing for the vertical lines of the image grid. The default value is 1px. ":"{}网格垂直间距(像素){}：此值设置图像网格垂直线的间距。默认值为 1px。",
    " {}Here you can set the ddifferent options for how some of the drawing tools operate and are shown. {}{} ":"{}您可以在此设置一些绘图工具的操作和显示方式的不同选项。{}{}",
    " {}Point size{}:&nbsp;Set the size of the different anchor points and control points to be used. Default is 10px. ":"{}点大小{}：设置要使用的不同锚点和控制点的大小。默认为 10px。",
    " {}Selected point colour{}:&nbsp;Set the colour to be used for any selected anchor points on the spline/arc. Default is (ARGB) #FF00FF00. ":"{}选定点颜色{}：设置用于样条线/圆弧上任何选定锚点的颜色。默认为 (ARGB) #FF00FF00。",
    " {}Snap To Grid{}:&nbsp;If this is checked then the image editor will automatically snap certain tools to the image grid. Default is off. ":"{}对齐到网格{}：如果选中此选项，则图像编辑器会自动将某些工具对齐到图像网格。默认设置为禁用。",
    " {}Tangent line colour{}:&nbsp;Set the colour for the lines linking the control points to the anchors. Default is (ARGB) #FF00FFFF. ":"{}切线颜色{}：设置将控制点连接到锚点的线的颜色。默认为 (ARGB) #FF00FFFF。",
    "Here you can select the behaviour of the confirmation dialogues when you perform different actions on the current sprite. They are:":"您可以在此处选择在当前精灵上执行不同操作时确认对话框的行为。它们是：",
    "Here you can set the options for the background that you edit your sprite images over. By default this is a grid of grey squares, but you can use the following settings to change it:":"您可以在此设置编辑精灵图像时使用的背景选项。默认情况下，这是由灰色方块组成的网格，但您可以使用以下设置来更改它：",
    "If you are using the {}Arc Tool{} {} then here you can set the different colours used to draw the node properties: ":"如果您使用的是{}圆弧工具{}{}，则可以在此处设置用于绘制节点属性的不同颜色：",
    "Image Editor&nbsp;Preferences":"图像编辑器首选项",
    "The Image Editor Preferences also has the following sub-categories:":"图像编辑器首选项还具有以下子项：",
    "The {}Image Editor Preferences{} are used to define how the {}Image Editor{}&nbsp;window&nbsp;looks and feels. The following are the general options:":"{}图像编辑器首选项{}用于定义{}图像编辑器{}窗口的外观。以下是常规选项：",
    "{}Background{}{}Background{}":"{}背景{}{}背景{}",
    "{}Confirm Dialogs{}{}Confirm Dialogs{}":"{}确认对话框{}{}确认对话框{}",
    "{}Default Loop Mode{}: The loop button in the Image Editor can be set to function in two different modes: either play once, where the animation will stop when it gets to the last frame, loop from the start, where the animation will go back to the first frame when it finishes, or ping pong, where the animation will go up through the images to the end and then back down through them again to the beginning. The default value here is \"loop\".":"{}默认循环模式{}：图像编辑器中的循环按钮可以设置为两种不同的模式：播放一次，动画在到达最后一帧时将停止从开始循环，动画结束时将返回到第一帧或乒乓，动画将通过图像向上移动到结束，然后再次通过图像向下返回到开始。这里的默认值是\"循环\"。",
    "{}Draw thin selection outline{}: If this is checked then the outline for selections will be an absolute 1px in width, regardless of the scale of the image, while having it un-checked will make the selection outline a relative 1px in width and scale with the image. The default is to have this option checked.":"{}绘制细的选择轮廓{}：如果选中此选项，则无论图像的比例如何，选择的轮廓都将是绝对 1px 的宽度，而取消选中它将使选择轮廓的宽度和比例与图像相对为 1px。默认情况下，选中此选项。",
    "{}Editor background colour{}: While editing a sprite frame the image may be scaled in or out or may not fit the whole drawing in window, in which case a background colour will be shown which you can set here. The default value is ARGB #282828FF.":"{}编辑器背景色{}：编辑精灵边框时，图像可能会被放大或缩小，或者可能不适合窗口中的整个图形，在这种情况下，将显示背景颜色，您可以在此处设置背景颜色。默认值为 ARGB #282828FF。",
    "{}Expand sprite controls overlay by default{}: When this is checked, the sprite controls and frame information will be shown in the Image Editor every time you open a sprite for editing (this can be closed again using the collapse button {}, but it will reopen on editing the sprite again later). When this is unchecked, the sprite controls and frame information will be hidden on opening a sprite. The default is to have this unchecked.":"{}默认展开精灵控件覆盖{}：选中此选项后，每次打开精灵进行编辑时，都会在图像编辑器中显示精灵控件和边框信息(可以使用折叠按钮{}再次关闭，但稍后再次编辑精灵时将重新打开)。如果取消选中此选项，则在打开精灵时将隐藏精灵控件和帧信息。默认情况下，取消选中此选项。",
    "{}Grid Settings{}{}Grid Settings{}":"{}网格设置{}{}网格设置{}",
    "{}Image Selection Copy/Paste{}: Choose whether you want CTRL+V (paste) to insert the copied image as a brush, or as a new layer.":"{}图像选择复制/粘贴{}：选择是按 CTRL+V (粘贴)将复制的图像作为画笔插入，还是作为新层插入。",
    "{}Selection outline primary colour{}: The section outline is a dashed line that alternates between two colours. This option permits you to set the first of those colours to use (including alpha), and has a default value of {}ARGB{}&nbsp;#FFFFFD0.":"{}选择轮廓原色{}：截面轮廓是一条在两种颜色之间交替的虚线。此选项允许您设置要使用的第一种颜色(包括Alpha)，其缺省值为 {}ARGB{} #FFFFFD0。",
    "{}Selection outline secondary colour{}: The section outline is a dashed line that alternates between two colours. This option permits you to set the second of those colours to use (including alpha), and has a default value of ARGB #0000D0.":"{}选择轮廓二次色{}：截面轮廓为两种颜色交替的虚线。该选项允许您设置要使用的第二种颜色(包括 Alpha)，其缺省值为 ARGB #0000D0。",
    "{}Tools{}{}Tools{}":"{}工具{}{}工具{}"
}