{
    "Object Editor&nbsp;Preferences":"对象编辑器首选项",
    "The following sub-category also exists for the Object Editor:":"对象编辑器还存在以下子项：",
    "The {}Object Editor Preferences{} are used to define certain properties for the {}Object Editor{}&nbsp;window. The main section contains the following option:":"{}对象编辑器首选项{}用于定义{}对象编辑器{}；窗口的某些属性。主要部分包含以下选项：",
    "This section deals with the dialogs that may be be shown while using the Object Editor, with the following option available:":"本节介绍使用对象编辑器时可能显示的对话框，可用选项如下：",
    "{}Add default event content{}: By default this option is enabled and all it does is add a simple comment into the code editor for all new events to remind you that you can add your code there.":"{}添加默认事件内容{}：默认情况下，此选项处于启用状态，它所做的只是为所有新事件在代码编辑器中添加一个简单的注释，以提醒您可以在那里添加代码。",
    "{}Automatic choice on event deletion{}: This option can be used to control the pop up message that is shown when you delete an event in the Object Editor events list. The default action here is to show a warning message, but you can set this to \"OK\" and the dialog will not be shown.":"{}删除事件时自动选择{}：此选项可用于控制在删除对象编辑器事件列表中的事件时显示的弹出消息。这里的默认操作是显示一条警告消息，但您可以将其设置为\"OK\"，对话框不会显示。",
    "{}Automatic response to GML Visual conversion to GML Code{}: You can use the right mouse button {} within the GML Visual workspace, or on an event, to select the option to turn all GML Visual for that event into GML code. The default action here is to show a warning message asking if you want to continue, but you can set this to \"OK\" and the dialog will not be shown before the conversion.":"{}GML 可视化转换为 GML 代码的自动响应 {}：您可以在 GML 可视化工作区内或在事件上使用鼠标右键 {}，选择将该事件的所有 GML 可视化转换为 GML 代码的选项。这里的默认操作是显示一条警告消息，询问您是否要继续，但您可以将其设置为\"OK\"，并且在转换之前不会显示该对话框。",
    "{}Automatic response to exceeding physics vertex limit{}: This option can be used to control the pop up message that is shown when you exceed the permitted vertex number in the physics shape editor. The default action here is to show a warning message, but you can set this to \"OK\" and the dialog will not be shown.":"{}自动响应超出物理顶点限制{}：此选项可用于控制当您超过物理形状编辑器中允许的顶点数时显示的弹出消息。这里的默认操作是显示一条警告消息，但您可以将其设置为\"OK\"，对话框不会显示。",
    "{}Click to open Event method{}: This option controls whether you need to perform a double click or a single click on an object event to open it. By default this is set to double-click.":"{}点击打开事件方法{}：此选项控制是否需要在对象事件上执行双击或单击才能打开它。默认情况下，此选项设置为双击。",
    "{}Confirm Dialogs{}{}Confirm Dialogs{}":"{}确认对话框{}{}确认对话框{}",
    "{}Default event content{}: Here you can edit the comments that are added by default in the code window for new events.":"{}默认事件内容{}：您可以在这里编辑新事件的代码窗口中默认添加的备注。",
    "{}Events label format{}: Here you can enable or disable the different possible texts that can be applied to the event label in the object editor events list. By default the Event Description is enabled only.":"{}事件标签格式{}：您可以在此启用或禁用可应用于对象编辑器事件列表中的事件标签的不同可能文本。默认情况下，仅启用事件描述。",
    "{}Inherited Events alpha{}: This option permits you to change the alpha that any ¡inherited events will be drawn with in the events list of the object. By default this is set to 0.5 (values should be between 0 and 1).":"{}继承事件 Alpha{}：此选项允许您更改在对象的事件列表中绘制任何继承事件时使用的 Alpha。默认情况下，该值设置为 0.5 (值应介于 0 和 1 之间)。"
}