{
    "After using {}\"Override and Reassign\"{}, GameMaker will highlight&nbsp;the overridden command&nbsp;in the Command List so you can assign&nbsp;new a key combination&nbsp;to it. In case multiple commands were overridden, it will change the filter to display only those commands so you can apply new shortcuts to them. This filter can be cleared by clicking on \"Clear\".{} {} If you wish to use a different binding for the selected command, you can expand the {}\"Suggested Free Keys\"{} section to see a list of key combinations that are not used anywhere in the IDE. Clicking on{} \"Use\"{} next to any one of these combinations will assign it to the selected command and solve the clash. ":"使用{}\"覆盖并重新分配\"{}后，GameMaker将 在命令列表中突出显示 被覆盖的命令 ，以便您可以为其分配 新的组合键。如果多个命令被覆盖，它将更改筛选器以仅显示这些命令，以便您可以对它们应用新的快捷方式。点击\"清除\"即可清除此过滤器。{}{}如果您希望对所选命令使用不同的绑定，您可以展开{}\"建议的自由键\"{}部分，以查看 IDE 中任何地方都不使用的组合键的列表。单击这些组合中任何一个组合旁边的{}\"使用\"{}会将其指定给选定的命令并解决碰撞。",
    "At the top you have the search bar, which you can use to look for specific commands by entering a name (e.g.&nbsp;\"{}Copy{}\"), a key combination (e.g. \"{}CTRL+C{}\") or a location (e.g. \"{}Text Editor{}\").":"顶部有搜索栏，可用于通过输入名称(如 \"{}复制{}\")、组合键(如\"{}CTRL+C{}\")或位置(如\"{}文本编辑器{}\")来查找特定命令。",
    "Below that you have numerous options allowing you to&nbsp;specify the locations that are displayed in the Command List. By default, {}\"All Locations\"{} is checked, meaning that you will see commands from all locations in the IDE. Unchecking {}\"All Locations\"{} will uncheck every other item below it, allowing you to manually select the ones you would like to see; for example, unchecking all items and then checking&nbsp;{}\"Image Editor\"{} will only show you commands that can be used in the Image Editor.":"下面有许多选项，允许您指定命令列表中显示的位置。默认情况下，选中{}\"所有位置\"{}，这意味着您将看到来自 IDE 中所有位置的命令。取消选中{}\"所有位置\"{}将取消选中其下方的所有其他项目，允许您手动选择要查看的项目例如，取消选中所有项目，然后选中 {}\"图像编辑器\"{}将仅显示可在图像编辑器中使用的命令。",
    "Clash Window":"冲突窗口",
    "Clearing Commands":"清除命令",
    "Command List":"命令列表",
    "Double-clicking on an existing key combination will allow you to change it, however while you are doing this you can click on the {}\"Clear\"{} button below the Command List to clear the binding for that command.":"双击现有的组合键将允许您更改它，但在执行此操作时，您可以单击命令列表下方的{}\"清除\"{}按钮以清除该命令的绑定。",
    "Enabling the&nbsp;{} button next to the search field allows you search by entering a shortcut. Any keys you press while this is enabled will be entered as a shortcut instead of regular text.":"启用搜索字段旁边的{}按钮允许您通过输入快捷方式进行搜索。在启用此功能时按下的任何键都将作为快捷键而不是普通文本输入。",
    "Filter Menu":"筛选菜单",
    "If you try to set a key combination that is already in use for other commands, you will see a special \"Clash\" window:{} {}This window will show the location and name of the command that is already using the key combination that you are trying to use. In case the key combination is used by&nbsp;multiple commands, it will show all of them in&nbsp;a list.{} {} Here you have two options,{} \"Cancel\"{} and {}\"Override (ALL) and Reassign\"{}: ":"如果您尝试设置已用于其他命令的组合键，您将看到一个特殊的\"冲突\"窗口：{}{}此窗口将显示已在使用您正在尝试使用的组合键的命令的位置和名称。如果该组合键被 多个命令使用，它将在 列表中显示所有这些组合键。{}{}这里有两个选项，{}\"取消\"{}和{}\"覆盖(全部)\"和\"重新分配\"{}：",
    "Next to the search bar you have the {}Filter{}&nbsp;menu&nbsp;which is described in its own section later on this page.":"在搜索栏旁边有{}筛选{}菜单，该菜单将在本页后面的单独部分中介绍。",
    "Pressing {}\"Cancel\"{} will close the Clash window and will not make any changes to any commands.":"按下{}\"取消\"{}将关闭碰撞窗口，并且不会对任何命令进行任何更改。",
    "Pressing {}\"Override (ALL) and Reassign\"{} will assign the new key combination to your selected command and {}clear {}the bindings of all other commands that previously used the&nbsp;same combination.":"按下{}\"覆盖(全部)并重新分配\"{}将为您选择的命令分配新的按键组合，并{}清除{}以前使用相同组合的所有其他命令的绑定。",
    "Redefine Keys Preferences":"重定义快捷键首选项",
    "Search":"搜索",
    "The \"Command List\" displays all the available shortcuts that can be remapped, separated into different categories based on the locations of those shortcuts.&nbsp;Clicking on any location in this list will display the commands that can be used within it:":"命令列表显示可以重新映射的所有可用快捷键，并根据这些快捷键的位置划分为不同的类别。 单击此列表中的任何位置将显示可在其中使用的命令：",
    "You can change the sorting of the Command List by&nbsp;{} clicking on a column heading (either \"Command\" or \"Keys\") to sort the list using the values from that column, alternating between ascending and descending with each click.":"您可以更改命令列表的排序，方法是：{}单击列标题(\"命令\"或\"快捷键\")以使用该列中的值对列表进行排序，每次单击时交替升序和降序。",
    "{}\"Show Only Redefined Commands\"{}: Enabling this will display only those commands that have been changed manually, i.e. their bindings are different from their default bindings.":"{}\"仅显示重新定义的命令\"{}：启用此选项将仅显示已手动更改的命令，即它们的绑定不同于其默认绑定。",
    "{}\"Show Unbound Commands\"{}: Enabling this will display any commands that have been unbound, i.e. their bindings have been cleared. Any commands that remain unbound cannot be used as there is no key combination assigned to them.":"{}\"显示未绑定命令\"{}：启用此选项将显示所有已解除绑定的命令，即它们的绑定已被清除。任何保持未绑定状态的命令都不能使用，因为没有为它们分配组合键。",
    "{}Command{}: This is the name of the command/shortcut and describes what action it performs.":"{}命令{}：这是命令/快捷方式的名称，描述它执行的操作。",
    "{}If you have accidentally overridden some keyboard shortcuts and wish to reset them back to their default settings, you can click on the \"Restore defaults\" button at the top of the Preferences window to reset all commands to their default mappings, or check the {}Keyboard Shortcuts{} page to check the default bindings and revert your commands manually.":"{}如果您意外覆盖了某些键盘快捷键并希望将其重置为其默认设置，您可以单击首选项窗口顶部的\"恢复默认设置\"按钮将所有命令重置为其默认映射，或检查{}键盘快捷键{}页面以检查默认绑定并手动恢复您的命令。",
    "{}Information for each command is separated into two columns:":"{}每个命令的信息分为两列：",
    "{}Keys{}: This displays the current keyboard mapping for the command. You can&nbsp;{} double click on any item in this column to reassign that command by simply pressing the appropriate combination of keys on the keyboard (they must be held simultaneously, similar to how the shortcut would actually be used). As soon as you release your new key combination, it will be registered and applied to the command. {}{} {}Double-click on a shortcut to enter a new one!{} {} Pressing&nbsp;{} while editing a command will bring you out of edit mode and will not modify the selected command. ":"{}快捷键{}：这将显示命令的当前键盘映射。只需按下键盘上适当的组合键(它们必须同时按住，类似于实际使用快捷键的方式)，您就可以 {}双击该列中的任何项来重新分配该命令。一旦您松开新的组合键，它就会被注册并应用于命令。{}{}{}双击快捷键以输入新的快捷键！{}{}在编辑命令时按 {}将使您退出编辑模式，并且不会修改所选命令。",
    "{}The Filter menu allows you specify what kind of commands should appear in the Command List. At the top, you have two options:":"{}过滤器菜单允许您指定应在命令列表中显示的命令类型。在顶部，您有两个选项：",
    "{}The {}Redefine Keys{} section of the Preferences allows you to change the mappings for the various {}keyboard shortcuts{} provided in the {}GameMaker{}&nbsp;IDE.":"{}{}重定义快捷键首选项{}部分允许您更改在 {5}GameMaker{6} IDE中提供的各种{}键盘快捷键的映射{}。"
}