{
    "Further options are available for editing from the sub-categories listed below:":"可以从下面列出的子项中选择更多选项进行编辑：",
    "Room Editor&nbsp;Preferences":"房间编辑器首选项",
    "The {}Grid Settings{} preferences are used to change how the grid overlay works, with the following options available:":"{}网格设置{}首选项用于更改网格覆盖的工作方式，可用选项如下：",
    "The {}Room Editor Preferences{} are used to define how the {}Room Editor{}&nbsp;will look and behave. The general settings are as follows:":"{}房间编辑器首选项{}用于定义{}房间编辑器{}的外观和行为。常规设置如下：",
    "This section details the {}Smart Guides Preferences{}&nbsp;for the Room Editor. The available options are:":"本节详细介绍房间编辑器的{}智能辅助线首选项{}。可用选项包括：",
    "{}Add default room layers{}:&nbsp;When you create any new room resource, {}GameMaker{} will generate a couple of \"base\" layers for you - a background layer and an instance layer. You can switch that behaviour off here so that new rooms will have no pre-made layers. This is on by default.":"{}添加默认房间层{}：当您创建任何新的房间资源时，{}GameMaker{} 会为您生成几个\"基础\"层 - 一个背景层和一个实例层。你可以在这里关闭这种行为，这样新房间就不会有预制的层了。默认情况下，该选项处于启用状态。",
    "{}Automatic response to invalid asset drag error{}: If you try to add an asset to a layer that is not designated as being for that asset type (like adding a path to an instance layer), then you will be shown a message by default to inform you that it can\u0027t be done. However setting this option to \"Ok\" will not show the message and just not let you add the asset. Note that this option does not apply to instances, sprites or sequences.":"{}自动响应无效资源拖动错误{}：如果您尝试将资源添加到未指定为该资源类型的层(如添加到实例层的路径)，则默认情况下会显示一条消息，通知您无法完成此操作。但是，将此选项设置为\"OK\"不会显示消息，也不会让您添加资产。请注意，此选项不适用于实例、精灵或序列。",
    "{}Automatic response to invalid layer selection drag error{}: Here you can choose what happens when you drag a resource onto the room editor when you have selected multiple layers in the layer editor (or have not selected any layer at all). The default is to show a warning message but you can set this option to \"OK\" to suppress the message and continue, without adding any resources.":"{}自动响应无效的层选择拖拽错误{}：当您在层编辑器中选择了多个层(或根本没有选择任何层)时，您可以在这里选择将资源拖到房间编辑器上时发生的情况。默认情况下会显示一条警告消息，但您可以将此选项设置为\"OK\"以取消显示该消息并继续，而不添加任何资源。",
    "{}Automatic response to item locked warning{}: {} {}If you try to delete an item it happens to be locked, you will be shown a message by default. However setting this option to \"Ok\" will not show the message and just not let you delete the item.":"{}自动响应项目锁定警告{}：{}{}如果您尝试删除恰好已锁定的项目，默认情况下将显示一条消息。但是，将此选项设置为\"OK\"将不会显示该消息，也不会让您删除该项目。",
    "{}Automatic response to item owner layer locked warning{}: If you try to delete an item on a layer and the layer happens to be locked (even if the item is not), then you will be shown a message by default to inform you that it can\u0027t be done. However setting this option to \"Ok\" will not show the message and just not let you delete the item.":"{}自动响应对项目所有者层锁定的警告{}：如果您尝试删除某个层上的项目，而该层碰巧被锁定(即使该项目未被锁定)，则默认情况下会显示一条消息，通知您无法完成此操作。但是，将此选项设置为\"OK\"将不会显示该消息，也不会让您删除该项目。",
    "{}Automatic response to layer locked warning{}: If you try to delete a layer in the room and it happens to be locked, you will be shown a message by default. However setting this option to \"Ok\" will not show the message and just not let you delete the layer.":"{}自动响应层锁定警告{}：如果您尝试删除房间中的某个层，而该层恰好被锁定，则默认情况下会显示一条消息。但是，将此选项设置为\"OK\"将不会显示该消息，也不会让您删除该层。",
    "{}Automatic response to locked or invisible layer drag error{}: Here you can choose what happens when you drag a resource onto a layer that has been locked or is flagged as invisible. The default is to show a warning message but you can set this option to \"OK\" to suppress the message and continue, without adding any resources.":"{}自动响应锁定或不可见的层拖动错误{}：您可以在此处选择将资源拖到已锁定或标记为不可见的层上时发生的操作。默认情况下会显示一条警告消息，但您可以将此选项设置为\"OK\"以取消显示该消息并继续，而不添加任何资源。",
    "{}Automatic response to parent room item deletion{}: Here you can choose what happens when you delete an item that is part of a parent room (and so present in all child rooms). The default is to show you a warning message and let you decide what to do, but you can set it to \"Delete All\" to suppress the message and go ahead with the item delete from the parent room and all its children, or you can select \"Keep All\" to suppress the message abort the delete.":"{}自动响应父房间项目删除{}：您可以在此选择删除属于父房间(因此存在于所有子房间中)的项目时发生的操作。默认情况下，会显示一条警告消息并让您决定要做什么，但您可以将其设置为\"删除所有\"以取消该消息，并继续从父房间及其所有子房间中删除项目，也可以选择\"保持所有\"以取消该消息中止删除。",
    "{}Automatic response to parent room layer deletion{}: Here you can choose what happens when you delete a layer that is part of a parent room (and so present in all child rooms). The default is to show you a warning message and let you decide what to do, but you can set it to \"Delete All\" to suppress the message and go ahead with the layer delete from the parent room and all its children, or you can select \"Keep All\" to suppress the message abort the delete.":"{}自动响应删除父房间层{}：您可以在此处选择删除属于父房间的层(因此存在于所有子房间中)时发生的操作。默认情况下，会显示一条警告消息并让您决定要做什么，但您可以将其设置为\"删除所有\"以取消该消息，并继续从父房间及其所有子房间中删除该层，也可以选择\"保持所有\"以取消该消息中止删除。",
    "{}Automatic response to updating layer depths{}: hen you change layer depths a message is shown to warn you that doing this will also automatically update all the other layer depths. With this option you can choose to have the message show, have it update the layers as if you\u0027d clicked \"Ok\", or have it not update anything as if you\u0027d clicked \"No\".":"{}自动响应更新层深度{}：当您更改层深度时，会显示一条消息，警告您这样做也会自动更新所有其他层深度。使用此选项，您可以选择让消息显示，让它更新层，就像你点击\"确定\"一样，或者让它不更新任何东西，就像你点击\"否\"一样。",
    "{}Chain fade out start distance (px){}: Sets the distance from the parent window for the chain link to fade out from. Default is 10px.":"{}链淡出起始距离(像素){}：设置链链接要淡入的距离。默认为 10px。",
    "{}Chain fade out stop distance (px){}: Sets the distance from the parent window for the chain link to end fading out to. Default is 100px.":"{}链淡出停止距离(像素){}：设置链链接结束淡入的距离。默认为 100px。",
    "{}Chain minimum alpha{}: Sets the final alpha value after the fade out falloff point for the chain alpha. Default is 0.3.":"{}链最小 Alpha{}：设置链 Alpha 的淡出衰减点之后的最终 Alpha 值。默认值为 0.3。",
    "{}Confirm Dialogs{}{}Confirm Dialogs{}":"{}确认对话框{}{}确认对话框{}",
    "{}Create new asset layer&nbsp;when dragging sequences/sprites onto unsuitable layers{}: If you try to add a sprite (or a sequence) to a layer that is not an asset layer, then you will be shown a message by default to inform you that it can\u0027t be done and ask if you want to create a new asset layer for the item being dragged. However setting this option to \"Ok\" will not show the message and automatically create a new layer for sprites (and sequences).":"{}在将序列/精灵拖动到不合适的层上时创建新的资源层{}：如果您尝试将精灵(或序列)添加到不是资源层的层，则默认情况下会显示一条消息，通知您无法完成此操作，并询问您是否要为正在拖动的项目创建新的资源层。然而，将此选项设置为\"OK\"将不会显示该消息，并自动为精灵(和序列)创建一个新的层。",
    "{}Create new instance layer&nbsp;when dragging objects onto unsuitable layers{}: If you try to add an object instance&nbsp;to a layer that is not an instance layer, then you will be shown a message by default to inform you that it can\u0027t be done and ask if you want to create a new instance layer for the item being dragged. However setting this option to \"Ok\" will not show the message and automatically create a new layer for the instance.":"{}在将对象拖动到不合适的层上时创建新的实例层{}：如果您尝试将对象实例添加到不是实例层的层，则默认情况下会显示一条消息，通知您无法完成该操作，并询问您是否要为正在拖动的项目创建新的实例层。但是，将此选项设置为\"OK\"将不会显示该消息，并会自动为实例创建一个新层。",
    "{}Default layer depth spacing{}: When you create multiple layers in the room editor they are automatically assigned a depth based on their position within the layer list. This depth is incremented by the amount given here. The default value is 100, so each layer will be previous layer + 100 in depth.":"{}默认层深度间距{}：在房间编辑器中创建多个层时，系统会根据它们在层列表中的位置自动为其指定深度。此深度按此处给出的量递增。默认值为 100，因此每个层的深度将是上一层 +100。",
    "{}Default room height{}: Sets the initial height that will be selected as the default for a new room. Default is 768px.":"{}默认房间高度{}：设置将被选为新房间默认高度的初始高度。默认为 768px。",
    "{}Default room width{}: Sets the initial width that will be selected as the default for a new room. Default is 1024px.":"{}默认房间宽度{}：设置将被选为新房间默认宽度的初始宽度。默认为 1024px。",
    "{}Display grid{}: This option will toggle on or off the room grid when you first open a room. It is on by default, but even if it is switched off you can enable it again using the appropriate button in the room editor itself.":"{}显示网格线{}：此选项将在您第一次打开房间时打开或关闭房间网格线。默认情况下，它是打开的，但即使它被关闭，您也可以使用房间编辑器本身中的相应按钮再次启用它。",
    "{}Enable Rulers{}: This option will enable/disable the side rulers in the Room Editor. Default is enabled.{} &nbsp;":"{}启用尺子{}：该选项会打开/关闭房间编辑器中的侧尺子。默认为启用。{}",
    "{}Enable Smart Guides{}: This is used to enable/disable the use of smart guides in the Room Editor. Default is enabled.{} &nbsp;":"{}启用智能辅助线{}：用于在房间编辑器中启用/禁用智能辅助线。默认为启用。{}",
    "{}Grid Settings{}{}Grid Settings{}":"{}网格设置{}{}网格设置{}",
    "{}Grid horizontal spacing (px){}:&nbsp;This will set the horizontal space for gird cells of the room grid in pixels. Default value is 32px.":"{}网格水平间距(像素){}：这将以像素为单位设置房间网格的网格单元的水平间距。默认值为 32px。",
    "{}Grid line colour{}: This option permits you to set the colour (including the alpha component) of the room grid lines. The default value is ( {}ARGB{}) #30FFFFFF.":"{}网格线颜色{}：该选项允许您设置房间网格线的颜色 (包括 Alpha 分量)。默认值为 ({}ARGB{})#30FFFFFF。",
    "{}Grid vertical spacing (px){}:&nbsp;This will set the vertical space for gird cells of the room grid in pixels. Default value is 32px.":"{}网格垂直间距(像素){}：这将以像素为单位设置房间网格的网格单元的垂直间距。默认值为 32px。",
    "{}Inspector selection colour{}:&nbsp;The colour used for highlighting the item selected in the Inspector&nbsp;{}Multi-Select{} list.":"{}检查器选择颜色{}：用于突出显示检查器-{}多选列表{}中所选项目的颜色。",
    "{}Master-volume setting{}: The master volume setting for preview playback in the Room Editor, a value between 0 and 1. Default is 1.":"{}主音量设置{}：房间编辑器中预览播放的主音量设置，取值范围为 0 到1，默认为 1。",
    "{}Other colour options{}: These are related to the different colours that are used throughout the room editor interface, and if you double click on any of the swatches you can edit the colour for that setting.":"{}其他颜色选项{}：这些选项与房间编辑器界面中使用的不同颜色相关，如果您双击任何样本，您可以编辑该设置的颜色。",
    "{}Show room views{}: If you have views active within a room, this is shown by an outline where the view boundaries would be within the room, and the visibility of this area can be toggled using the dedicated button in the editor itself. However you can choose to have view boundaries invisible when you open a room by un-checking this option (the button can still be used to show them again). The default value is on, making view boundaries visible when you open a room.":"{}显示房间视图{}：如果您在房间内有活动的视图，这将由一个轮廓显示，其中的视图边界将位于房间内，并且可以使用编辑器本身中的专用按钮切换该区域的可见性。但是，您可以通过取消选中此选项来选择在打开房间时使视图边界不可见(该按钮仍可用于再次显示它们)。默认值为打开，打开房间时使视图边界可见。",
    "{}Smart Guides{}{}Smart Guides{}":"{}智能辅助线{}{}智能辅助线{}",
    "{}Snap Distance{}: This setting tells the Room Editor at what distance a guide has to be from an asset before it will \"snap\" to the side of the asset. Default value is 6px.{} &nbsp;":"{}捕捉距离{}：此设置告诉聊天室编辑器辅助线与资源之间的距离，辅助线必须与资源保持多远的距离，然后才能将辅助线与资源的一侧对齐。默认值为 6px.{} ",
    "{}Snap Rulers To Edges{}: When enabled, this option will snap guides dragged into the Room Editor from the rulers to any assets placed in the room. Default is enabled.{} &nbsp;":"{}靠齐尺子边缘{}：启用此选项后，将从尺子拖动到聊天室编辑器中的辅助线与放置在聊天室中的任何资源对齐。默认为启用。{}",
    "{}Snap to grid{}: With this option you can set whether a room will have assets snap to the room grid by default or not when a room is initially opened. It is on by default, but even if it is switched off you can enable it again using the appropriate button in the room editor itself.":"{}捕捉到网格线{}：使用此选项，可以设置在最初打开房间时，是否默认将资源捕捉到房间网格线。默认情况下，它是打开的，但即使它被关闭，您也可以使用房间编辑器本身中的相应按钮再次启用它。",
    "{}{}The {}Confirm Dialogs {}preferences are used to change the messages that are shown in the room editor when you perform certain actions. The messages you can change are:":"{}{}当您执行某些操作时，可以使用{}确认对话框{}首选项来更改房间编辑器中显示的消息。您可以更改的消息包括："
}