{
    "A couple of alternative IP addresses that you can use are 1.1.1.1 and 9.9.9.9.":"您可以使用的替代 IP 地址有 1.1.1.1 和 9.9.9.9。",
    "Below that is a list of all the available runtimes.&nbsp;You can choose any one from this list to set it as the \"running\" runtime used for compiling your projects.":"下面是所有可用运行库的列表。您可以从该列表中选择任何一个来将其设置为用于编译项目的\"运行\"运行库。",
    "Click \"Apply\" to save the changes.&nbsp;{}GameMaker{}&nbsp;will test to see if it can get a valid DNS result from the given IP address. If not an error message will be shown:&nbsp;":"单击\"应用\"保存更改。 {}GameMaker{} 将测试是否可以从给定的 IP 地址获得有效的 DNS 结果。如果不是，将显示错误消息： ",
    "Clicking this will initiate the download and installation of the selected runtime (a status bar will be shown in the top right of the {}IDE{}). If&nbsp;{}Remember last selection of modules{}&nbsp;is set to \"No\" or \"Show Message\" you will first be shown the&nbsp;{}Runtime Modules Dialog{}&nbsp;where you can select the modules that should be included.":"单击此选项将启动所选运行时的下载和安装(状态栏将显示在 {}IDE{} 的右上角)。如果{}记住上次选择的模块{}设置为\"否\"或\"显示消息\"，您将首先看到{}运行时模块对话框{}，您可以在其中选择应该包括的模块。",
    "Clicking this will remove the selected runtime from your hard drive.":"单击此选项将从硬盘中删除选定的运行时。",
    "For each runtime&nbsp;you can find the version number, the date it was released, and -&nbsp;if it\u0027s installed -&nbsp;the path to where it\u0027s been installed to. The right hand side also shows the different status icons:&nbsp;":"对于每个运行时，您可以找到版本号、发布日期以及-(如果已安装)-安装位置的路径。右侧还显示了不同的状态图标：",
    "Ideally you want to be using the most up-to-date runtimes, but sometimes it may have an issue, or you may be required to use an older one for compatibility, etc. and so you can change the runtime tools that {}GameMaker{} uses to build your game here.":"理想情况下，您希望使用最新的运行时，但有时可能会出现问题，或者您可能需要使用较旧的运行时来实现兼容性等，因此您可以在此处更改 {}GameMaker{} 用来构建游戏的运行时工具。",
    "Modify Current Runtime Modules":"修改当前运行时模块",
    "Once a Runtime Feed has been created it will be listed in this section as a sub-category, and you should always have at least one feed listed (by default this would be the {}Master {}feed). Regardless of the runtime being used, they will all have the same features, outlined below using the Master feed as an example:":"创建运行时源后，它将作为子类别在本节中列出，并且您应该始终至少列出一个源 (默认情况下，这将是 {}Master{} 源)。无论使用哪种运行时，它们都将具有相同的功能，下面以 Master 源为例进行了概述：",
    "Once the new runtime has been installed you will be asked to close and restart the IDE so that the runtime can be initialised.":"一旦安装了新的运行时，系统将要求您关闭并重新启动 IDE，以便可以初始化运行时。",
    "Remember last selection of {}{}{}{}{}{}modules":"记住上次选择的{}{}{}{}{}{}模块",
    "Runtime Feeds":"运行时源",
    "Runtime RSS Feeds":"运行时 RSS 源",
    "Show Message":"显示消息",
    "The dialog shows the modules that you have already installed for the current runtime and allows you to install additional ones.":"该对话框显示您已经为当前运行时安装的模块，并允许您安装其他模块。",
    "The following options can be set here:&nbsp;":"可以在此处设置以下选项：",
    "The {}{}Runtime Feeds Preferences{}{}&nbsp;are used to display and change the currently installed {}Runtime{} as well as the runtime in current use.":"{}{}运行时源首选项{}{}用于显示和更改当前安装的{}运行时{}以及当前使用的运行时。",
    "This marks the current runtime that has been selected for use when building your projects.":"这将标记在生成项目时选择使用的当前运行时。",
    "This option always show the dialog when installing a different runtime.&nbsp;It corresponds to the \"Remember Selection\" checkbox unticked in the {}Runtime Modules Dialog{}.{}{}":"此选项在安装不同的运行时时始终显示该对话框。它对应于在{}运行时模块对话框{}中取消勾选的\"记住所选内容\"复选框。{}{}",
    "This option changes if and how the&nbsp;{}Runtime Modules Dialog{}&nbsp;is shown.":"如果以及如何显示{}运行时模块对话框{}，则此选项会更改。",
    "This option remembers your choice of modules and will not show the&nbsp;{}Runtime Modules Dialog{}&nbsp;each time you install any runtime. Instead, it will just automatically install those same runtime modules. It corresponds to the \"Remember Selection\" checkbox ticked in the Runtime Modules Dialog.":"此选项会记住您选择的模块，并且不会在您每次安装任何运行时时都显示{}运行时模块对话框{} 。相反，它只会自动安装那些相同的运行时模块。它与运行时模块对话框中勾选的\"记住选择\"复选框相对应。",
    "This section of the&nbsp;{}Runtime Feeds Preferences{} is related to where you pull the runtime tools from and requires you to input a {}URL{} to an {}RSS{} feed. This feed will then be scanned for updates to the runtime tools which can then be downloaded and installed.":"{}运行时源首选项{}的这一部分与您从中提取运行时工具的位置相关，并要求您输入 {}RSS{} 源的 {}URL{}。然后将扫描此提要以查找运行时工具的更新，然后可以下载和安装这些工具。",
    "This section will show the Master runtime feed URL by default, but you can click the {}Add {}button to create a new Runtime Feed where you give the name and the URL for the RSS feed, and then click Apply to tell {}GameMaker{} to access it. You will need to close and re-open the Preferences window for the new feed to be shown.":"默认情况下，此部分将显示主运行时源 URL，但您可以单击 {} 添加 {} 按钮来创建一个新的运行时源，您可以在其中提供 RSS 源的名称和 URL，然后单击应用以告知 {}GameMaker{} 访问它。您需要关闭并重新打开首选项窗口，才能显示新源 。",
    "To select a different runtime to use, find it in the list and then double click {}&nbsp;its version number in the left-hand column. If the runtime has not been downloaded and installed, then you will be prompted to do so. Depending on the setting of&nbsp;{}Remember last selection of modules{}&nbsp;the&nbsp;{}Runtime Modules Dialog{}&nbsp;may or may not be shown before download and installation starts:&nbsp;":"要选择不同的运行时来使用，请在列表中找到它，然后在左栏中双击{}它的版本号。如果尚未下载和安装运行库，系统将提示您进行下载和安装。根据{}记住上次选择的模块{}的设置，{}运行时模块对话框{}在下载和安装开始之前可能会显示，也可能不显示：",
    "To use this, check the \"Use Alternative DNS\" checkbox and enter the IP address of the alternative DNS server to use:&nbsp;":"要使用此选项，请选中\"使用替代 DNS \"复选框并输入要使用的替代 DNS 服务器的 IP 地址：",
    "Use Alternative DNS":"使用替代 DNS",
    "You can click this button to bring up the {}Runtime Modules Dialog{} again&nbsp;at any time. Opening the dialog via this button allows you to change the modules that are installed for the {}current{} runtime.":"您可以点击此按钮，随时再次调出{}运行时模块对话框{}。通过此按钮打开对话框允许您更改为{}当前{}运行时安装的模块。",
    "You can update this&nbsp;list at any time from the given RSS feed by clicking the refresh button&nbsp; {}&nbsp;, and you can clean your hard drive of old runtimes by clicking the \"Clean Runtimes Now\" button. You can also check the \"Automatically delete old runtimes\" checkbox so&nbsp;{}GameMaker{}&nbsp;does this automatically.":"您可以通过单击刷新按钮{}，随时从给定的 RSS 提要更新此列表，还可以通过单击 \" 立即清除运行时 \" 按钮，清除硬盘上的旧运行时。您还可以选中 \" 自动删除旧运行时 \" 复选框，以便 {}GameMaker{} 自动执行此操作。",
    "{}GameMaker{} can have several different runtime&nbsp;versions installed at the same time and you can set which one to use from this menu.":"{}GameMaker{} 可以同时安装多个不同的运行时版本，您可以从此菜单中设置要使用的版本。",
    "{}GameMaker{}&nbsp;allows you to use an alternative&nbsp;{}DNS{}&nbsp;server if you want to or in case you experience delays getting the updated RSS feeds.":"{}GameMaker{} 允许您使用替代 {}DNS{} 服务器，如果您愿意或在获取更新的 RSS 提要时遇到延迟。",
    "{}Here you can select, install and uninstall the different runtimes. At the top is the runtime currently in use, the date it was created, and its location on the hard drive.":"{}您可以在此处选择、安装和卸载不同的运行时。顶部是当前正在使用的运行时、创建它的日期以及它在硬盘上的位置。",
    "{}Runtime Feeds Preferences{}":"{}运行时源首选项{}",
    "{}{}NOTE{}{} The current runtime version can be found in the Version Details displayed in the top-right corner of the IDE (see&nbsp;{}Start Page Elements{}).":"{}{}注意{}{} 当前运行时版本可在 IDE 右上角显示的版本详细信息中找到(请参阅{}起始页元素{})。",
    "{}{}NOTE{}{}&nbsp;If you leave the text field empty {}GameMaker{}&nbsp;will continue to use your system DNS settings.":"{}{}注意{}{} 如果您将文本字段留空，则 {}GameMaker{} 将继续使用您的系统 DNS 设置。"
}