{
    "Sequences Preferences":"序列首选项",
    "{}Automatic choice to convert curve to keys{}:&nbsp;If you try to convert an animation curve to keyframes, you will be shown a message by default asking if you want to continue. However setting this option to \"Ok\" will not show the message and just not let you convert the curve.":"{}自动选择将曲线转换为关键点{}： 如果您尝试将动画曲线转换为关键帧，默认情况下将显示一条消息，询问您是否要继续。但是，将此选项设置为\"OK\"不会显示该消息，也不会让您转换曲线。",
    "{}Automatic choice to embed edited curve{}:&nbsp;If you try to embed an animation curve that you have edited, you will be shown a message by default to confirm the action. However setting this option to \"Yes\" will not show the message and embed every time. Setting it to \"No\" will prevent embedding every time.&nbsp;":"{}自动选择嵌入已编辑的曲线{}：如果您尝试嵌入已编辑的动画曲线，则默认情况下将显示一条消息，要求您确认操作。但是，如果将此选项设置为\"是\"，则不会每次都显示和嵌入消息。将其设置为\"否\"将阻止每次嵌入。",
    "{}Automatically create default parameter tracks{}: When enabled, this option will automatically add parameter tracks for position, scale, rotation and origin to any new tracks created in the Track Panel of the sequence. Default is disabled.":"{}自动创建默认参数轨迹{}：启用后，此选项将自动将位置、比例、旋转和原点参数轨迹添加到序列的轨迹面板中创建的任何新轨迹。默认设置为禁用。",
    "{}Automatically stretch newly created assets{}: This option will stretch all newly created asset keys to match the length of the sequence. Default is disabled.":"{}自动拉伸新创建的资源{}：此选项将拉伸所有新创建的资源密钥以匹配序列的长度。默认设置为禁用。",
    "{}Canvas frame width on newly created sequences{}: Here you can set the default frame width for all new sequences. Default value is 1366px.":"{}新建序列的画布边框宽度{}：您可以在此设置所有新序列的默认边框宽度。默认值为1366px。",
    "{}Ca{}{}nvas frame height on newly created sequences{}: Here you can set the default frame height for all new sequences. Default value is 768px.":"{}新建序列的画布边框高度{}{}{}：您可以在此处设置所有新序列的默认帧高度。默认值为768px。",
    "{}Confirm Dialogs{}{}Confirm Dialogs{}":"{}确认对话框{}{}确认对话框{}",
    "{}Default text for new Text Track{}: The text string used when you create a new Text Track in a Sequence.":"{}新建文本轨道的默认文本{}：在序列中创建新文本轨道时使用的文本字符串。",
    "{}Enable Rulers{}: Here you can enable or disable the smart guides in the Sequences Editor canvas. This is enabled by default.":"{}启用尺子{}：您可以在此处启用或禁用序列编辑器画布中的智能参考线。这在默认情况下是启用的。",
    "{}Enable Smart Guides{}: Here you can enable or disable the smart guides in the Sequences Editor canvas. This is enabled by default.":"{}启用智能参考线{}：您可以在此处启用或禁用序列编辑器画布中的智能参考线。这在默认情况下是启用的。",
    "{}Height of Anim Curve Track in Dopesheet{}: This option can be used to set how many track lines parameter tracks that use curves will take up in the dopw sheet when in the keyframe view.&nbsp; Default is 2, but you can select either 1 or 3 as well.":"{}动画曲线轨迹在多普表中的高度{}：此选项可用于设置在关键帧视图中使用曲线的轨迹线参数轨迹的数量。 默认为2，但您也可以选择1或3。",
    "{}Here you can select the behaviour of the smart guides when working in the Sequences Editor. The available options are:":"{}您可以在此处选择在序列编辑器中工作时智能参考线的行为。可用选项包括：",
    "{}Inspector selection colour{}: The colour used for highlighting the track selected in the Inspector&nbsp;{}Multi-Select{} list.":"{}检查器选择颜色{}：用于突出显示在检查员器{}多选{}列表中选择的轨道的颜色。",
    "{}Overlap selection delay in milliseconds{}: This controls how long you need to wait before the Item Toolbox will pop up for overlapping items on the Sequence Editor canvas. Default value is 1000ms.":"{}重叠选择延迟(以毫秒为单位){}：这控制您需要等待多长时间才能在序列编辑器画布上为重叠项弹出项目工具箱。默认值为1000ms。",
    "{}Pause when clicking on the canvas{}: When this option is checked, clicking anywhere in the Sequence Editor canvas will pause the sequence playback. This is enabled by default.":"{}在画布上单击时暂停{}：选中此选项后，在序列编辑器画布中的任何位置单击将暂停序列回放。这在默认情况下是启用的。",
    "{}Select asset keys and keyframes together{}: When this setting is enabled, asset keys are selected together with all keyframes that belong to them in the Sequence Editor. This is enabled by default.":"{}同时选择资源关键点和关键帧{}：启用此设置后，将在序列编辑器中一起选择资源关键点以及属于它们的所有关键帧。这在默认情况下是启用的。",
    "{}Show canvas frame on newly created sequences{}: When enabled, the canvas frame smart guide will be shown in the canvas of the Sequence Editor for all new sequences. This option can be enabled/disabled as required from the canvas properties in the editor itself too. Default value is enabled.":"{}在新创建的序列上显示画布框{}：启用后，所有新序列的画布框智能参考线将显示在序列编辑器的画布中。该选项也可以根据需要从编辑器本身的画布属性中启用/禁用。默认值为启用。",
    "{}Smart Guides{}{}Smart Guides{}":"{}智能参考线{}{}智能参考线{}",
    "{}Snap Distance{}: This is the distance (in pixels) that an item needs to be to a ruler (or a ruler to an item) for it to \"snap\" to the position. Default value is 6px.":"{}对齐距离{}：这是一个项目需要到标尺(或标尺到项目)的距离(以像素为单位)，它才能\"对齐\"到该位置。默认值为6px。",
    "{}Snap Rulers To Edges{}: This option will enable rulers to \"snap\" to the edges of assets in the sequences canvas (and vice versa). Default is enabled.":"{}将尺子对齐边缘{}：此选项将使尺子能够在序列画布中将资源的边缘对齐(反之亦然)。默认为已启用。",
    "{}The {}Confirm Dialogs {}preferences are used to change the messages that are shown in the sequence editor when you perform certain actions. The messages you can change are:":"{}当您执行某些操作时，可使用{}确认对话框{}首选项来更改序列编辑器中显示的消息。您可以更改的消息包括：",
    "{}The {}Sequences Preferences{} are used to define certain properties for how the {}Sequences Editor{}&nbsp;and its elements function. The main options are:":"{}{}序列首选项{}用于定义{}序列编辑器{}及其元素如何运行的某些属性。主要选项包括：",
    "{}The {}Sequences Preferences{} are used to define certain properties for how&nbsp;{}The Sequence Editor{}&nbsp;and its elements function. The main options are:":"{}{}序列首选项{}用于定义{}序列编辑器{}及其元素如何运行的某些属性。主要选项包括：",
    "{}Translation path point insertion margin{}: In the Sequence Editor canvas, when you have added an asset and then created a position parameter track, there will be dotted lines drawn to demonstrate the path that the asset will take when moving. If you place your mouse close to this line, then you can add a new parameter track point to it, and this option sets the distance from the translation line that the mouse needs to be before the point marker will be shown. Default value is 6px.":"{}平移路径点插入页边距{}：在序列编辑器画布中，当您添加资源，然后创建位置参数轨迹时，将绘制虚线以演示资源在移动时将采用的路径。如果将鼠标放在靠近这条线的位置，则可以向其添加一个新的参数轨迹点，该选项设置鼠标在点标记显示之前与平移线的距离。默认值为6px。"
}