{
    "Automatic response to file import: When you import a new image and one already exists, by default you will be prompted to continue importing and overwrite the existing image or cancel the operation. This option lets you suppress this message and always either cancel the import by selecting \"No\", or overwrite the current sprite by selecting \"Yes\". Default value is \"Show Message\".":"自动响应文件导入：当您导入新映像且已存在一个图像时，默认情况下，系统将提示您继续导入并覆盖现有映像或取消操作。此选项允许您隐藏此消息，并始终通过选择\"否\"取消导入，或通过选择\"是\"覆盖当前精灵。默认值为\"显示消息\"。",
    "Automatic response to image load failure: When you import a new image and and the import fails, by default you will be shown a warning message informing you that there has been a failure. This option lets you suppress this message by selecting \"Okay\". Default value is \"Show Message\".":"自动响应图像加载失败：当您导入新的图像，并且导入失败时，默认情况下会显示一条警告消息，通知您已失败。此选项允许您通过选择\"确定\"来取消显示此消息。默认值为\"显示消息\"。",
    "Sprite Editor&nbsp;Preferences":"精灵编辑器首选项",
    "The following sub-category also exists for the Sprite Editor:":"精灵编辑器还存在以下子项：",
    "The options available here control the messages that pop up when are required to confirm an action. You can change these setting to show the message always or dismiss it with a specific action (either Yes or No) :":"此处提供的选项控制在需要确认操作时弹出的消息。您可以更改这些设置以始终显示消息或使用特定操作(是或否)关闭消息：",
    "The {}Sprite Editor Preferences{} are used to define how the {}Sprite Editor{}&nbsp;looks and functions. The following options exist:":"{}精灵编辑器首选项{}用于定义{}精灵编辑器{}的外观和功能。存在以下选项：",
    "The {}Sprite Editor Preferences{} are used to define how&nbsp;{}The Sprite Editor{} looks and functions. The following options exist:":"{} 精灵编辑器首选项 {} 用于定义 {} 精灵编辑器 {} 的外观和功能。存在以下选项：",
    "{}Apply resize and scale to sprite origin{}: When checked this option will change the origin of the sprite when the sprite is resized or scaled, with the new origin being moved/scaled to match the new values for the sprite. Note that this is only applicable for custom sprite origins that are not locked in the sprite editor. If the origin is locked or the sprite uses one of the default positions - e.g.: \"Center\" or \"Top Left\", etc. - then this option will be grayed out and unavailable for changing. Default is enabled.":"{}调整大小和缩放应用于精灵原点{}：选中此选项后，将在调整精灵大小或缩放时更改精灵原点，并移动/缩放新原点以匹配精灵的新值。请注意，此选项仅适用于未在精灵编辑器中锁定的自定义精灵原点。如果原点已锁定或精灵使用默认位置之一-例如：\"居中\"或\"左上角\"等-则此选项将变灰且不可更改。默认为启用。",
    "{}Apply resize and scale to sprite origin{}: When checked this option will change the origin of the sprite when the sprite is resized or scaled, with the new origin being moved/scaled to match the new values for the sprite. Note that this is only applicable for custom sprite origins that are not locked in the sprite editor. If the origin is locked or the sprite uses one of the default positions - eg: \"Center\" or \"Top Left\", etc... - then this option will be grayed out and unavailable for changing. Default is enabled.":"{}将调整大小和比例应用于精灵原点{}：如果选中此选项，则在调整精灵大小或缩放精灵时，将更改精灵的原点，并移动/缩放新原点以匹配精灵的新值。请注意，这仅适用于未在精灵编辑器中锁定的自定义精灵原点。如果原点被锁定，或者精灵使用默认位置之一--例如：\"居中\"或\"左上角\"等。-则此选项将呈灰色显示且不可更改。默认为已启用。",
    "{}Confirm Dialogs{}{}Confirm Dialogs{}":"{}确认对话框{}{}确认对话框{}",
    "{}Default sprite SWF precision{}: This option sets the default precision for the SWF precision slider. Default value is 50.":"{}默认SWF精灵精度{}: 此选项设置SWF精度滑块. 默认值为50",
    "{}Default sprite animation mode{}: This option permits you to set the default animation mode for sprites in the Sprite Editor. You can choose either \"{}Frames per second{}\" or \"{}Frames per game frame{}\", with the default setting being \"{}Frames per second{}\".":"{} 默认精灵动画模式 {}：此选项允许您在精灵编辑器中设置精灵的默认动画模式。您可以选择 \"{} 每秒帧数 {}\" 或 \"{} 每游戏帧帧数 {}\"，默认设置为 \"{} 每秒帧数 {}\"。",
    "{}Default sprite animation mode{}: This option permits you to set the default animation mode for sprites in the sprite editor. You can choose either \" {}Frames per second{}\" or \" {}Frames per game frame{}\", with the default setting being \" {}Frames per second{}\".":"{}默认精灵动画模式{}：此选项允许您在精灵编辑器中设置精灵的默认动画模式。您可以选择\"{}帧/秒{}\"或\"{}帧/游戏帧{}\"，默认设置为\"{}帧/秒{}\"。",
    "{}Default sprite animation speed when added to an asset layer{}: Determines the default speed of a sprite when it\u0027s added to an {}Asset Layer in a room{}, which functions as a multiplier (1 will play at the same speed as defined in the Sprite\u0027s properties, 2 will play twice as fast, 0 will make it static, etc.)":"{}添加到资源层时的默认精灵动画速度{}：确定将精灵添加到房间中的{}资源层时的默认速度{}，它的作用是倍增 (1 将以与精灵属性中定义的速度相同的速度播放，2 将以两倍的速度播放，0 将使其静止，依此类推。)",
    "{}Default sprite animation speed{}: This option permits you to set the default animation speed value for when you create a new sprite asset. Note that this value is linked to the animation mode and - for example - 3 frames per second is not the same as 30 frames per game frame, so be sure to set this value correctly in reference to the preferred mode. Default value is 30.":"{}默认精灵动画速度{}：该选项允许您在创建新的精灵资源时设置默认动画速度值。请注意，此值链接到动画模式，例如，每秒 3 帧与每游戏帧 30 帧不同，因此请确保参考首选模式正确设置此值。默认值为 30。",
    "{}Default sprite collision mask kind{}: This option permits you to set the default kind of collision mask to use for new sprites. Choices are {}rectangle{}, {}rotated rectangle{}, {}ellipse{}, {}diamond{}, or {}precise{} / {}precise per frame.{}&nbsp;The default is {}rectangle{}.":"{} 默认精灵碰撞遮罩类型 {}：此选项允许您设置用于新精灵的默认碰撞遮罩类型。每帧可选择 {} 矩形 {}、{} 旋转矩形 {}、{} 椭圆 {}、{} 菱形 {} 或 {} 精确 {}/{} 精确到每帧。{}&nbsp; 默认为 {} 矩形 {}。",
    "{}Default sprite height{}: This option permits you to set the default height for all new sprites. Default value is 64.":"{}默认精灵高度{}：此选项允许您设置所有新精灵的默认高度。默认值为 64。",
    "{}Default sprite origin{}: This option permits you to set the default origin position for any new sprite assets that you create. The default value is the Top Left.":"{} 默认精灵原点 {}：此选项允许您为创建的任何新精灵资源设置默认原点位置。默认值为左上角。",
    "{}Default sprite origin{}: This option permits you to set the default origin position for any new sprite resources that you create. The default value is the Top Left.":"{}默认精灵原点{}：此选项允许您为您创建的任何新精灵资源设置默认原点位置。默认值为左上角。",
    "{}Default sprite width{}: This option permits you to set the default width for all new sprites created. Default value is 64.":"{}默认精灵宽度{}：此选项允许您设置所有新创建的精灵的默认宽度。默认值为 64。"
}