{
    "Clicking on \"{}Restore Default Colours{}\" will do the following:":"点击 \"{} 恢复默认颜色 {}\" 将执行以下操作：",
    "Contents":"内容",
    "Each scope is written using the formatting settings chosen for it, functioning as a preview. Double-clicking on a scope allows you to edit its name and scope identifier(s).":"每个范围都是使用为其选择的格式设置编写的，用作预览。双击范围可以编辑其名称和范围标识符。",
    "Editing":"编辑",
    "Editor":"编辑",
    "Editor View":"编辑器视图",
    "General":"常规",
    "Gutter":"装订线",
    "In this section you can define the colours used in the document view, such as the Background, Foreground, Caret, Line Highlight and Selection.":"在此部分中，您可以定义文档视图中使用的颜色，例如背景、前景、插入符、行突出显示和选择。",
    "Main":"主要的",
    "Once you have created a custom theme, you can delete it from the same drop-down menu.":"创建自定义主题后，您可以从同一下拉菜单中将其删除。",
    "Reset all copied themes to the defaults of their original themes.":"将所有复制的主题重置为其原始主题的默认值。",
    "Reset all themes loaded from files to the values at the time of load.":"将从文件加载的所有主题重置为加载时的值。",
    "Reset the \"{}GameMaker Dark - Default{}\" theme to its default properties, removing all your changes to it.":"将 \"{}GameMaker Dark - Default{}\" 主题重置为其默认属性，删除对其进行的所有更改。",
    "Scopes":"范围",
    "Scrollbars":"滚动条",
    "The Theme section allows you to modify how documents are rendered in the editor.":"主题部分允许您修改文档在编辑器中的呈现方式。",
    "The main section contains the following options:":"主要部分包含以下选项：",
    "Theme":"主题",
    "Theme Selector":"主题选择器",
    "This contains a drop-drop menu for theme selection, with the default being \"{}GameMaker Dark - Default{}\". You can edit any properties of the default theme.":"其中包含一个用于主题选择的下拉菜单，默认值为 \"{}GameMaker Dark - Default{}\"。您可以编辑默认主题的任何属性。",
    "This contains colours for the&nbsp;{}Gutter{}&nbsp;elements, like its background and foreground colours, colour of the divider between the document view and the gutter, colour of the togglable rail and the colour of the document header text.":"其中包含 {}Gutter{} 元素的颜色，例如其背景色和前景色、文档视图和装订线之间分隔线的颜色、可切换栏的颜色以及文档标题文本的颜色。",
    "You can add a new scope by selecting \"{}Add Scope{}\" at the bottom. If a language contains a scope that is not in the list, you can add it from here and define its formatting.":"您可以通过选择底部的 \"{} 添加范围 {}\" 来添加新范围。如果某种语言包含的范围不在列表中，您可以从此处添加它并定义其格式。",
    "You can also choose the size of the font, and whether to enable ligatures for fonts that use them.":"您还可以选择字体的大小，以及是否为使用它们的字体启用连字。",
    "You can use this to add colours for deeper levels of brackets, as the default list goes from&nbsp;{}punctuation.rainbow.1{} to {}punctuation.rainbow.4{}.":"您可以使用它为更深层次的括号添加颜色，因为默认列表从 {}punctuation.rainbow.1{} 到 {}punctuation.rainbow.4{}。",
    "You have the option to make a new, custom theme by clicking on \"{}New...{}\", which will give you the following options:":"您可以选择通过点击 \"{}New...{}\" 来创建新的自定义主题，这将为您提供以下选项：",
    "{}Allow Overwrite Mode{}: When enabled, pressing {}insert{} will toggle between insertion mode and overwrite mode. When disabled, nothing will happen, and the editor will stay on insertion mode. (Default: Enabled)":"{} 允许覆盖模式 {}：启用后，按 {}insert{} 将在插入模式和覆盖模式之间切换。禁用后，什么也不会发生，编辑器将保持插入模式。(默认值：启用)",
    "{}Allow overscroll{}: When enabled, allows you to scroll beyond the end of the last document up until its last line leaving the top boundary of the editor view. (Default: Disabled)":"{} 允许过度滚动 {}：启用后，您可以滚动到最后一个文档的末尾之外，直到最后一行离开编辑器视图的顶部边界。(默认值：禁用)",
    "{}Auto Indent Mode{}: See&nbsp;{}Auto-Indent{}.":"{} 自动缩进模式 {}：请参阅 {} 自动缩进 {}。",
    "{}Auto Indent clipboard contents{}: Whether automatic indentation should be applied to pasted code.":"{} 自动缩进剪贴板内容 {}：是否应将自动缩进应用于粘贴的代码。",
    "{}Auto-extend multiline comments on new line{}: When writing multiline comments ({}/* */{}, {}///{}) if you press {}enter{} and this option is enabled, it will extend the comment to the new line as well. (Default: Enabled)":"{} 在新行上自动扩展多行注释 {}：编写多行注释 ({}/* */{}、{}///{}) 时，如果您按 {}enter{} 并且启用此选项，则也会将注释扩展到新行。(默认值：启用)",
    "{}Auto-insert braces{}: Whether an ending brace should be auto-inserted when you write the beginning brace (e.g. {}{}{}, {}(){}).":"{} 自动插入大括号 {}：在编写开始大括号时是否应自动插入结束大括号 (例如 {}{ }{}、{}(){})。",
    "{}Autofill JSDoc header comments{}: Controls whether JSDoc is auto-generated for functions. See:&nbsp;{}Auto-Generating JSDoc{}&nbsp;(Default: Disabled)":"{} 自动填充 JSDoc 标头注释 {}：控制是否为函数自动生成 JSDoc。请参阅：{} 自动生成 JSDoc{}( 默认值：已禁用)",
    "{}Code Editor{}&nbsp;Preferences":"{} 代码编辑器 {} 首选项",
    "{}Default Close Behaviour{}: This controls what happens when you close an editor window when there are unsaved changes in a document. You can choose to show the dialog message, or automatically save ({}Yes{}) or not save ({}No{}) the unsaved changes.":"{} 默认关闭行为 {}：这控制当文档中有未保存的更改时关闭编辑器窗口时会发生什么情况。您可以选择显示对话框消息，或者自动保存 ({} 是 {}) 或不保存 ({} 否 {}) 未保存的更改。",
    "{}Default Delete Document Choice{}:&nbsp;This controls what happens when you choose to delete a document. You can choose to show the dialog message, or automatically delete ({}Yes{}) or not delete ({}No{}) the document.":"{} 默认删除文档选择 {}：这控制当您选择删除文档时会发生什么。您可以选择显示对话框消息，或者自动删除 ({} 是 {}) 或不删除 ({} 否 {}) 文档。",
    "{}Detect tab type{}: Enable this to use whichever tab type the currently open document is using, overriding the tab type set in the previous option. This is useful for ensuring consistency within a document, regardless of overall project-level consistency. (Default: Enabled)":"{} 检测选项卡类型 {}：启用此选项可使用当前打开的文档正在使用的选项卡类型，覆盖上一个选项中设置的选项卡类型。无论整体项目级别的一致性如何，这对于确保文档内的一致性很有用。(默认值：启用)",
    "{}Enabled{}: Enable or disable the&nbsp;{}Code Editor{}, disabling will make it fall back to the&nbsp;{}Legacy Code Editor{}. (Default: Disabled)":"{} 已启用 {}：启用或禁用 {} 代码编辑器 {}，禁用将使其回退到 {} 旧版代码编辑器 {}。(默认值：禁用)",
    "{}Highlight selection matches{}: Whether occurrences of the selected text within the same document should be highlighted.":"{} 突出显示所选内容匹配 {}：是否应突出显示同一文档中出现的所选文本。",
    "{}Highlight symbol pairs{}: Whether or not to highlight symbol pairs. (Default: Enabled)":"{} 突出显示符号对 {}：是否突出显示符号对。(默认值：启用)",
    "{}Highlight the line that the caret is on{}: Whether the line where the text cursor is placed should be highlighted. (Default: Enabled)":"{} 突出显示插入符号所在的行 {}：是否应突出显示文本光标所在的行。(默认值：启用)",
    "{}Navigation Orientation{}: This controls where the Navigation Bar is shown in the&nbsp;{}Editor Frame{}. The Navigation Bar is where you choose which asset and document is open for editing. (Default: Top)":"{} 导航方向 {}：它控制导航栏在 {} 编辑器框架 {} 中的显示位置。您可以在导航栏上选择打开哪个资产和文档进行编辑。(默认：顶部)",
    "{}Open Asset in Inspector when Editor is opened{}: When you open an asset in the&nbsp;{}Code Editor{}, and this option is enabled,&nbsp;{}The Inspector{}&nbsp;will switch its focus to the newly opened asset so you can modify its properties. (Default: Enabled)":"{} 打开编辑器时在检查器中打开资产 {}：当您在 {} 代码编辑器 {} 中打开资产并且启用此选项时，{} 检查器 {} 会将其焦点切换到新打开的资产，以便您可以修改其属性。(默认值：启用)",
    "{}Padding lines following Document{}: How many lines worth of padding is added below a document. (Default: 4)":"{} 文档后的填充行 {}：在文档下方添加多少行填充。(默认值：4)",
    "{}Padding lines preceding Document{}: How many lines worth of padding is added above a document, useful when showing all documents in a single view. (Default: 1)":"{} 文档前的填充行 {}：在文档上方添加多少行填充，在单个视图中显示所有文档时非常有用。(默认值：1)",
    "{}Scrollbar Mode{}: The {}Vertical Scrollbar{} mode to use. You can choose from the following: {} {}{}Bar{}: A simple vertical scrollbar is shown.{} {}{}Small Map{} / {}Medium Map{} / {}Large Map{}: A map is shown of the selected size. (Default: Medium Map){} {} ":"{} 滚动条模式 {}：要使用的 {} 垂直滚动条 {} 模式。您可以从以下选项中进行选择：{}{}{} 栏 {}：显示一个简单的垂直滚动条。{}{}{} 小地图 {}/{} 中型地图 {}/{} 大地图 {}：A 显示所选尺寸的地图。(默认：中地图 ){}{}",
    "{}Show Indent Guide{}: Display vertical indentation lines. See:&nbsp;{}Guides{}. (Default: Enabled)":"{} 显示缩进指南 {}：显示垂直缩进线。请参阅：{} 指南 {}。(默认值：启用)",
    "{}Show Rainbow Brackets{}: Enable&nbsp;{}Rainbow Brackets{}. Colours can be modified in the Theme section. (Default: Enabled)":"{} 显示彩虹括号 {}：启用 {} 彩虹括号 {}。可以在主题部分修改颜色。(默认值：启用)",
    "{}Show all documents in single view{}: When enabled, all documents for an asset are shown one after another in the same editor (e.g. all events for an object, all shader files for a shader asset). When disabled, only one document is shown at a time, which can be changed from the Navigation Bar. (Default: Enabled)":"{} 在单一视图中显示所有文档 {}：启用后，资产的所有文档都会在同一编辑器中依次显示 (例如，对象的所有事件、着色器资产的所有着色器文件)。禁用后，一次仅显示一个文档，可以从导航栏更改该文档。(默认值：启用)",
    "{}Show code preview when mouse hovers over scrollbar{}: If enabled, hovering over the scroll map (if enabled) for a second will display a preview of the code at the position where the mouse is placed. (Default: Enabled)":"{} 当鼠标悬停在滚动条上时显示代码预览 {}：如果启用，将鼠标悬停在滚动地图 (如果启用) 上一秒钟将在鼠标放置的位置显示代码预览。(默认值：启用)",
    "{}Show diagnostics on scrollbar{}: Whether diagnostics (such as syntax errors) should be displayed on the scrollbar. (Default: Disabled)":"{} 在滚动条上显示诊断信息 {}：是否应在滚动条上显示诊断信息 (例如语法错误)。(默认值：禁用)",
    "{}Show line numbers{}: Whether line numbers are displayed in the&nbsp;{}Gutter{}. (Default: Enabled)":"{} 显示行号 {}：行号是否显示在 {} 装订线 {} 中。(默认值：启用)",
    "{}Show sticky headers for documents{}: Whether document headers should stick to the top of the document view. (Default: Enabled)":"{} 显示文档的粘性标题 {}：文档标题是否应粘在文档视图的顶部。(默认值：启用)",
    "{}Show sticky headers for statements{}: Whether foldable statements (such as if conditions, regions etc.) should stick to the top of the document view when the view has scrolled beyond it. (Default: Disabled)":"{} 显示语句的粘性标题 {}：当视图滚动超出文档视图时，可折叠语句 (例如 if 条件、区域等) 是否应粘在文档视图的顶部。(默认值：禁用)",
    "{}Show whitespace{}: Display whitespace guides (dots). See:&nbsp;{}Guides{}. (Default: Disabled)":"{} 显示空白 {}：显示空白参考线 (点)。请参阅：{} 指南 {}。(默认值：禁用)",
    "{}Tab size{}: The size of a tab. (Default: 4)":"{} 标签大小 {}：标签的大小。(默认值：4)",
    "{}Tab type{}: The type of each tab inserted. You can choose from the following options: {} {}{}Space{}: Choosing this will insert \"{}Tab size{}\" number of spaces when you press {}tab{}. (Default){} {}{}Tab{}: Choosing this will insert a single tab character when you press {}tab{}, which will be rendered as \"{}Tab size{}\" number of spaces.{} {} ":"{} 选项卡类型 {}：插入的每个选项卡的类型。您可以从以下选项中进行选择：{}{}{} 空格 {}：选择此选项将在您按 {}Tab{} 时插入 \"{} 制表符大小 {}\" 数量的空格。(默认 ){}{}{} 制表符 {}：选择此选项将在您按 {} 制表符 {} 时插入单个制表符，该字符将呈现为 \"{} 制表符大小 {}\" 个空格。{}{}",
    "{}The \"{}Name{}\" field is the display name of the scope shown in this list, and the \"{}Scopes{}\" field is a list of scopes to cover under this name, separated by commas.":"{}\"{}Name{}\" 字段是此列表中显示的范围的显示名称，\"{}Scopes{}\" 字段是此名称下要涵盖的范围的列表，以逗号分隔。",
    "{}The first option is the font used by the&nbsp;{}Code Editor{}. Fonts that are fixed-width (which are recommended for coding over non-fixed-width fonts) are {}bolded{} in the drop-down list.":"{} 第一个选项是 {} 代码编辑器 {} 使用的字体。固定宽度字体 (建议在非固定宽度字体上进行编码) 在下拉列表中以 {} 粗体 {} 显示。",
    "{}This allows you to edit the colour for each scope that can be detected in a document. You can change the foreground and background colours, and whether to use bold, italic and/or underline formatting.":"{} 这允许您编辑可在文档中检测到的每个范围的颜色。您可以更改前景色和背景色，以及是否使用粗体、斜体和 / 或下划线格式。",
    "{}This page describes all the preferences for&nbsp;{}The Code Editor{}, which contains the following sections:":"{} 此页面介绍了 {} 代码编辑器 {} 的所有首选项，其中包含以下部分：",
    "{}Undo/Redo stack limit{}: Size of the undo/redo stack limit which controls how many undo commands you can perform. Any value below 0 is considered as \"unlimited\". (Default: -1)":"{} 撤消 / 重做堆栈限制 {}：撤消 / 重做堆栈限制的大小，控制您可以执行的撤消命令的数量。任何低于 0 的值都被视为 \" 无限制\"。(默认值：-1)",
    "{}from Copy of Selected{}: Creates a copy of the selected theme that you can edit.":"{} 来自所选主题的副本 {}：创建您可以编辑的所选主题的副本。",
    "{}from File{}: Allows you to load a {}TextMate{} file.":"{} 来自文件 {}：允许您加载 {}TextMate{} 文件。"
}