{
    "Apart from the options above there are two sub-categories, Code Editor and Visual Editor, described below.":"除了上面的选项外，还有两个子项，代码编辑器和可视化编辑器，如下所述。",
    "Code Editor":"代码编辑器",
    "Text Editor Editor Preferences":"文本编辑器首选项",
    "The Comments preferences control the different colour and formatting options for any comments that have been added to your&nbsp;{}GML Visual{} scripts. These options are:":"注释首选项控制已添加到 {}GML 可视化{}脚本中的任何注释的不同颜色和格式选项。这些选项包括：",
    "The {}Colour preferences{} are used to change how the code and script editor display different texts. Each entry has a number of sub-entries to permit you to define exactly how each separate piece of text should look, as shown in the example image above. In general, you can set the colour, font, size and style for each of the different options. Further down you can also set more general styling for things like line selection of code brackets, etc...":"{}颜色首选项{}用于更改代码和脚本编辑器显示不同文本的方式。每个条目都有多个子条目，以允许您准确定义每个单独的文本片段的外观，如上图所示。通常，您可以为每个不同的选项设置颜色、字体、大小和样式。再往下，你还可以设置更通用的样式，比如代码方括号的行选等。",
    "Under the colour preferences you have the different {}styling Options{}. These preferences are used to set the behaviour of the code/script editor, with the following options available:":"在颜色首选项下，您有不同的{}样式选项{}。这些首选项用于设置代码/脚本编辑器的行为，可用选项如下：",
    "Visual Editor":"可视化编辑器",
    "{}Anti-Aliasing{}: Here you can set the {}anti-aliasing{} mode for the output windows font rendering. You can choose to let the IDE decide by selecting {}Use Default{}, or you can force it {}On {}or {}Off {}by selecting either of those options.":"{}抗锯齿{}：您可以在此设置输出窗口字体渲染的{}抗锯齿{}模式。您可以选择让 IDE 通过选择{}使用默认{}来决定，也可以通过选择这两个选项之一来强制它{}启用{}或{}禁用{}。",
    "{}Auto add function brackets{}: Enable or disable the automatic addition of brackets {}(){} when you use the autocomplete. When writing code and this is enabled, the IDE will automatically add the two brackets {}(){} that a function requires, placing the cursor within them if the function takes arguments, or placing the cursor after them if it does not. This feature only works when the function has been selected from the autocomplete. Default is on.":"{}自动添加函数括号{}：使用自动补全时启用或禁用自动添加括号{}(){}。当编写代码并启用此功能时，IDE 将自动添加函数所需的两个方括号{}(){}，如果函数带有参数，则将光标放在其中，如果函数不带参数，则将光标放在括号后面。仅当从自动完成中选择了该功能时，此功能才起作用。默认设置为启用。",
    "{}Auto indent after brace{}: Enable or disable auto-indentation for your code when adding braces {}{}{}. Default is on, which will tab the next line of code when a new brace {}{{} and a new line are added.":"{}大括号后自动缩进{}: 在添加大括号时启用或禁用代码的自动缩进 {}{ }{}. 默认值为启用，这将在新的大括号出现时切换到下一行代码 {}{{} 并添加了新的行。",
    "{}Code Completion Delay (ms){}: The delay time (in milliseconds)":"{}代码完成延迟(毫秒){}：延迟时间，单位为毫秒",
    "{}Colour coding/code completion for obsolete functions{}: This will highlight any section of code that is obsolete. Default is on.":"{}过时函数的颜色编码/代码完成{}：这将突出显示任何过时的代码段。默认设置为启用。",
    "{}Colour{}: The default colour for the text being written to the window (default {}ARGB{} #FF53E270).":"{}颜色{}：写入窗口的文本的默认颜色(默认为 {}ARGB{} #FF53E270)。",
    "{}Default code window height{}: Set the default height (in pixels) for the code window to be when opened. Default value is 600.":"{}默认代码窗口高度{}：设置代码窗口打开时的默认高度(以像素为单位)。默认值为 600。",
    "{}Default code window width{}: Set the default width (in pixels) for the code window to be when opened. Default value is 900.":"{}默认代码窗口宽度{}：设置代码窗口打开时的默认宽度(以像素为单位)。默认值为 900。",
    "{}Document line limit{}: Set the maximum number of lines for any given editor document. The default value is 0 (0 or less is essentially infinite) and any other value will limit the lines permitted.":"{}文档行数限制{}：设置任意给定编辑单据的最大行数。缺省值为0 (0或更小基本上是无限的)，任何其他值都将限制允许的行数。",
    "{}Enable code completion{}: Enable or disable the code completion window. When writing code and this is enabled, you will get a popup window showing possible functions that you can use based on the current input text. Default is on.":"{}启用代码完成{}：启用或禁用代码完成窗口。当编写代码并启用此功能时，您将看到一个弹出窗口，其中显示您可以基于当前输入文本使用的可能功能。默认设置为启用。",
    "{}Enable colour coding{}: Enable or disable colour coding for the editor. If off, the code will not be styled, while when on it will be styled using the formatting given above in the Colour section. Default is on.":"{}启用颜色编码{}：启用或禁用编辑器的颜色编码。如果禁用，代码将不会设置样式，而启用时，将使用上面在颜色部分中给出的格式设置代码的样式。默认设置为启用。",
    "{}Font Name{}: The name of the font to use (available fonts will depend on those installed on your system).":"{}字体名称{}：要使用的字体的名称(可用的字体取决于系统上安装的字体)。",
    "{}Highlight selection matches{}: This will lightly highlight any section of code that is duplicated elsewhere. So, if you select a function, for example, all instances of this function in the current code window will be highlighted too. Default is on.":"{}突出显示选择匹配项{}：这将略微突出显示在其他地方复制的任何代码段。因此，例如，如果选择一个函数，则当前代码窗口中该函数的所有实例也将突出显示。默认设置为启用。",
    "{}Keep tabs{}: If checked, this will keep tab key presses as tab characters - \u0027 {}\\t{}\u0027 - in the editor, while unchecked means that tabs are converted into spaces. Default is off.":"{}保留制表符{}：如果选中，将在编辑器中保持按下制表键为制表符-\u0027{}\\t{}\u0027，而不选中则表示制表符转换为空格。默认设置为禁用。",
    "{}Match indent on new lines{}: Enable or disable auto-indentation for your code. Default is on, which will maintain any tabs set on a line when a new line is added.":"{}匹配新行的缩进{}：启用或禁用代码的自动缩进。默认设置为启用，这将在添加新行时保留行上设置的所有制表符。",
    "{}Minimum code window height{}: Set the minimum height (in pixels) permitted by the code window. Default value is 200.":"{}最小代码窗口高度{}：设置代码窗口允许的最小高度(以像素为单位)。默认值为 200。",
    "{}Minimum code window width{}: Set the minimum width (in pixels) permitted by the code window. Default value is 300.":"{}最小代码窗口宽度{}：设置代码窗口允许的最小宽度(以像素为单位)。默认值为 300。",
    "{}Open event scripts as tabs in same window{}: When adding code or GML Visual to an event, the code window is chained to the event window, and when this option is checked any further events that are opened for editing will be added to the same window as tabs along the top. Un-checking this option will make each event open as its own unique chained window. This option is checked by default.":"{}在同一窗口中以选项卡形式打开事件脚本{}：将代码或 GML 可视化添加到事件时，代码窗口将链接到事件窗口，选中此选项后，任何进一步打开进行编辑的事件都将添加到与顶部选项卡相同的窗口中。取消选中此选项将使每个事件作为其自己的唯一链接窗口打开。默认情况下此选项处于选中状态。",
    "{}Open linked scripts as tabs in same window{}: When you have multiple linked scripts and open them, by default they will be grouped n the same window as tabs. Un-checking this option will force them to open each in their own window/workspace. This option is checked by default.":"{}在同一窗口中将链接的脚本作为选项卡打开{}：当您有多个链接的脚本并打开它们时，默认情况下，它们将作为选项卡分组在同一窗口中。取消选中此选项将强制他们在各自的窗口/工作区中打开每个窗口。默认情况下此选项处于选中状态。",
    "{}Open object events in full screen editor{}: Checking this option will make object event code editors open automatically in a new workspace. If this is un-checked, they will open in a window chained to the object event editor. This option is unchecked by default.":"{}在全屏编辑器中打开对象事件{}：选中此选项将使对象事件代码编辑器在新的工作区中自动打开。如果未选中此选项，它们将在链接到对象事件编辑器的窗口中打开。默认情况下，此选项处于未选中状态。",
    "{}Open scripts in full screen editor{}: Checking this option will make script resources open automatically in a new workspace. If this is un-checked, they will open in a window within the current workspace. This option is unchecked by default.":"{}在全屏编辑器中打开脚本{}：选中此选项将使脚本资源在新的工作区中自动打开。如果未选中此选项，则它们将在当前工作区内的窗口中打开。默认情况下，此选项处于未选中状态。",
    "{}Open shaders in full screen editor{}: Checking this option will make shader resources open automatically in a new workspace. If this is un-checked, they will open in a window within the current workspace. This option is unchecked by default.":"{}在全屏编辑器中打开着色器{}：选中此选项将使着色器资源在新工作区中自动打开。如果未选中此选项，则它们将在当前工作区内的窗口中打开。默认情况下，此选项处于未选中状态。",
    "{}Pan text editor into view on focus{}: When you open a text editor from an object event, selecting this option will automatically pan the workspace to bring the editor to within the bounds. This option is off by default.":"{}焦点时将文本编辑器平移到视图中{}：当您从对象事件打开文本编辑器时，选择此选项将自动平移工作区以将编辑器置于边界内。默认情况下，此选项处于禁用状态。",
    "{}Show Whitespace{}: Display \" {}.{}\" to show whitespace (see image below). Default is off.":"{}显示空格{}：显示\"{}.{}\"以显示空格(见下图)。默认设置为禁用。",
    "{}Show line numbers{}: Whether to show the line numbers down the left or not. Default is on.":"{}显示行号{}：是否在左侧显示行号。默认设置为启用。",
    "{}Show tab lines{}: Display \" {}....{}\" to show tabbed space. Default is off.":"{}显示制表符行数{}：显示\"{}...{}\"以显示制表符空格。默认设置为禁用。",
    "{}Size{}: The size to set the font to for the given output window.":"{}大小{}：为给定的输出窗口设置字体的大小。",
    "{}Style{}: The font style to use, like {}bold {}or {}italics {}(note that not all windows will permit the same styles and it will also depend on the font used).":"{}样式{}：要使用的字体样式，如{}粗体{}或{}斜体{}(请注意，并不是所有窗口都允许使用相同的样式，它还取决于所使用的字体)。",
    "{}Syntax checking delay (ms){}: The delay time (in milliseconds) before the syntax checker runs. This default value is 2000ms.":"{}语法检查延迟(毫秒){}：语法检查器运行前的延迟时间(毫秒)。此默认值为 2000ms。",
    "{}Tab size{}: The number of character spaces that pressing \"Tab\" should indent the code. Default is 4.":"{}制表符大小{}：按\"Tab\"键应缩进代码的字符空格数。默认值为4。",
    "{}The {}Text Editors preferences{} are used to define how the different code/script editors look and feel. The main page has the following options:":"{}{}文本编辑器首选项{}用于定义不同的代码/脚本编辑器的外观和感觉。主页具有以下选项：",
    "{}Undo / Redo Stack Limit{}: Here you can set the Undo/Redo stack limit. Anything under 0 is essentially infinite (limited by the memory available) while positive values will limit the stack to that number, removing any action at the tail of the stack if the limit is reached. Default is -1.":"{}撤销/重做堆栈限制{}：您可以在此处设置撤消/重做堆栈限制。小于0的任何值本质上都是无限的(受可用内存的限制)，而正值会将堆栈限制为该数字，如果达到该限制，则删除堆栈尾部的所有操作。默认值为 -1。"
}