{
    "A string&nbsp;or a reference to a variable that can be converted to string, returned by&nbsp;{}{}ref_create{}{}":"一个字符串或一个可以转换为字符串的变量的引用，由{}{}ref_create{}{}返回",
    "A string&nbsp;or a reference to a variable that can be converted to string, returned by&nbsp;{}{}ref_create{}{}, or an array containing strings or references.":"一个字符串或对变量的引用，可以转换为字符串，由 {}{}ref_create{}{} 返回，或包含字符串或引用的数组。",
    "Both a&nbsp;{}{}String{}{}&nbsp;and a&nbsp;{}{}Reference{}{} to a variable containing a string can be passed to the function.&nbsp;The text can be&nbsp;multiline.":"对包含字符串的变量的 {}{}String{}{} 和 {}{}Reference{}{} 都可以传递给函数。文本可以是多行的。",
    "The above code assigns some text to an {}instance variable{} {}text{}. It then creates a reference to that variable using&nbsp;{}{}ref_create{}{}&nbsp;and stores it in {}ref_to_text{}. Next, it adds three text controls to a new debug view&nbsp;{}\"Default\"{} that will be created, under a new section&nbsp;{}\"Default\"{}. The three calls to&nbsp;{}{}dbg_text{}{}&nbsp;add a text entry in three different ways: the first provides the reference to the {}text{} variable, the second passes the variable {}text{} itself (which assigns the {}value{} the variable currently has) and the last passes a string directly.":"上面的代码将一些文本赋给 {} 实例变量 {}{}text{}。然后使用 {}{}ref_create{}{} 创建对该变量的引用，并将其存储在 {}ref_to_text{} 中。接下来，它将三个文本控件添加到将在新节 {}\"Default\"{} 下创建的新调试视图 {}\"Default\"{} 中。对 {}{}dbg_text{}{} 的三次调用以三种不同的方式添加文本条目：第一个提供对 {}text{} 变量的引用，第二个传递变量 {}text{} 本身 (它为变量当前具有的 {} 值 {} 赋值)，最后一个直接传递字符串。",
    "This function creates a read-only text label within the current debug section. You can use this to explain surrounding controls.":"此函数在当前调试部分中创建只读文本标签。您可以使用它来解释周围的控件。",
    "You can also pass an array containing items of either type. The function will create a label for each item in the array.":"你也可以传递一个包含两种类型的元素的数组。该函数将为数组中的每一个元素创建一个标签。",
    "{}{}NOTE{}{}&nbsp;See {}{}dbg_text_input{}{}&nbsp;for a control that allows modifiable text.":"{}{}注意{}{}有关允许修改文本的控件，请参见{}{}dbg_text_input{}{}。",
    "{}{}NOTE{}{}&nbsp;This control takes up a single column and can be shown&nbsp;on the same line with another single-column control using&nbsp;{}{}dbg_same_line{}{}.":"{}{}注意{}{}此控件占用一列，可以使用{}{}dbg_same_line{}{}与另一个单列控件显示在同一行上。"
}