{
    "The above code first defines an array with some numbers, and sorts them in an ascending order. It then uses that array in a {}show_debug_message_ext(){} to call to insert its first three numbers into a format string, and then print the resulting string to the Output Log.":"上面的代码首先定义一个包含一些数字的数组，并按升序对它们进行排序。然后，它在 {}show_debug_message_ext(){} 中使用该数组来调用以将其前三个数字插入到格式字符串中，然后将结果字符串打印到输出日志。",
    "The syntax of this function is identical to that of the&nbsp;{}{}string_ext{}{}&nbsp;function; aside from a single argument it can also take a {}Format String{}&nbsp;with placeholders and and array with additional arguments to replace the placeholders with.":"此函数的语法与 {}{}string_ext{}{} 函数的语法相同除了单个参数外，它还可以接受带有占位符的{}格式字符串{}，以及带有要替换占位符的附加参数的数组。",
    "The value to be turned into a string.":"要转换为字符串的值。",
    "This function shows a custom debug message in {}The Output Window{}.":"此函数在{}输出窗口{}中显示自定义调试消息。",
    "Values of type&nbsp;{}Array{}&nbsp;will be converted to a string of the format {}[element1, element2, element3, element4, element5]{}, i.e. the concatenation of all elements in the array. If any of the elements in the array is a struct or an instance then its&nbsp;{}toString() Method{} will be called to convert it to a string.":"{}数组{} 类型的值将被转换为格式为{}[Element1，Element2，Element3，Element4，Element5]{}的字符串，即数组中所有元素的串联。如果数组中的任何元素是结构或实例，则将调用其 {}toString()方法{}将其转换为字符串。",
    "Values of type&nbsp;{}Struct{}&nbsp;or {}Instance{}&nbsp;will be converted to a string using that struct\u0027s or instance\u0027s&nbsp;{}toString() Method{}&nbsp;if one exists, or converted to a string implicitly.":"类型为{}结构{}或{}实例{}的值将使用该结构或实例的 {}toString() 方法{}(如果存在)转换为字符串，或者隐式转换为字符串。",
    "Values of type&nbsp;{}{}Real{}{}&nbsp;that are an integer will have no decimal places in the string. Values of type&nbsp;{}{}Real{}{}&nbsp;that have a fractional part will have two decimal places in the string. If you need more decimal places in the output string you can use the function {}{}string_format{}{}.":"{}{}Real{}{} 类型为整数的值在字符串中不会有小数位。具有小数部分的 {}{}Real{}{} 类型的值在字符串中有两个小数位。如果在输出字符串中需要更多的小数位，可以使用函数{}{}string_format{}{}。",
    "{}{}OPTIONAL{}{}&nbsp;An array containing the values to be inserted at the placeholder positions.":"{}{}可选{}{} 包含要插入到占位符位置的值的数组。"
}