{
    "Passing an array of strings as the second argument ({}substr{}) will make the function remove any of those substrings at the end of the string, instead of white-space. These substrings may be repeated at the end, in which case all continuous occurrences will be removed. See {}Example 3{} below.":"传递字符串数组作为第二个参数 ({}substr{}) 将使函数删除字符串末尾的任何子字符串，而不是空格。这些子字符串可能会在末尾重复，在这种情况下，所有连续出现的子字符串都将被删除。请参阅下面的 {} 示例 3{}。",
    "The above code first defines a string with many newlines at the end and stores it in a temporary variable {}_the_string{}. It then calls&nbsp;{}{}string_trim_end{}{}&nbsp;to remove all the newline characters at the end of the string (but {}not{} the ones between the letters) and stores the result in another temporary variable {}_clean_string{}.":"上面的代码首先定义了一个末尾有很多换行符的字符串，并将其存储在临时变量 {}_the_string{} 中。然后调用 {}{}string_trim_end{}{} 删除字符串末尾的所有换行符 (但{}不{}删除字母之间的换行符)，并将结果存储在另一个临时变量 {}_clean_string{} 中。",
    "The string to trim":"要修剪的字符串",
    "This removes the word&nbsp;{}\"love\"{}&nbsp;from&nbsp;the end of the string.&nbsp;{}\"love\"{} appears twice at the end and is removed both times. The word {}\"I\"{} is not removed, because it\u0027s not at the very end of the string, and {}\"This\"{} is not removed as it\u0027s at the {}start{}.":"这将从字符串末尾删除单词 {}\"love\"{}。{}\"love\"{} 在末尾出现两次，但两次均被删除。单词 {}\"I\"{} 不会被删除，因为它不在字符串的最末尾，而 {}\"This\"{} 也不会被删除，因为它位于 {} 开头 {}。",
    "{}This function returns a new string with all trailing white-space characters removed.{}":"{}此函数返回一个删除所有尾随空白字符的新字符串。{}",
    "{}This function returns a new string with all trailing white-space characters removed{} (i.e. on the right side of the string){}.{}":"{} 此函数返回删除了所有尾随空白字符的新字符串 {}( 即位于字符串的右侧 ){}。{}",
    "{}{}NOTE{}{}&nbsp;The following characters are white-space characters: space (\" \"), tab (\"\\t\"), carriage return (\"\\r\"), newline (\"\\n\"), form feed (\"\\f\") and vertical tab (\"\\v\"). See&nbsp;{}White-space Characters{}&nbsp;for the full list, including Unicode characters.":"{}{}注意{}{} 以下字符为空白字符：空格(\"\")、制表符(\"\\t\")、回车符(\"\\r\")、换行符(\"\\n\")、换页符(\"\\f\")和垂直制表符(\"\\v\")。有关完整列表(包括 Unicode 字符)，请参见{}空白字符{}。",
    "{}{}OPTIONAL{}{}&nbsp;An array containing strings to trim from the end of the string":"{}{} 可选{}{} 包含要从字符串末尾修剪的字符串的数组"
}