{
    "Also see:&nbsp;{}string_split{}":"另请参阅：{}string_split{}",
    "An array with the delimiters on which to split the string":"包含要拆分字符串的分隔符的数组",
    "The above code splits a string using two different delimiters {}\",\"{} and {}\";\"{}. It stores the resulting array in the variable {}words{}.":"上面的代码使用两个不同的分隔符 {}\",\"{} 和 {}\";\"{} 来拆分字符串。它将结果数组存储在变量 {}words{} 中。",
    "The delimiter array contains all possible values at which the string is split. For example, you can have a string that you want to split {}\"Name,Age;Height|Description\"{}. In the end you want the individual words but there are multiple delimiter characters, which you can specify in an array: {}[\",\", \";\", \"|\"]{}. The result of&nbsp;{}{}string_split_ext{}{}&nbsp;on the given string with this array will then be {}[\"Name\", \"Age\", \"Height\", \"Description\"]{}.":"分隔符数组包含拆分字符串的所有可能值。例如，您可以有一个要拆分的字符串：{}\"Name,Age;Height|Description\"{}。最后需要单个单词，但有多个分隔符，可以在数组中指定：{}[\"，\"，\"\"，\"|\"]{}。然后，对具有此数组的给定字符串进行 {}{}string_split_ext{}{} 的结果为 {}[\"name\"，\"Age\"，\"Height\"，\"Description\"]{}。",
    "The string to split using any of the provided delimiters":"要使用任何提供的分隔符拆分的字符串",
    "This function splits a string into into separate strings using any of the&nbsp;{}delimiters{}&nbsp;in an array. The resulting strings are returned in a new array.":"此函数使用数组中的任何{}分隔符{}将字符串拆分为多个单独的字符串。结果字符串在新数组中返回。",
    "{}{}OPTIONAL{}{}&nbsp;This parameter determines if empty array elements should be removed from the array or not (default is {}false{}). It can be useful for those situations where two delimiters are right next to each other in the string, with nothing in between. By default, in this case, an empty string is added to the array (representing the empty string between those two delimiters). If you don\u0027t want these empty strings in the array then you should set this parameter to {}true{} instead.":"{}{}可选{}{} 此参数确定是否应从数组中移除空数组元素(默认为 {}false{})。对于字符串中两个分隔符紧挨着且中间没有任何分隔符的情况，它非常有用。默认情况下，在这种情况下，会向数组中添加一个空字符串(表示这两个分隔符之间的空字符串)。如果您不希望数组中包含这些空字符串，则应该将此参数设置为 {}true{}。",
    "{}{}OPTIONAL{}{}&nbsp;This parameter determines the maximum number of splits to make.&nbsp;Any delimiters that come after&nbsp;{}max_splits{}&nbsp;become part of the last string, e.g. splitting {}\"1|2|3|4|5\"{} with a {}max_splits{} of 3 and {}|{} as the delimiter will return {}[\"1\", \"2\", \"3\", \"4|5\"]{}.":"{}{}可选{}{} 此参数确定要进行的最大拆分数。之后的任何分隔符都将 {4}max_splits{5} 成为最后一个字符串的一部分，例如，拆分 {}\"1|2|3|4|5\"{}，其中 {}max_splits{} 为 3，并且 {}|{} 作为分隔符将返回 {}[\"1\"，\"2\"，\"3\"，\"4|5\"]{}。"
}