{
    "The default format is no extra spaces on the left, and only two decimal places on the right, e.g.&nbsp;{}\"265.73\"{}.":"默认格式是左边没有多余的空格，右边只有两位小数，例如{}\"265.73\"{}。",
    "The number of decimal places to be included (right side of decimal). Zeroes will be inserted to match this.":"要包含的小数位数(小数点右侧)。将插入零以与此匹配。",
    "The number of decimal places to be included.":"要包括的小数位数。",
    "The number of places of the main number to be shown (left side of decimal). Spaces will be inserted to match this.":"要显示的主数字的位数(小数点左边)。将插入空格以匹配此位数。",
    "The real number to be converted to a string.":"要转换为字符串的真实的数字。",
    "The real number to be turned into a string.":"要变成字符串的实数。",
    "The total number of places of the main number to be shown. Zeroes or spaces will be inserted to match this.":"要显示的主数字的总位数。零或空格将被插入，以符合这个要求。",
    "The {}total{} argument is the number of digits on the left side of the decimal, and if this is higher than your value allows, spaces are inserted to fill the remaining digits. The {}dec{} argument is the number of digits on the right side of the decimal, and if this is more than the decimal digits in your number, zeroes are inserted to keep your given number of digits.":"{}total{}参数是小数点左边的位数，如果这比您的值允许的要高，则插入空格以填充剩余的位数。{}dec{}参数是小数点右边的位数，如果这比您的数字中的小数点位数要多，则插入零以保持给定的位数。",
    "This function converts a real number into a string, where you can specify how many digits are visible on each side of the decimal.":"此函数将真实的数字转换为字符串，您可以在其中指定小数点两侧可见的位数。",
    "This will set {}str1{} to \"&nbsp;&nbsp;&nbsp;&nbsp;1234\", {}str2{} to \"3.1415926535\" and {}str3{} to \"&nbsp;&nbsp;&nbsp;&nbsp;3.14159\".":"这会将 {} str1{} 设置为 “1234”，{} str2{} 设置为 “3.1415926535”，将 {} str3{} 设置为 “3.14159”。",
    "Turns a real number into a string using your own formatting, where you can choose how many \"places\" are saved to the string and how many decimal places are saved also. Both can be very handy, some games prefer to display a score as a set number of digits, while control over decimal places can be good for a high accuracy the two decimal places of {}{}string(){}{} cannot provide. If the number of places specified is greater than the value to be shown and/or the number plus the decimal places that have been specified is less than the total places, then spaces will be added before the value to make up the difference (see the example below). Zeros will be added to the right of the decimal point if the value given is less than the total and the number of decimal places to include. The default format is no extra spaces on the left, and only two decimal places on the right, eg \"265.73\".":"将一个实数变成一个使用你自己格式的字符串，你可以选择多少个 \"位 \"被保存到字符串中，以及多少个小数位也被保存。这两种方法都很方便，有些游戏喜欢将分数显示为一个固定的数字，而对小数点位的控制可以达到{}{}string(){}{}的两个小数点位无法提供的高精确度。如果指定的位数大于要显示的数值，并且/或者指定的数值加上小数点后的位数小于总的位数，那么在数值前会加上空格以弥补差值(见下面的例子)。如果给定的数值小于总数和要包括的小数位数，小数点右边将加零。默认格式是左边没有多余的空格，右边只有两个小数位，例如 \"265.73\"。"
}