{
    "It writes the resulting string to the buffer as a&nbsp;{}buffer_text{}&nbsp;value and then saves the contents of the buffer to a file named {}\"text.txt\"{} in a directory {}save_dir{}. Finally it deletes the buffer to prevent memory leaks.":"它将生成的字符串作为 {}buffer_text{} 值写入缓冲区，然后将缓冲区内容保存到名为 {}\"text.txt\"{} 的文件中，该文件位于目录 {}save_dir{} 中。最后，它删除缓冲区以防止内存泄漏。",
    "The above code first creates a grow&nbsp;{}buffer{}&nbsp;and assigns it to a temporary variable {}_buffer{}. It then creates an array with a number of elements and stores that in another variable {}_text_lines{}. It then calls&nbsp;{}{}string_join_ext{}{}&nbsp;on the array with a separator {}\"\\r\\n\"{}, which results in new lines between all the given strings.":"上面的代码首先创建一个增长的 {} 缓冲区 {} 并将其赋给一个临时变量 {}_buffer{}。然后，它创建一个包含多个元素的数组，并将其存储在另一个变量 {}_text_lines{} 中。然后，它使用分隔符 {10}\"\\r\\n\"{11} 对数组调用 {}{}string_join_ext{}{}，这会在所有给定字符串之间产生新行。",
    "The above code joins the words in the {}array{} into a single string using a space as the delimiter.":"上面的代码使用空格作为分隔符，将{}数组{}中的单词连接到单个字符串中。",
    "The array containing the values to join together":"包含要联接在一起的值的数组",
    "The string to insert between the values":"要在值之间插入的字符串",
    "This function joins together the string representations of all values in the given array (or part of the array), inserting the given \"delimiter\" between each value. The function returns the joined string.":"此函数将给定数组(或数组的一部分)中所有值的字符串表示连接在一起，在每个值之间插入给定的\"分隔符\"。该函数返回联接的字符串。",
    "Values that are not strings will have the {}{}string(){}{} function run on them implicitly. See {}Conversion From Non-String Types{}&nbsp;for information on how those data types are converted.":"不是字符串的值将具有隐式运行的 {}{}string(){}{} 函数。有关如何转换这些数据类型的信息，请参阅 {} 从非字符串类型转换 {}。",
    "{}{}OPTIONAL{}{}&nbsp;The number of array elements to concatenate, starting at the offset.&nbsp;A negative value will traverse the array backwards (i.e. in descending order of indices, e.g. 2, 1, 0 instead of 2, 3, 4). See:&nbsp;{}Offset And Length{}":"{}{}可选{}{} 要连接的数组元素的数量，从偏移量开始。 负值将向后遍历数组(即按索引的降序，例如 2，1，0 而不是 2，3，4)。请参阅： {}偏移量和长度{}",
    "{}{}OPTIONAL{}{}&nbsp;The offset, or starting index, in the array to start joining elements.&nbsp;Setting a negative value will count from the end of the array. The starting index will then be {}array_length(array) + offset{}. See:&nbsp;{}Offset And Length{}":"{}{}可选{}{} 数组中开始加入元素的偏移量或起始索引。设置负值将从数组的末尾开始计算。然后，起始索引将是 {}array_length(array) + offset{}。请参阅：{} 偏移量和长度 {}"
}