{
    "Passing an array of strings as the second argument ({}substr{})&nbsp;will make the function remove any of those substrings at the start of the string, instead of white-space. These substrings may be repeated at the start, in which case all continuous occurrences will be removed. See {}Example 3{} below.":"传递字符串数组作为第二个参数 ({}substr{}) 将使函数删除字符串开头的任何子字符串，而不是空格。这些子字符串可能会在开始时重复，在这种情况下，所有连续出现的子字符串都将被删除。请参阅下面的 {} 示例 3{}。",
    "The above code first creates a temporary string named&nbsp;{}_string_with_a_bit_of_everything{}. This string contains a couple of leading spaces and tabs before the actual text. It then trims all whitespace from the start of the string by calling&nbsp;{}{}string_trim_start{}{}&nbsp;and the result is stored in a new temporary variable&nbsp;{}_trimmed_string{}. Finally this new string is shown in a debug message.":"上面的代码首先创建一个名为 {}_string_with_a_bit_of_everything{} 的临时字符串。此字符串在实际文本之前包含几个前导空格和制表符。然后，它通过调用 {}{}string_trim_start{}{} 从字符串的开头修剪所有空格，结果存储在一个新的临时变量 {}_trimmed_string{} 中。最后，这个新字符串显示在调试消息中。",
    "The string to trim":"要修剪的字符串",
    "This removes the word&nbsp;{}\"This\"{}&nbsp;from&nbsp;the start of the string.&nbsp;{}\"This\"{} appears twice at the start and is removed both times. The word {}\"is\"{} is not removed, because it\u0027s not at the very start of the string, and {}\"love\"{} is not removed as it\u0027s at the {}end{}.":"这将从字符串开头删除单词 {}\"This\"{}。{}\"This\"{} 在开始时出现两次，但两次均被删除。单词 {}\"is\"{} 不会被删除，因为它不在字符串的最开头，而 {}\"love\"{} 也不会被删除，因为它位于 {} 末尾 {}。",
    "{}This function returns a new string with all leading white-space characters removed (i.e. on the left side of the string).{}":"{} 此函数返回一个新字符串，其中所有前导空白字符均被删除 (即位于字符串的左侧)。{}",
    "{}This function returns a new string with all leading white-space characters removed.{}":"{}此函数返回删除了所有前导空格字符的新字符串。{}",
    "{}{}NOTE{}{}&nbsp;The following characters are white-space characters: space (\" \"), tab (\"\\t\"), carriage return (\"\\r\"), newline (\"\\n\"), form feed (\"\\f\") and vertical tab (\"\\v\"). See&nbsp;{}White-space Characters{}&nbsp;for the full list, including Unicode characters.":"{}{}注意{}{} 以下字符为空白字符：空格(\"\")、制表符(\"\\t\")、回车符(\"\\r\")、换行符(\"\\n\")、换页符(\"\\f\")和垂直制表符(\"\\v\")。有关完整列表(包括 Unicode 字符)，请参见{}空白字符{}。",
    "{}{}OPTIONAL{}{}&nbsp;An array containing strings to trim from the start of the string":"{}{} 可选{}{} 包含要从字符串开头修剪的字符串的数组"
}