{
    "Conversion From Non-String Types":"从非字符串类型转换",
    "Format String":"格式化字符串",
    "If you only pass a single argument to the function, then this argument will not be considered a format string. If you add placeholders of the kind \"{0}\" in this case, then they will be output as normal text as there are no values to replace them with:&nbsp;":"如果只将单个参数传递给函数，则此参数不会被视为格式字符串。如果在本例中添加类型为 \"{0}\" 的占位符，则它们将作为普通文本输出，因为没有值可以替换为：",
    "In this code the&nbsp;{}{}string{}{} function is used in a slightly different way to achieve the same result as in Example 1. Here the function is called with a format string as the first argument, in which \"{0}\" is replaced with the value of {}{}score{}{} and \"{1}\" is replaced with the value of {}{}health{}{}.":"在此代码中，{0}{1}string{}{}函数的使用方式与示例1中的使用方式略有不同。这里使用格式字符串作为第一个参数来调用该函数，其中\"{0}\"替换为{}{}score{}{}，而\"{1}\"替换为{}{}health{}{}。",
    "The above code uses the {}string{} function to draw both real numbers and strings together (draw will only accept {}either{} a string {}or{} a real, but not both).":"上面的代码使用 {} string{} 函数将实数和字符串都画在一起 (draw将只接受 {} 一个字符串 {} 或 {} 一个实数，但不接受两者)。",
    "The above code uses the&nbsp;{}{}string{}{} function to draw both real numbers and strings together, as {}{}draw_text(){}{} will only accept {}either{} a string {}or{} a real, but not both, so we convert the non-strings into strings.":"上面的代码使用 {}{}string{}{} 函数将实数和字符串绘制在一起，因为 {}{}draw_text(){}{} 将只接受 {} 一个字符串 {} 或 {} 一个实数 {}，而不是两者都接受，所以我们将非字符串转换为字符串。",
    "The real number to be turned into a string.":"要变成字符串的实数。",
    "The value to be turned into a string.":"要转换为字符串的值。",
    "These placeholders will be replaced with the arguments at the positions they refer to, i.e. \"{0}\" will be replaced with the second argument, \"{1}\" will be replaced with the third argument, \"{2}\" will be replaced with the fourth argument, and so on.":"这些占位符将替换为它们所引用位置上的参数，即 \"{0}\" 将替换为第二个参数，\"{1}\" 将替换为第三个参数，\"{2}\" 将替换为第四个参数，依此类推。",
    "This function creates a new string from a variety of data types.":"此函数用于从各种数据类型创建新字符串。",
    "Values of type&nbsp;{}Array{}&nbsp;will be converted to a string of the format {}[element1, element2, element3, element4, element5]{}, i.e. the concatenation of all elements in the array. If any of the elements in the array is a struct or an instance then its&nbsp;{}toString() Method{} will be called to convert it to a string.":"{}数组{}类型的值将被转换为格式为 {}[Element1，Element2，Element3，Element4，Element5]{} 的字符串，即数组中所有元素的串联。如果数组中的任何元素是结构或实例，则将调用其 {}toString() 方法{} 将其转换为字符串。",
    "Values of type&nbsp;{}Struct{}&nbsp;or {}Instance{}&nbsp;will be converted to a string using that struct\u0027s or instance\u0027s&nbsp;{}toString() Method{}&nbsp;if one exists, or converted to a string implicitly.":"{}结构{}或{}实例{}类型的值将使用该结构或实例的 {}toString() 方法{} (如果存在)转换为字符串，或者隐式转换为字符串。",
    "Values of type&nbsp;{}{}Real{}{}&nbsp;that are an integer will have no decimal places in the string. Values of type&nbsp;{}{}Real{}{}&nbsp;that have a fractional part will have two decimal places in the string. If you need more decimal places in the output string you can use the function {}{}string_format{}{}.":"{}{}Real{}{} 类型为整数的值在字符串中不会有小数位。具有小数部分的 {}{}Real{}{} 类型的值在字符串中有两个小数位。如果在输出字符串中需要更多的小数位，可以使用函数 {}{}string_format{}{}。",
    "When only one argument is provided to the function, this argument is considered to be a value, which will be converted to a string from its original&nbsp;{}data type{}. When more than one argument is given, the first argument is considered a {}Format String{}&nbsp;and the arguments that follow it are considered the values to insert into the format string.":"当只向函数提供一个参数时，该参数被视为一个值，该值将从其原始{}数据类型{}转换为字符串。当给定多个参数时，第一个参数被视为{}格式字符串{}，其后的参数被视为要插入到格式字符串中的值。",
    "When you pass more than one argument to the&nbsp;{}{}string{}{}&nbsp;function, the first argument will be treated as a {}format string{}. In a format string you can use {}placeholders{} of the form \"{0}\", \"{1}\", \"{2}\", etc.":"当您向{0}{1}string{2}{3}函数传递多个参数时，第一个参数将被视为{}格式字符串{}。在格式字符串中，您可以使用 \"{0}\"、\"{1}\"、\"{2}\" 等形式的{}占位符{}。",
    "With this function you can turn any real number into a string. If the real number is an integer, it will be saved with no decimal places, otherwise, it will be saved with two decimal places. If you require more decimal places, then use the function {}{}string_format(){}{}. Also note that using this function on a variable storing&nbsp;an {}array{}, a {}data structure{}, or a {}struct{} will convert the contents of these variables into a string which can then be output to the console or saved to a file for debugging.":"有了这个函数，你可以把任何实数变成一个字符串。如果实数是整数，则将其保存为无小数位，否则，将保存为两位小数。如果您需要更多的小数位，那么使用函数 {}{} string_format(){}{}。还要注意，在变量上使用此函数存储 {} 数组 {} 、 {} 数据结构 {} 或 {} 结构 {} 会将这些变量的内容转换为字符串，然后可以输出到控制台或保存到文件中进行调试。",
    "{}{}NOTE{}{}&nbsp;You can also use&nbsp;{}Template Strings{} to insert variables and expressions into strings.":"{}{}注意{}{} 还可以使用{}模板字符串{}将变量和表达式插入字符串中。",
    "{}{}OPTIONAL{}{}&nbsp;The values to be inserted at the placeholder positions.":"{}{}可选{}{} 要插入占位符位置的值。"
}