{
    "The above code will draw the sprite associated with the instance running the code distorted around the x / y position of the instance and with a fully opaque alpha.":"上述代码将绘制与运行在实例的x/y位置周围扭曲的代码的实例相关联的精灵，并使用完全不透明的字母。",
    "The alpha of the sprite (from 0 to 1 where 0 is transparent and 1 opaque).":"精灵的alpha(从0到1，其中0是透明的，1是不透明的)。",
    "The first x coordinate.":"第一个x坐标。",
    "The first y coordinate.":"第一个y坐标。",
    "The fourth x coordinate.":"第四个x坐标。",
    "The fourth y coordinate.":"第四个y坐标。",
    "The index of the sprite to draw.":"要绘制的精灵的索引。",
    "The second x coordinate.":"第二个x坐标。",
    "The second y coordinate.":"第二个y坐标。",
    "The subimg (frame) of the sprite to draw (image_index or -1 correlate to the current frame of animation in the object).":"要绘制的精灵的subimg(帧)(image_index或-1)与对象中动画的当前帧相关联。",
    "The third x coordinate.":"第三个x坐标。",
    "The third y coordinate.":"第三个y坐标。",
    "With this function you can draw a sprite distorted over the area defined by the four corner coordinates. The first two arguments are the sprite to draw and the sub-image of the sprite (the same as in the function {}{}draw_sprite(){}{}) but the next ones are those that define the position of each of the four corners of the {}bounding box{} of the given sprite. These should be given in {}clockwise{} order, so the first coordinate is the top left, then the top right, then bottom right and finally the bottom left. You can also set a value for the alpha of the sprite to draw it with transparency. The image below illustrates how this function works:":"使用此函数，可以在由四个角坐标定义的区域上绘制变形的精灵。前两个参数是要绘制的精灵和精灵(与函数{}{}draw_sprite(){}{}中的相同)但下一个是定义给定精灵的{}边界框{}的四个角的每个角的位置的那些。这些坐标应按{}顺时针{}顺序给出，因此第一个坐标是左上角，然后是右上角，最后是底部最后是左下角。也可以为精灵的Alpha设置一个值，以便使用透明度绘制它。下图说明了此函数的工作原理：",
    "{}NOTE{}: This function is only useful for {}bitmap{} sprites and will not work with SWF or JSON (Spine) sprites.":"{}注意{}：此函数仅适用于{}位图{}精灵，不适用于Swf或JSON(脊椎)精灵。",
    "{}NOTE{}: When using this function, you should have the {}Automatically Crop{} setting disabled for texture pages.":"{}注意{}：使用此函数时，应禁用纹理页面的{}\"自动裁剪\"{}设置。",
    "{}WARNING!{} The image above is only for illustrative purposes, and if you use this function on a sprite, you will get different results and may experience texture \"shearing\" due to the way that a sprite is constructed from a quad of primitives.":"{}警告!{}上面的图像仅用于说明目的，如果在精灵上使用此函数，则会得到不同的结果，并且由于精灵是由四个基元组成的，因此可能会遇到纹理\"剪切\"。"
}