{
    "The index of the sprite to draw.":"要绘制的精灵的索引。",
    "The sub-image (frame) of the sprite to draw (image_index or -1 correlate to the current frame of animation in the object).":"要绘制的精灵(image_index或-1)的子图像(帧)与对象中动画的当前帧相关联。",
    "The x coordinate of where to draw the sprite.":"绘制精灵的位置的x坐标。",
    "The y coordinate of where to draw the sprite.":"绘制精灵的位置的y坐标。",
    "This function draws the given sprite and sub-image at a position within the game room. For the sprite you can use the instance variable {}{}sprite_index{}{} to get the current sprite that is assigned to the instance running the code, or you can use any other sprite asset. The same goes for the sub-image, as this can also be set to the instance variable {}{}image_index{}{} which will set the sub-image to that selected for the current instance sprite (note, that you can draw a different sprite and still use the sub-image value for the current instance), or you can use any other value for this to draw a specific sub-image of the chosen sprite. If the value is larger than the number of sub-images, then {}GameMaker{} will automatically loop the number to select the corresponding image (for example, if the sprite being drawn has 5 sub-images numbered 0 to 4 and we set the index value to 7, then the function will draw sub-image 3, numbered 0). Finally, the x and y position is the position within the room that the sprite will be drawn, and it is centered on the sprite {}x offset{} and {}y offset{}.":"该函数在游戏室内的某个位置绘制给定的精灵和子图像。对于精灵，您可以使用实例变量{}{}sprite_index{}{}获取分配给运行代码的实例的当前精灵，也可以使用任何其他精灵资源。子图像也是如此，因为这也可以设置为实例变量{}{}image_index{}{}，该变量将把子图像设置为为当前实例精灵选择的子图像(请注意，您可以绘制不同的精灵，并仍然使用当前实例的子图像值)，或者您可以为此使用任何其他值来绘制所选精灵的特定子图像。如果该值大于子图像的数量，{}GameMaker{}将自动循环该数量以选择相应的图像(例如，如果正在绘制的精灵具有编号为0到4的5个子图像，并且我们将索引值设置为7，则函数将绘制编号为0的子图像3)。最后，x和y位置是房间内将绘制精灵的位置，它位于精灵{}x偏移量{}和{}y偏移量{}的中心。",
    "This will draw the instances assigned sprite (sprite_index) with the current sub-image at the x and y position of the instance within the room. It will then draw the first frame of the sprite indexed by \"spr_Halo\" at the same x and y position but 32 pixels \u0027above\u0027.":"这将在房间内实例的x和y位置绘制指定了sprite(sprite_index)的实例，其中包含当前子图像。然后，它将在相同的x和y位置绘制由\"spr_Halo\"索引的精灵的第一帧，但是在上面的32个像素处。",
    "{}NOTE{}&nbsp;This function may not work as expected when using skeleton animation sprites, and you may find that the function only draws the first frame of the default pose. You should be using the {}draw_skeleton_*{} functions instead.":"{}注意{}使用骨骼动画精灵时，此函数可能无法按预期工作，您可能会发现此函数仅绘制默认姿势的第一帧。您应该改用{}draw_skeleton_*{}函数。"
}