{
    "The height of the area to draw.":"要绘制的区域的高度。",
    "The index of the sprite to draw.":"要绘制的子画面的索引。",
    "The subimg (frame) of the sprite to draw (image_index or -1 correlate to the current frame of animation in the object).":"要绘制的sprite的subimg(帧)(image_index或-1)与对象中动画的当前帧相关联。",
    "The width of the area to draw.":"要绘制的区域的宽度。",
    "The x coordinate of where to draw the sprite.":"绘制精灵的位置的x坐标。",
    "The x position on the sprite of the top left corner of the area to draw.":"要绘制区域左上角子画面上的x位置。",
    "The y coordinate of where to draw the sprite.":"绘制精灵的位置的y坐标。",
    "The y position on the sprite of the top left corner of the area to draw.":"要绘制区域左上角子画面上的y位置。",
    "This will draw the instances assigned sprite (sprite_index) and its current frame of animation (image_index), however it will shave a 4px margin off the width on both sides, and an 8 pixel margin off the height from the bottom of the original 24x24 pixel sprite.":"这将绘制指定为sprite(sprite_index)的实例及其当前动画帧(image_index)，但它将从两侧的宽度上削减4 px边距，从原始24 x 24底部的高度上削减8像素边距像素精灵。",
    "With this function you can draw part of any sprite at a given position within the room. As with {}{}draw_sprite(){}{} you can specify a sprite and a sub-image for drawing, then you must give the {}relative coordinates{} within the sprite of the area to select for drawing. This means that a left position of 0 and a top position of 0 would be the top left corner of the sprite and all further coordinates should be taken from that position. The image below shows an example of how this works:":"使用此功能，您可以在房间内的给定位置绘制任何sprite的一部分。对于{}{}draw_sprite(){}{}，可以指定要绘制的子图像和子图像，然后必须在要选择绘制的区域的子图像中给出{}个相对坐标{}。这意味着，左侧位置0和顶部位置0将是子画面的左上角，并且应该从该位置获取所有进一步的坐标。下图显示了一个示例的工作原理：",
    "{}NOTE{}: This function is only useful for {}bitmap{} sprites and will not work with SWF or JSON (Spine) sprites.":"{}注意{}：此函数仅适用于{}位图{}精灵，不适用于Swf或Json(脊椎)精灵。",
    "{}NOTE{}: When drawing with this function, the sprite {}x offset{} and {}y offset{} are ignored and the sprite part will be drawn with the top left corner at the specified x / y position in the room.":"{}注意{}：使用此函数绘制时，将忽略精灵{}x偏移{}和{}y偏移{}，并且将绘制sprite零件，其中左上角位于房间中指定的x/ y位置。",
    "{}You should note that if the texture page permits automatic cropping then this function may not work as expected, since the extra \"empty\" space around the sprite will have been removed for creating the texture page. To resolve this issue, you will need to set the texture page settings (in the {}Texture Group Editor{}) to disable the option {}Automatic Crop{}.":"{}请注意，如果纹理页面允许自动裁剪，则此功能可能无法按预期工作，因为sprite周围的额外\"空\"空间将被删除以创建纹理页面。若要解决此问题，您需要设置纹理页面设置(在{}纹理组编辑器{}中)以禁用选项{}自动裁剪{}。"
}