{
    "The alpha of the sprite (from 0 to 1 where 0 is transparent and 1 opaque).":"精灵的alpha(从0到1，其中0是透明的，1是不透明的)。",
    "The colour with which to blend the sprite. {}c_white{} is to display it normally.":"与精灵混合的颜色。{}c_white{}将正常显示它。",
    "The horizontal scaling of the sprite, as a multiplier: 1 = normal scaling, 0.5 is half etc...":"精灵的水平缩放，作为乘数：1 =正常缩放，0.5等于一半...",
    "The index of the sprite to draw.":"要绘制的精灵的索引。",
    "The rotation of the sprite. 0=right way up, 90=rotated 90 degrees counter-clockwise etc...":"精灵的旋转。0 =右上角，90 =逆时针旋转90度，等等...",
    "The subimg (frame) of the sprite to draw (image_index or -1 correlate to the current frame of animation in the object).":"要绘制的精灵的subimg(帧)(image_index或-1)与对象中动画的当前帧相关联。",
    "The vertical scaling of the sprite as a multiplier: 1 = normal scaling, 0.5 is half etc...":"作为乘数的精灵的垂直缩放：1 =正常缩放，0.5等于一半...",
    "The x coordinate of where to draw the sprite.":"绘制精灵的位置的x坐标。",
    "The y coordinate of where to draw the sprite.":"绘制精灵的位置的y坐标。",
    "This function will draw the given sprite as in the function {}{}draw_sprite(){}{} but with additional options to change the scale, blending, rotation and alpha of the sprite being drawn. Changing these values does {}not{} modify the resource in any way (only how it is drawn), and you can use any of the available {}sprite variables{} instead of direct values for all the arguments in the function. The image below illustrates how different values affect the drawing of the sprite:":"此函数将按照函数{}{}draw_sprite(){}{}中的方式绘制给定的精灵，但具有更改绘制的精灵的缩放、混合、旋转和Alpha的附加选项。更改这些值{}不会{}以任何方式(仅限于绘制方式)修改资源，并且您可以使用任何可用的{}精灵变量{}，而不是使用函数中所有参数的直接值。下图说明了不同的值如何影响精灵的绘制：",
    "This will draw the instances assigned sprite with all its default values (essentially the same as using {}draw_self{}).":"这将使用其所有默认值(基本上与使用{}draw_self{}相同)绘制分配给精灵的实例。",
    "{}If used with a Nine Slice enabled sprite, it will retain any detail&nbsp;after scaling depending on your Nine Slice settings in the {}Sprite Editor{}. See the page on {}Nine Slice{} for more information.{}":"{}如果与启用九宫格的精灵配合使用，则根据{}精灵编辑器{}中的\"九宫格\"设置进行缩放后，它将保留任何详细信息。有关详细信息，请参阅{}九宫格{}上的页面。{}",
    "{}NOTE{}: Colour blending is only recommended for the HTML5 target when WebGL is enabled, although you can still set the blending colour if it is not enabled and it will blend the sprite as normal. However all blending in this way creates a duplicate sprite which is then stored in the cache and used when required. This is far from optimal and if you use multiple colour changes it will slow down your games performance unless you activate WebGL. if you do not wish to use WebGL, then you can set the font cache size to try and limit this should it be necessary using the function {}{}{}sprite_set_cache_size(){}{}{}.":"{}注意{}：只有在启用WebGL时，才建议对HTML5目标使用颜色混合，但如果未启用混合颜色，则仍可以设置该混合颜色，并且该混合颜色会将sprite混合为正常颜色。但是，以这种方式进行的所有混合都会创建一个重复的精灵，然后将其存储在缓存中并在需要时使用。这远远不是最佳选择，如果您使用多种颜色更改，则除非您激活WebGL，否则会降低游戏性能。如果您不希望使用WebGL，则可以设置字体缓存大小，以便在必要时使用函数{}{}{}sprite_set_cache_size(){}{}{}进行限制。",
    "{}NOTE{}: This function may not work as expected when using skeleton animation sprites, and you may find that the function only draws the first frame of the default pose. You should be using the {}draw_skeleton_*{} functions instead.":"{}注意{}：使用骨骼动画精灵时，此函数可能无法按预期工作，您可能会发现此函数仅绘制默认姿势的第一帧。您应该改用{}draw_skeleton_*{}函数。"
}