{
    "The alpha of the sprite (from 0 to 1 where 0 is transparent and 1 opaque).":"精灵的α(从0到1，其中0是透明的，1是不透明的)。",
    "The colour with which to blend the sprite. c_white is to display it normally.":"混合精灵的颜色。c_white将正常显示精灵。",
    "The height of the area the stretched sprite will occupy.":"拉伸精灵将占据的区域的高度。",
    "The index of the sprite to draw.":"要绘制的子画面的索引。",
    "The subimg (frame) of the sprite to draw (image_index or -1 correlate to the current frame of animation in the object).":"要绘制的sprite的subimg(帧)(image_index或-1)与对象中动画的当前帧相关联。",
    "The width of the area the stretched sprite will occupy.":"拉伸精灵将占据的区域的宽度。",
    "The x coordinate of where to draw the sprite.":"绘制精灵的位置的x坐标。",
    "The y coordinate of where to draw the sprite.":"绘制精灵的位置的y坐标。",
    "This function does exactly the same as the {}{}draw_sprite_stretched(){}{} function with the added ability to set the colour blending and alpha value for the sprite when it is drawn (similar to the function {}{}draw_sprite_ext(){}{}).":"此函数的作用与{}{}draw_sprite_stretched(){}{}函数完全相同，添加了绘制sprite时设置颜色混合和Alpha值的函数(类似于函数{}{}draw_sprite_ext(){}{})。",
    "This will draw the instances assigned sprite and its sub-image with the left corner at the instance x /y position. Its width is set to the same as the sprite, and the height is the sprite height divided by two. It will also be blended normally but have a partially transparent alpha value.":"这将绘制分配给sprite的实例及其子图像，其中左角位于实例x/y位置。其宽度设置为与精灵相同，高度为精灵高度除以两。它也将正常混合，但具有部分透明的Alpha值。",
    "{}NOTE{}&nbsp;Colour blending is only recommended for the HTML5 target when WebGL is enabled, although you can still set the blending colour if it is not enabled and it will blend the sprite as normal. However all blending in this way creates a duplicate sprite which is then stored in the cache and used when required. This is far from optimal and if you use multiple colour changes it will slow down your games performance unless you activate WebGL. if you do not wish to use WebGL, then you can set the font cache size to try and limit this should it be necessary using the function {}{}{}sprite_set_cache_sizee(){}{}{}.":"{}注意{}只有在启用WebGL时，才建议对HTML5目标使用颜色混合，但如果未启用混合颜色，则仍可以设置该混合颜色，并且该混合颜色会将sprite混合为正常颜色。但是，以这种方式进行的所有混合都会创建一个重复的sprite，然后将其存储在缓存中并在需要时使用。这远远不是最佳选择，如果您使用多种颜色更改，则除非您激活WebGL，否则会降低游戏性能。如果您不希望使用WebGL，则可以设置字体缓存大小，以便在必要时使用函数{}{}{}sprite_set_cache_sizee(){}{}{}进行限制。",
    "{}NOTE{}&nbsp;When drawing with this function, the sprite {}x offset{} and {}y offset{}&nbsp;(or origins) are ignored and the sprite is drawn with the top-left corner at the specified x/y position in the room.":"{}注意{}使用此函数绘制时，将忽略精灵{}x偏移{}和{}y偏移{}(或原点)，并使用房间中指定的x/ y位置的左上角绘制子画面。"
}