{
    "Apart from those functions listed above, there are also two special functions designed for use with skeletal animations (see {}Importing Non-Bitmap Sprites{} for more information on these types of sprites, and the section {}Skeletal Animations{} for specific functions related to these types of sprites):":"除了上面列出的那些功能外，还有两个专门设计用于骨骼动画的特殊功能(有关这些类型的精灵的详细信息，请参阅{}导入非位图精灵{}，以及有关这些类型精灵的特定功能的{}骨骼动画{}部分)：",
    "Even though you can set up backgrounds in the room editor and you can assign sprites to instances, often this is not flexible enough for the game you are making. For example, if you have an instance that has to draw a menu, you may want to display various button sprites at a time, or if you have a game with scrolling parallax backgrounds you will need to be able to set them through code in a controller instance of some type. In these situations you should be using the following functions which can draw sprite and background assets anywhere in the room with some of the functions also permitting you to manipulate the shape, size, colour and alpha of the sprite to achieve special effects.":"即使您可以在文件室编辑器中设置背景，并且可以为实例指定精灵，但对于您正在进行的游戏来说，这往往不够灵活。例如，如果您有一个必须绘制菜单的实例，则可能希望一次显示各种按钮精灵，或者如果您有一个带有滚动视差背景的游戏，则需要能够通过某种类型的控制器实例中的代码来设置它们。在这些情况下，您应该使用以下功能，这些功能可以在房间的任何位置绘制sprite和背景资源，其中一些功能还允许您操纵sprite的形状、大小、颜色和Alpha以获得特殊效果。",
    "If you are using SWF format sprites, then there are also additional options for controlling the anti-aliasing used when drawing (see {}Importing Non-Bitmap Sprites{} for more information on these types of sprites). Note that these functions work on a {}global{} level and will set the AA on all vector SWF sprites drawn after they have been called.":"如果使用的是Swf格式的精灵，则还有其他选项可用于控制绘制时使用的抗锯齿(有关这些精灵类型的详细信息，请参阅导入非位图精灵)。请注意，这些函数在{}全局{}级别上工作，并将在调用所有矢量Swf精灵后设置它们的Aa。",
    "Tiles are drawn automatically based on the data that they contain, the tile set used and the tile map properties. However you {}can{} draw individual tiles or tile maps using the following functions:":"平铺将根据其包含的数据、使用的平铺集和平铺贴图特性自动绘制。但是，{}可以使用以下功能{}绘制单个互动程序或互动程序贴图：",
    "You can assign a sprite to an instance and by default&nbsp;{}GameMaker{}&nbsp;will draw it with the properties given by the various&nbsp;{}sprite variables{}, however if you add anything into the draw event, you are \"taking control\" and must tell&nbsp;{}GameMaker{}&nbsp;exactly what to draw. This means that if you must use the following functions to define exactly what it is the instance is to draw and where about in the room it is to draw it:":"您可以将sprite分配给某个实例，默认情况下{}GameMaker{}将使用各种{}sprite变量{}给定的属性绘制该sprite，但是，如果您在绘制事件中添加任何内容，则\"正在控制\"，并且必须告诉{}GameMaker{}确切要绘制的内容。这意味着，如果必须使用以下函数来确切定义实例要绘制的内容以及要在房间中绘制的位置："
}