{
    "It is also worth noting that if the position that has been marked changes within the list, the \"mark\" will move with it, so if you have marked position 3 in the list (for example) and then insert 2 more items below it so it moves up to position 5, it will {}still{} be marked as a list.":"另外值得注意的是，如果已标记的位置在列表中发生变化，则\"mark\"将随之移动，因此，如果您在列表中标记了位置3(例如)，然后在其下面再插入2个项目，使其向上移动到位置5，则仍将{}标记为列表。",
    "The above code creates two DS list, then populates one with various values from global variables. This list is then added into the second list, and the position \"marked\" as such so that it can be correctly encoded later.":"上述代码创建两个D列表，然后使用全局变量中的各种值填充一个D列表。然后将该列表添加到第二个列表中，并将该位置\"标记为\"，以便以后可以对其进行正确编码。",
    "The id of the list to mark.":"要标记的列表的ID。",
    "The position within the list to mark.":"列表中要标记的位置。",
    "This function will \"mark\" (or \"flag\") a given position within a previously created DS list as holding another DS list. This functionality is required when encoding JSON strings (which you can create using {}{}json_encode(){}{}), but can also be useful when nesting data-structures, as items marked in this way will automatically be garbage collected (destroyed) when the parent DS list is destroyed. This means that you do not have to manually go through the list contents and destroy the marked data structures individually before destroying the \"parent\" list. However, if you delete the list position individually, the DS list it contained will {}not{} be garbage collected and you should call the appropriate DS list destroy function before deleting the item from the parent list position. Also note that if you call the function {}{}ds_list_clear(){}{} on a list, any items flagged as lists will be destroyed as well when the list is cleared.":"此函数将在先前创建的D列表中的给定位置\"标记\"(或标记)为保存另一个D列表。在编码Json字符串(您可以使用{}{}json_encode(){}{}创建)时需要此功能，但在嵌套数据结构时也可以使用此功能，因为在销毁父级D列表时，以此方式标记的项目将自动被垃圾收集(销毁)。这意味着，在销毁\"父\"列表之前，您不必手动浏览列表内容并单独销毁标记的数据结构。但是，如果您单独删除列表位置，则其中包含的D列表将{}不会{}被垃圾收集，您应该在从父列表位置删除该项之前调用相应的D列表销毁功能。另请注意，如果在列表中调用function{}{}ds_list_clear(){}{}，则在清除列表时，任何标记为列表的项目也将被销毁。"
}