{
    "A DS list is a data-structure that stores information sequentially as it is added (much like an&nbsp;{}array{}). DS lists are very flexible data structures that permit you to add values at the end or insert them somewhere in the middle of the list, as well as giving you the ability to shuffle the order (to randomise the values) or sort them in an ascending or descending order.":"Ds列表是一种数据结构，它在添加时按顺序存储信息(非常类似于{}数组{})。Ds列表是非常灵活的数据结构，允许您在列表末尾添加值或在列表中间的某个位置插入值，并使您能够改变顺序(随机化值)或按升序或降序对其进行排序。",
    "Apart from the specific functions listed below you can all use an {}expression{} (called an {}accessor{}) to add or modify the contents of your DS list. This accessor looks similar to a 1D array with the following syntax:":"除了下面列出的特定函数外，您还可以使用{}表达式{}(称为{}访问器{})来添加或修改D列表的内容。此存取器类似于1D阵列，具有以下语法：",
    "Ds lists can be used hold {}DS maps{} and other DS lists too, and so we have some special functions that are used to \"flag\" or \"mark\" positions within the list as holding these data structures. In general this is not required, but it has the advantage of automatically garbage collecting (destroying) the marked data structures when the parent list is destroyed, and it\u0027s also required when used in conjunction with the {}{}json_encode(){}{} function so that the list and it\u0027s data is properly encoded. The functions for this are:":"ds列表也可以用于保存{}DS映射{}和其他DS列表，因此我们有一些特殊函数用于\"标记\"或\"标记\"列表中的位置以保存这些数据结构。一般来说，这不是必需的，但它的优点是，当父列表被销毁时，它会自动垃圾收集(销毁)标记的数据结构，并且当与{}{}json_encode{}{}函数结合使用时，它也是必需的，以便列表及其数据得到正确编码。这方面的函数是：",
    "The following functions exist that deal with DS lists:":"存在以下处理D列表的函数：",
    "When accessing DS list data structures, you should always try to use {}integer values{} for the list position, and all non-integer indices will be floored by {}GameMaker{} if you do not. If that is not what you require, then you will need to do the rounding yourself previously before passing the index that you wish to check.":"访问DS列表数据结构时，您应该始终尝试使用{}整数值{}作为列表位置，如果不这样做，所有非整数索引都将被{}GameMaker{}打乱。如果这不是您所需要的，那么在传递您希望检查的索引之前，您需要自己进行四舍五入。",
    "You can find more information, plus examples, from from the GML Overview page on {}Accessors{}.":"您可以从{}访问者{}的Gml概述页面中找到更多信息和示例。",
    "{}NOTE{}: As with all dynamic resources, data structures take up memory and so should {}always{} be destroyed when no longer needed to prevent memory leaks which will slow down and eventually crash your game.":"{}注意{}：与所有动态资源一样，数据结构占用内存，因此当不再需要防止内存泄漏时，应始终销毁{}个{}，这将降低速度并最终导致游戏崩溃。",
    "{}NOTE{}: It is recommended to use {}arrays{} over DS lists as they have similar features, are easier to use and are garbage collected automatically.":"{}注意{}：建议在DS列表上使用{}数组{}，因为它们具有相似的函数、更易于使用并且会自动进行垃圾收集。"
}