{
    "Another way to use force in the physics world is to apply it {}locally{} to an instance. What this means is that the strength and direction of the force are calculated based on the origin (or the position if it has no sprite) of the instance, without taking into consideration the direction or rotation it may have in the game room or physics world. It should be noted that with this function, forces are not applied to the center of mass of the object, but rather at a point relative to the instance and they will not be instantly applied as they are dependent on any other forces that are working on the object (like gravity). This illustration demonstrates how a local force works:":"在物理世界中使用力的另一种方法是在{}本地{}将其应用于实例。这意味着力的强度和方向是根据实例的原点计算的(如果没有精灵，则为位置)，而不考虑它在游戏室或物理世界中可能具有的方向或旋转。需要注意的是，使用此函数，力不会施加到对象的质心，而是施加到相对于实例的某个点，并且它们不会立即施加，因为它们依赖于正在对象上工作的任何其他力(如重力)。本图演示了局部力的工作原理：",
    "The code above will apply a force to the instance of 50 Newtons from left to right {}relative{} to the origin while the right arrow key is pressed.":"按下右箭头键时，上述代码将从左到右{}相对{}于原点施加 50 牛顿的力。",
    "The x coordinate {}relative to the origin{} where the force will be applied":"{}相对于施加力的原点{}的 X 坐标",
    "The y coordinate {}relative to the origin{} where the force will be applied":"{}相对于施加力的原点{}的 Y 坐标",
    "the x component of the force vector":"力矢量的 X 分量",
    "the y component of the force vector":"力矢量的 Y 分量",
    "{}As you can see, the xlocal and ylocal coordinates are calculated based on the axis position {}always{} being considered as the origin of the instance (0,0), so no matter where in the room the object is, xlocal and ylocal are always going to be the same. You then have to decide where the vector components of the force (xforce and yforce) should be positioned relative to the xlocal/ylocal position. The exact force is defined by the vector we get from the components xforce/yforce in relation to those coordinates - which simply means that the force is calculated as the distance from xlocal/ylocal to xforce/yforce in Newtons, and the direction is the angle that we get from xlocal/ylocal to xforce/yforce. This may seem slightly confusing, but you just have to look at the illustration to see how this works, and it saves you some complicated maths!":"{}如您所见，xlocal 和 ylocal 坐标是根据轴位置计算的，并且{}始终{}将视为实例 (0,0) 的原点，因此无论对象在房间的哪个位置，xlocal 和 ylocal 都将始终相同。然后，必须确定力的矢量分量 (xforce 和 yforce) 相对于 xlocal/ylocal 位置的位置。精确力由我们从分量 xforce/yforce 相对于这些坐标得到的矢量定义-这简单地意味着力被计算为从 xlocal/ylocal 到 xforce/yforce 的牛顿距离，并且方向是我们从 xlocal/ylocal 到 xforce/yforce 的角度。这看起来似乎有点混乱，但是你只需看一下插图就知道它是如何工作的，而且它为你节省了一些复杂的数学知识！",
    "{}NOTE{}: The physics world uses meters for all its calculations, and the ratio of pixels per meter is defined in the room editor or using {}{}{}physics_world_create(){}{}{}.":"{}注意{}：物理世界使用仪表进行所有计算，每米像素的比率在房间编辑器中定义或使用 {}{}{}physics_world_create(){}{}{}。"
}