{
    "Not only can you apply force and gravity to an object with the physics in {}GameMaker{} but you can also apply an impulse. This is slightly different to a force in that when it is applied it will {}immediately{} affect the speed, and, potentially the torque (or \"spin\") of the object, particularly if the point chosen to apply the impulse has a vector that is not aligned with the centre of mass (note: the center of mass is {}not necessarily{} the same as the origin!). This function applies an impulse {}locally{} to an instance. What this means is that the strength and direction of the impulse are calculated based on the origin (or the position if it has no sprite) of the instance, without taking into consideration the direction or rotation it may have in the game room or physics world. Here is an illustration:":"您不仅可以对 {}GameMaker{} 中的物理对象施加力和重力，还可以施加脉冲。这与力略有不同，因为当施加力时，它会{}立即{}影响速度，并且可能影响对象的扭矩(或旋转)，特别是如果选择施加脉冲的点的矢量与质心不对齐(注意：质心{}不一定{}与原点相同!)。此函数在{}本地{}将脉冲应用于实例。这意味着，脉冲的强度和方向是根据实例的原点(如果没有精灵，则是位置)计算的，而不考虑它在游戏室或物理世界中可能具有的方向或旋转。下面是一个例子：",
    "The code above will apply an impulse with force of 30 Newtons and a direction going from bottom to top {}relative{} to the instance origin if the variable \"jump\" is true.":"如果变量 \"jump\" 为真，则上述代码将以 30 牛顿的力施加脉冲，并且从底部到顶部{}相对于实例原点{}的方向。",
    "The x coordinate {}relative to the origin{} where the impulse will be applied":"{}相对于将应用脉冲的原点{}的 X 坐标",
    "The y coordinate {}relative to the origin{} where the impulse will be applied":"{}相对于将应用脉冲的原点{}的 Y 坐标",
    "the x component of the impulse vector (relative to the xpos coordinate)":"脉冲矢量的 X 分量(相对于 xpos 坐标)",
    "the y component of the impulse vector (relative to the ypos coordinate)":"脉冲矢量的 Y 分量(相对于 ypos 坐标)",
    "{}As you can see, the frog in the image gets an impulse from below to make it \"jump\". The exact impulse is defined by the vector we get from the components ximpulse/yimpulse in relation to the xpos/ypos coordinates - which simply means that the impulse is calculated as the distance from xpos/ypos to ximpulse/yimpulse in Newtons, and the direction is the angle that we get from xpos/ypos to ximpulse/yimpulse.":"{}正如你所看到的，图像中的青蛙从下面得到一个冲动，让它\"跳\"起来。确切的脉冲由我们从与 xpos/ypos 坐标相关的分量 ximpulse/yimpulse 得到的矢量定义 - 这只是意味着脉冲被计算为从 xpos/ypos 到 ximpulse/yimpulse 的距离，以牛顿为单位，方向是我们从 xpos/ypos 到 ximpulse/yimpulse 的角度。",
    "{}NOTE{}: The physics world uses meters for all its calculations, and the ratio of pixels per meter is defined in the room editor or using {}{}{}physics_world_create(){}{}{}.":"{}注意{}：物理世界使用仪表进行所有计算，每米像素的比率在房间编辑器中定义或使用 {}{}{}physics_world_create(){}{}{}。"
}