{
    "Selecting the {}Bottom Up{} view mode will show things from the bottom up so you can see all the functions and script calls individually. When using this view mode, clicking on the {}&nbsp;will expand the function or script to show what actually called it.":"选择{}自下而上{}查看模式将自下而上显示内容，以便您可以单独查看所有函数和脚本调用。使用此查看模式时，单击{}将展开函数或脚本以显示实际调用的内容。",
    "Selecting the {}Top Down{} view mode will show the profile from the top down (more or less the same as the callstack hierarchy) so it will show the event, then the script and then any functions used. Note that you can double click {}&nbsp;on any of the entries to have it open in the {}Source {}debug window if you have one. If you see a {}&nbsp;icon beside a name then there are further script or function calls within that section, and clicking the {}&nbsp;will expand the tree to show them.":"选择{}自上而下{}视图模式将自上而下显示配置文件(与调用堆栈层次结构大致相同)，因此它将显示事件，然后显示脚本，然后显示所有使用的函数。请注意，您可以在任何条目上双击{}，使其在{}源{}调试窗口(如果有)中打开。如果您在名称旁边看到一个{}图标，则该部分中还有其他脚本或函数调用，单击{}将展开树以显示它们。",
    "The Debugger permits you to step through your code and find any issues with the code base, but sometimes you need to check for subtler details in order to properly optimise your games. The {}Profile {}option helps to do just that by giving you a performance overview, showing the time it takes to call functions, scripts, and even how long it took a specific event to complete.":"调试器允许您遍历代码并发现代码库中的任何问题，但有时您需要检查更微妙的细节，以便正确优化您的游戏。{}探查器{}选项为您提供了性能概述，显示了调用函数、脚本所需的时间，甚至显示了完成特定事件所需的时间。",
    "The Profiler":"探查器",
    "The {}View Target{} permits you to choose between viewing the project GML (event and code data), the background engine processes or both. If you choose \"GML\", then you will get the events, functions and scripts being called each step while the \"Engine\" view will only show the engine calls required by the project, enabling you to see any bottlenecks in the way that your project is handling things. If you select \"Both\", then both sets of data will be displayed, but note that when combined with the \"Bottom Up\" view, the different script and function calls will be nested within the engine calls and you will need to click the {}&nbsp;to expand these out to see them.":"{}查看目标{}允许您在查看项目GML(事件和代码数据)、后台引擎进程或两者之间进行选择。如果您选择\"GML\"，那么您将获得每个步骤调用的事件、函数和脚本，而\"引擎\"视图将只显示项目所需的引擎调用，使您能够看到项目处理事情的方式中的任何瓶颈。如果选择\"两者\"，则两组数据都将显示，但请注意，当与\"自下而上\"视图组合时，不同的脚本和函数调用将嵌套在引擎调用中，您需要单击{} 将其展开以查看它们。",
    "This checkbox permits you to switch between the {}average {}time and the {}absolute {}time for the profiler. When it is not checked, the values shown in the main window will be the {}total {}number of calls made to the function, script or event and the {}total {}time taken (times are in {}microseconds{}) over the course of the profile. However if you enable this then these columns show the {}average {}time taken per step for each function, script or event, and the {}average {}number of times that it was called.":"此复选框允许您在分析器的{}平均时间{}和{}绝对时间{}之间切换。如果未选中该选项，则主窗口中显示的值将是对函数、脚本或事件进行的{}总{}调用次数和在配置文件过程中花费的{}总{}时间(时间以{}微秒{}为单位)。但是，如果启用此选项，则这些列将显示每个函数、脚本或事件的每个步骤所用的{}平均{}时间，以及它被调用的{}平均{}次数。",
    "This is the button to enable or disable the Profiler. When enabled, the profiler will start and you will start to see events, scripts and functions be listed in the main window along with different data values for each of them. How this data is displayed will depend on the {}Time Display{} and the {}View Mode{} (both explained in more depth below).":"这是启用或禁用探查器的按钮。启用后，探查器将启动，您将开始在主窗口中看到事件、脚本和函数以及每个事件、脚本和函数的不同数据值。此数据的显示方式将取决于{}时间显示{}和{}查看模式{}(这两种模式都将在下面进行更深入的说明)。",
    "This menu lets you choose the view mode, which can be either {}Top Down{} or {}Bottom Up{}.":"此菜单允许您选择查看模式，可以是{}自上而下{}或{}自下而上{}。",
    "{} The profile data is shown in four columns, and clicking on any of them will sort the data according to the column criteria.":"{}配置文件数据显示在四列中，单击其中任何一列都会根据列标准对数据进行排序。",
    "{}Apart from the main window showing all the different events, scripts and functions being called, you also have the following options for using the Profiler:":"{}除了显示正在调用的所有不同事件、脚本和函数的主窗口外，您还可以使用以下选项来使用事件探查器：",
    "{}Calls{}:&nbsp;Here you can see either the {}total {}number of calls to the given event, function or script, or the {}average {}number of calls to it in a single step (again, depending on the {}Time Display{} option selected).":"{}调用{}：在此，您可以看到对给定事件、函数或脚本的调用{}总数{}，或单个步骤中对它的{}平均{}调用次数(同样，取决于所选的{}时间显示{}选项)。",
    "{}Enable / Disable{}{}Enable / Disable{}":"{}启用/禁用{}{}启用/禁用{}",
    "{}Name{}:&nbsp;This is the name of the event, script or function being called, and may have a {}&nbsp;beside it to denote further calls to it or from it (depending on the {}View Mode{} you have selected). You can double click {}&nbsp;on any of the names to have it open the code block or script within the Source window. Clicking the top of this column will sort the names in alphabetical order.":"{}名称{}：这是要调用的事件、脚本或函数的名称，它的旁边可能有一个{}，以表示对它或从它进一步的调用(取决于您选择的{}查看模式{})。您可以在任何名称上双击{}，使其在源代码窗口中打开代码块或脚本。单击此列的顶部将按字母顺序对姓名进行排序。",
    "{}Step%{}:&nbsp;The value shown here is the overall percentage of a single step that the call has taken.":"{}步骤%{}：此处显示的值是调用已执行的单个步骤的总百分比。",
    "{}Time Display{}{}Time Display{}":"{}时间显示{}{}时间显示{}",
    "{}Time{}:&nbsp;This will show either the {}total {}time that a function (or script or event) has taken while profiling, or the {}average {}time that it has taken each step to be called (depending on the {}Time Display{} option selected) and it is displayed in microseconds.":"{}时间{}：这将显示一个函数(或脚本或事件)在分析时{}总共{}花费的时间，或它执行的每个调用步骤的{}平均{}时间(取决于所选的{}时间显示{}选项)，并以微秒为单位进行显示。",
    "{}View Mode{}{}View Mode{}":"{}查看模式{}{}查看模式{}",
    "{}View Target{}{}View Target{}":"{}查看目标{}{}查看目标{}"
}