{
    "For example, if you have a default {}*.txt{} file included with your game and read it into memory using {}working_directory{}, then that file will be taken from the area where the Included Files are stored. If you then choose to write that information to a text file using {}working_directory{}, this will write the file to the target platform\u0027s local storage, where it will be read from the next time unless you instruct {}GameMaker{} to delete the file, in which case {}working_directory{} will once more point to the area where the Included Files are stored.":"例如，如果您的游戏包含一个默认的 {}*.txt{} 文件并使用 {}working_directory{} 将其读入内存，那么该文件将从存储包含文件的区域中获取。 如果您随后选择使用 {}working_directory{} 将该信息写入文本文件，这会将文件写入目标平台的本地存储，下次将从那里读取，除非您指示 {}GameMaker{} 删除 文件，在这种情况下，{}working_directory{} 将再次指向存储包含文件的区域。",
    "However, when reading from disk, {}working_directory{} can be {}either{} the local storage ({}{}game_save_id{}{})&nbsp;{}or{} the area where the {}Included Files{} are stored.":"但是，从磁盘读取时，{}working_directory{} 可以是{}{}本地存储 ({}{}game_save_id{}{}){}或{}{10}包含文件{11}所在的区域 被存储。",
    "If you are writing a file to disk, {}working_directory{} points to the area of local storage that is reserved for your game on the target device (in Windows this is \"{}%LOCALAPPDATA%/gamedir/{}\" where the \"gamedir\" is the directory with the name of your game).":"如果您将文件写入磁盘，{}working_directory{} 指向目标设备上为您的游戏保留的本地存储区域（在 Windows 中，这是“{}%LOCALAPPDATA%/gamedir/{}”，其中 “gamedir”是您游戏名称的目录）。",
    "It is worth noting that&nbsp;{}in general{}&nbsp;you do not need to use this and simply specify the file name itself (plus any additional path information), which is sufficient. For example, this:":"值得注意的是，{}一般情况下{}您不需要使用它，只需指定文件名本身（加上任何其他路径信息）就足够了。 例如，这个：",
    "This will open an ini file from the working directory of the game (creating it if it does not already exist). This could be the local storage, or the area where the included files are depending on whether the file being looked for exists in either place.":"这将从游戏的工作目录打开一个 ini 文件(如果它不存在就创建它)。这可能是本地存储，也可能是包含文件的区域，具体取决于正在查找的文件是否存在于这两个位置。",
    "would be better done as this:":"最好这样做:",
    "{}NOTE{}&nbsp;The {}working_directory{} variable will return the path {}including{} the final backslash.":"{}注意{}{}working_directory{} 变量将返回{}包括{}最后一个反斜杠的路径。",
    "{}WARNING{}&nbsp;This function may not work as you expect due to {}GameMaker{} being sandboxed! Please see the section on the&nbsp;{}File System{}&nbsp;for more information.":"{}警告{}由于 {}GameMaker{} 被沙盒化，此功能可能无法按您预期的方式工作！ 有关详细信息，请参阅{}文件系统{}部分。",
    "{}Working_directory{} can actually return two different values depending on what you are using it for.":"{}Working_directory{} 实际上可以返回两个不同的值，具体取决于您使用它的目的。"
}