{
    "If you are using this function on Windows, Ubuntu (Linux), MacOS or HTML5 platforms, then the function is only toggled for {}one step{} to {}true{} when the game loses focus, and then it will return {}false{} again until the game is returned to focus (and loses it again). This is because these platforms do not cache apps and games, and so these will continue to run in the background.":"如果您在Windows、Ubuntu(Linux)、MacOS或HTML5平台上使用此函数，则当游戏失去焦点时，该函数仅切换{}一步{}至{}true{}，然后它将再次返回{}false{}，直到游戏返回焦点(并再次失去焦点)。这是因为这些平台不会缓存应用程序和游戏，因此这些应用程序和游戏将继续在后台运行。",
    "It is worth noting that this function will run any code that is contained within the code block on devices but then {}GameMaker{} will be paused immediately after as the device caches the game as a background process. So if you have something like the example code provided below, the instance to be created will not actually appear or run any of its events {}until after the game has been restarted from the cached state{}. This means that you may prefer to have the {}os_is_paused{} function call an alarm and then in the alarm event (which will be set when the device is paused but not run until it is un-paused) create a pause menu, restart music etc...":"值得注意的是，此函数将在设备上运行代码块中包含的任何代码，但随后{}GameMaker{}将立即暂停，因为设备将游戏缓存为后台进程。因此，如果您有类似于下面提供的示例代码，则在游戏从缓存状态{}重新启动之前，要创建的实例将不会实际出现或运行其任何事件{}。这意味着您可能更喜欢让 {}os_is_paused{} 函数调用警报，然后在警报事件中(当设备暂停时设置，但直到取消暂停才运行)创建暂停菜单，重新启动音乐等。",
    "The above code checks to see if the game has been paused, and if it has then it creates an instance of the object \"obj_PauseMenu\" if none exist already.":"上面的代码检查游戏是否已暂停，如果已暂停，则创建对象\" obj_pausemenu \"的实例(如果不存在)。",
    "When developing for mobile devices, you need to have a way to check that the device is still focused on your game or not, especially as if your game is on an iOS, Android or Windows Phone device then it can be interrupted by phone calls and other apps. You can use this function to check if the device is paused or not.":"在为移动设备开发时，您需要有一种方法来检查设备是否仍然专注于您的游戏，尤其是如果您的游戏在iOS、Android或Windows Phone设备上，那么它可能会被电话和其他应用程序打断。您可以使用此函数检查设备是否暂停。",
    "{}NOTE{}: On mobile devices, sounds and music will be stopped when the os is paused. They will {}not{} restart again unless you specifically start them with the appropriate function.":"{}注意{}：在移动设备上，当操作系统暂停时，声音和音乐将会停止。除非您特别使用适当的函数启动它们，否则它们将{}不会{}再次重新启动。"
}