{
    "\"{}&lt;permission&gt;{}\": This will be a permission requested by the function, as a string. You will get keys for all the permissions you requested in the original function call.{} {} This key will equal one of the following constants: ":"\"{}<权限>{}\"：这将是函数请求的权限，作为字符串。您将获得原始函数调用中请求的所有权限的密钥。{}{}此键将等于以下常量之一：",
    "\"{}type{}\": This will be the string {}\"permission_request_result\"{}, used to identify the type of event triggered.":"\"{}type{}\"：这将是字符串{}\"permission_request_result\"{}，用于标识触发的事件类型。",
    "For more information on app permissions, please see the {}Android Documentation{}.":"有关应用权限的更多信息，请参阅{}Android文档{}。",
    "It is worth noting that the following permission are supported natively by {}GameMaker{}, but are considered \"dangerous\" by Google and as such they {}must{} be explicitly requested (note too that some permissions can be requested using the {}Android Game Options{} without the need for this function):":"值得注意的是，{}GameMaker{}原生支持以下权限，但Google认为它们是\"危险的\"，因此必须明确请求{}(请注意，可以使用{}{}Android游戏选项{}请求某些权限，而无需此功能)：",
    "The above code checks the OS type and if it\u0027s Android, it performs a check on the \"INTERNET\" permission and if it\u0027s not yet been granted, it requests it.{}{}":"上面的代码检查操作系统类型，如果是Android，它会检查\"互联网\"权限，如果尚未被授予，它会请求它。{}{}",
    "The permission(s) to request. Request multiple permissions by adding more arguments.":"请求的权限。通过添加更多参数请求多个权限。",
    "This function is for the Android target only.":"此功能仅适用于Android目标。",
    "This indicates that the permission has been granted":"这表示该权限已被授予",
    "This indicates that the permission has not been granted":"这表明该权限未被授予",
    "This will later trigger a {}System Asynchronous Event{} where the built in {}{}async_load{}{} DS map will contain the following key/value pairs:":"这将稍后触发{}系统异步事件{}，其中内置的{}{}async_load{}{}DS映射将包含以下键/值对：",
    "This&nbsp;{}{}function checks if the user has permissions for reading from and writing to external storage. If it\u0027s allowed, it runs an extension function to operate using those permissions. However if either of those permissions are not allowed, it calls {}os_request_permission(){} to request both permissions at once.":"此{}{}函数检查用户是否具有读取和写入外部存储的权限。如果允许，它会运行扩展函数以使用这些权限进行操作。但是，如果不允许这些权限中的任何一个，它会调用{}os_request_permission(){}来一次请求这两个权限。",
    "With this function you can request a specific permission. You supply the permission to request as a string using the format \"{}android.permission.&lt;permission&gt;{}\", so to request the {}RECORD_AUDIO{} permission (for example) you would call:":"使用此功能，您可以请求特定权限。您使用格式 \"{}android.permission.&lt;permission&gt;{}\"，因此要请求{}RECORD_AUDIO{}权限(例如)，您可以调用：",
    "You can request multiple permissions at once by passing multiple arguments into the function.":"您可以通过将多个参数传递给函数来一次请求多个权限。"
}