{
    "In the context of {}GameMaker{}, an asynchronous function is one that sends out to a web server, or asks for user input, or even streams data, while letting {}GameMaker{} continue to run without blocking the game being run. When the information {}callback{} is received a special {}Async Event{} is fired which, in turn, allows any instance with an Async Event assigned to it to execute further functions (although this does not have to be the case). So, basically, it\u0027s a way to communicate with some external resource (server, user or device) without the game or project stopping while waiting for a reply.":"在 {}GameMaker{} 上下文中，异步函数是一种发送到网络服务器、请求用户输入甚至流式传输数据的函数，同时让 {}GameMaker{} 继续运行而不阻塞正在运行的游戏 . 当接收到信息{}回调{}时，会触发一个特殊的{}异步事件{}，这反过来又允许任何分配有异步事件的实例执行更多功能（尽管不一定是这种情况） . 因此，基本上，这是一种与某些外部资源（服务器、用户或设备）通信的方式，而无需在等待回复时停止游戏或项目。",
    "The different type of asynchronous functions are listed in the sections below:":"以下各节列出了不同类型的异步函数:",
    "There are also a number of {}Buffer{} functions that can be used for loading and saving buffers in an asynchronous manner, which are required when working on the different consoles that {}GameMaker{} supports, although they can also be used on the other target platforms:":"还有一些{}Buffer{}函数可以用于以异步方式加载和保存缓冲区，这在{}GameMaker{}支持的不同控制台上是必需的，尽管它们也可以在其他目标平台上使用:",
    "This makes everything function in a much more fluid and unobtrusive way. It should be noted that the Async Events will be triggered for {}all {}instances that have them, so you can use an async function in one instance, and have the Asynchronous Event that deals with the reply in another one, or even various other ones. You can go here for more information on how the Asynchronous event works - {}Asynchronous Events{}.":"这使得一切都以一种更加流畅和不引人注目的方式运行。需要注意的是，异步将被{}所有拥有它们的{}实例触发，所以你可以在一个实例中使用异步函数，而在另一个实例中使用异步事件来处理响应，甚至在其他实例中。您可以到这里查看更多关于异步事件如何工作的信息 --{}异步事件{}。",
    "Why is this important? Well, since it allows {}GameMaker{} to continue functioning while sending or receiving data, and this means that you can do many things all without blocking the game loop like:":"这有什么重要的？嗯，因为它允许{} GameMaker {}在发送或接收数据时继续工作，这意味着你可以做很多事情，而不会阻塞游戏循环，比如:",
    "communicate and interchange data with a web server":"与网络服务器通信和交换数据",
    "have callback events to do things only when the correct information is received":"只有在收到正确的信息时才有回调事件做事",
    "stream data from the device into your game without the player waiting for things to load":"将数据从设备流式传输到您的游戏中，而无需玩家等待内容加载"
}