{
    "A deactivated instance effectively ceases to exist in the game, but individual instances can still have their variables accessed. You cannot use {}with(object){} or {}with(instance){} however, but rather you must access the instance directly using it\u0027s unique ID in the following form:":"停用的实例实际上不再存在于游戏中，但单个实例仍然可以访问其变量。但是，您不能将{}与(object){}或{}与(instance){}一起使用，而是必须使用以下形式的唯一ID直接访问实例：",
    "Deactivating Instances":"停用实例",
    "In the above example, \"inst\" would be a variable that holds the ID&nbsp;of the deactivated instance, and this is the only way that a deactivated instance can be referenced without it being activated previously.":"在上面的示例中，\" inst \"是一个变量，它保存已停用实例的ID，这是引用已停用实例的唯一方法，而无需事先激活它。",
    "It is normally not necessary to deactivate instances every step of your game and this can actually cause your game to have performance issues. Instead it is recommended that you only run these functions every few steps in an alarm (for example), or if the camera view has changed position, and it is especially important that you do not use these functions in the draw event as this can lead to serious errors in your game.":"通常没有必要在游戏的每一步都停用实例，这实际上会导致游戏出现性能问题。相反，建议您仅在警报中每隔几步运行一次这些函数(例如)，或者在相机视图已更改位置时运行这些函数，尤其重要的是，不要在绘制事件中使用这些函数，因为这可能会导致游戏中出现严重错误。",
    "{}GameMaker{} offers you the possibility to \"switch off\" instances so that they are no longer processed in any way. Technically they don\u0027t really exist anymore, except as a pointer within the deactivation process itself, which means that a deactivated instance cannot be manipulated or changed in any way at all until it is re-activated again. So, these functions should be used with great care as they can cause problems when not used properly, particularly with persistent objects, as a persistent object that has been deactivated will not be moved to the next room unless it is re-activated first (effectively deleting it from the game). Note too that {}activation and deactivation are not instantaneous{}, and an instance that has had its state changed in this way will not be considered to be active/inactive until the {}end of the event in which the function was called{}.":"{}GameMaker{}为您提供\"关闭\"实例的可能性，以便不再以任何方式处理它们。从技术上来说，它们实际上已经不存在了，除了作为去激活过程本身的指针，这意味着在重新激活之前，不能以任何方式操作或更改已停用的实例。因此，使用这些函数时应该非常小心，因为它们在使用不当时会引起问题，特别是对于持久对象，因为已停用的持久对象将不会移动到下一个房间，除非它首先被重新激活(从游戏中有效地将其删除)。另请注意，{}激活和去激活不是瞬时{}，在函数被调用{}的事件的{}结束之前，以这种方式改变其状态的实例不会被视为活动/不活动。",
    "{}WARNING: {}Deactivating instances that have physics enabled will NOT stop their fixtures from interacting within the physics simulation. For that you should set their {}phy_active{} variable to {}{}true{}{} or {}{}false{}{} as you activate/deactivate the instances.{}{}":"{}警告：{}禁用启用了物理的实例不会阻止其固定装置在物理模拟内进行交互。为此，您应在激活/停用实例时将其{}phy_active{}变量设置为{}{}true{}{}或{}{}false{}{}。{}{}",
    "{}{}NOTE{}{} If you deactivate an instance on room start (ie: from the room creation code, or from an instance create event of an instance within the room) all instances that are placed within the room from the room editor will still run their create event before being deactivated.":"{}{}注意{}{}如果您在房间启动时停用实例(即：从房间创建代码，或从房间内实例的实例创建事件)，则从房间编辑器放置在房间内的所有实例在被停用之前仍将运行其创建事件。",
    "{}{}NOTE{}{}&nbsp;If you deactivate an instance on room start (i.e.&nbsp;from the Room Creation Code, or from an instance {}Create event{} of an instance within the room) all instances that are placed within the room from&nbsp;{}The Room Editor{}&nbsp;{}will still run their Create event{} before being deactivated.":"{}{} 注意{}{} 如果您在房间启动时停用实例 (即通过房间创建代码，或通过房间内实例的实例 {} 创建事件 {})，则放置在房间内的所有实例在停用之前，{} 房间编辑器 {} 仍会运行其 Create 事件 {}。",
    "{}{}The following functions exist for deactivating instances:":"{}{}存在以下用于停用实例的函数：",
    "{}{}{}WARNING{}{}&nbsp;{}Deactivating instances that have physics enabled will {}NOT{} stop their fixtures from interacting within the physics simulation. For that you should set their&nbsp;{}{}phy_active{}{} variable to {}true{} or {}false{} as you activate/deactivate the instances.":"{}{}{} 警告{}{}{} 停用启用了物理功能的实例将 {} 不会 {} 阻止其装置在物理模拟中进行交互。为此，您应在激活 / 停用实例时将其 {}{}phy_active{}{} 变量设置为 {}true{} 或 {}false{}。"
}