{
    "The above code deactivates all instances assigned to the layer \"Enemy_Layer\" and then activates a region within the room.":"以上代码取消激活指定给图层\"Enemy_Layer\"的所有实例，然后激活房间内的区域。",
    "The layer name string (or ID value) to be used":"要使用的图层名称字符串(或Id值)",
    "With this function you can deactivate all instances assigned to a specific layer. You need to supply the {}layer ID{}, which can either be the name of the layer as written in the code editor (as a string) or the actual layer ID value as returned by the {}{}layer_create(){}{}, and note that you can only deactivate {}instance{} layers with this function. Note that if you have deactivated a layer that has instances of objects flagged as {}Persistent{}, then you will need to reactivate the layer again with the function {}{}instance_activate_layer(){}{}&nbsp;before changing room, otherwise any persistent instances on the layer will {}not{} be carried over and will be discarded. Note too that deactivation is not instantaneous, and an instance that has been deactivated in this way will not be considered to be inactive until the end of the event in which the function was called.":"使用此函数，可以停用指定给特定层的所有实例。需要提供{}层 ID{}，可以是在代码编辑器中写入的层的名称(作为字符串)，也可以是{}{}layer_create(){}{}返回的实际层 ID 值，请注意，您只能使用此函数停用{}实例{}层。请注意，如果您已停用一个对象实例标记为{}持久性{}的层，则在更改空间之前，您需要使用函数{}{}instance_activate_layer(){}{}再次重新激活该层，否则该层上的任何持久实例将{}不会{}被继承并将被丢弃。还要注意，停用不是瞬时的，并且以这种方式停用的实例在调用函数的事件结束之前不会被视为不活动。",
    "{}NOTE{}: If you deactivate an instance on room start (ie:from the room creation code, or from an instance create event of an instance within the room) all instances that are placed within the room from the room editor {}will still run their create event{} before being deactivated.":"{}注意{}:如果在文件室开始时停用某个实例(即从文件室创建代码或从文件室内某个实例的实例创建事件)，则从文件室编辑器{}放置在文件室内的所有实例在停用之前仍将运行其创建事件{}。",
    "{}{}{}WARNING{}: Deactivating instances that have physics enabled will {}NOT{} stop their fixtures from interacting within the physics simulation. For that you should set their {}{}{}phy_active{}{}{}&nbsp;variable to {}true{} or {}false{} as you activate/deactivate the instances.":"{}{}{}警告{}：取消激活已启用物理的实例将{}不会{}阻止它们的设备在物理模拟中相互作用。为此，在激活/取消激活实例时，应将其{}{}{}phy_active{}{}{}变量设置为{}真{}或{}假{}。"
}