{
    "Here is an example of the {}AddTwoNumbers(){} function:":"下面是{}AddTwoNumbers(){}函数的一个例子。",
    "Our example extension for Android will contain functions that do the following:":"我们为Android提供的扩展实例将包含做以下工作的函数。",
    "Return a string consisting of an input string and value":"返回一个由输入字符串和值组成的字符串",
    "Return a string consisting of two input strings":"返回由两个输入字符串组成的字符串",
    "Return two numbers added together":"返回两个数字相加的结果",
    "Source Examples":"示例代码",
    "The example provided for iOS is the same as the Android example given above; only the source files differ, which we\u0027ll cover in this section.":"为iOS提供的例子与上面给出的Android例子相同；只有源文件不同，我们将在本节介绍。",
    "The {}ReturnAsync(){} function will trigger the&nbsp;{}Async - Social{} event, so you will need to add that event to your object and read data from its {}async_load{} map (which is filled by the extension\u0027s source code given above).":"{}ReturnAsync(){}函数将触发&nbsp;{}Async - Social{}事件，所以你需要将该事件添加到你的对象中，并从其{}async_load{}映射中读取数据（该映射由上面给出的扩展的源代码填充）。",
    "This extension will make use of a {}.java{} file, the contents of which are given&nbsp;below (click to open):":"这个扩展将利用一个{}.java{}文件，其内容在下面给出&nbsp;（点击可打开）。",
    "This page contains examples and information on extension source code for Android and iOS, to help you create your own native extensions for those platforms.":"本页包含Android和iOS的扩展源代码的例子和信息，以帮助你为这些平台创建你自己的本地扩展。",
    "To add such a file to your extension, you need to go under its&nbsp;{}Android Properties{}&nbsp;and first enter a class name (for this example, \"GenericTest\"),&nbsp;then&nbsp;click on \"Add Source\" and select the {}.java{} file. This will add the selected file to your project directory --&nbsp;you can&nbsp;right-click on your extension, select \"Open in Explorer\" and see the source files there.":"要在你的扩展中添加这样的文件，你需要在它的&nbsp;{}Android Properties{}&nbsp;下，首先输入一个类名（在这个例子中，是 \"GenericTest\"），&nbsp;然后&nbsp;点击 \"Add Source\"，选择{}.java{}文件。这将把选中的文件添加到你的项目目录中--&nbsp;你可以&nbsp;右键点击你的扩展名，选择 \"在资源管理器中打开\"，并在那里看到源文件。",
    "To add these files to your extension, you first need to go under its {}iOS Properties{} and enter a class name (for this example, \"GenericTest\").&nbsp;You can then use either the \"Enter framework path\" option (if the files are present on your macOS machine used for building) or the \"Add Source\" option (if they are on your development machine); regardless of the option you use, you will need to point them to the directory that contains your {}.h{} and {}.mm{} files.":"要将这些文件添加到你的扩展中，你首先需要在它的{}iOS Properties{}下，输入一个类名（在这个例子中是 \"GenericTest\"）。&nbsp;然后你可以使用 \"输入框架路径 \"选项（如果这些文件存在于你用于构建的macOS机器上）或 \"添加源代码 \"选项（如果它们在你的开发机器上）；无论你使用哪个选项，你都需要将它们指向包含{}.h{}和{}.mm{}文件的那个目录。",
    "Trigger the {}Async - Social{} event and fill values in its {}async_load{} map":"触发{}Async - Social{}事件，并在其{}async_load{}映射中填充数值。",
    "You can add these source files to the same extension that was set up in the previous section for Android, meaning that any functions already defined in that extension will now work on iOS too (given that the {}External Names{} of all functions on Android and iOS are the same). If you are creating a new extension, you can simply create the functions&nbsp;in the same way as previously described.":"你可以将这些源文件添加到上一节为Android设置的同一个扩展中，这意味着该扩展中已经定义的任何函数现在也可以在iOS上使用（鉴于Android和iOS上所有函数的{}外部名称{}都是一样的）。如果你正在创建一个新的扩展，你可以简单地创建函数&nbsp;，与之前描述的方式相同。",
    "You can now add a new placeholder file to your extension and create functions inside it&nbsp;with the following properties:":"现在你可以在你的扩展中添加一个新的占位符文件，并在其中创建具有以下属性的函数&nbsp;。",
    "You can use the following callback functions in your {}.java{} extension files:":"你可以在你的{}.java{}扩展文件中使用以下回调函数。",
    "You can use the following callback functions in your {}.mm{} extension files:":"你可以在你的{}.mm{}扩展文件中使用以下回调函数。",
    "iOS extensions make use of an {}.h{} and an {}.mm{} file, and the contents of both are given below (click to open):":"iOS扩展使用一个{}.h{}和一个{}.mm{}文件，两者的内容如下（点击打开）。",
    "{}You can now call these functions from your game code and use them like&nbsp;any other built-in function:":"{}你现在可以从你的游戏代码中调用这些函数，并像其他内置函数一样使用它们。"
}