{
    "The code above also creates a new particle system&nbsp;on a room layer named {}\"Effects\"{}. It then sets a {}method{} as the layer begin script. The method gets the particle system ID {}ps{} via the struct. Inside it, the function&nbsp;{}{}part_particles_burst{}{}&nbsp;is used to create particles&nbsp;of the {}ps_Fireworks{}&nbsp;{}{}Particle System Asset{}{}&nbsp;at random positions in the room. This way, particles are created continuously, since the layer begin scripts run every step. The layer begin script can be removed to end the creation&nbsp;of particles from the asset.":"上面的代码还在名为 {}\"Effects\"{} 的房间层上创建了一个新的粒子系统。然后将 {}method{} 设置为层开始脚本。该方法通过结构获取粒子{}ps{} 的系统ID。在它内部，函数 {}{}part_particles_burst{}{} 用于在房间中的随机位置创建 {}ps_Fireworks{}{}{} 粒子系统资源 {}{} 的粒子。通过这种方式，粒子会连续创建，因为层开始脚本会运行每一步。可以删除层开始脚本以结束从资源创建粒子。",
    "The code above first creates a new particle system on a room layer named {}\"Effects\"{} and stores the index in an instance variable {}ps{}. The&nbsp;{}{}part_particles_burst{}{}&nbsp;function is then called 10 times in a&nbsp;{}repeat{} loop to add particles from a&nbsp;{}{}Particle System Asset{}{}&nbsp;{}ps_Fireworks{}&nbsp;to the particle system {}ps{}.":"上面的代码首先在名为 {}\"Effects\"{} 的房间图层上创建一个新粒子系统，并将索引存储在实例变量 {}ps{} 中。然后在 {8}repeat{9} 循环中调用 {}{}part_particles_burst{}{} 函数 10 次，以将 {}{} 粒子系统资源 {}{}{}ps_Fireworks{} 添加到粒子系统 {16}ps{17}。",
    "The function gives you a quick way to add a particle effect that you made in&nbsp;{}The Particle System Editor{} to an existing particle system.":"该函数提供了一种将在 {}\" 粒子系统编辑器 \"{} 中创建的粒子效果添加到现有粒子系统的快速方法。",
    "The index&nbsp;of the particle system in which to create the particles":"要在其中创建粒子的粒子系统的索引",
    "The particle system asset&nbsp;of which to burst particles":"要爆裂粒子的粒子系统资源",
    "The x position to burst the particles":"使粒子爆炸的x位置",
    "The y position to burst the particles":"使粒子爆裂的y位置",
    "This function creates a single burst&nbsp;of all the particles&nbsp;contained in the given&nbsp;{}{}Particle System Asset{}{}. The particles are created in the given particle system instance&nbsp;{}ind{}.":"此函数创建给定 {}{} 粒子系统资源 {}{} 中包含的所有粒子的单个爆发。粒子在给定的粒子系统实例 {}ind{} 中创建。",
    "This is as if you\u0027d add the emitters&nbsp;inside that particle system asset to the given particle system and then call&nbsp;{}{}part_emitter_burst{}{}&nbsp;on all&nbsp;of&nbsp;them.":"这就好像将该粒子系统资源中的发射器添加到给定的粒子系统，然后对所有发射器调用{}{}part_emitter_burst{}{}。",
    "{}{}NOTE{}{}&nbsp;Particles won\u0027t be created for any disabled emitters in the&nbsp;{}{}Particle System Asset{}{}&nbsp;(which is {}Enabled{} unchecked).":"{}{}注意{}{}不会为{}{}粒子系统资源{}{}(未选中{}启用{})中的任何禁用发射器创建粒子。"
}