{
    "By default, every particle system that you create is drawn automatically by&nbsp;{}GameMaker{}. You can also draw it {}manually{} using this function.":"默认情况下，您创建的每个粒子系统都由{}GameMaker{}自动绘制。您也可以使用此功能{}手动{}绘制。",
    "If&nbsp;{}{}part_system_automatic_draw{}{}&nbsp;is switched off then this function will show the particles when used in the draw event of an instance. It can also be used when the drawing target is set to a surface (using {}{}surface_set_target{}{}) to draw the particles in the system to that surface.":"如果{}{}part_system_automatic_draw{}{}关闭，则在实例的绘制事件中使用时，此函数将显示粒子。当绘制目标设置为曲面(使用{}{}surface_set_target{}{})时，也可以使用它将系统中的粒子绘制到该曲面。",
    "The above code checks to see if the surface indexed in the variable \"surf\" exists, and if it does it then sets the drawing target to the surface, draws the particle system with the ID stored in the global variable, and then resets the drawing target so all normal drawing appears on the screen once more.":"上面的代码检查变量\"washing\"中索引的表面是否存在，如果存在，则将绘制目标设置为表面，绘制Id存储在全局变量中的粒子系统，然后重置绘制目标，以便所有正常绘制再次出现在屏幕上。",
    "The above code checks to see if the surface indexed in the variable {}surf{} exists. If it does it then sets the drawing target to the surface, draws the particle system with the ID stored in the global variable, and then resets the drawing target so all normal drawing appears on the screen once more.":"上面的代码检查变量 {}surf{} 中索引的曲面是否存在。如果是，则将绘制目标设置为曲面，使用存储在全局变量中的 ID 绘制粒子系统，然后重置绘制目标，以便所有法线绘制再次显示在屏幕上。",
    "The index of the particle system to draw the particles of.":"用于绘制粒子的粒子系统的索引。",
    "This function draws the given particle system.":"此函数绘制给定的粒子系统。",
    "With this function you can force a particle system to draw all the current particles on the screen. If {}{}part_system_automatic_draw(){}{} is switched off then this function will show the particles when used in the draw event of an instance, or it can be used when the drawing target is set to a surface (using {}{}surface_set_target(){}{}) to draw the particles in the system to that surface.":"使用此函数，可以强制粒子系统在屏幕上绘制所有当前粒子。如果 {}{}part_system_automatic_draw(){}{} 处于关闭状态，则在实例的绘制事件中使用时，此函数将显示粒子，或者在绘制目标设置为表面 (使用 {}{}surface_set_target(){}{}) 时，可以使用此函数将系统中的粒子绘制到该表面。",
    "{}{}TIP{}{}&nbsp;Call this function in any of the&nbsp;{}Draw Events{} to draw the particle system whenever you want. Call it in a Draw End event to draw the particles in front of other graphics or in one of the Draw GUI events to draw them on the GUI layer.":"{}{}提示{}{}在任何{}绘制事件{}中调用此函数，以便随时绘制粒子系统。在\"绘制结束\"事件中调用它，以在其他图形前面绘制粒子，或在其中一个\"绘制GUI\"事件中调用它，以在GUI层上绘制粒子。"
}