{
    "Note that if the value is outside of the tile map area, and no cell is available, it will return -1.":"请注意，如果该值位于图块地图区域之外，并且没有可用的单元格，则它将返回 -1。",
    "The above code uses the retrieved tile map ID to get the cell position from a set of room coordinates and then store the data for any tile found there in an instance variable.":"上面的代码使用检索到的图块贴图ID从一组房间坐标中获取单元位置，然后在实例变量中存储在其中找到的任何块的数据。",
    "The unique ID value of the tile map element to get the cell y position of":"块映射元素的唯一ID值，用于获取",
    "The x position within the room to use for getting the cell":"房间内用于获取细胞的x位置",
    "The y position within the room to use for getting the cell":"房间内用于获取细胞的y位置",
    "Using this function you can retrieve the y-axis position of an individual tile map cell by giving the relative y-axis position within the room.":"使用此函数，您可以通过给出房间内的相对 y 轴位置来检索单个图块地图单元格的 y 轴位置。",
    "Using this function you can retrieve the y-axis position of an individual tile map cell by giving the relative y-axis position within the room. You give the tile map element ID (which you get when you create a tile map element using {}{}layer_tilemap_create(){}{} or when you use the function {}{}layer_tilemap_get_id(){}{}), as well as the x and y position {}within the room{} and the function will return the y position of the cell within the tile map for that point. Note that if the value is outside of the tile map area, and no cell is available, it will return -1.":"使用此函数，可以通过给出房间内的相对y轴位置来检索单个贴图单元的y轴位置。给定图块贴图元素 ID(使用{}{}layer_tilemap_create(){}{}或使用函数{}{}layer_tilemap_get_id(){}{}时获得的 ID)以及房间{}内的 x 和 y 位置{}，该函数将返回该点图块贴图内单元格的 y 位置。请注意，如果值在图块映射区域之外，且没有可用的单元格，则返回-1。",
    "You give the tile map element ID (which you get when you create a tile map element using {}{}layer_tilemap_create(){}{} or when you use the function {}{}layer_tilemap_get_id(){}{}), as well as the x and y position {}within the room{} and the function will return the y position of the cell within the tile map for that point.":"您提供图块地图元素 ID(在使用 {}{}layer_tilemap_create(){}{} 创建图块地图元素或使用函数 {}{}layer_tilemap_get_id(){}{} 时获得)，如下所示以及 {} 房间内 {} 的 x 和 y 位置，该函数将返回该点的图块地图内单元格的 y 位置。",
    "{}{}Real{}{} (y-axis cell position or -1 if there is an error)":"{}{}Real{}{}(y 轴单元格位置，如果出现错误，则为 -1)"
}