{
    "A special constant that is for \"and\"-ing with the tile data blob to extract the tile index.":"用于\"和\"的专用常量，与块数据块一起提取块索引。",
    "An easy way to get the initial index mask value is to take the number of tiles in the tile set and subtract 1, so a 16x16 tile set has 256 tiles and a mask value of 255 (or $ff in hexadecimal), and if the tile set has a number of tiles that are not a power of two, then round up to the nearest power of two to get the mask, for example a tile set that is 20x20 has 400 tiles, which you would round up to 512, and so get a mask index value of 511 ($1ff in hexadecimal). Apart from the index mask, normally you would want to preserve the flip, rotate and mirror values that are assigned to a tile too, so to help with that there are a few {}constants{} that can be used. These can be \"or\"-ed together with the index mask value to preserve those bits of data. The following constants can be used (see the example code below for usage):":"获得初始索引掩码值的简单方法是取图块集中的图块数并减去1，因此，16x16的图块集有256个图块，掩码值为255(或$ ff，十六进制)，如果图块集的图块数不是2的幂，则向上四舍五入到最接近的2次方以获得掩码，例如，20x20的图块集有400个图块，这四舍五入到512，因此得到掩码索引值511(十六进制为$ 1ff)。除了索引掩码之外，通常您还希望保留分配给平铺的翻转、旋转和镜像值，以便帮助使用一些{}常数{}。这些可以与索引掩码值一起\"或\"化，以保留这些数据位。可以使用以下常量(有关用法，请参见下面的示例代码)：",
    "The above code gets the tile map ID from the given layer and then sets the tile map bit mask to 8bits, preserving the flip, mirror, and rotate values for each tile in the map.":"上述代码从给定层获取图块映射ID，然后将图块映射位掩码设置为8位，保留映射中每个图块的翻转、镜像和旋转值。",
    "The mask value":"掩码值",
    "The unique ID value of the tile map element to set the mask of":"要设置掩码的平铺贴图元素的唯一ID值",
    "This function can be used to set the {}tile bit mask{} for a single tile map. You give the tile map element ID (which you get when you create a tile map element using {}{}layer_tilemap_create(){}{} or when you use the function {}{}layer_tilemap_get_id(){}{}), and then the mask value. The idea is that if you have, for example, a pretty small tile set of 16 x 16 tiles then you have a total of 256 different tiles in your tile set, which only uses up 8 bits of your index in the tile data \"blob\" (from an available 19 bits of data). These bits can be \"masked\" and then the rest of the tile data can be used to store additional values.":"此函数可用于设置单个平铺贴图的{}块位掩码{}。为贴图元素 ID(当使用{}{}layer_tilemap_create(){}{}或使用函数{}{}layer_tilemap_get_id(){}{}创建平铺贴图元素时获得的 ID)，然后给出掩码值。其思想是，例如，如果您有一个相当小的16 x 16块的图块集，那么您的图块集中总共有256个不同的图块，这在图块数据\"blob\"(从可用的19位数据)中仅使用8位索引。这些位可以被\"屏蔽\"，然后其余的平铺数据可用于存储附加值。",
    "Tile Mask Constant":"",
    "Tile map bit masking is an advanced feature and allows you to use bits of the tile data \"blob\" for your own use. For example, the user could reserve a bit to mean \"solid\" in the tile-data structure and then this can be checked for fast collisions. Basically, the bit mask is \"and\"-ed against the tile data when the tile map is {}drawn{} (so it doesn\u0027t affect any of the other functionality), meaning that bits which aren\u0027t in the mask are ignored, but can still be read and written to by the user for their own purposes. Note that there are two different masks – a global one and one per tile map - and these are \"and\"-ed together internally by {}GameMaker{} before being used for drawing.":"平铺贴图位掩码是一项高级函数，允许您使用平铺数据的位\"blob\"供您自己使用。例如，用户可以在平铺数据结构中保留一个表示\"实心\"的位，然后可以检查快速冲突。基本上，当绘制图块映射{}时，位掩码相对于瓦块数据\"和\"ed{}(因此不影响任何其他函数)，意味着不在掩码中的位被忽略，但用户仍可以出于自己的目的读取和写入。请注意，有两种不同的蒙版 – 全局蒙版和每块贴图一个，它们在用于绘图之前由{}GameMaker{}内部组合在一起。",
    "Used to set/get the flip bit of a tile data blob.":"用于设置/获取平铺数据块的翻转位。",
    "Used to set/get the mirror bit of a tile data blob.":"用于设置/获取平铺数据块的镜像位。",
    "Used to set/get the rotate bit of a tile data blob.":"用于设置/获取图块数据块的旋转位。"
}