{
    "The above code gets the ID for the tile map \"Clouds\" on the layer \"Tiles_Sky\" and then uses that to get the data from the tile at position (64, 128). This tile data is then flipped before being used to set the tile on the tile map again.":"上面的代码获取\"Tiles_Sky\"层上的图块映射\"云\"的ID，然后使用该ID从位置(64，128)的图块中获取数据。然后翻转此图块数据，然后再用于设置图块贴图上的图块。",
    "The position along the x-axis to get the tile data from (in room pixels)":"沿x轴从(房间像素中)获取图块数据的位置",
    "The position along the y-axis to get the tile data from (in room pixels)":"沿y轴从(房间像素中)获取图块数据的位置",
    "The unique ID value of the tile map element to get the tile-data of":"图块图元素的唯一ID值，用于获取",
    "Using this function you can retrieve the tile data from a position (within the room) of the tile map element.":"使用此函数，您可以从瓦片地图元素的某个位置 (房间内) 检索瓦片数据。",
    "Using this function you can retrieve the tile data from a position (within the room) of the tile map element. You give the tile map element ID (which you get when you create a tile map element using {}{}layer_tilemap_create(){}{} or when you use the function {}{}layer_tilemap_get_id(){}{}) as well as the x and y position {}in the room{} to get the tile data from and the function will return the tile data \"blob\". This data is essentially a bit mask that contains the tile index, the flip/rotate/mirror booleans and any mask data that has been applied (see {}{}tilemap_set_mask(){}{} for details), and the resulting data value can then be used in the {}tile_*{}&nbsp;functions to change a tiles properties. If you need to get the tile data from a specific tile cell you should be using the function {}{}tilemap_get(){}{} instead.":"使用此函数，您可以从图块地图元素的某个位置(在房间内)检索图块数据。您可以提供互动程序地图元素Id(当您使用{}{}layer_tilemap_create(){}{}创建互动程序地图元素时，或者当您使用函数{}{}layer_tilemap_get_id(){}{})以及房间{}中的x和y位置{}从中获取互动程序地图元素数据时，将获得此ID，并且此函数将返回互动程序数据\"blob\"。此数据基本上是一个位掩码，其中包含互动程序索引、翻转/旋转/镜像布尔值和已应用的任何掩码数据(有关详细信息，请参见{}{}tilemap_set_mask(){}{})，然后可以在{}互动程序{}函数中使用生成的数据值来更改互动程序属性。如果需要从特定的互动程序单元格获取互动程序数据，则应改用函数{}{}tilemap_get(){}{}。",
    "You give the tile map element ID (which you get when you create a tile map element using {}{}layer_tilemap_create(){}{} or when you use the function {}{}layer_tilemap_get_id(){}{}) as well as the x and y position {}in the room{} to get the tile data from and the function will return the tile data \"blob\". This data is essentially a bit mask that contains the tile index, the flip/rotate/mirror booleans and any mask data that has been applied (see {}{}tilemap_set_mask(){}{} for details), and the resulting data value can then be used in the {}tile_*{}&nbsp;functions to change a tiles properties. If you need to get the tile data from a specific tile cell you should be using the function {}{}tilemap_get(){}{} instead.":"您还可以提供图块地图元素 ID(在使用 {}{}layer_tilemap_create(){}{} 创建图块地图元素或使用函数 {}{}layer_tilemap_get_id(){}{} 时获得) 作为获取图块数据的 {} 房间中 {} 的 x 和 y 位置，该函数将返回图块数据 \"blob\"。该数据本质上是一个位掩码，其中包含图块索引、翻转 / 旋转 / 镜像布尔值以及已应用的任何掩码数据 (有关详细信息，请参阅 {}{}tilemap_set_mask(){}{}) 以及结果数据值然后可以在 {}tile_*{} 函数中使用来更改图块属性。如果您需要从特定图块单元格获取图块数据，则应使用函数 {}{}tilemap_get(){}{}。",
    "{}IMPORTANT!{} If the tiles in the tile map have been unchanged (ie: they are {}not{} rotated or flipped etc...), then the return value of the tile set data will be exactly equal to the index of the tile on the tile set. So you can create \"collision maps\" of tiles using one tile at index 1 in the tile set - for example - then use this function to check for 1 or 0 (an empty tile) to calculate collisions.":"{}重要！{} 如果图块地图中的图块未更改(即：它们{}不{}旋转或翻转等...)，则图块集数据的返回值将恰好等于图块集上的图块的索引。因此，您可以使用图块集中索引为1的一个图块创建图块的\"碰撞贴图\"-例如-然后使用此函数检查1或0(空图块)以计算碰撞。",
    "{}{}IMPORTANT{}{}&nbsp;If the tiles in the tile map have been unchanged (i.e.: they are {}not{} rotated, flipped, etc.), then the return value of the tile set data will be exactly equal to the index of the tile on the tile set. So you can create \"collision maps\" of tiles using one tile at index 1 in the tile set - for example - then use this function to check for 1 or 0 (an empty tile) to calculate collisions.":"{}{} 重要{}{} 如果图块地图中的图块未发生变化 (即：它们 {} 未 {} 旋转、翻转等)，则图块集数据的返回值将完全相等到图块集上图块的索引。因此，您可以使用图块集中索引 1 处的一个图块创建图块的 \" 碰撞图 \"( 例如)，然后使用此函数检查 1 或 0( 空图块) 以计算碰撞。"
}