{
    "A stack overflow occurs when too much memory is used on the call stack and when your game attempts to use more space than is available on the call stack (that is, when it attempts to access memory beyond the call stack\u0027s bounds, which is essentially a buffer overflow), the stack is said to overflow, resulting in a program crash. Restart your computer and {}GameMaker{}&nbsp;and if the error persists please get in touch with support and/or file a bug (as explained above).":"当调用堆栈上使用了太多的内存时，当你的游戏试图使用比调用堆栈上可用的更多的空间时(也就是说，当它试图访问超出调用堆栈边界的内存时，本质上就是一个缓冲区溢出) ，堆栈就会溢出，导致程序崩溃。重新启动您的计算机和{} GameMaker {} ，如果错误仍然存在，请报告这个BUG(如上所述)。",
    "A value with the wrong data type was passed as an argument to the function at (index) (where an index of 1 is the {}first{} argument). A value of wrong_type was given but it should be one of expected_type instead.":"数据类型错误的值作为参数传递给(index)处的函数(其中索引为1的是{}第一个{}参数)。已经给出了 wrong_type 的值，但是它应该是 expected_type 之一。",
    "As mentioned above, certain error messages will be identify the scope not by an instance ID value, but rather by a {}negative {}value. These values can be used to pinpoint the exact nature of the error and what it refers to with the following values possible:":"如上所述，某些错误消息将不通过实例 ID 值而是通过{}负{}值来标识范围。这些值可以用来确定错误的确切性质，以及它与下列可能值的关系:",
    "Bitwise":"位操作",
    "Data Types":"数据类型",
    "Even after syntax checking in the code editor and then having the compiler check your code for {}compiler errors{}, there are still occasions when something can go wrong. In most cases this will throw a {}Virtual Machine (VM){}&nbsp;runner error (also called a {}runtime exception{}) which looks like this:":"即使在代码编辑器中进行了语法检查，然后让编译器检查代码中的{}编译器错误{}之后，仍然有可能出现错误的情况。在大多数情况下，这将抛出一个{}虚拟机(VM){}运行程序错误(也称为{}运行时异常{}) ，它看起来像这样:",
    "Local":"Local",
    "Maths":"数学",
    "Not Specified":"未指定",
    "Runner errors are generally more serious than compile errors as it means that there is something seriously wrong with your code that neither the code editor nor the compiler have been able to detect, and as such you should pay attention to all such errors. When one occurs, you can use the {}Copy{}&nbsp;button on the pop-up to copy the error to the clipboard which you can then paste into a text file (or wherever) for future reference.":"运行程序错误通常比编译错误更严重，因为它意味着代码出现了代码编辑器和编译器都无法检测到的严重错误，因此您应该注意所有这类错误。当出现错误时，您可以使用弹出窗口上的{} Copy {}按钮将错误复制到剪贴板，然后将其粘贴到文本文件(或其他地方)中以供将来参考。",
    "Self":"Self",
    "Something has gone wrong when bitshifting left ({}&lt;&lt;{}) a value.":"当位移({}<<{})留下一个值时，出现了错误。",
    "Something has gone wrong when bitshifting right ({}&gt;&gt;{}) a value.":"当位移({}>>{})保留一个值时，出现了错误。",
    "Something has gone wrong when using the addition ({}+{}) expression.":"使用加法({} + {})表达式时出错。",
    "Something has gone wrong when using the bitwise \"and\" ({}&amp;{}) expression.":"使用按位“ and”({} & {})表达式时出错。",
    "Something has gone wrong when using the bitwise \"or\" ({}|{}) expression.":"使用位“ or”({} | {})表达式时出错。",
    "Something has gone wrong when using the bitwise \"xor\" ({}^{}) expression.":"使用按位“ xor”({} ^ {})表达式时出错。",
    "Something has gone wrong when using the division ({}/{} or {}div{}) expression.":"使用除法({}/{}或{}div{})表达式时出错。",
    "Something has gone wrong when using the modulo ({}mod{}) expression.":"使用模({}mod{})表达式时出错。",
    "Something has gone wrong when using the multiplication ({}*{}) expression.":"使用乘法({} * {})表达式时出错。",
    "Something has gone wrong when using the subtraction ({}-{}) expression.":"使用减法({} - {})表达式时出错。",
    "Stack":"堆栈",
    "The given variable has not been defined or is unknown.":"给定的变量尚未定义或未知。",
    "The possible errors from the VM runner are as follows:":"VM 运行程序可能出现的错误如下:",
    "The structure of this error is as follows:":"这一错误的结构如下:",
    "The variable being accessed is out with the established range for the runner.":"正在访问的变量超出了为运行器设定的范围。",
    "This denotes an error in the conversion of one data-type into another.":"这表示将一种数据类型转换为另一种数据类型时出错。",
    "This denotes that the runner has tried to compare two incompatible data types, like a real number with a string.":"这表示运行程序试图比较两种不兼容的数据类型，比如实数和字符串。",
    "This is an undefined error within the Virtual Machine. You should file a bug report should this happen (see: The Help Menu for details on how to do this.":"这是虚拟机中未定义的错误。如果发生这种情况，您应该提交一份 bug 报告(有关如何做到这一点的详细信息，请参阅: 帮助菜单。",
    "You are attempting to divide by 0 (note this will only happen when using integer division, dividing a (non-zero) real by 0 will give infinity as an answer, dividing zero by zero will give NaN as an answer).&nbsp;You can check for these values with ({}is_infinity{})&nbsp;and ({}is_nan{})":"您正在尝试除以0(注意，这只有在使用整数除法时才会发生，将一个(非零)实数除以0将得到无穷大作为答案，将零除以零将得到 NaN 作为答案)。可以使用({}is_infinity{})和({}is_nan{})检查这些值",
    "You are trying to \"not\" a variable type when this type does not permit such an operation.":"当一个变量类型不允许这样的操作时，您尝试“非”该类型。",
    "You are trying to access a variable that hasn\u0027t been set (i.e. {}initialised{}) yet. Assign a value to it first before trying to read it, e.g. {}variable&nbsp;=&nbsp;100;{}. Only {}declaring{} a variable, using e.g. {}var&nbsp;variable;{} will also throw this error.":"您正在尝试访问一个尚未设置的变量(即{}初始化{})。在尝试读取它之前先为它分配一个值，例如{}variable = 100; {}。只有{}声明{}变量，例如使用{} var variable; {}也将引发此错误。",
    "You are trying to divide the wrong type of variables (for example divide a string by a real).":"您试图划分错误类型的变量(例如，将字符串除以实数)。",
    "You are trying to left bitshift ({}&lt;&lt;{}) the wrong type of variables (for example trying to bitshift a string).":"您试图将位移({}<<{})保留为错误的变量类型(例如，试图对字符串进行位移)。",
    "You are trying to right bitshift ({}&gt;&gt;{}) the wrong type of variables (for example trying to bitshift a string).":"您正在尝试对位移({}>>{})错误的变量类型(例如尝试对字符串进行位移)。",
    "You are trying to subtract the wrong type of variables (for example subtract a string from a real).":"您试图减去错误类型的变量(例如，从实数中减去字符串)。",
    "You are trying to turn a variable type into a negative when this type does not permit such an operation.":"当变量类型不允许这样的操作时，您试图将变量类型转换为负值。",
    "You are trying to use \"or\" ({}|{}) on the wrong type of variables (for example trying to \"or\" a string with a real).":"您正在尝试对错误类型的变量使用“ or”({} | {})(例如，字符串“ or”实数)。",
    "You are trying to use \"xor\" ({}^{}) on the wrong type of variables (for example trying to \"xor\" a string with a real).":"您试图在错误类型的变量上使用“ xor”({} ^ {})(例如，实数“ xor”字符串)。",
    "You are trying to use bitwise \"and\" ({}&amp;{}) on the wrong type of variables (for example trying to \"and\" a string with a real).":"您正在尝试对错误类型的变量使用位“and”({} & {})(例如，字符串“and”实数)。",
    "You are trying to use modulo ({}mod{}) on the wrong type of variables (for example {}mod{} a string by a real).":"您试图对错误类型的变量使用模({}mod{})(例如通过一个实数来 {} mod {}一个字符串)。",
    "You have tried to use \"{}global{}\" as a variable within a \"{}with{}\" statement, ie:{} {}with (global){} &nbsp; &nbsp;{{} &nbsp; &nbsp;//do something;{} &nbsp; &nbsp;}{} ":"您尝试过在“{}with{}”语句中使用“{}global{}”作为变量，即:{} {}with (global){} &nbsp; &nbsp;{{} &nbsp; &nbsp;//做某些事情;{} &nbsp; &nbsp;}{}",
    "You have tried to use \"{}local{}\" as a variable within a \"{}with{}\" statement, ie:{} {}with (local){} &nbsp; &nbsp;{{} &nbsp; &nbsp;//do something;{} &nbsp; &nbsp;}{} ":"您尝试过在“{}with{}”语句中使用“{}local{}”作为变量，即:{} {}with (local){} &nbsp; &nbsp;{{} &nbsp; &nbsp;//做某些事情;{} &nbsp; &nbsp;}{} ",
    "{}Runner Errors{}":"{}运行器错误{}",
    "{}{} This shows the Event that the error has occurred in as well as the Object (where applicable).":"{}{}这显示发生错误的事件和对象(如果适用)。",
    "{}{} This shows the actual error.&nbsp; So, it shows the {}scope {}of the error and the type of error it is. The first value in the brackets will be the instance ID of the instance that was running the code -&nbsp;or it could be one of the special values listed in the table below - and the second is an internal value that {}GameMaker{} uses for identifying bugs and can be ignored. In the case of the image above, it\u0027s saying that the variable {}_image{} has not been set (ie: does not exist before being accessed) on the object {}obj_EA_DEMO_Control{}.":"{}{}这显示了实际的错误。因此，它显示了错误的{}范围{}和错误的类型。括号中的第一个值将是运行代码的实例的实例 ID ——或者它可能是下表中列出的特殊值之一——第二个值是{}GameMaker{}用于识别 bug 并可以忽略的内部值。对于上面的图像，它表示变量{}_image{}尚未在对象{}obj_EA_DEMO_Control{}上设置(即: 在被访问之前不存在)。",
    "{}{} This shows the line number that the error occurs on as well as a snippet of code showing the position. Note that this is not always 100% accurate due to the way the game is compiled, but it should be enough to help you find exactly where the issue is.":"{}{}这显示发生错误的行号以及显示位置的代码片段。请注意，由于游戏的编译方式，这并不总是100% 准确，但它应该足以帮助您找到问题的确切位置。"
}