{
    "&nbsp;":"&nbsp;",
    "As above only for a range of arguments.":"如上所述，只适用于一系列参数。",
    "As above, but for when there are multiple possible expected symbols.":"如上所述，但当有多个可能的预期符号。",
    "Double clicking {} on any of the errors shown in the output console will take you to the line in the object event or script that has the error so you can edit it.":"双击{}输出控制台中显示的任何错误，都会将您带到具有错误的对象事件或脚本中的行，以便您可以编辑它。",
    "Feather Messages (Feather enabled)":"羽毛信息(羽毛启用)",
    "Feather messages fall into three categories:":"羽毛信息分为三类:",
    "In this window the list of messages can be sorted ascending or descending by message code, by message text (alphabetically) or by resource (alphabetically by resource name). You can also search using the search box in the top right corner of the window.":"在这个窗口中，消息列表可以按照消息代码、消息文本(按字母顺序)或资源(按资源名称的字母顺序)进行升序或降序排序。也可以使用窗口右上角的搜索框进行搜索。",
    "It should be noted that some of these errors will be shown at specific places in your code, but the actual error may be cause by something elsewhere, or one single issue may provoke multiple error messages:":"应该注意的是，其中一些错误将显示在代码中的特定位置，但实际错误可能是由其他地方引起的，或者一个问题可能引发多个错误消息:",
    "Malformed reference [val]":"Malformed reference [val]",
    "Or if the error is in a script, it will be:":"或者，如果错误出现在脚本中，那么它将是:",
    "Syntax Error List":"语法错误列表",
    "Syntax Errors (Feather disabled)":"语法错误(羽毛禁用)",
    "Syntax error checking happens differently depending on whether you have enabled {}Feather{} in the&nbsp;{}Feather Settings{}.":"根据您是否在{}羽毛设置{}中启用了{}羽毛{} ，语法错误检查会发生不同的情况。",
    "Syntax errors will update as you write your code (there will be a short pause between typing something and any errors appearing in this window to prevent errors being reported for unfinished code), and will follow the format:":"当你写代码的时候，语法错误会更新(在输入代码和窗口中出现的错误之间会有一个短暂的停顿，以防止未完成代码的错误被报告) ，并且会遵循以下格式:",
    "The first level of error reporting when programming your games in {}GameMaker{} is in the code or GML Visual editor, and it\u0027s the&nbsp;{}syntax{}&nbsp;checker. As you write your code - or add your actions - {}GameMaker{}&nbsp;will check that it follows the established syntax for the language, and flag any issues that it finds so you can fix them before it comes to running the game or compiling an executable.":"在{}GameMaker{}中编写游戏时，错误报告的第一级是在代码或 GML Visual 编辑器中，它是{}语法{}检查器。当你编写代码或者添加动作时，{}GameMaker{} 会检查它是否遵循语言的语法，并标记出它发现的任何问题，这样你就可以在运行游戏或者编译可执行文件之前解决这些问题。",
    "The table below lists the different syntax errors and their main causes:":"下表列出了不同的语法错误及其主要原因:",
    "These errors fall into two main categories:":"这些错误分为两大类:",
    "This can happen when you are trying to nest function calls within a statement, eg:{}\n          {}ds_list_find_value(list, 0)).sprite_index{}\n        ":"当您试图在语句中嵌套函数调用时，例如: {}\n          {}ds_list_find_value(list, 0)).sprite_index{}",
    "This can happen when you have used the hexadecimal value for an escape character in a string and this has the wrong format.":"如果在字符串中使用了转义字符的十六进制值，并且格式不正确，就会发生这种情况。",
    "This error denotes a syntax error which the parser is not able to identify more specifically.":"此错误表示语法错误，解析器无法更具体地识别该错误。",
    "This error happens when you try to reference an argument in an inherited function that has not been declared in the parent function definition.":"当您尝试引用未在父函数定义中声明的继承函数中的参数时，会发生此错误。",
    "This error means that you have tried to use an invalid or unidentified function modifier ([val]) when declaring an in-kine function (a function modifier is something like the {}constructor{} keyword, which is supported).&nbsp;":"这个错误意味着您在声明 in-kine 函数时尝试使用无效或未标识的函数修饰符([val])(函数修饰符类似于受支持的{}构造函数{}关键字)。",
    "This error means you have called the {}try{} function but have omitted to include a {}catch{} or {}finally{} clause.":"此错误意味着您调用了{}try{}函数，但是忽略了包含{}catch{}或{}finally{}子句。",
    "This error means you have declared a region somewhere in the code but have not defined an end region anywhere for it.":"这个错误意味着您已经在代码中的某个地方声明了一个区域，但是还没有为它在任何地方定义一个结束区域。",
    "This error means you have declared an end region in your code, without defining a start region.":"此错误意味着您在代码中声明了一个结束区域，而没有定义开始区域。",
    "This error means you have used one of the parts of the ternary operator incorrectly somewhere in your code, where [val] shows the part that is in error.":"这个错误意味着您在代码的某个地方错误地使用了三元运算符的一个部分，其中[val]显示了出错的部分。",
    "This error occurs when the syntax checker detects an expression (shown in [val]) where it was expecting a statement. For example, the following code will throw the error as it\u0027s expecting the ternary operator ? but encounters 32:{}\n          {}temp_x = x &lt; (room_width / 2)&nbsp; 32: room_width - 32;{}\n        ":"当语法检查器检测到一个表达式(在[val]中显示)时，将发生此错误。例如，下面的代码将抛出错误，因为它期望的三元运算符？错误的遇到了32{}\n          {}temp_x = x &lt; (room_width / 2)&nbsp; 32: room_width - 32;{}",
    "This error occurs when the syntax checker expects an expression but one isn\u0027t given.":"当语法检查器期望一个表达式，但是没有给出该表达式时，就会发生此错误。",
    "This error occurs when you try to use strings wrapped in single quotes, eg: \u0027Hello World\u0027, instead of double quotes, eg: \"Hello World\".":"当您尝试使用以单引号包装的字符串(例如: \u0027Hello World\u0027而不是双引号，例如: \"Hello World\")时，会发生此错误。",
    "This error occurs when you use one of the bitwise operators in a place where it shouldn\u0027t be getting used, with [val] showing where.":"当您在不应该使用位操作符的位置使用位操作符时，会发生此错误，并且[val]显示位操作符的位置。",
    "This error tells you that you have defined two or more enums with the same name.":"此错误告诉您已定义了两个或多个具有相同名称的枚举。",
    "This error tells you that you have duplicated an enum variable entry name&nbsp;":"此错误告诉您已经复制了一个枚举变量条目名称",
    "This error tells you that you have not supplied the correct number of arguments to the function shown for [val1], which expects the number shown in [val2] but got those shown in [val3].":"这个错误告诉您，您没有为[val1]所示的函数提供正确的参数数目，该函数期望得到[val2]中所示的参数数目，但是得到了[val3]中所示的参数数目。",
    "This error tells you that you have tried to use inheritance on a function which has not been declared as a constructor.":"这个错误告诉您，您已经尝试对未声明为构造函数的函数使用继承。",
    "This error tells you there is an issue with a multi-operator assignment (also called a compound assignment) which is not supported by the GameMaker Language. This includes things like \"{}*={}\" or \"{}/={}\", etc...":"此错误告诉您存在一个 GameMaker Language 不支持的多操作符赋值(也称为复合赋值)问题。这包括“{} *= {}”或“{}/= {}”等等。.",
    "This error will occur when you open a string using {}@“{} or {}“{} but you do not close it before the end of code.":"当您使用{}@\"{}或{}\"{}编写字符串但在代码结束前未关闭该字符串时，将发生此错误。",
    "This happens when a unary operator (like +, -, =, etc...) has been found in your code at a place when it isn\u0027t expected, where [val] will show you the operator.":"当一元运算符(如 + 、-、 = 等)在您的代码中找到了一个不需要的位置，在那里[val]将向您显示操作符。",
    "This happens when the macro [val] is unused anywhere in your code.":"当宏[val]在代码中的任何地方未使用时，就会发生这种情况。",
    "This happens when the syntax checker expects some value or symbol but gets a different one, where [val1] is the current symbol or value, and [val2] is the expected symbol or value. For example:{}\n          {}Got \"{\", expected \"(\"{}\n        ":"当语法检查器期望某个值或符号，但得到一个不同的值或符号时，就会发生这种情况，其中[val1]是当前符号或值，[val2]是期望的符号或值。例如: {}\n          {}Got \"{\", expected \"(\"{}",
    "This happens when you have an error [val] in the room creation code somewhere.":"当您在房间创建代码中的某个地方出现错误[val]时，就会发生这种情况。",
    "This happens when you terminate a statement and leave it empty. For example, the following code will give the error (note the terminating semi-colon):{}\n          {}if (x &lt; 0);{}\n        ":"当您终止一条语句并将其保留为空时，就会发生这种情况。例如，下面的代码将给出错误(注意终止分号) : {}{}if(x<0);{}",
    "This means that the given variable [val] is only referenced once in your code.":"这意味着给定的变量[val]在代码中只引用一次。",
    "This means that the variable [val] has been referenced in your code, but has not been assigned a value anywhere previously.":"这意味着变量[val]已经在您的代码中被引用，但是以前没有在任何地方被赋值。",
    "This means there is an internal AST Validation Error (you should never see this error, but if you do please consider filing a bug report from the {}Help Menu{})&nbsp;":"这意味着存在一个内部 AST 验证错误(您应该永远不会看到这个错误，但是如果您确实看到了，请考虑从{}帮助菜单{}中提交错误报告)",
    "This means you have tried to reference an array in an incorrect way, and [val] will show the reference.":"这意味着您试图以不正确的方式引用数组，[val]将显示引用。",
    "This tells you that you have used the {}globalvar{} declaration but omitted to supply a variable name.":"这说明您已经使用了{}globalvar{}声明，但是没有提供变量名。",
    "This tells you that you have used the {}var{} declaration but omitted to supply a variable name.":"这说明您已经使用了{}var{}声明，但是忽略了提供变量名。",
    "When Feather is enabled the Syntax Errors window is replaced by the Feather Messages window:&nbsp;":"当“羽毛”被启用时，“语法错误”窗口将被“羽毛消息”窗口替换:",
    "You can get this error when you try to define a macro [val] with the same name as one that has been previously defined.":"当您尝试定义与之前定义的宏同名的宏[val]时，可能会出现这个错误。",
    "[object] - [event] - [Line Number] - [Position In Line]: [error {}string{}]":"[物体] - [事件] - [行数] - [行中位置]: [error {}字符串{}]",
    "[script] - [Line Number] - [Position in line]: [error {}string{}]":"[脚本] - [行数] - [行中位置]: [error {}字符串{}]",
    "{}&nbsp;{}Errors{}: These are problems that will not permit the game to compile, let alone run. These should be fixed before doing anything further with the code.":"{} {}错误{} : 这些问题不允许游戏编译，更不用说运行了。在进一步处理代码之前，应该修复这些问题。",
    "{}&nbsp;{}Errors{}: These are problems that will not permit the game to compile, let alone run. These should be fixed before doing anything further with the code. The table below shows the most common causes of these.":"{} {}错误{} : 这些问题不允许游戏编译，更不用说运行了。在进一步处理代码之前，应该修复这些问题。下表显示了这些错误最常见的原因。",
    "{}&nbsp;{}Suggestions{}: These are suggestions for possible improvements to the code, related to a variety of things.":"{} {}建议{} : 这些是对代码的可能改进的建议，涉及到很多方面。",
    "{}&nbsp;{}Warnings{}: These are shown for possible errors,&nbsp;which, in most cases, won\u0027t stop the game from compiling, but might provoke runtime errors.&nbsp;The most common causes of these warnings is when a variable is used in an expression and it hasn\u0027t been defined yet anywhere else, or when a variable has been defined but hasn\u0027t been used.":"{} {}警告{} : 这些是针对可能的错误显示的，在大多数情况下，这不会停止游戏的编译，但可能会引发运行时错误。产生这些警告的最常见原因是: 在表达式中使用了变量，但尚未在其他任何地方定义该变量，或者已经定义了变量但尚未使用。",
    "{}&nbsp;{}Warnings{}: These are shown for things that may be an error, but may not be,&nbsp;and probably won\u0027t stop the game from compiling, but might provoke runtime errors.&nbsp;The most common causes of these warnings is when a variable is used in an expression and it hasn\u0027t been defined yet anywhere else, or when a variable has been defined but hasn\u0027t been used.":"{}{} 警告{} : 对于可能是错误，但也可能不是，并且可能不会阻止游戏编译，但可能引发运行时错误的情况，会显示这些信息。产生这些警告的最常见原因是: 在表达式中使用了变量，但尚未在其他任何地方定义该变量，或者已经定义了变量但尚未使用。",
    "{}In the above image, all three&nbsp;{}&nbsp;errors have been provoked&nbsp; by a single mistake - the use of a semi colon \"{};{}\" instead of a comma \"{},{}\" at line 220 for the function {}variable_instance_exists(){}.":"{}在上面的图像中，所有三个错误{}都是由一个错误引起的——在第220行中对函数{6}variable_instance_exists(){7}使用了分号“{};{}”而不是逗号“{},{}”。",
    "{}Syntax Errors (Feather Messages){}":"{}语法错误(羽毛信息){}",
    "{}The Feather Messages window lists the errors and warnings that Feather encounters in your code, as well as the suggestions that it gives when it finds certain specific code patterns. Which types of errors are shown here depends on the profile that you define in the {}Feather Settings{}&nbsp;under Message Severity.":"{}羽毛信息窗口列出羽毛在代码中遇到的错误和警告，以及在找到特定的代码模式时给出的建议。此处显示的错误类型取决于您在消息严重程度下的{}羽毛设置{}中定义的配置文件。"
}