{
    "By adding the filter/effect&nbsp;in&nbsp;{}at least one room{} through the IDE":"通过IDE在{}至少一个房间{}中添加滤镜/效果",
    "By calling {}{}fx_create(){}{} with the filter/effect name as a&nbsp;string&nbsp;{}literal{}":"调用{}{}fx_create(){}{}，将过滤器/效果名称作为字符串{}literal{}",
    "Function Failures":"功能故障",
    "If these conditions are not fulfilled, i.e. you are not passing in a string literal {}and{} the filter/effect is not present in any rooms, then the function will not be able to load that filter/effect and will return -1.":"如果不满足这些条件，即您没有传入字符串文本{}并且{}过滤器/效果在任何房间中都不存在，则函数将无法加载该过滤器/效果，并将返回-1。",
    "Note that the struct returned by this function will contain no visible members and can only be modified through one of the {}Filter/Effect Functions{}.":"请注意，此函数返回的结构将不包含可见成员，只能通过{}Filter/Effect 函数{}之一进行修改。",
    "Please note that there are currently only two ways to ensure that GameMaker loads a particular filter/effect in your game:":"请注意，目前只有两种方法可确保GameMaker在游戏中加载特定过滤器/效果：",
    "The above code creates a new FX struct from the&nbsp;{}\"_filter_tintfilter\"{} effect, which is the \"Colour Tint\" filter found in the Room Editor. It assigns a value to its {}\"g_TintCol\"{}&nbsp;parameter which is the colour of the tint, and as it\u0027s a {}vec4{} internally, it takes an array containing four values (corresponding to its red, green, blue and alpha values). The FX struct for the tint is then applied to an FX layer.":"上面的代码从{}\"_filter_tintfilter\"{}效果创建一个新的FX结构，该效果是在房间编辑器中找到的\"色调\"过滤器。它为其{}\" g_TintCol\"{}参数分配一个值，该参数是色调的颜色，由于它在内部是{}vec4{}，它采用包含四个值(对应于其红色、绿色、蓝色和α值)的数组。然后，将色调的 FX 结构应用于 FX 层。",
    "The function will return -1 if the struct failed to create for any reason; this may happen if the specified FX name was wrong or the FX was not loaded into the game package.":"如果结构因任何原因无法创建，函数将返回-1; 如果指定的 FX 名称错误或 FX 未加载到游戏包中，则可能发生这种情况。",
    "The name of the filter/effect to create (get them from {}FX Types &amp; Parameters{}).":"要创建的过滤器/效果的名称(从{}外汇类型获取)参数{})。",
    "The names of the Filters/Effects that you can pass into this function are listed on this page: {}FX Types &amp; Parameters{}.":"可以传递到此函数的过滤器/效果的名称在此页面中列出：{}外汇类型 参数{}。",
    "This function is used to create a new FX Struct for a given effect type, which can then be {}applied to a layer{}.":"此函数用于为给定效果类型创建新的 FX 结构，然后可以{}应用于层{}。",
    "This means that to use a specific filter/effect at runtime, it must have either been added into a room first (so GameMaker knows you are going to use it) or specified explicitly in an {}{}fx_create(){}{} call.":"这意味着要在运行时使用特定的过滤器/效果，必须首先将其添加到房间(因此 GameMaker 知道要使用它)，或者在{}{}fx_create(){}{}调用中明确指定。",
    "To ensure that this function works properly, make sure the FX you need is loaded into your game package,&nbsp;as&nbsp;explained on the&nbsp;{}Filter and Effect Functions{}&nbsp;page:":"为确保此功能正常工作，请确保将所需的 FX 加载到游戏包中，如{}筛选器和效果函数{}页面所述：",
    "Usage":"用途",
    "You can read the parameters for the created effect by calling {}{}fx_get_parameter{}{}/{}{}s{}{}&nbsp;on the returned struct, and assign new values to them by calling {}{}fx_set_parameter{}{}/{}{}s{}{}.":"您可以通过在返回的结构上调用{}{}fx_get_parameter{}{}/{}{}s{}{}来读取所创建效果的参数，并通过调用{}{}fx_set_parameter{}{}/{}{}s{}{}为它们分配新值。"
}