{
    "Basic Code Structure":"基本代码结构",
    "Code is written in&nbsp;{}blocks{}&nbsp;and a typical&nbsp;code block consists of a set of instructions, called {}statement{}{}s{}, that are then interpreted by {}GameMaker{} and used to make something happen within your game. That \"something\" can be as simple as adding 2 and 2 to get 4, or as complex as making an enemy run away when their health gets below a certain value. The actual structure of the program can vary greatly, depending on the functions it uses, but broken down to basics it just looks like this:":"代码以{}块{}形式写入，典型的代码块由一组名为{}语句{}{} {}的指令组成，然后由{}GameMaker{}解释并用于在游戏中实现某些操作。\"某事\"可以简单到加2和2得到4，或者复杂到让敌人在他们的健康状况低于一定值时逃跑。程序的实际结构可能会有很大差异，具体取决于它使用的功能，但细分到基本功能时，它只是看起来如下所示：",
    "Here is a more visual representation of how a code block can look, this time created as a {}script{} in the {}GameMaker{} {}Script Editor{}:":"以下是代码块外观的更直观表示，这次在{}GameMaker{}{}脚本编辑器{}中创建为{}脚本{}：",
    "Statements should be separated with a \u0027;\u0027 symbol to prevent errors with {}variable{} declarations and to keep your code clean and tidy, and they can consist of variable declarations, {}expression{}{}s{} and calls to specific {}functions{}. You can also \"group\" statements together as a block using the curly brackets {}{}{} so that they run together, like in the following {}conditional{}&nbsp;example:":"语句应该用\u0027;\u0027符号分隔，以防止{}变量{}声明错误，并保持代码干净整洁，它们可以由变量声明、{}表达式{}{} {}和对特定{}函数{}的调用组成。你也可以使用花括号{}&#123;&#125;{}将语句“分组”成一个块，这样它们就可以一起运行，就像下面的{}条件{}示例:",
    "There are a number of different types of statements, expressions, conditionals and functions, all of which are discussed at length in subsequent sections of the manual.":"有许多不同类型的陈述、表述、条件和功能，所有这些都将在手册的后续章节中详细讨论。",
    "{}NOTE{}&nbsp;If you are new to programming then you may want to check out the {}Quick Start Guide{} before continuing.":"{}注意{}如果您是新编程人员，可能需要先查看{}《快速入门指南》{}，然后再继续。",
    "{}NOTE{}&nbsp;The GameMaker Language will also accept {}begin{}{}&nbsp;{}and {}end{}{}&nbsp;&nbsp;{}instead of the curly brackets {}{}{}, although this is not typically the most common way to do it:":"{}注意{}  GameMaker语言也将接受 {}begin{}{} {} {}和{}end{}{}  {}，而不是花括号{}&#123;&#125;，尽管这不是典型的最常见的方法:"
}