{
    "Apart from comments you can also use special {}#region{} tags to mark a section of code for {}Code Folding{},&nbsp;and each region can contain a comment.&nbsp;How this works is that you add a {}#region{} tag&nbsp;- along with any comment text -&nbsp;to the top of a section of code and then add a corresponding {}#endregion{} tag to the bottom of the section and then you can \"fold\" the code, ie: hide it away so you can cut down on the number of lines of code visible in the editor at any one time:":"除了注释，您还可以使用特殊的{}#region{}标记{}代码折叠{}的一段代码，并且每个区域可以包含一个注释。这是如何工作的，你添加一个{}#region{}标签 -以及任何注释文本-到一段代码的顶部，然后添加一个相应的{}#endregion{}标签到该部分的底部，然后你可以“折叠”代码，即:隐藏它，这样你可以减少在编辑器中可见的代码行数:",
    "Commenting Code":"代码注释",
    "Finally, if you are writing {}script functions{} and want to have some control over how they are treated by the IDE (ie: have auto-complete or show the script parameters) then you should be writing your comments using JSDoc notation as explained {}here{}.":"最后，如果您正在编写{}脚本函数{}，并希望对Ide(即自动完成或显示脚本参数)如何处理它们进行一些控制，则应使用JSDoc表示法编写注释，如此处{}所述。",
    "Finally, it\u0027s worth mentioning that when working with events in the {}Object Editor{}, you can use a special \"{}description{}\" comment at the start of the event to say what the general contents of the event are, and this will show in the Object Editor events window. This should go on the very first line of the code editor, and is formatted as follows:":"最后，值得一提的是，在{}对象编辑器{}中处理事件时，可以在事件开始时使用特殊的\"{}描述{}\"注释来说明事件的常规内容，这将在\"对象编辑器\"(Object Editor)事件窗口中显示。这应该出现在代码编辑器的第一行，格式如下：",
    "This will now be shown in the event window, eg:":"这将显示在事件窗口中，例如：",
    "To leave a simple one-line comment, the first thing you can do is use&nbsp;{}{}{}//{}{}{} before the text. For example:":"要留下简单的单行注释，首先可以在文本之前使用{}{}{}//{}{}{}。例如：",
    "When working in collaboration with other people, when dealing with a large project, or even just for your own reference and debugging, leaving comments in your event code and scripts is very important. In {}GameMaker{} you have various mechanisms to help you leave notes and comments about code sections and even whole blocks of code that can be seen in the event list of the object that you are currently editing. In this way you can leave notes to yourself and to your colleagues, or to explain a particularly tricky piece of code, or even just leave a reminder about what something does, or what you want something to do in the future.":"在与其他人协作时，在处理大型项目时，甚至只是为了自己的参考和调试时，在事件代码和脚本中留下注释非常重要。在{}GameMaker{}中，您可以通过各种机制帮助您留下有关代码部分的注释和评论，甚至可以在当前正在编辑的对象的事件列表中看到整个代码块。通过这种方式，你可以给自己和同事留下笔记，或者解释一段特别棘手的代码，甚至只是留下一个关于某些事情的提醒，或者你希望将来做什么的提醒。",
    "You may also leave multi-line comments, to give credit, to omit a complete section of code for debugging, or even to leave notes about how you want to change the code in the future. For that you can use {}{}/* ... */{}{} like this:":"您还可以留下多行注释，以表扬、省略一段完整的代码以进行调试，或者甚至留下关于您将来想如何更改代码的注释。为此，您可以使用{}{}/*…*/{}{}如下:",
    "{}Note that you can define a default comment to be created for all events from the {}Object Editor Preferences{}.":"{}请注意，您可以从{}对象编辑器首选项{}中定义要为所有事件创建的默认注释。",
    "{}The actual code looks something like this:":"{}实际代码类似于以下内容："
}