{
    "Here is an outline of the structure of a function:":"以下是函数结构的大纲：",
    "In both of the above cases a function has the form of a function {}name{}, followed by the {}input {}argument{}{}s{}{} between brackets {}(){} and separated by commas (if the function has no input arguments then just brackets are used). This page concentrates on the {}runtime functions{}&nbsp;(ie: the ones that are built-in to GameMaker to form the GameMaker Language), but the general rules shown below follow for all function types.":"在上述两种情况下，函数的形式都是函数{}名称{}，后面是{}输入{}参数{}{} {}{}，中间是括号{}(){}，中间用逗号分隔(如果函数没有输入参数，则只使用方括号)。本页面主要关注{}运行时函数{}(即:内置到GameMaker中形成GameMaker语言的函数)，但下面所示的通用规则适用于所有函数类型。",
    "In {}GameMaker{} this translates into two different things, but they both work the same way:":"在{}GameMaker{}中，这将转换为两种不同的方式，但它们的工作方式相同：",
    "Runtime Functions":"运行时函数",
    "Some functions can return values and can be used in {}expression{}{}s{}, while others simply execute commands, as illustrated in the following two runtime function examples:":"某些函数可以返回值并可以在{}表达式{}{} {}中使用，而其他函数只是执行命令，如以下两个运行时函数示例所示：",
    "Sometimes the return value of a function may be a value that you want to use in an {}assignment{}, but you&nbsp;should note that it is impossible to use any function {}directly{}&nbsp;as the left-hand side of an assignment. For example, the following code to set the speed on an instance would give you an error:":"有时，函数的返回值可能是要在{}赋值{}中使用的值，但应注意，不可能直接将任何函数{}用作赋值的左侧。例如，以下用于设置实例速度的代码将给出错误消息：",
    "The general definition of a function is something like this:":"函数的一般定义如下：",
    "The return value for the expression in that code example is an integer number (the unique ID value for the nearest instance) and so it must be enclosed in brackets to be used in this way and properly address the instance required (see&nbsp;{}Addressing Variables In Other Instances{} for more information). The above code would be correctly written as:":"该代码示例中表达式的返回值是一个整数(最近实例的唯一Id值)，因此必须将其括在括号中才能以这种方式使用并正确处理所需的实例(有关详细信息，请参阅{}其他实例中的处理变量{})。上述代码将正确写入为：",
    "The {}Language Reference{} section of the manual lists all of the runtime functions available to you and gives examples of how they can be used as well as other important information about what they may return or any events that they may trigger, etc... For more information on user defined script functions and methods, see the section on {}Script Functions{} and the section on&nbsp;{}Method Variables{}.":"本手册的{}语言参考{}部分列出了所有可用的运行时函数，并举例说明如何使用这些函数，以及它们可能返回的内容或可能触发的任何事件等其他重要信息...有关用户定义的脚本函数和方法的详细信息，请参阅{}脚本函数{}一节和{}方法变量{}一节。",
    "{}// Destroy the calling instance{}{}\n    {}// This requires no arguments and returns nothing{}{}\n    {}instance_destroy{}();{}\n    {}\n    {}// Get the distance from the current instance position to the mouse position{}{}\n    {}// This takes four arguments and returns a real value{}{}\n    dist = {}point_distance{}({}x{}, {}y{}, {}mouse_x{}, {}mouse_y{});\n  ":"{}// 销毁调用实例{}{}\n    {}// 这不需要也不返回任何参数，{}{}\n    {}instance_destroy{}();{}\n    {}\n    {}// 获取从当前实例位置到鼠标位置距离{}{}\n    {}// 这需要四个参数并返回一个real值{}{}\n    dist = {}point_distance{}({}x{}, {}y{}, {}mouse_x{}, {}mouse_y{});\n  ",
    "{}A function has an input and an output, and the output is related to the input.{}":"{}函数具有输入和输出，输出与输入相关。{}",
    "{}NOTE{}&nbsp;Anywhere the manual has \"N/A\" as a return value for a function, it means that the function is not meant to return any value as part of its operation. If you try to check for a return value from these functions then you will get the value {}undefined{}.&nbsp;":"{}注意{}如果手册中有\"N/A\"作为函数的返回值，则表示该函数并不意味着在其操作过程中返回任何值。如果您尝试检查这些函数的返回值，则会得到未定义的值{}。",
    "{}Runtime Functions{} - A {}runtime{} function is one that is supplied as part of the {}GameMaker Language{} (GML). These are built in to the language and can be used to make things happen in your games and there are a great number of GML runtime functions available to you, all of which are explained in the {}Language Reference{} section of the manual.":"{}运行时函数{} -{}运行时函数(Runtime Functions){}是作为{}GameMaker语言{}(GML)的一部分提供的函数。这些都是语言内建的，可以用来让你的游戏发生变化，你可以使用大量的GML运行时函数，所有这些都在手册的{}语言参考{}部分进行了解释。",
    "{}Script Functions And Methods&nbsp;{}- {}{}Script {}{}functions{}{}&nbsp;and&nbsp;{}{}M{}{}ethod Variables{}{}&nbsp;are&nbsp;functions that you have created yourself using the basic building blocks of the&nbsp;{}GameMaker Language{}&nbsp;(GML), and these can include runtime functions as part of their code.":"{}脚本函数和方法 {}-{}{}脚本{}{}函数{}{} 和 {}{}方法变量{}{}{}{} 是你自己用 {}GameMaker语言{} (GML)的基本构建块创建的函数，这些函数可以包括运行时函数作为它们代码的一部分。"
}