{
    "A good \"real world\" example of a variable is the speed of something, e.g. the speed of a car. A car\u0027s speed is clearly&nbsp;{}variable{}, because at some point in time the car will be standing still (i.e. its speed is equal to 0), at another point in time the car will be driving (i.e. its speed is greater than 0). When the car accelerates or slows down, its speed changes. So it makes sense that if you want to store the car\u0027s speed in a&nbsp;{}GameMaker{} game that you store it in a {}variable{}. In the game, you\u0027d e.g. set the variable to 0 when the game starts and change it whenever you want the car to change its speed.":"一个很好的\"真实的世界\"变量的例子是某物的速度，例如：汽车的速度。汽车的速度显然是{}可变的{}，因为在某个时间点，汽车将静止不动(即其速度等于0)，在另一时间点汽车将行驶(即，其速度大于0)。当汽车加速或减速时，它的速度会改变。因此，如果您想在{}GameMaker{}游戏中存储汽车的速度，则可以将其存储在{}变量{}中。在游戏中，你可以。当游戏开始时，将变量设置为0，并在您希望汽车改变其速度时更改它。",
    "A variable in {}GML{} can store many different {}Data Types{}, like a real number (e.g.: 100, 2.456575, -56, etc.), a string (e.g.: \"Hello world!\"), an integer (e.g.: 1, 556, -7), or a boolean ({}true{} or {}false{}), as well as other things:":"{}GML{}中的变量可以存储许多不同的{}数据类型(Data Types){}，例如实数(例如：100、2.456575、-56等)、字符串(例如：\"Hello world！\")、整数(例如：1，556，-7)，或布尔值({}true{}或{}false{})，以及其他东西：",
    "A variable in {}GML{} can store many different {}Data Types{}, like a real number (e.g.: {}100{}, {}2.456575{}, {}-56{}, etc.), a string (e.g.: {}\"Hello world!\"{}), an integer (e.g.: {}1{}, {}556{}, {}-7{}), or a boolean&nbsp;({}true{} or {}false{}), as well as other things:":"{}GML{}中的变量可以存储许多不同的{}数据类型{}，例如实数(例如：{}100{}、{}2.456575{}、{}-56{}等)、字符串(例如：{}\"Hello world!\"{})、整数(例如：{}1{}、{}556{}、{}-7{})或布尔值({}true{}或{}false{})，以及其他内容：",
    "An expression can be a simple value but can also be more complicated, so, rather than assigning a value to a variable, one can also add a value to the current value of the variable using {}{}+={}{}, for example:":"表达式可以是简单的值，但也可以更加复杂，因此，与其为变量赋值，还可以使用{}{}+={}{}将值添加到变量的当前值，例如：",
    "An expression can be a simple value but can also be more complicated, so, rather than assigning a value to a variable, you can also add a value to the current value of the variable using {}+={},&nbsp;for example:":"表达式可以是一个简单的值，也可以是更复杂的值，因此，您可以使用{}+={}将值添加到变量的当前值，而不是给变量赋值，例如：",
    "And examples of built-in global variables are:":"内置全局变量的例子有：",
    "And examples of built-in global variables would be:":"内置全局变量的示例如下：",
    "And instead it should be done as:":"相反，应该按如下方式进行：",
    "Assignment and Naming Rules":"分配和命名规则",
    "Built-in Variables":"内置变量",
    "By default, when you assign variables in&nbsp;{}Object Events{}, you assign them to&nbsp;{}instance {}variables, however there are actually four other main variable types when you program with {}GameMaker{}, each with its own {}scope{}.":"默认情况下，当您在{}对象事件{}中分配变量时，您会将它们分配给{}实例{}变量，但当您使用{}GameMaker{}编程时，实际上还有四种其他主要变量类型，每种类型都有自己的{ }范围{}。",
    "Changing Scope":"改变范围",
    "Constants":"常量",
    "Examples of built-in instance variables are:":"内置实例变量的示例有：",
    "Finally, there are a number of functions that are dedicated to setting, getting or checking variables in some way, available from the following page:":"最后，还有一些专门用于设置、获取或以某种方式检查变量的函数，可从以下页面获得：",
    "Global Variables":"全局变量",
    "In GML, like in many programming languages, you first have to create a variable \"assignment\" before you can use it. This basically means that you tell the computer the name you wish to use for the variable and assign it an initial value. The variable is then given a place in memory to store the value or perform operations on it. A variable assignment takes the form:":"在 GML 中，与许多编程语言一样，您首先必须创建一个变量\"赋值\"，然后才能使用它。这基本上意味着您告诉计算机您希望用于变量的名称并为其分配初始值。然后，变量在内存中被赋予一个位置来存储值或对其执行操作。变量赋值采用以下形式：",
    "Instance Variables":"实例变量",
    "Like any programming language {}GML{} uses {}variables{} as the basic unit for most programming operations. Variables are used to store information in the devices memory for later (or instant) use, and they are given a name so that you can refer to them in runtime and script functions. A variable in {}GML{} can store many different {}{}data types{}{}, like a real number (eg: 100, 2.456575, -56 etc...), a string (eg: \"Hello world!\"), an integer (eg: 1, 556, -7), or a boolean ({}true{} or {}false{}), as well as other things:":"与任何编程语言{}一样，GML {}使用{}变量{}作为大多数编程操作的基本单位。变量用于将信息存储在设备内存中供以后(或即时)使用，并且为它们指定了一个名称，以便您可以在运行时和脚本函数中引用它们。{}GML {}中的变量可以存储许多不同的{}{}数据类型{}{}，如实数(例如：100、2.456575、-56等等，字符串(例如：\"Hello world！\")，整数(例如：1, 556,-7 )或布尔值({}true{}或{}false{})，以及其他内容：",
    "Local Variables":"局部变量",
    "Most built-in variables can be changed and set like other variables, and some can even be {}Arrays{}, only you don\u0027t have to set them to create them like you would a regular variable as they will already be initialised to a default value.":"大多数内置变量都可以像其他变量一样进行更改和设置，有些甚至可以是{}数组(Arrays){}，只是你不必像创建常规变量那样设置它们，因为它们已经被初始化为默认值。",
    "Most built-in variables can be changed and set like other variables, and some can even be {}arrays{}, only you don\u0027t have to set them to create them like you would a regular variable as they will already be initialised to a default value.":"大多数内置变量可以像其他变量一样进行更改和设置，有些变量甚至可以是{}数组{}，只是您不必像创建常规变量那样设置它们，因为它们已经初始化为默认值。",
    "Note that you {}cannot{} do the following (or any variation):":"请注意，您{}无法{}执行以下操作(或任何变更)：",
    "Now, In many programming languages you need to create a variable \"assignment\" before you can use it. This basically means that you tell the computer the name you wish to use for the variable and assign it an initial value. The variable is then given a place in memory to store the value or perform operations on it. Assigning a variable takes the form of:":"现在，在许多编程语言中，您需要创建一个\"变量\"赋值才能使用它。这基本上意味着您告诉计算机要用于变量的名称，并为其指定初始值。然后在内存中为变量指定一个存储值或对其执行操作的位置。赋值变量的形式为：",
    "Now, in many programming languages you need to create a variable \"assignment\" before you can use it. This basically means that you tell the computer the name you wish to use for the variable and assign it an initial value. The variable is then given a place in memory to store the value or perform operations on it. Assigning a variable takes the form of:":"现在，在许多编程语言中，您需要在使用变量之前创建变量\"赋值\"。这基本上意味着您告诉计算机您希望用于变量的名称，并为其分配一个初始值。然后在内存中为变量指定一个位置，以存储值或对其执行操作。分配变量的形式为：",
    "See&nbsp;{}Addressing Variables In Other Instances{}&nbsp;for detailed information.":"有关详细信息，请参阅{}在其他实例中寻址变量{}。",
    "Similarly, you can subtract using {}-={},&nbsp;multiply using {}*={},&nbsp;divide using {}/={}, or use bitwise operators using {}|={}, {}&amp;={},&nbsp;or {}{}^={}{}. You can also add or subtract {}one{} from a value using {}{}++{}{}, {}{}--{}{}. For further information see the section on {}Expressions And Operators{}.":"同样，您可以使用{}-={}进行减法，使用{}*={}进行乘法，使用{}/={}除法，或者使用{}|={}、{}&amp;={}进行按位运算符，或{}{}^={}{}。您还可以使用{}{}++{}{}、{}{}--{}{}在值中添加或减去{14}一{15}。如需了解更多信息，请参阅{}表达式和运算符{}部分。",
    "Similarly, you can subtract using {}{}-={}{}, multiply using {}{}*={}{}, divide using {}{}/={}{}, or use bitwise operators using {}{}|={}{}, {}{}&amp;={}{}, or {}{}^={}{}. You can also add or subtract {}one{} from a value using {}{}++{}{}, {}{}--{}{}. For further information see the section on {}Expressions And Operators{}.":"类似地,您可以使用减 {}{}-={}{}, 乘 {}{}*={}{}, 除 {}{}/={}{}, 或者使用位操作符使用 {}{}|={}{}, {}{}& ={}{},或 {}{}^={}{}.您还可以使用{}{}{}{}++{}{}, {}{}--{}{}从一个值添加或减去1。有关更多信息，请参见{}表达式和运算符{}一节。",
    "So, a variable is something that we can name and use to store a value for later use in one or more operations.":"因此，变量是我们可以命名并用于存储值以供以后在一个或多个操作中使用的东西。",
    "So, a variable is something that we can name and use to store a value for later use in one or more operations. A great \"real world\" example of a variable is {}pi&nbsp;𝜋&nbsp;{}... it is a variable that everyone knows and it holds the value 3.14159265(etc...). Why do we have it in our language? Well, it\u0027s much easier to say to someone \"pi\" than \"three point one four one five nine two six five\"! Naming things like this makes life a lot simpler and it also means that should the value of that variable ever change, we don\u0027t have to change the number everywhere as the variable {}name{} is still the same.":"因此，变量是我们可以命名并用于存储值的对象，以便以后在一个或多个操作中使用。变量的一个很好的\"真实世界\"示例是{}pi 𝜋{}...它是一个变量，每个变量都知道并保留值3.14159265(等等...)。为什么我们有我们的语言？好吧，对某人说\"pi\"比\"3点14159265\"要容易得多！这样命名会使生活变得简单许多，这也意味着如果该变量的值发生变化，我们不必随处更改数字，因为变量{}名称{}仍然相同。",
    "Static Variables":"静态变量",
    "The GameMaker Language also has multiple different built-in variables that can have any of the above mentioned scopes (except {}local{}). These variables are special as they are included by default as part of the objects and the rooms in the game world. Some built in global variables are listed in the section mentioned above, and the different parts of the manual for sprites, rooms, objects, etc. also outline the built-in variables available in each case.":"GameMaker语言也有多个不同的内置变量，这些变量可以具有上述任何作用域({}局部(local){}除外)。这些变量是特殊的，因为它们默认作为游戏世界中的对象和房间的一部分被包括在内。一些内置的全局变量列在上面提到的章节中，以及手册中关于精灵、房间、对象等的不同部分。还概述了在每种情况下可用的内置变量。",
    "The GameMaker Language also has multiple different built-in variables that can have any of the above mentioned scopes (except {}local{}). These variables are special as they are included by default as part of the objects and the rooms in the game world. Some built in global variables are listed in the section mentioned above, and the different parts of the manual for sprites, rooms, objects, etc... also outline the built-in variables available in each case. Examples of such built-in instance variables would be:":"GameMaker语言还具有多个不同的内置变量，这些变量可以具有上述任何范围({}local{}除外)。这些变量是特殊的，因为默认情况下它们是游戏世界中对象和房间的一部分。上述部分列出了一些内置的全局变量，手册中针对精灵、房间、对象等的不同部分也概述了每种情况下可用的内置变量。此类内置实例变量的示例如下：",
    "The GameMaker Language has multiple different built-in variables that can have any of the above-mentioned scopes (except {}local{}). These variables are special as they are included by default as part of the objects and the rooms in the game world. Some built-in global variables are listed in the section mentioned above, and the different parts of the manual for sprites, rooms, objects, etc., also outline the built-in variables available in each case.":"GameMaker 语言具有多个不同的内置变量，这些变量可以具有任何上述范围({}本地{}除外)。这些变量很特殊，因为它们默认包含在游戏世界中的对象和房间中。上面提到的部分列出了一些内置全局变量，手册中针对精灵、房间、对象等的不同部分也概述了每种情况下可用的内置变量。",
    "The different kinds of variables and their scope are all outlined in the following pages:":"以下几页概述了不同类型的变量及其范围：",
    "The dot operator,&nbsp;e.g. {}a.b{}, which means \"the variable&nbsp;{}b{}&nbsp;of&nbsp;{}a{}\".":"点运算符，例如{}a.b{}，表示\"{}a{}的变量{}b{}\"。",
    "The variable assignments shown above are all {}instance {}variables, however there are actually four other main variable categories when you program with {}GameMaker{} and each has its own {}scope {}(which can be considered as its area of operation, or reach). The different kinds of variables and their scope are all outlined in the following pages:":"上面显示的变量赋值都是{}实例(instance){}变量，但是当你用{}GameMaker{}编程时，实际上还有四个其他的主要变量类别，每个变量类别都有自己的{}作用域{}(这可以被认为是它的操作区域，或范围)。不同类型的变量及其作用域都在下面的页面中概述：",
    "The variable assignments shown above are all {}instance {}variables, however there are actually three other main variable categories when you program with {}GameMaker{} and each has its own {}scope {}(which can be considered as its area of operation, or reach). The different kinds of variables and their scope are all outlined in the following pages:":"上面显示的变量赋值是所有{}实例{}变量，但是当您使用{}GameMaker{}进行编程并且每个变量都有自己的{}范围{}(可视为其操作区域或到达范围)时，实际上还有其他三个主要变量类别。以下各页概述了不同类型的变量及其范围：",
    "The variable {}a{} can be either an instance or a struct. You can also use one of the&nbsp;{}Instance Keywords{}&nbsp;or the {}global{} keyword.":"变量{}a{}可以是实例，也可以是结构体。您还可以使用{}实例关键字{}或{}全局{}关键字之一。",
    "The&nbsp;{}with{} statement, e.g. {}with(a) {b = 10;}{}, which means \"execute the following lines of code in {}a{}\".":"{}with{}语句，例如{}with(a){b = 10;}{}，表示\"执行{}a{}中的以下代码行\"。",
    "They are used to store information in the device\u0027s memory for later (or instant) use, and given a name so you can refer to them in {}runtime{} and {}script functions{}.":"它们用于将信息存储在设备内存中以供以后(或即时)使用，并指定名称，以便您可以在{}运行时{}和{}脚本函数{}中引用它们。",
    "Types of Scope":"范围类型",
    "Variable Functions":"变量函数",
    "Variable Scope":"变量作用域",
    "Variable scope tells which part of your code a variable belongs to, it is determined by where you first define&nbsp;it in your code. Variable scope also tells from where in your code you can access it. If you need to access variables that are in a different scope, you can change the scope.":"变量作用域告诉变量属于代码的哪一部分，它由您在代码中首先定义它的位置决定。变量作用域还告诉您可以从代码中的何处访问它。如果需要访问不同作用域中的变量，可以更改作用域。",
    "Variables And Variable Scope":"变量和变量范围",
    "Variables are the basic unit for most programming operations. Like any programming language,&nbsp;{}GML{} uses them.":"变量是大多数编程操作的基本单位。与任何编程语言一样，{}GML{}使用它们。",
    "When forming variables in {}GML{} it must have a name that starts with a letter or the underscore symbol \"_\" and can contain only letters, numbers, and the underscore symbol \u0027_\u0027 with a maximum length of 64 symbols. So, valid variables are things like {}fish{}, {}foo_bar{}, {}num1{}, or {}_str{}, while invalid variables would be {}6fish{}, {}foo bar{}, or {}*num{}.":"在{}GML {}中构成变量时，名称必须以字母或下划线符号\"_\"开头，并且只能包含字母、数字和下划线符号\"_\"，最大长度为64个符号。因此，有效变量包括{}fish{}、{}foo_bar{}、{}num 1{}或{}_str{}，而无效变量为{}6 fish{}、{}foo bar{}或{} *num{}。",
    "When forming variables in {}GML{}&nbsp;they must have a name that starts with a letter or the underscore symbol \"_\" and can contain only letters, numbers, and the underscore symbol \u0027_\u0027 with a maximum length of 64 symbols. So, valid variables are things like {}fish{}, {}foo_bar{}, {}num1{}, or {}_str{}, while invalid variables would be {}6fish{}, {}foo bar{}, or {}*num{}.":"在{}GML{}中分配变量时，变量的名称必须以字母或下划线符号\"_\"开头，并且只能包含字母、数字和下划线符号\"_\"，最大长度为64个符号。因此，有效变量是{}fish{}、{}foo_bar{}、{}num 1{}或{}_str{}，而无效变量是{}6 fish{}、{}foo bar{}或{}*num{}。",
    "When forming variables in {}GML{}&nbsp;they must have a name that starts with a letter or the underscore symbol {}_{} and can contain only letters, numbers, and the underscore symbol {}_{} with a maximum length of 64 symbols. So, valid variable names are things like {}fish{}, {}foo_bar{}, {}num1{}, or {}_str{}, while invalid ones would be {}6fish{}, {}foo bar{}, or {}*num{}.":"在{}GML{}中形成变量时，它们的名称必须以字母或下划线符号{}_{}开头，并且只能包含字母、数字和下划线符号{}_{}，最大长度为64 个符号。因此，有效的变量名称为{}fish{}、{}foo_bar{}、{}num1{}或{}_str{}，而无效的变量名称为{}6fish{}、{}foo bar{}，或{}*num{}。",
    "You can access variables in a different scope in two ways:&nbsp;":"您可以通过两种方式访问​​不同范围内的变量：",
    "You can also use variables to hold the values returned from functions, for example:":"也可以使用变量保存从函数返回的值，例如：",
    "room":"room",
    "{}NOTE{}&nbsp;The GameMaker Language will also accept \"{}:={}\" for assignments, although this is not typically the most common way to do it:":"{}注意{}GameMaker语言还将接受\"{}:={}\"作为赋值，尽管这通常不是最常用的方法：",
    "{}NOTE{}&nbsp;The GameMaker Language will also accept {}:={}&nbsp;for assignments, although this is not typically the most common way to do it:":"{}注意{}GameMaker 语言还将接受{}:={}进行分配，尽管这通常不是最常见的方法：",
    "{}Variables And Variable Scope{}":"{}变量和变量作用域{}",
    "{}Variables{} are the basic unit for most programming operations. Like any programming language,&nbsp;{}GML{} uses them.":"{}变量{}是大多数编程操作的基本单位。像任何编程语言一样，{}GML{}使用它们。",
    "{}{}NOTE{}{}&nbsp;Constants aren\u0027t \"true\" variables since they\u0027re replaced by their underlying value by the&nbsp;{}Compiler{}&nbsp;and don\u0027t exist as variables in-game.":"{}{}注意{}{}常量不是\"真正的\"变量，因为它们会被{}编译器{}替换为其基础值，并且在游戏中不作为变量存在。",
    "{}{}instance_count{}{}":"{}{}instance_count{}{} 实例数量",
    "{}{}path_scale{}{}":"{}{}path_scale{}{} 路径缩放",
    "{}{}room{}{}":"{}{}room{}{} 房间",
    "{}{}speed{}{}":"{}{}speed{}{} 速度",
    "{}{}sprite_index{}{}":"{}{}sprite_index{}{} 精灵索引",
    "{}{}view_xport{}{}":"{}{}view_xport{}{} 视口x坐标"
}