{
    "A DS grid is basically a type of{}&nbsp;{}array{} with 2 dimensions{}. You define the grid by setting its integer width and height, which then sets the total number of \"cells\" within the grid (the width and height multiplied) and these cells are then used to hold different data values (real numbers or strings).":"Ds网格基本上是具有2个维度{}的{}{}数组{}的类型。您可以通过设置网格的整数宽度和高度来定义网格，然后设置网格中\"单元格\"的总数(宽度和高度的乘积)，这些单元格将用于保存不同的数据值(实数或字符串)。",
    "Apart from the specific functions listed below you can all use an {}expression{} (called an {}accessor{}) to add or modify the contents of your DS grid. This accessor looks similar to a 2D array with the following syntax:":"除了下面列出的特定函数外，您还可以使用{}表达式{}(称为{}访问器{})来添加或修改D网格的内容。此存取器类似于2D阵列，具有以下语法：",
    "The following functions exist that deal with DS grids:":"存在以下处理D网格的函数：",
    "When accessing DS grid data structures, you should always try to use {}integer values{} for the cell position, and all non-integer indices will be floored by {}GameMaker{} if you do not. If that is not what you require, then you will need to do the rounding yourself previously before passing the index that you wish to check.":"访问D的网格数据结构时，应始终尝试对单元格位置使用{}个整数值{}，否则{}GameMaker{}将泛洪所有非整数索引。如果这不是您所需要的，那么在传递要检查的索引之前，您需要先进行舍入。",
    "You can find more information, plus examples, from from the GML Overview page on {}Accessors{}.":"您可以从{}访问者{}的GML 概述页面中找到更多信息和示例。",
    "{}This type of structure allows you to set and retrieve the value of cells in the grid by giving the x and y index of it (which starts with 0 for both the x and the y axis and goes up to the width - 1 and the height -1). But you can also set the value in specific grid regions, add single values, and retrieve the sum, maximum, minimum, and mean value over a given region, making this data structure the most versatile of all those available to you.":"{}这种类型的结构允许您通过给出网格中单元格的x和y索引来设置和检索网格中单元格的值(x和y轴从0开始，直到width-1和height-1)。但是，您也可以在特定的栅格区域中设置值，添加单个值，并检索给定区域上的和、最大值、最小值和平均值，从而使此数据结构成为您可用的所有数据结构中函数最丰富的。",
    "{}{}NOTE{} {}As with all dynamic resources, data structures take up memory and so should {}always{} be destroyed when no longer needed to prevent memory leaks which will slow down and eventually crash your game.":"{}{}注意{}{}与所有动态资源一样，数据结构占用内存，因此当不再需要{}防止内存泄漏时，应始终销毁{}，这将降低速度并最终导致游戏崩溃。",
    "{}{}NOTE{}{} if you need to check if a data structure exists, you can use the {}{}{}ds_exists(){}{}{} function.":"{}{}注意{}{}如果需要检查是否存在数据结构，可以使用{}{}{}ds_exists(){}{}{}函数。"
}