{
    "Add a video file to the {}Included Files{} ({}/datafiles{} directory) of your project.":"将视频文件添加到项目的{}包含文件{}({}/数据文件{}目录)。",
    "Async Callbacks":"异步回调",
    "Draw it in a Draw event using {}{}video_draw(){}{}. {} {}This functions draws the video to an internal surface, which it returns as part of its return array.{} {}You must draw that surface manually using {}{}draw_surface(){}{} for the video to appear. {} {}Drawing&nbsp;{}YUV Videos{}&nbsp;will require extra steps.{} {} {} {} ":"使用{}{}video _draw(){}{}在绘图事件中绘制它。{}{}此函数将视频绘制到内部曲面，并将其作为返回数组的一部分返回。{}{}要显示视频，必须使用{}{}draw_surface(){}{}手动绘制该曲面。{}{}绘图{}Yuv视频{}将需要额外的步骤。{}{}{}{}",
    "Follow these steps to load videos at runtime and play them:":"按照以下步骤在运行时加载和播放视频：",
    "For distribution on console platforms, check with your account representative to find out what formats you are allowed to use without having to pay extra licencing fees.":"对于在控制台平台上的分发，请咨询您的客户代表，了解您可以使用哪些格式，而无需支付额外的许可费用。",
    "Formats":"格式",
    "Functions":"函数",
    "Here is an example of an Async Social event listening to video callbacks:":"以下是Async Social事件监听视频回叫的示例：",
    "How to play videos?":"如何播放视频？",
    "Load the video using {}{}video_open(){}{}. {} {}Alternatively, load a video from a URL.{} {} ":"使用{}{}video _open(){}{}加载视频。{}{}或者，从URL加载视频。{}{}",
    "Making use of certain formats may require you to pay licensing fees depending on the related codec\u0027s licence and your game\u0027s revenue, and in such a case, the developer will be legally liable for any fees that is to be paid to the codec owners. Codecs are also licensed differently on each platform and so care must be taken for games that are distributed on multiple platforms.":"使用某些格式可能需要根据相关编解码器的许可证和游戏的收入来支付许可费，在这种情况下，开发者将对支付给编解码器所有者的任何费用承担法律责任。编解码器在每个平台上的授权也不同，因此必须注意在多个平台上分发的游戏。",
    "Note that video formats (such as {}.mp4{}, {}.avi{}, {}.mkv{},&nbsp;etc.) are simply containers that wrap {}video{} and {}audio{} streams, both of which may be encoded separately and may require separate licences.":"请注意，视频格式(如{}.mp 4{}、{}.avi{}、{}.mkv{}等)只是包装{}视频{}和{}音频{}流的容器，这两种格式可以单独编码，并且可能需要单独的许可证。",
    "The above code reads the type from the {}async_load{} map. When the video starts, it sets a variable in an object to {}true{}, so it can display the video.":"以上代码从{}async_load{}映射读取类型。视频启动时，会将对象中的变量设置为{}true{}，以便可以显示视频。",
    "The following functions are used to get information about the currently loaded video:":"以下函数用于获取有关当前加载的视频的信息：",
    "The video formats that you are able to load and play in your game will depend on your target platform, and the codecs that are supported on that platform.":"您可以在游戏中加载和播放的视频格式将取决于您的目标平台以及该平台支持的编解码器。",
    "The {}Async Social{} event is triggered at the stages given below, with the {}\"type\"{} key in its {}async_load{} map set to the given value:":"{}异步社交{}事件在下面给定的阶段触发，其{}async_load{}映射中的{}类型\"{}\"键设置为给定值：",
    "Video Codecs &amp; Licensing":"视频编解码器和许可",
    "When the video ends, it sets that same variable to {}false{}, and then calls {}{}video_close(){}{} to remove the video from memory.":"视频结束时，会将相同的变量设置为{}假{}，然后调用{}{}video_close(){}{}从内存中删除视频。",
    "When the video is finished, remove it from memory by calling {}{}video_close(){}{}. {} {}Use the {}Async Callbacks{} to run code when the video ends.{} {} ":"视频完成后，通过调用{}{}video_close(){}{}将其从内存中删除。{}{}使用{}异步回叫{}在视频结束时运行代码。{}{}",
    "You can load, play and manipulate video files at runtime using the following functions:":"您可以使用以下函数在运行时加载、播放和操作视频文件：",
    "{}\"video_end\"{}: When the video ends. This does not trigger when the video is {}set to loop{}.":"{}\" video _end\"{}:视频结束时。当视频{}设置为循环{}时，此操作不会触发。",
    "{}\"video_start\"{}: When the video starts playing, which is when its {}status{} changes from {}video_status_preparing{} to {}video_status_playing{}.":"{}\"video_start\"{}：当视频开始播放时，即其{}状态{}从{}视频状态准备{}变为{}视频状态播放{}。",
    "{}GameMaker{}&nbsp;does not ship with any codecs, and makes use of the codecs present on the platform that the game is running on. This means your videos must be encoded in a format that can be decoded on your intended target platform(s).":"{}GameMaker{}不随附任何编解码器，并使用运行游戏的平台上存在的编解码器。这意味着您的视频必须以可在目标平台上解码的格式进行编码。"
}