{
    "Once you have finished using the path, or wish to create a new one and store its reference in the same variable, you should first delete the old path with {}{}path_delete{}{} to prevent memory leaks which can eventually crash your game.":"一旦您使用完路径，或者希望创建一个新路径并将其引用存储在同一变量中，您应该首先使用 {}{}path_delete{}{} 删除旧路径，以防止内存泄漏，从而最终导致您的系统崩溃。游戏。",
    "Please note that the created path is {}empty{} i.e.: it has no points defined, so you will then have to use the {}other available functions{} to add points to the path or use&nbsp;{}MP grids{}&nbsp;to generate the path. It will be created as a \"closed\" path, which you can {}change{}.":"请注意，创建的路径是 {} 空 {}，即：它没有定义点，因此您必须使用 {} 其他可用函数 {} 向路径添加点或使用 {}MP 网格 {} 生成路径。它将被创建为 \" 封闭 \" 路径，您可以 {} 更改 {}。",
    "This function will return a reference to the path which should be stored in a variable and used in other path functions.":"该函数将返回对路径的引用，该引用应存储在变量中并在其他路径函数中使用。",
    "This will create a new path and assign its index to global.newpath.":"这将创建一个新路径，并将其索引分配给global.newPath.",
    "With this function you can create a path in {}GameMaker{} without using the path editor.":"通过此功能，您可以在 {}GameMaker{} 中创建路径，而无需使用路径编辑器。",
    "With this function you can create a path in {}GameMaker{} without using the path editor. This function will return the index of the path which should be stored in a variable and used as the reference for that path from then on. Please note that the created path is {}empty{} ie: it has no points defined, so you will then have to use the {}other available functions{} to add points to the path or be using {}MP grids{}&nbsp;to generate the path. Once you have finished using the path, or wish to create a new one and store its index in the same variable you should first delete the old path with {}{}path_delete{}{} to prevent memory leaks which can eventually crash your game.":"使用此函数，您可以在{}GameMaker{}中创建路径，而无需使用路径编辑器。此函数将返回路径的索引，该索引应存储在变量中，并从那时起用作该路径的引用。请注意，创建的路径是{}空的{}IE：它没有定义点，因此您必须使用{}其他可用函数{}来向路径添加点，或者使用{}MP网格{}来生成路径。一旦你完成了对路径的使用，或者希望创建一个新的路径并将其索引存储在相同的变量中，你应该首先用{}{}path_delete{}{}删除旧的路径，以防止内存泄漏，这最终会使你的游戏崩溃。"
}