{
    "An object instance\u0027s depth set through&nbsp;its&nbsp;{}{}depth{}{}&nbsp;variable.":"",
    "By default, the depth buffer is {}enabled{} in&nbsp;{}GameMaker{},&nbsp;which means that every surface is {}created{} with a depth buffer. This also applies to the&nbsp;{}{}application_surface{}{}, which is the surface that\u0027s drawn to by default.":"默认情况下，深度缓冲区在 {}GameMaker{} 中 {} 启用 {}，这意味着每个表面都是使用深度缓冲区 {} 创建 {} 的。这也适用于 {}{}application_surface{}{}，它是默认绘制的表面。",
    "Depth vs. Depth Buffer Depth":"深度与深度缓冲区深度",
    "For the default orthographic camera the values can be converted as follows:&nbsp;":"对于默认正交相机，可以按如下方式转换值：",
    "Like the surfaces they belong to, the depth and stencil buffer are also stored in video memory ({}VRAM{}).":"与它们所属的表面一样，深度和模板缓冲区也存储在视频内存 ({}VRAM{}) 中。",
    "The Depth Buffer":"深度缓冲区",
    "The depth and stencil buffer always exist together, i.e.: if a surface has a depth buffer, it also has a stencil buffer, if it has no depth buffer, it also has no stencil buffer.":"深度和模板缓冲区总是一起存在，即：如果一个表面有深度缓冲区，它也有一个模板缓冲区，如果它没有深度缓冲区，它也没有模板缓冲区。",
    "The depth and stencil buffer are two data buffers that are used for advanced graphical effects in both 2D and 3D games, which include&nbsp;shadow mapping, deferred rendering, volumetric rendering, ambient occlusion and many more.":"深度和模板缓冲区是两个数据缓冲区，用于 2D 和 3D 游戏中的高级图形效果，其中包括阴影贴图、延迟渲染、体积渲染、环境光遮挡等等。",
    "The depth buffer can be displayed as a grayscale image, where {}white{} (a value of 1) indicates the pixel is as far away as it can be (at the far plane) and {}black{} (a value of 0) indicates the closest pixel (at znear).":"深度缓冲区可以显示为灰度图像，其中 {} 白色 {}( 值为 1) 表示像素尽可能远 (在远平面)，{} 黑色 {}( 值为 1)0) 表示最近的像素 (在 znear 处)。",
    "The depth buffer stores the values after all transformations have been applied.&nbsp;{}{}draw_clear_depth{}{}&nbsp;can be used to reset all values in the depth buffer to any value between 0 (znear) and 1 (zfar).":"深度缓冲区存储应用所有变换后的值。{}{}draw_clear_depth{}{} 可用于将深度缓冲区中的所有值重置为 0(znear) 和 1(zfar) 之间的任何值。",
    "The depth buffer, also called z-buffer, is a graphics buffer created with the same dimensions as the surface that it\u0027s created for. It stores a 24-bit depth value for every pixel of the surface, which holds the distance away from the surface.":"深度缓冲区也称为 z 缓冲区，是一种图形缓冲区，其创建尺寸与其创建的表面相同。它为表面的每个像素存储一个 24 位深度值，该值保存距表面的距离。",
    "The depth buffer, which stores a depth value for every pixel of a surface (i.e. render target). This depth value is the fraction of the distance between the near plane and the far plane. A value of 0 corresponds to znear, a value of 1 corresponds to zfar. The value depends on the&nbsp;{}camera{}&nbsp;currently in use and its type of {}projection{} ({}perspective{} or {}orthographic{}).":"深度缓冲区，存储表面 (即渲染目标) 每个像素的深度值。该深度值是近平面和远平面之间距离的分数。值 0 对应于 znear，值 1 对应于 zfar。该值取决于当前使用的 {} 相机 {} 及其 {} 投影 {} 类型 ({} 透视 {} 或 {} 正交 {})。",
    "The depth value assigned to anything that\u0027s drawn, either automatically by&nbsp;{}GameMaker{}&nbsp;or manually using code. This can be:&nbsp; {} {}The layer depth of layers in&nbsp;{}The Room Editor{}.{} {}An object instance\u0027s depth set through&nbsp;its&nbsp;{}{}depth{}{}&nbsp;variable.{} {}The depth value you set manually in&nbsp;{}GML Code{}&nbsp;using&nbsp;{}{}gpu_set_depth{}{}.{} {} This depth is the z coordinate of the vertex that&nbsp;{}GameMaker{}&nbsp;writes to the vertex buffer, {}before{} any transformations have taken place on the vertex. (For any geometry drawn by&nbsp;{}GameMaker{}, this is the value stored in&nbsp;{}in_Position.z{}). {} {} ":"",
    "The layer depth of layers in&nbsp;{}The Room Editor{}.":"",
    "There are two different uses of the term depth in {}GameMaker{}:&nbsp;":"在 {}GameMaker{} 中，术语深度有两种不同的用法：",
    "They store, for every pixel, a 24-bit&nbsp;{}depth{}&nbsp;value and an 8-bit&nbsp;{}stencil{} value respectively.&nbsp;They are created for every&nbsp;{}{}Surface{}{}&nbsp;when the depth buffer is enabled. By default, surfaces are created with a depth buffer (and a stencil buffer), {}z-writing{} is enabled, {}z-testing{} is disabled and the {}stencil test{} is disabled.":"它们分别为每个像素存储一个 24 位 {} 深度 {} 值和一个 8 位 {} 模板 {} 值。当深度缓冲区启用时，它们会为每个 {}{} 表面 {}{} 创建。默认情况下，表面是使用深度缓冲区 (和模板缓冲区) 创建的，启用 {}z-writing{}，禁用 {}z-testing{} 并禁用 {}stencil test{}。",
    "{}The Depth And Stencil Buffer{}":"{} 深度和模板缓冲区 {}",
    "{}{}NOTE{}{}&nbsp;Automatic depth buffer and stencil buffer generation can be turned off&nbsp;using&nbsp;{}{}surface_depth_disable{}{}.":"{}{} 注意{}{} 可以使用 {}{}surface_depth_disable{}{} 关闭自动深度缓冲区和模板缓冲区生成。"
}