{
    "This section outlines the functions specifically for use when targeting the UWP target platform. The initial set of functions are for controlling the general game behaviour when creating a UWP app:":"本节概述了专门针对 UWP 目标平台使用的函数。最初的一组函数是用来控制创建 UWP 应用程序时的一般游戏行为:",
    "UWP And Xbox Live&nbsp;{}{}OBSOLETE{}{}":"UWP 和 Xbox Live&nbsp;{}{}OBSOLETE{}{}",
    "UWP also permits you to create games for the XBox One platform using the XBox Live API using the following functions. These functions require you to have checked the {}Enable XBox Live{} option in the UWP Game Options. Some of these functions require the user to be signed-in to XBox Live, which {}GameMaker{} will try to do automatically when you run the project. This \"silent\" sign in will generate a {}System Asynchronous Event{} which can the be checked to see if it was successful or not before proceeding. Note that unlike the Xbox One Console export, the UWP export for XBox Live only permits one user to be signed-in at a time.":"UWP还允许您使用以下函数使用XBox Live API为XBox One平台创建游戏。这些函数需要你勾选UWP游戏选项中的{}Enable XBox Live{}选项。其中一些函数需要用户登录到XBox Live，当你运行项目时{}GameMaker{}将尝试自动执行。这个“静默”登录将生成一个{}系统异步事件{}，在继续之前可以检查它是否成功。注意，与Xbox One控制台导出不同的是，Xbox Live的UWP导出一次只允许一个用户登录。",
    "You can find all the various Xbox Live functions for use with the UWP export target from the sections listed below:":"您可以在下面列出的部分中找到所有用于 UWP 导出目标的 Xbox Live 函数:",
    "{}IMPORTANT!{} The UWP target only has a minimum of support for XBox Live when set up as part of the {}Creator Program{}, which is limited to some basic user and account functions (see {}here{} for more information on setting this up). To be able to use all the functionality listed here you will need to have an {}ID@XBox account{}.":"{}重要!{} UWP目标在作为{}创建者程序{}的一部分设置时，只对XBox Live提供最低限度的支持，它仅限于一些基本的用户和账户函数(有关设置的更多信息，请参阅{}这里的{})。要使用这里列出的所有函数，您需要有一个{}ID@XBox账户{}。",
    "{}{}IMPORTANT{}{}&nbsp;UWP functionality is now obsolete as the UWP target no longer exists in {}GameMaker{}.":"{}{}重要{}{} UWP 函数现在已过时，因为 UWP 目标不再存在于{} GameMaker {}中。<br><big>微软终止了UWP 以及 XDK 支持，所以GM自然也取消了，不再能使用UWP作为跳板发布到 Xbox，Xbox 支持使用 GDK 具体信息参考官网。<br>所以本大项都是针对UWP的，没有翻译的必要。故之后不会更新任何翻译</big>"
}