{
    "For a complete guide to the different falloff models and how these values are used, please see the function {}{}audio_falloff_set_model(){}.{}":"有关不同衰减模型的完整指南以及如何使用这些值，请参阅函数{}{}audio_falloff_set_model(){}。{}",
    "How the sound itself is heard will depend on the falloff reference (which is the distance under which the volume for the source would normally drop by half) and the roll off factor (which affects the sound past the falloff reference distance only). The default factor is normally 1, and the effect of the different falloff values will depend on the model chosen.":"如何听到声音本身将取决于衰减参考(即源音量通常下降一半的距离)和滚降因子(仅影响经过衰减参考距离的声音)。默认因子通常为1，不同衰减值的影响将取决于所选模型。",
    "The above code creates an audio emitter and assigns its index to the variable \"s_emit\". This emitter is then placed at the position of the instance creating it and is given a fall-off distance of 300, meaning that when the emitter is further than 300 pixels from the {}listener{} position it will be silent. Its falloff factor is the default 1 and the falloff reference is 100, so at 100 pixels from the listener the falloff will start.":"上面的代码创建了一个音频发射器，并将其索引分配给变量\" s_emit \"。然后，将该发射器放置在创建它的实例的位置，并为其提供300的衰减距离，这意味着当发射器距离{}侦听器{}位置超过300像素时，它将处于静默状态。其\"衰减因子\"(Falloff Factor)为默认值1，\"衰减参考\"(Falloff Reference)为100，因此衰减将在距离侦听器100像素处开始。",
    "The falloff factor (default 1).":"衰减因子(默认值为1)。",
    "The falloff reference relative to the listener (clamp).":"相对于侦听器(clamp)的衰减引用。",
    "The index of the emitter to change.":"要更改的发射器的索引。",
    "The maximum falloff distance relative to the listener.":"相对于侦听器的最大衰减距离。",
    "With this function you can set the fall-off distance for an emitter. This is the distance from the {}listener{} the emitter has to be before the sound will have \"fallen off\" to a volume of 0. The default value for this is 100, but beware of setting this to any value lower than 1 as that will make any sound played through this emitter inaudible to the {}listener{}, however any other value will cause the sound to fade away the further that the emitter is from the {}listener{}.":"使用此功能，可以设置发射器的衰减距离。这是从发射器{}listener{}到声音\"下降\"到0的音量之前的距离。其默认值为100，但注意将此值设置为低于1的任何值，因为这会使通过此发射器播放的任何声音对{}listener{}是听不到的，但是任何其他值将导致声音越远离{}listener{}，声音就会逐渐减弱。"
}