{
    "\"{}event_type{}\" - this will be \"{}virtual keyboard status{}\" when triggered by virtual keyboard functions.":"“{}event_type{}”-当由虚拟键盘函数触发时，这将是 “{}虚拟键盘状态{}”。",
    "\"{}keyboard_status{}\" - the current status of the keyboard, returned as one of the following strings: {} {}\"hiding\"{} {}\"hidden\"{} {}\"showing\"{} {}\"visible\"{} {} ":"\"{}keyboard_status{}\" - 键盘的当前状态，作为以下字符串之一返回： {} {}\"hiding\"{} {}\"hidden\"{} {}\"showing\"{} {}\"visible\"{} {} ",
    "\"{}screen_height{}\" - the height of the virtual keyboard (in pixels). This will be 0 if the keyboard is invisible.":"“{}screen_height{}”-虚拟键盘的高度(以像素为单位)。如果键盘不可见，则该值将为 0。",
    "A keyboard optimized for entering both a phone number and a name. Usually similar to an ASCII keyboard, but with a limited special characters selection.":"为输入电话号码和姓名而优化的键盘。通常类似于ASCII键盘，但具有有限的特殊字符选择。",
    "A normal keyboard optimized for URL entry. Usually features a \".com\" or other domain keys, as well as \"/\" and \".\" keys.":"为URL输入优化的普通键盘。通常具有 “.com” 或其他域密钥，以及 “/” 和 “.” 密钥。",
    "A normal keyboard optimized for e-mail entry. Usually features \"@\" and \".\" characters.":"为电子邮件输入优化的普通键盘。通常特征为 “@” 和 “.” 字符。",
    "A numbers-only keyboard, usually displayed as a number pad.":"一种仅数字键盘，通常显示为数字键盘。",
    "A phone pad keyboard. Usually numbers-only with the \"*\" and \"#\" keys.":"电话键盘。通常数字-仅带有 “*” 和 “#” 键。",
    "All characters will be capitalized.":"所有字符都将大写。",
    "An ASCII-only keyboard.":"仅支持ASCII的键盘。",
    "Autocapitalization is disabled.":"已禁用自动大写。",
    "Calling this function will generate a {}System Asynchronous Event{}, in which the {}async_load{} DS map will be populated with the following key/value pairs:":"调用此函数将生成{}系统异步事件{}，其中 {}async_load{} DS 映射将填充以下键/值对：",
    "Determines how/if the words typed via the virtual keyboard will be autocapitalized {}(see tables at the top){}.":"确定如何/是否将通过虚拟键盘键入的单词自动大写{}(请参阅顶部的表格){}。",
    "Determines the keyset available on the virtual keyboard {}(see tables at the top){}.":"确定虚拟键盘上的可用键集{}(请参阅顶部的表){}。",
    "Determines what is shown on the return/action key of the virtual keyboard ({}see tables at the top){}.":"确定虚拟键盘的返回/操作键上显示的内容({}参见顶部的表格){}。",
    "It is important to note too that the user will get different keyboards with different capabilities depending on the platform OS, with the following caveats for use per target:":"还需要注意的是，根据平台操作系统的不同，用户将获得具有不同函数的不同键盘，每个目标的使用注意事项如下：",
    "Sentences will be auto-capitalized.":"句子将自动大写。",
    "Set to {}true{}/{}false{} to enable/disable predictive text input.":"设置为{}true{}/{}false{}以启用/禁用预想英文输入法。",
    "Sets the return key title to \"Continue\".":"将返回键标题设置为 “Continue”。",
    "Sets the return key title to \"Done\".":"将返回键标题设置为 “Done”。",
    "Sets the return key title to \"Emergency Call\".":"将返回键标题设置为 “Emergency Call”。",
    "Sets the return key title to \"Go\".":"将返回键标题设置为 “Go”。",
    "Sets the return key title to \"Google\", or to a generic search icon in some cases.":"将返回键标题设置为 “Google”，在某些情况下设置为通用搜索图标。",
    "Sets the return key title to \"Next\".":"将返回键标题设置为 “Next”。",
    "Sets the return key title to \"Route\".":"将返回键标题设置为 “Route”。",
    "Sets the return key title to \"Search\", or to a generic search icon in some cases.":"将返回键标题设置为 “Search”，在某些情况下设置为通用搜索图标。",
    "Sets the return key title to \"Send\".":"将返回键标题设置为 “Send”。",
    "Sets the return key title to \"Yahoo\", or to a generic search icon in some cases.":"将返回键标题设置为 “Yahoo”，在某些情况下设置为通用搜索图标。",
    "The above code will bring up the OS virtual keyboard if the given variable is not set to {}true{}.":"如果给定的变量未设置为{}true{}，则上面的代码将调出操作系统虚拟键盘。",
    "The default keyboard type for the current system.":"当前系统的默认键盘类型。",
    "The default return key title for the current system.":"当前系统的默认返回键标题。",
    "The last argument is to enable/disable predictive text, and this would be set to {}true{} to permit it, and {}false{} otherwise, but note that just because it is permitted doesn\u0027t mean that it will be used as that will depend on the preferences of the user on the device. When in predictive text mode, the virtual keyboard will not generate normal {}GameMaker{} keypress events. Instead, it will only update the {}last{} character pressed and keyboard string variables. This is due to the inability to detect whether a change in the internal text field used for detecting key presses came from an actual virtual keyboard key, or a text suggestion. In these cases you would want to read the {}keyboard_string{} input as opposed to reading any kind of raw key input.":"最后一个参数是启用/禁用预想英文输入法，这将被设置为{}true{}以允许它，否则设置为{}false{}，但请注意，仅仅因为它被允许并不意味着它将被使用，因为这将取决于用户在设备上的偏好。在预想英文输入法模式下，虚拟键盘不会生成正常的{}GameMaker{}按键事件。相反，它将只更新{}最后一个{}按下的字符和键盘字符串变量。这是由于无法检测用于检测按键的内部文本字段中的变化是来自实际的虚拟键盘键还是来自文本建议。在这些情况下，您可能希望读取{}keyboard_string{}输入，而不是读取任何类型的原始按键输入。",
    "This function can be used to show the virtual keyboard on the device running the game. When you call this function you need to provide one of the following constants for each of the first three arguments:":"此函数可用于在运行游戏的设备上显示虚拟键盘。调用此函数时，需要为前三个参数中的每个参数提供以下常量之一：",
    "Virtual Keyboard Autocapitalization Type Constant":"虚拟键盘自动大写类型常量",
    "Virtual Keyboard Return Type Constant":"虚拟键盘返回类型常量",
    "Virtual Keyboard Type Constant":"虚拟键盘类型常量",
    "Words will be auto-capitalized.":"单词将自动大写。",
    "{}AndroidTV / FireTV{}: Custom return key types are {}not{} supported on ASCII keyboards - the default return key will always be displayed.":"{}AndroidTV/ FireTV{}：ASCII 键盘不支持{}自定义返回键类型——将始终显示默认返回键。",
    "{}Android{}: On Android, the keyboard type {}kbv_type_phone_name{} is not supported and will display an ASCII keyboard instead, and the return key type can only be {}kbv_returnkey_go{}, {}kbv_returnkey_search{}, {}kbv_returnkey_next{}, {}kbv_returnkey_send{} or {}kbv_returnkey_done{}. If other return key types are used on that platform, the system will default to the replacement return keys listed below:":"{}Android{}：在 Android 上，不支持键盘类型{}kbv_type_phone_name{}，而是显示 ASCII 键盘，返回键类型只能是{}kbv_returnkey_go{}、{}kbv_returnkey_send{}或{}kbv_returnkey_done{}。如果在该平台上使用其他返回密钥类型，则系统将默认为下面列出的替换返回密钥：",
    "{}Autocapitalization type{}: This constant is used to determine how the words typed via the virtual keyboard should be autocapitalized. The available autocapitalization types are:":"{}自动大写类型{}：此常量用于确定通过虚拟键盘键入的单词应如何自动大写。可用的自动大写类型包括：",
    "{}Keyboard type{}: This constant is used to set which keyset will be available on the virtual keyboard. The available keyboard types are:":"{}Keyboard type{}：该常量用于设置虚拟键盘上可用的键集。可用的键盘类型有：",
    "{}Return type{}: This constant is used to set what is shown on the return/action key of the virtual keyboard. The available return types are:":"{}返回类型{}: 此常量用于设置虚拟键盘的Return/action键上显示的内容。可用的返回类型为:",
    "{}tvOS{}: Predictive text and auto-capitalization are not supported on tvOS, and the height of the keyboard returned by system events and the function {}keyboard_virtual_height(){} will default to the screen height due to it spanning the entire screen and due to keyboard rect dimension functions being disabled on tvOS. Also note that physical (bluetooth) keyboard events will not be broadcast unless the virtual keyboard has been opened.":"{}tvOS{}：tvOS 不支持预测文本和自动大小写，系统事件和函数{}keyboard_virtual_height(){}返回的键盘高度将默认为屏幕高度，因为它横跨整个屏幕，也因为在 tvOS 上禁用了键盘矩形尺寸函数。另请注意，除非打开虚拟键盘，否则不会广播物理(蓝牙)键盘事件。"
}