{
    "Bookmarks":"书签",
    "IDE Input And Navigation":"IDE 输入和导航",
    "If you are using {}GameMaker{} on a laptop, then you will have a further option at the top of the IDE for Laptop Mode:":"如果您在笔记本电脑上使用 {}GameMaker{}，则在笔记本电脑模式的 IDE 顶部将有一个进一步的选项：",
    "In general you can click the left mouse button&nbsp; {}&nbsp;to select anything, use {}&nbsp;/ {} + {} to select multiple items, hold {} to drag items into different docks or onto the workspaces, and also the {} to open context specific menus. Note that if you are running {}GameMaker{} on a macOS system and are using a single button mouse, please use {} + {} to get a right mouse click {}.":"通常，您可以单击鼠标左键{}选择任何内容，使用{} /{}+{}选择多个项目，按住{}将项目拖到不同的停靠或工作区中，也可以按住{}打开特定于上下文的菜单。请注意，如果您在 macOS 系统上运行 {}GameMaker{} 并使用单键鼠标，请使用{}+{}进行鼠标右键单击{}。",
    "In some situations, these options may be expanded on, depending on the editor or window that is in focus.":"在某些情况下，这些选项可能会展开，具体取决于焦点所在的编辑器或窗口。",
    "Input Preferences":"输入首选项",
    "Keyboard Shortcuts":"键盘快捷键",
    "Menus":"菜单",
    "One final thing we\u0027ll mention here is that the IDE for {}GameMaker{} also has minimal support for touch screens. On all operating systems you can use the touch screen to click and drag items in the main workspace, and we support 2 simultaneous pointers, where a second tap will perform a right-click. Note that on Windows 8 and above, the {}GameMaker{} IDE will support pen devices too.{}":"这里我们要提到的最后一件事是，{}GameMaker{} 的 IDE 对触摸屏的支持也是最低限度的。在所有操作系统上，您都可以使用触摸屏在主工作区中点击和拖动项目，我们支持 2 个同时指针，第二次点击将执行右击。请注意，在 Windows 8 及更高版本上，{}GameMaker{} IDE 也支持笔设备。{}",
    "Other than those methods of input, there is also limited support for pen devices, and also a special mode for those people working on projects using a laptop. Both of these are explained below:":"除了这些输入方法之外，对笔设备的支持也是有限的，而且还为使用笔记本电脑进行项目工作的人提供了一种特殊的模式。以下是对这两个问题的解释：",
    "Other ways to navigate the workspace include using the keyboard shortcut&nbsp; {} /&nbsp; {}&nbsp;+&nbsp; {} + {} {}&lt;Arrow Keys&gt;{}{} to move between any open windows in the direction pressed, and by pressing and holding the middle mouse button {}&nbsp;then dragging the mouse you can pan around the workspace too.":"浏览工作区的其他方法包括使用键盘快捷键 {}/ {} + {}+{}{}<箭头键>{}{}以按下的方向在任何打开的窗口之间移动，以及通过按住鼠标中键{} 然后拖动鼠标，您也可以在工作区中平移。",
    "Recent Windows":"最近窗口",
    "The Inspector":"检查器",
    "The {}GameMaker{} {}IDE{} accepts mouse and keyboard input, and many operations can be carried out using one or the other or both.":"{}GameMaker{} {}IDE{}接受鼠标和键盘输入，许多操作都可以使用其中一个或两个来执行。",
    "There are also a great number of keyboard shortcuts that can be used to navigate around the different workspace elements and resource editors, and we\u0027ll quickly go through some of the most important ones (you can find a complete list {}here{}):":"还有大量键盘快捷键可用于在不同的工作区元素和资源编辑器之间导航，我们将快速浏览其中一些最重要的快捷键(您可以在此处{}找到完整的列表{})：",
    "When navigating around the various different workspaces and windows, you can use the right-mouse button {}&nbsp;on any text field to open a context menu which will have the following fields by default:":"在各种不同的工作区和窗口中导航时，您可以在任何文本字段上使用鼠标右键{}打开上下文菜单，该菜单将默认包含以下字段：",
    "When using a laptop trackpad, you can use the panning gesture, i.e. dragging with two fingers, to pan around workspaces, and use the pinch in/out gestures to zoom out and in.":"当使用笔记本电脑触摸板时，您可以使用平移手势，即用两个手指拖动来在工作空间中平移，并使用收拢/缩小手势来缩小和放大。",
    "You can also find some extra preferences related to the IDE input here:":"您还可以在此处找到一些与 IDE 输入相关的额外首选项：",
    "{} {} The following pages contain more detailed and specific information on navigating the IDE, as well as information on some navigation tools available to you: ":"{}{} 以下页面包含有关导航 IDE 的更详细、更具体的信息，以及有关您可以使用的一些导航工具的信息：",
    "{}&nbsp;+ {}: This will open the {}Workspace Overview{} window which can be used to navigate quickly between items that are open in the different workspaces. The window will remain open as long as&nbsp;{}&nbsp;is held, and pressing&nbsp;{}&nbsp; once will move you to the next item in the window. Releasing the shortcut will then navigate to the item that was selected.{} {} {}{}NOTE{}{}&nbsp;If you remap the binding for this window to either use more than one modifiers (such as&nbsp;{} +&nbsp;{} + {}B{}) or a single key (such as {}B{} only), then the window will remain open after pressing the shortcut regardless of whether you still have it held or not, until you manually close it or choose an item from the window. ":"{} + {}: 这将打开{}工作区概述{}窗口，该窗口可用于在不同工作区中打开的项目之间快速导航。只要 {} 被按住，窗口就会保持打开状态，按一次 {} 就会转到窗口中的下一项。然后，释放快捷键将导航到选定的项目。\n{}{} {}{}注意{}{} 如果您重新映射此窗口的绑定以使用多个修饰符(如 {}+ {}+{}B{})或单个键(如仅{}B{})，则窗口在按下快捷键后将保持打开状态，无论您是否仍然按住它，直到您手动关闭它或从窗口中选择一个项目。",
    "{}/ {} + \"S\" : This will force {}GameMaker{} to save your project.":"{}/ {} + \"S\" : 这将强制 {}GameMaker{} 保存您的项目。",
    "{}/ {} + \"T\" : This will open the {}Goto Window{} which enables you to quickly search for and go to any asset in your game, as well as search the {}Preferences{} and {}Game Options{}. You are presented with a list of everything and as you type the search term, this list will be culled to suit, so if all your rooms are prefixed with \"rm_\" for example, typing that will cull the list to show only those assets that begin with that name.":"{}/ {} + \"T\" : 这将打开{}转到窗口{}，使您可以快速搜索和转到游戏中的任何资源，以及搜索{}首选项{}和{}游戏选项{}。你会看到一个所有东西的列表，当你输入搜索词时，这个列表将被剔除以适合你的需求，例如，如果你所有的房间都以\"rm_\"为前缀，输入这将剔除列表，只显示那些以该名称开头的资产。",
    "{}/ {} + \"Y\" : This will redo a previous action that was undone and works in most of the editors. Like undo, you have multiple levels of redo too.":"{}/ {} + \"Y\" : 这将重做以前撤消的操作，并在大多数编辑器中起作用。与撤消一样，您也有多个级别的重做。",
    "{}/ {} + \"Z\" : This will undo the previous action and works in most of the editors. You have multiple levels of undo too, so you can press this multiple times to \"roll back\" changes.":"{}/ {} + \"Z\" : 这将撤消之前的操作，并在大多数编辑器中起作用。您也有多个级别的撤消，因此您可以多次按此来“回滚”更改。",
    "{}/ {}&nbsp;+ {}: This will reset the zoom level in workspaces and various editors.":"{}/{} +{}：这将重置工作区和各种编辑器中的缩放级别。",
    "{}: This can be used to collapse or expand all the different docked windows in the IDE.":"{}: 这可用于折叠或展开 IDE 中所有不同的停靠窗口。",
    "{}: This will open the manual. Note that when using GML Visual or GML code you can also select an action or a function (or keyword or whatever) and then press {} or click the middle mouse button {} to open the manual on the relevant page.":"{}: 这将打开手册。请注意，当使用 GML 可视化或 GML 代码时，您还可以选择一个操作或功能 (或关键字或其他任何内容)，然后按下 {} 或单击鼠标中键 {} 在相关页面上打开手册。",
    "{}Laptop Mode{}{}Laptop Mode{}":"{}笔记本电脑模式{}{}笔记本电脑模式{}",
    "{}This will be on by default but can be switched off if you prefer by toggling this button. Laptop mode combines with some tools in the IDE to make it a much better experience when using a touchpad, simplifying the 3 main mouse interactions: {}Pan{}, {}zoom{} and {}scroll{}. It uses two modifier keys to do this: Left {}/ {} and Left {}. When laptop mode is on, {}Left {} {}/ {}&nbsp;and {}Left {} {} are \"reserved\" for mouse interactions like panning the room editor, where {}Left {} {}/ {} is zoom, {}Left {} {} is scroll and pan. Scrolling in laptop mode behaves just like panning, so it should be intuitive and precise enough so that you don\u0027t need to use the scrollbar. Note that when holding these buttons, you simply have to move the mouse - not click nor drag, just move - and that if there is a general shortcut that normally requires the use of the {}/ {} or {} keys, you would use the {}Right {}keys of the keyboard instead.{} &nbsp;":"{}这将在默认情况下处于打开状态，但如果您愿意，可以通过切换此按钮将其关闭。笔记本电脑模式与IDE中的一些工具相结合，使其在使用触摸板时获得了更好的体验，简化了3种主要的鼠标交互：{}平移{}、{}缩放{}和{}滚动{}。它使用两个修改键来完成此操作：左{}/{}和左{}。当笔记本电脑模式开启时，{}左{}{} / 和左{}{}{}为鼠标交互保留，如平移房间编辑器，其中{}左{}{}{}/{}表示缩放，{}左{}{}表示滚动和平移。在笔记本电脑模式下滚动就像平移一样，所以它应该足够直观和精确，这样你就不需要使用滚动条了。请注意，当按住这些按钮时，您只需移动鼠标--不是点击或拖动，而是移动--如果有一个常规快捷键通常需要使用{}/{}或{}键，您可以使用键盘上的{}向右键{}替代。{}",
    "{}Touch Screen Support{}{}Touch Screen Support{}":"{}触摸屏支持{}{}触摸屏支持{}"
}