{
    "Changes in Collisions":"碰撞中的更改",
    "Collision Compatibility Mode":"碰撞兼容模式",
    "Compatibility Mode":"兼容性模式",
    "For projects that are new or do not use existing collision code, there is no need to enable this option.":"对于新项目或不使用现有碰撞代码的项目，无需启用此选项。",
    "In the current collision system, bounding box values are not rounded and are used as-is, meaning collisions are more accurate and behave as one would expect. Bounding boxes are also \"inclusive\"&nbsp;now, i.e. they include the bottom-most and right-most edges. For example,&nbsp;the bounding box for a&nbsp;16x16&nbsp;collision mask is now generated from {}(0.0, 0.0){}&nbsp;to {}(16.0, 16.0){} (relative).":"在当前碰撞系统中，边界框值不是四舍五入的，而是按原样使用，这意味着碰撞更加精确，并且行为与预期的一样。边界框现在也是\"包含\"的，也就是说，它们包含最底部和最右侧的边。例如，16 x 16碰撞遮罩的边界框现在从{}(0.0,0.0 ){}到{}(16.0, 16.0 ){}(相对)生成。",
    "In the legacy collision system, all bounding box coordinates were rounded to integers and were \"exclusive\", i.e. they would exclude the bottom-most and right-most edges of a collision mask. For example, the bounding box for a&nbsp;16x16&nbsp;collision mask would be generated from {}(0, 0){} to {}(15, 15){} (relative). This would work fine for instances that used only integer values for positioning and scaling, however using&nbsp;{}floating point{} values would cause unexpected behaviour and a slight disconnect between rendering and collision checking, as GameMaker would then always&nbsp;round the bounding box values for performing collision checks.":"在遗留的碰撞系统中，所有边界框坐标都四舍五入为整数，并且是\"独占的\"，即它们将排除碰撞遮罩的最底部和最右侧的边。例如，16 x 16碰撞遮罩的边界框将从{}(0,0 ){}到{}(15,15 ){}(相对)生成。对于仅使用整数值进行定位和缩放的实例，这将非常有效，但是使用{}浮点{}值会导致意外行为，并导致渲染和碰撞检查之间的轻微断开，因为GameMaker随后会始终舍入边界框值以执行碰撞检查。",
    "In the {}General Game Options{} for your project, you can enable \"{}Collision Compatibility Mode{}\" to switch to the legacy collision system. You would only need to do this if you noticed odd behaviour with collisions in your existing project(s)&nbsp;after upgrading to&nbsp;{}GameMaker{}&nbsp;2022.1, which changed how collisions work.":"在项目的{}常规游戏选项{}中，您可以启用\"{}碰撞兼容模式{}\"以切换到旧式碰撞系统。只有在升级到{}GameMaker{}2022.1后发现现有项目中存在奇怪的碰撞行为时，才需要执行此操作。{}GameMaker{}2022.1改变了碰撞的工作方式。",
    "The collision changes explained above may cause some existing projects to break, which you can easily fix by enabling the {}Collision Compatibility Mode{} for such projects so the legacy collision system is used; however it is recommended to test and upgrade your collision code to work with the new system as it should allow your game to have more accurate and logical collisions.":"上述碰撞更改可能会导致某些现有项目中断，您可以通过为此类项目启用{}碰撞兼容模式{}来轻松修复这些碰撞，以便使用传统的碰撞系统;但是，建议测试并升级您的碰撞代码，以便与新系统一起使用，因为它应该允许您的游戏具有更准确和更合理的碰撞。"
}