{
    "Note that the given x/y coordinates will be floored to the nearest integer before the check is performed.":"请注意，在执行检查之前，给定的x/y坐标将泛洪到最近的整数。",
    "The above code will check for a collision with any other instance of the object \"obj_Enemy\", as if the calling instance were to be placed at the same position as the mouse. If there is no collision detected, then the instance has its x/y coordinates set to those of the mouse.":"上述代码将检查是否与对象\"obj_Enemy\"的任何其他实例发生冲突，就好像将调用实例放置在与鼠标相同的位置一样。如果未检测到碰撞，则将实例的x/y坐标设置为鼠标的坐标。",
    "The function is testing if there are no collisions should the calling instance be placed at a specific position, and you can supply an optional argument to refine the check to only check if a position is free of collisions with instances of the given type. Note that if no optional object ID is supplied, the check will be done against {}all{} instances within the room. The collision checking will be either precise or based on the bounding box of the instance, depending on what kind of collision mask has been selected, but for precise collisions to work correctly, all instances in the check should have precise collision masks.":"如果将调用实例放置在特定位置，则此函数将测试是否不存在冲突，并且您可以提供一个可选参数来细化检查，以便仅检查某个位置是否与给定类型的实例没有冲突。请注意，如果未提供可选的对象Id，将对房间内的{}个all{}实例进行检查。碰撞检查要么精确，要么基于实例的边界框，具体取决于选择了哪种碰撞遮罩，但要使精确碰撞正常工作，检查中的所有实例都应具有精确碰撞遮罩。",
    "The x position to check.":"要检查的x位置。",
    "The y position to check.":"要检查的y位置。",
    "You can use this function to check and see if the calling instance would collide with {}any other instance{} of an object or all instances in your game. For this to collision to resolve correctly, the instance running the code must have a valid collision mask (either for the sprite itself, or through the {}{}mask_index{}{}) and it will only register collisions with those instances that also have a valid mask.":"您可以使用此函数检查并查看调用实例是否会与游戏中某个对象的{}任何其他实例{}或所有实例发生冲突。为了正确解决此冲突，运行代码的实例必须具有有效的冲突掩码(对于sprite本身或通过{}{}mask_index{}{})，并且它只会注册与同样具有有效掩码的实例的冲突。",
    "{}OPTIONAL{} The object to check against.":"{}可选{}要检查的对象。"
}