{
    "An effect that creates a smoke plume that rises up the screen":"一种能产生一股烟羽在屏幕上升起的效果",
    "An effect that creates expanding ellipses":"创建扩展椭圆的效果",
    "An effect that creates expanding fading explosions":"一种创建扩展渐消爆炸的效果",
    "An effect that creates multiple small particles to generate a firework explosion":"产生多个小粒子以产生烟花爆炸的效果",
    "An effect that creates random cloud particles of varying sizes":"一种创建大小不一的随机云粒子的效果",
    "An effect that generates a brilliant point that flares up and fades out":"一种产生明亮点的效果，该点会逐渐变亮并逐渐消失",
    "An effect that generates a small spark":"产生小火花的效果",
    "An effect that generates expanding and fading circles":"产生扩大和淡化圆圈的效果",
    "An effect that generates little puffs of smoke":"产生小股烟雾的效果",
    "An effect that generates multiple snow particles falling down the screen":"一种产生多个雪粒子从屏幕上落下的效果",
    "An effect that generates rain particles coming down from the top of the screen":"一种产生雨粒子从屏幕顶部落下的效果",
    "An effect that generates star particles":"产生星星粒子的效果",
    "The available constants for the different particle kinds are:&nbsp;":"不同粒子种类的可用常数为：",
    "The code above creates a large, dark gray coloured explosion particle effect ({}ef_explosion{})&nbsp;at the {}depth{} and x, y position&nbsp;of the calling {}instance{}.":"上面的代码在调用 {4} 实例 {5} 的 {} 深度 {} 和 x，y 位置创建了一个大的深灰色爆炸粒子效果 ({0}ef_explosion{1})。",
    "The colour of the effect":"效果的颜色",
    "The depth at which to create the effect":"创建效果的深度",
    "The kind of effect to create":"要创造的那种效果",
    "The size of the effect (0 = small, 1 = medium, 2 = large)":"效果的大小(0 =小，1 =中，2 =大)",
    "The x position to create the effect at&nbsp;(unused by {}ef_rain{}&nbsp;and {}ef_snow{})":"创建效果的x位置({}ef_rain{}和{}ef_snow{}未使用)",
    "The y position to create the effect at&nbsp;(unused by {}ef_rain{}&nbsp;and {}ef_snow{})":"创建效果的y位置({}ef_rain{}和{}ef_snow{}未使用)",
    "This function creates a simple particle effect at the given depth.":"该函数在给定深度处创建简单的粒子效果。",
    "You supply a depth value and a particle kind, along with its position, size and colour. The size takes three possible values: 0 (small), 1 (medium), or 2 (large).":"您可以提供深度值和粒子种类，沿着其位置、大小和颜色。大小采用三个可能的值：0(小)、1(中)或2(大)。",
    "{}{}NOTE{}{}&nbsp;The effect types {}ef_rain{}&nbsp;and {}ef_snow{} don\u0027t use the x/y position (although you must still provide them).":"{}{}注意{}{}效果类型{}ef_rain{}和{}ef_snow{}不使用x/y位置(尽管您仍然必须提供它们)。"
}