{
    "Encoding And Hashing":"编码和哈希",
    "It is worth noting that there are also a number of functions related to encoding and hashing&nbsp;{}Buffers{}, which you can find from the following links:":"值得注意的是，还有许多与编码和哈希 {} 缓冲区 {} 相关的函数，您可以在以下链接中找到它们:",
    "The following functions are provided for working with ZIP files:":"提供以下函数用于处理 ZIP 文件：",
    "When dealing with external files, there is always the possibility that the end user could open and change the information that they contain, and so change your game. This can result in broken game-play elements or fraudulent scores on-line (for example), and so {}GameMaker{} provides you with some basic {}encoding{} functions as well as functions to perform {}hashing{} checks on strings and files to make sure that they have maintained their integrity before being used. There are also some functions supplied for encoding and decoding {}JSON{}&nbsp;format strings, as well as for creating ZIP files.":"在处理外部文件时，最终用户始终有可能打开并更改它们包含的信息，从而更改您的游戏。这可能会导致游戏元素损坏或在线分数出现欺诈 (例如)，因此 {}GameMaker{} 为您提供了一些基本的 {} 编码 {} 函数以及执行 {} 哈希 {} 检查的函数对字符串和文件进行检查，以确保它们在使用之前保持完整性。还提供了一些用于编码和解码 {}JSON{} 格式字符串以及创建 ZIP 文件的函数。",
    "When dealing with external files, there is always the possibility that the end user could open and change the information that they contain, and so change your game. This can result in broken game-play elements or fraudulent scores on-line (for example), and so {}GameMaker{} provides you with some basic {}encoding{} functions as well as functions to perform {}hashing{} checks on strings and files to make sure that they have maintained their integrity before being used. There are also some functions supplied for encoding and decoding {}JSON{}&nbsp;format strings.":"在处理外部文件时，最终用户总是有可能打开并更改其中包含的信息，从而改变你的游戏。这可能导致游戏玩法元素被破坏或在线欺诈分数，所以 {}GameMaker{} 为你提供了一些基本的 {} 编码{} 函数，以及对字符串和文件执行 {} 哈希{} 检查的函数，以确保它们在使用之前保持完整性。还提供了一些用于编码和解码 {}JSON{}&nbsp; 格式字符串的函数。",
    "{}{}NOTE{} {}Encoding is NOT encryption! A base64 encoding renders the file unreadable to the naked eye and will require an effort on behalf of the user to decode, but it is not secure from hacking. It is recommended that you mix those functions with your own encryption (there are many forms of encryption and script functions&nbsp;for GameMaker are available on the internet).":"{}{} 注意{}{} 编码不是加密！Base64 编码使文件无法用肉眼读取，并且需要用户代表进行解码，但它不能保证不被黑客攻击。建议您将这些函数与您自己的加密混合使用 (GameMaker 的加密和脚本函数在互联网上有很多种形式)。"
}