{
    "\"{}filename{}\": The complete path to the file you requested.":"\"{}filename{}\"：您请求的文件的完整路径。",
    "\"{}id{}\": The ID of the resource that you have loaded. This will be the same as the variable that you have assigned the resource to.":"\"{}id{}\"：您加载的资源的ID。这将与您为其分配资源的变量相同。",
    "\"{}status{}\": Returns a value of less than 0 for an error.":"\"{}status{}\"：返回小于 0 的错误值。",
    "Image Loaded":"图像已加载",
    "The above code will first check the {}id{} of the DS map that has been created, then check the {}status{} of the callback. If the value is greater than or equal to 0 (signalling success) the result from the callback will then be used to set the sprite index to the newly loaded image.":"上面的代码将首先检查已创建的DS映射的{}id{}，然后检查回调的{}状态{}。如果值大于或等于0(表示成功)，则结果来自然后将使用回调将精灵索引设置为新加载的图像。",
    "This will now start to load the image into the device or the browser, but it will not block {}GameMaker{} while it waits for the file to be loaded. Instead {}GameMaker{} will keep running as normal until the image is loaded and the {}callback{} triggers the {}Image Loaded Event{}, where a {}DS Map{}&nbsp;is created and stored in the special variable {}{}async_load{}{}. The map contains the following information:":"这现在将开始将图像加载到设备或浏览器中，但在等待加载文件时不会阻止 {}GameMaker{}。相反，{}GameMaker{} 将继续正常运行，直到图像被加载并且 {} 回调 {} 触发 {} 图像加载事件 {}，其中创建了 {}DS Map{} 并将其存储在特殊变量中{}{}async_load{}{}。地图包含以下信息：",
    "You would then assign the newly loaded image to a sprite in this event. The following code example demonstrates how the returned information would be used:":"然后，在此事件中将新加载的图像分配给精灵。以下代码示例演示如何使用返回的信息：",
    "{}Image Loaded{}":"{}图像已加载{}",
    "{}This event is triggered when you load an image into {}GameMaker{}&nbsp;either on HTML5, or through a&nbsp;{}URL{}. For example, say you want to load a sprite image, and only change the current sprite for the instance to the new one after it has loaded. You would have something like this in the Create event (or any other event):":"{} 当您在 HTML5 上或通过 {}URL{} 将图像加载到 {}GameMaker{} 时，会触发此事件。例如，假设您要加载精灵图像，并且仅在加载后将实例的当前精灵更改为新精灵。您将在创建事件 (或任何其他事件) 中拥有类似的内容："
}