{
    "If the function fails, then it will fail silently without replacing the given sprite font.":"如果函数失败，那么它将在不替换给定的sprite字体的情况下静默失败。",
    "Set as proportional font or not.":"是否设置为比例字体。",
    "String from which sprite sub-image order is taken.":"从中获取精灵子图像顺序的字符串。",
    "The above code will replace a sprite font asset that is indexed in the variable \"global.Font\" with sprite images indexed in the variable \"spr_CalcFont\".":"上述代码将用在变量 \"spr_CalcFont\" 中索引的精灵图像替换在变量 \"global.font\" 中索引的精灵字体资源。",
    "The font to replace.":"要替换的字体。",
    "The space to leave between each letter.":"每个字母之间要留出的空间。",
    "The sprite to add a font based on.":"要添加字体的sprite.",
    "This function will replace a sprite font that you created previously using the function {}{}font_add_sprite_ext(){}{}. It uses a \"sprite strip\", where each sub-image is be an individual symbol or letter, and the images are mapped to letters based on the argument \"string_map\" of the function. This argument is a string that you can use to tell {}GameMaker{} what order the sub-images of the sprite font are and it will map these automatically when writing text. So, for example, if you have a string-map of \"AaBbCcDdEeFfGgHh\", your sprite font {}must{} have the sub-images ordered in this way.":"该函数将替换您之前使用函数{}{}font_add_sprite_ext(){}{}创建的一个精灵字体。它使用 \"精灵条带\"，其中每个子图像都是一个单独的符号或字母，并且图像基于函数的参数 \"string_map\" 映射到字母。这个参数是一个字符串，你可以用它来告诉{}GameMaker{}精灵字体的子图像是什么顺序，它会在写文本时自动映射这些。因此，例如，如果您有一个字符串映射 \"AaBbCcDdEeFfGgHh\"，则您的sprite字体{}必须{}具有以这种方式排序的子图像。",
    "You can also set the spacing for the font to be proportional ({}true{}) or not ({}false{}), where a proportional font is spaced based on the actual width of the letters (so the letter \"i\" takes less room than the letter \"w\", for example) while a non-proportional font will be spaced based on the sub-image width, like a monospaced font. Finally, you can define the space to leave between each letter when writing, and this can be any integer value, with 0 being no space (the letters will \"touch\" if proportional). The function returns an {}index{} value that should be stored in a variable as this will be needed in all further codes that refer to this font.":"您还可以将字体的间距设置为按比例 ({}true{}) 或不按比例 ({}false{})，其中按比例字体的间距是根据字母的实际宽度进行的 (因此，字母 \"i\" 占用的空间比字母 \"w\" 少，例如)，而非比例字体将根据子图像宽度进行间隔，例如等宽字体。最后，您可以定义书写时每个字母之间要留出的空间，这可以是任何整数值，0是没有空格的 (如果比例，字母将 \"触摸\")。该函数返回一个{}index{}值，该值应存储在变量中，因为在引用此字体的所有其他代码中都需要此值。",
    "{}{}NOTE{} {}This function requires you to have previously added a sprite font using {}{}{}font_add_sprite(){}{}{}, as it will replace that and cannot be used on fonts that are included as part of the game resources.":"{}{}注意{}{}此函数要求您先前使用{}{}{}font_add_sprite(){}{}{}{}添加了一个sprite字体，因为它将替换该字体，并且不能用于作为游戏资源的一部分。"
}