{
    "A different texture is generated for the font\u0027s glyphs. At every texel, the texture stores the signed distance from the texel to the character. This leads to a couple of advantages:&nbsp;":"为字体的字形生成一个不同的纹理。在每一个字元上，纹理都存储了从字元到字符的签名距离。这导致了几个优点：",
    "A disadvantage of this is that scaling up text using regular fonts makes them look pixelated. To fix this, GameMaker provides an SDF rendering option for fonts added at runtime.":"这样做的一个缺点是，使用常规字体放大文本会使它们看起来像像素化。为了解决此问题，GameMaker 为在运行时添加的字体提供了 SDF 渲染选项。",
    "Adding/Removing Fonts":"添加/删除字体",
    "Asset Info":"资源信息",
    "Configuration":"配置",
    "Drawing":"绘制",
    "Font textures require a lower resolution than using regular text rendering.":"与使用普通的文本渲染相比，字体纹理需要较低的分辨率。",
    "Fonts and Text Rendering":"字体和文本呈现",
    "For text that is too close or scaled up too much the individual pixels become visible.":"当文本太近或放大过多时，个别像素会变得可见。",
    "Function Reference":"功能参考",
    "In this case,&nbsp;every texel stores the {}signed distance{} to the closest point on the character. All texels on this texture combined make up a&nbsp;{}field{}&nbsp;of signed distances.":"在这种情况下，每个纹理元素都存储到字符上最近点的{}带符号距离{}。此纹理上的所有纹理元素组合在一起构成了带符号距离的{}字段{}。",
    "It is worth noting is that if you add a font to your game that doesn\u0027t have the glyphs required by the text you wish to write, then the Unicode character 9647 (▯) is used to substitute those missing glyphs when rendering it in the draw event. So if your font doesn\u0027t have, for example, the º&nbsp;symbol, then writing 90º&nbsp;will actually produce 90▯.":"值得注意的是，如果您在游戏中添加的字体没有想要书写的文本所需的字形，那么在绘制事件中渲染时，Unicode 字符 9647( 的符号)被用来替换缺少的字形。因此，如果你的字体没有，例如，o符号，那么写90o实际上将产生90度。",
    "Regular":"常规",
    "SDF Rendering":"SDF 渲染",
    "SDF rendering is different from regular text rendering.":"SDF的渲染与普通的文本渲染不同。",
    "SDF rendering is enabled or disabled per font by calling&nbsp;{}{}font_enable_sdf{}{}. It is {}disabled by default{} for newly added fonts.":"SDF渲染可以通过调用&nbsp;{}{}font_enable_sdf{}{}来启用或禁用每个字体。对于新添加的字体，它默认是{}关闭的{}。",
    "Text Rendering":"文本渲染",
    "Text drawn using SDF rendering&nbsp;":"使用SDF渲染法绘制的文本",
    "Text in&nbsp;{}GameMaker{}&nbsp;is drawn using the font set with&nbsp;{}{}draw_set_font{}{}. Text drawn using a font will be drawn in a different way depending on whether SDF is enabled or not.":"{}GameMaker{} 中的文本是使用 {}{}draw_set_font{}{} 设置的字体绘制的。使用字体绘制的文本将以不同的方式绘制，具体取决于是否启用了 SDF。",
    "Texture":"纹理",
    "The following functions can be used to change and manipulate fonts during a game:":"以下函数可用于在游戏过程中更改和操作字体：",
    "The following functions can be used to get information about font resources:":"以下函数可用于获取有关字体资源的信息：",
    "The following table shows a visual comparison between&nbsp;text drawn using a regular font,&nbsp;and drawn using a font that has SDF enabled:&nbsp;":"下表显示了使用常规字体绘制的文本和使用启用了SDF的字体绘制的文本之间的直观比较：",
    "The font\u0027s {}glyph{}s for the given font size ({}font_get_size{}) are placed on a texture page ({}font_get_texture{}) and each character is rendered using its texels on the texture page.":"给定字体大小({}font_get_size{})的字体的 {}glyph{} 被放置在一个纹理页({}font_get_texture{})上，每个字符都使用其在纹理页上的 texels 进行渲染。",
    "The function&nbsp;{}{}font_add{}{} can be used to add fonts at runtime, including non-standard fonts such as Asian glyph fonts, from a {}*.ttf{}&nbsp;or {}*.otf{} file.":"函数 {}{}font_add{}{} 可用于从一个 {}*.ttf{} 或 {}*.otf{} 文件添加非标准字体，如亚洲字形字体。",
    "This is the normal way of drawing text in&nbsp;{}GameMaker{}. The font\u0027s {}glyph{}s for the chosen font size ({}{}font_get_size{}{}) are placed on a texture page ({}{}font_get_texture{}{}) and each character is rendered as it is from the&nbsp;texture page.":"这是在 {}GameMaker{} 中绘制文本的正常方式。所选字体大小 ({}{}font_get_size{}{}) 的字体的 {} 字形 {} 放置在纹理页面 ({}{}font_get_texture{}{}) 上，每个字符都按纹理页面的原样呈现。",
    "This&nbsp;is&nbsp;{}disabled by default{} for newly added fonts and enabled {}per font{} by calling&nbsp;{}{}font_enable_sdf{}{}:":"对于新添加的字体，此默认情况下为 {} 禁用 {}，并通过调用 {}{}font_enable_sdf{}{} 按字体 {2} 启用 {3}：",
    "Visual Comparison":"直观比较",
    "When SDF rendering is enabled, all characters in the given font\u0027s range are stored differently on the texture page. Instead of an actual render of the different characters at the font\u0027s set size, an SDF ({}Signed Distance Field){} is stored.":"启用 SDF 渲染时，给定字体范围内的所有字符在纹理页面上以不同方式存储。存储的不是字体设置大小的不同字符的实际呈现，而是 SDF ({}带符号距离域){}。",
    "With this feature enabled for a font, text can be scaled up without the characters becoming pixelated.":"为字体启用此功能后，可以放大文本，而不会使字符变得像素化。",
    "With this feature enabled for a font, text can be scaled up without the characters becoming pixelated.{}{}":"为字体启用此功能后，可以放大文本，而不会使字符变得像素化。{}{}",
    "{}Fonts{}":"{}字体{}",
    "{}GameMaker{} has a number of functions that can be used to get information about the included font assets, as well as a further set of functions that can be used to change, add or remove fonts from your game at run-time. In particular the function&nbsp;{}{}font_add{}{} can be used to add non-standard fonts, like Asian glyph fonts, from a&nbsp;{}*.ttf{}&nbsp;or&nbsp;{}*.otf{} file.":"{}GameMaker{} 具有许多可用于获取所包括字体资源的信息的函数，以及一组可用于在运行时更改、添加或删除游戏字体的函数。具体而言，函数 {}{}font_add{}{} 可用于从一个 {}*.ttf{} 或 {}*.otf{} 文件添加非标准字体，如亚洲字形字体。",
    "{}GameMaker{} has a number of functions that can be used to get information from font assets added using {}The Font Editor{}, as well as a further set of functions that can be used to change, add or remove fonts from your game at run-time. In particular the function&nbsp;{}{}font_add{}{} can be used to add non-standard fonts, like Asian glyph fonts, from a {}*.ttf{}&nbsp;or {}*.otf{} file.":"{}GameMaker{} 有许多函数可以用来从使用 {}字体编辑器{} 添加的字体资源中获取信息，还有一组函数可以用来在运行时改变、添加或移除游戏中的字体。特别是函数 {}{}font_add{}{} 可以用来从 {}*.ttf{} 或 {}*.otf{} 文件中添加非标准字体，比如亚洲字形字体。",
    "{}GameMaker{} has a number of functions to get information from font assets added using {}The Font Editor{}&nbsp;and&nbsp;functions that can be used to change, add or remove fonts from your game at {}Runtime{}.":"{}GameMaker{} 具有多个函数，可从使用{}字体编辑器{}添加的字体资源获取信息，以及可用于在{}运行时{}更改、添加或删除游戏字体的函数。",
    "{}GameMaker{}&nbsp;supports SDF rendering of fonts (Signed Distance Field)":"{}GameMaker{} 支持字体的SDF渲染(有符号的距离场)。",
    "{}{}IMPORTANT{}{}&nbsp;SDF rendering is currently only available for fonts added using&nbsp;{}{}font_add{}{}. Support for font assets added through the IDE will be provided in a future version.":"{}{}重要{}{} SDF渲染当前仅适用于使用 {}{}font_add{}{} 添加的字体。未来版本中将提供对通过IDE添加的字体资源的支持。",
    "{}{}IMPORTANT{}{}&nbsp;SDF rendering is currently only available for fonts that you add using&nbsp;{}{}font_add{}{}.":"{}{}IMPORTANT{}{}&nbsp;SDF渲染目前只适用于你用&nbsp;{}{}font_add{}{}添加的字体。",
    "{}{}NOTE{}{}&nbsp;SDF fonts are currently not supported on HTML5.":"{}{}NOTE{}{}&nbsp;目前HTML5上不支持SDF字体。",
    "{}{}NOTE{}{}&nbsp;SDF fonts are currently not supported on HTML5.{}{}":"{}{}注意{}{} HTML5 当前不支持 SDF 字体。",
    "{}{}NOTE{}{}&nbsp;SDF rendering currently doesn\u0027t work with custom shaders, as drawing text using an SDF enabled font with the default passthrough&nbsp;{}shader{}&nbsp;simply looks up the texels on the texture, which draws the distance field.":"{}{}注意{}{} SDF 渲染当前不适用于自定义着色器，因为使用默认通过{}着色器{}使用启用 SDF 的字体绘制文本时，只需查找纹理上的纹理元素即可绘制距离场。",
    "{}{}NOTE{}{}&nbsp;The Unicode character 9647 (▯) is used to substitute any missing {}glyph{}s that you may have in your designated font when rendering it in the draw event. So if your font doesn\u0027t have, for example, the ° symbol, then writing 90° will actually produce 90▯.":"{}{}注意{}{} 在绘制事件中呈现时，Unicode 字符 9647(▯) 用于替换指定字体中可能缺少的任何 {} 字形 {}。例如，如果你的字体没有°符号，那么写 90° 实际上会产生 90▯。"
}