{
    "For the HTML5 target module, this function {}can only be used to replace&nbsp;{}Web Fonts{}{}, and will only work if WebGL is {}not{} enabled - if WebGL is enabled then you must use a general font resource (ie: using {}{}draw_set_font(){}{} along with a font from the Asset Browser) or bitmap fonts (see {}{}font_add_sprite(){}{}).":"对于HTML5目标模块，此函数{}只能用于替换{}Web字体{}{}。并且只有在{}未{}启用WebGL时才能工作-如果启用了WebGL，则必须使用常规字体资源(即：使用{}{}draw_set_font(){}{}以及资源浏览器中的字体)或位图字体(请参见{}\\{}font_add_sprite(){}\\{}))。",
    "On all other (non Web) targets, you can use this function to replace a font from a file. The file {}must be included in the game bundle{} using the {}Included Files{} functionality of {}GameMaker{}, and must be either a {}*.ttf{}&nbsp;or&nbsp;{}*.otf{} format font file, useful for adding non-standard fonts like Asian or Arabic.":"在所有其他 (非Web) 目标上，您可以使用此函数替换文件中的字体。文件{}必须使用{}GameMaker{}的{}包含文件{}函数包含在游戏包{}中，并且必须是{}*。ttf{}或{}*。otf{}格式的字体文件，对于添加亚洲或阿拉伯语等非标准字体很有用。",
    "The first character to include (if you\u0027re unsure, go for 32).":"要包含的第一个字符(如果您不确定，请选择32)。",
    "The following table shows the fonts that are standard across all browsers and that should be be available for use without problems. Any other font may or may not exist on the computer or device that is running your game, so the use of this function should be limited to these standard fonts:":"下表显示了所有浏览器中的标准字体，这些字体应该可以毫无问题地使用。运行游戏的计算机或设备上可能存在或不存在任何其他字体，因此此函数的使用应仅限于这些标准字体：",
    "The index of the (previously added) font to be replaced.":"要替换的(以前添加的)字体的索引。",
    "The last character to include (if you\u0027re unsure, go for 128).":"要包含的最后一个字符(如果您不确定，请选择128)。",
    "The name of the font to be used (eg \u0027Arial\u0027), or the file path if the font is an included {}{}*.{}ttf{}&nbsp;or {}*.otf{} file.":"要使用的字体的名称(例如 \u0027Arial\u0027)，或者如果该字体是包含的{}{}*.{}ttf{}或{}*. otf{}文件，则为文件路径。",
    "The size of the font - points for Web Fonts, pixels for file fonts.":"字体的大小-网页字体的点数，文件字体的像素。",
    "This function can be used to replace a font in your game from those fonts that are installed on the system it is running on. Note that the font being replaces {}cannot{}&nbsp;be a font from the Asset Browser, and must be a font that was added previously using the function {}{}font_add(){}{}.":"此函数可用于从运行它的系统上安装的那些字体替换游戏中的字体。请注意，正在替换{}的字体不能{}是来自资源浏览器的字体，并且必须是以前使用函数{}{}font_add(){}{}添加的字体。",
    "This will replace the font indexed in the variable \"myfont\" with a new font that is 24pt in size, uses \"Arial\" and which is bold and italic. The font range includes capital and lower case letters, numbers and all common punctuation.":"这将把变量\" MyFont \"中索引的字体替换为大小为24pt、使用\" Arial \"且为粗体和斜体的新字体。字体范围包括大写字母、小写字母、数字和所有常用标点符号。",
    "When loading a font from a file in this way the {}size{} of the font is in {}pixels{} and the {}first{} and {}last{} values are ignored, meaning all glyphs in the font will be added. Fonts added in this way are assigned to their own texture page, so care should be taken when using this function as it will increment the number of texture swaps when drawing. It is also worth noting that fonts may appear slightly larger when drawn, since glyphs may have parts that are drawn outside of the bounding box defined for the font. You should be aware too that there is a limitation of around 200 glyphs that can be rendered in a single frame for a particular font.":"当以这种方式从文件中加载字体时，字体的{}大小{}以{}像素{}为单位，并且{}第一个{}和{}最后一个{}值被忽略，这意味着将添加字体中的所有字形。以这种方式添加的字体将分配到其自己的纹理页面，因此在使用此函数时应小心，因为它将在绘制时增加纹理交换的次数。同样值得注意的是，字体在绘制时可能会显得稍大，因为字形可能具有绘制在为字体定义的边界框之外的部分。您还应该知道，对于特定字体，在单帧中可以呈现的字形限制在200个左右。",
    "When replacing a font in this way, you can define the size of the font (in points), as well as whether the font should be {}bold{} or {}italic{}, and you can also define the range of characters to include. If the function fails then it will fail silently and the given font will not be replaced.":"以这种方式替换字体时，可以定义字体的大小 (以点数表示)，以及字体应该是{}粗体{}还是{}斜体{}, 还可以定义要包含的字符范围。如果该函数失败，则它将静默失败，并且不会替换给定的字体。",
    "Whether the font is bold (true) or not (false).":"字体是否为粗体(正确)或不正确(错误)。",
    "Whether the font is italic (true) or not (false).":"字体是否为斜体(正确)或不正确(错误)。",
    "{}IMPORTANT{}&nbsp;When targeting HTML5, italics and bold text is only supported if the font asset or web font itself has these characters included. They will not be synthesised from the base font.":"{}重要{}在针对HTML5时，仅当字体资源或web字体本身包含这些字符时，才支持斜体和粗体文本。它们不会从基本字体合成。",
    "{}TIP{}{}&nbsp;{}If you include such a font file&nbsp;with a game, ensure that it is&nbsp;{}properly licensed{} for distribution with the game.":"{}提示{}{}{}如果您在游戏中包含这样的字体文件，请确保该字体文件已获得{}正确许可{}以随游戏分发。",
    "{}{}NOTE{} {}When you load a font into {}GameMaker{} you must remember to remove it again (with {}{}{}font_delete(){}{}{}) when no longer needed, otherwise there is risk of a memory leak which will slow down and eventually crash your game.":"{}{}注意{}{}当您将字体加载到{}GameMaker{}时，您必须记住在不再需要时再次将其删除 (使用{}{}{}font_delete(){}{}{})，否则存在内存泄漏的风险，这将减慢速度并最终使您的游戏崩溃。"
}