{
    "It is also worth noting that there cannot be any {}spaces{} in the character map, so that if you, for example, use \u0027.\u0027 and \u00270\u0027 but not \u0027/\u0027, you need to either include \u0027/\u0027 anyway or leave a blank sub-image between the two used characters.":"同样值得注意的是，字符映射中不能有任何{}空格{}，因此，如果您例如使用 \u0027.\u0027 和 \u00270\u0027 但不使用 \u0027/\u0027，则无论如何都需要包含 \u0027/\u0027 或在两个使用的字符之间留下空白的子图像。",
    "Set as proportional font or not.":"是否设置为比例字体。",
    "The above code will create a new font asset from a sprite asset and store the index of the new font in the variable \"global.Font\" for later use.":"上面的代码将从Sprite资源创建一个新的字体资源，并将新字体的索引存储在变量\" global.font \"中以供以后使用。",
    "The function returns an {}index{} value that should be stored in a variable as this will be needed in all further codes that refer to this font, or it will return -1 if the function fails for any reason.":"该函数返回一个{}index{}值，该值应存储在变量中，因为在引用此字体的所有其他代码中都需要此值，或者如果该函数由于任何原因而失败，它将返回-1。",
    "The index of the first available character.":"第一个可用字符的索引。",
    "The space to leave between each letter.":"每个字母之间要留出的空间。",
    "The sprite itself can be a sprite asset from the Asset Browser or one loaded from a file using {}sprite_add{} first to get the index of the loaded sprite (which is then used in the function). It\u0027s important to note that for the font alignment functions (like {}{}draw_set_halign(){}{}) to work as expected when using a sprite font, the sprite should have its origin set to the {}top left corner{}. If you use other values then you will need to take the origin offset into consideration when drawing text using the font.":"精灵本身可以是来自资源浏览器的精灵资源，也可以是首先使用{}sprite_add{}从文件加载的精灵资源，以获取加载的精灵的索引 (然后在函数中使用)。重要的是要注意，要使字体对齐函数 (例如{}{}draw_set_halign(){}{}) 在使用精灵字体时按预期工作，精灵应将其原点设置为{}左上角{}。如果使用其他值，则在使用字体绘制文本时需要考虑原点偏移量。",
    "The sprite to add a font based on.":"要添加字体的sprite.",
    "With this function you can use a \"sprite strip\" to create a new font asset, where each sub-image would be an individual symbol or letter. The index is the UTF8 map number for the first character to use and the ranges to use are the same as you would for a normal font, starting with \"!\" but remember that you should only include what you need and that you should be using the {}{}ord(){}{}&nbsp;function to get the correct UTF8 value for the starting letter. The created sprite font will then have the sub-images set to an individual glyph from the font, where the \"first\" glyph will have the image_index of 0. You can define \"space\" as being any character you want, for example a single line the size that you want the space to be, and all spaces in text will be rendered at that width (but the image chosen will {}never{} be rendered), or if you don\u0027t supply a sprite for space then the width of the widest character in the sprite font will be used instead.":"使用此函数，您可以使用 \"精灵条\" 来创建新的字体资源，其中每个子图像将是一个单独的符号或字母。索引是第一个要使用的字符的UTF8地图编号，使用的范围与普通字体相同，以 \"!\" 但是请记住，您应该仅包含所需的内容，并且应该使用{}{}ord(){}{}函数来获取起始字母的正确UTF8值。然后，创建的sprite字体将子图像设置为该字体中的单个字形，其中 \"第一个\" 字形的image_index为0。您可以将 \"空格\" 定义为您想要的任何字符，例如，您希望空格大小的单行，并且文本中的所有空格都将以该宽度呈现 (但是选择的图像将{}永远不会{}被呈现)，或者，如果您不提供sprite空间，则将使用sprite字体中最宽字符的宽度。",
    "You can also set the spacing for the font to be proportional ({}true{}) or not ({}false{}), where a proportional font is spaced based on the actual width of the letters (so the letter \"i\" takes less room than the letter \"w\", for example) while a non-proportional font will be spaced based on the sub-image width, like a monospaced font. Finally, you can define the space to leave between each letter when writing, and this can be any integer value, with 0 being no space (the letters will \"touch\" if proportional).":"您还可以将字体的间距设置为按比例 ({}true{}) 或不按比例 ({}false{})，其中按比例字体的间距是根据字母的实际宽度进行的 (因此，字母 \"i\" 占用的空间比字母 \"w\" 少，例如)，而非比例字体将根据子图像宽度进行间隔，例如等宽字体。最后，您可以定义书写时每个字母之间要留出的空间，这可以是任何整数值，0是没有空格的 (如果比例，字母将 \"触摸\")。",
    "{}{}NOTE{} {}When you load a font into {}GameMaker{} you must remember to remove it again (with {}{}{}font_delete(){}{}{}) when no longer needed, otherwise there is risk of a memory leak which will slow down and eventually crash your game.":"{}{}注意{}{}当您将字体加载到{}GameMaker{}时，您必须记住在不再需要时再次将其删除 (使用{}{}{}font_delete(){}{}{})，否则存在内存泄漏的风险，这将减慢速度并最终使您的游戏崩溃。"
}