{
    "-1 if the font was created from a sprite, otherwise the texture ID of the font":"如果字体是从精灵创建的，则为-1，否则为字体的纹理ID",
    "A struct containing information for each glyph in the font (more information is given {}below{})":"包含字体中每个字形信息的结构(更多信息见下文{})",
    "Also note that changing the values of any of these variables, or any variables contained within the {}glyphs{} struct, will not change how the font is rendered,&nbsp;so this information should be considered {}read-only{}.":"另请注意，更改这些变量中任何变量的值，或{}字形{}结构中包含的任何变量的值，不会改变字体的呈现方式，因此，此信息应该考虑{}只读{}。",
    "An array of integers containing kerning information in pairs (or groups of 2). The first integer in a pair is the Unicode value for a character, and the second integer is the amount to add to that character\u0027s shift value (can be positive or negative) if it is preceded by this glyph\u0027s character.":"包含成对(或2个一组)字距调整信息的整数数组。字符对中的第一个整数是字符的Unicode值，第二个整数是要添加到该字符的移位值(可以是正数或负数)的数量(如果该字符前面有该字形的字符)。",
    "An array of integers containing kerning information in pairs (or groups of 2). The first integer in a pair is the Unicode value for a character, and the second integer is the amount to add to that character\u0027s shift value (can be positive or negative) if it is preceeded by this glyph\u0027s character.":"包含成对(或2个一组)字距调整信息的整数数组。字符对中的第一个整数是字符的Unicode值，第二个整数是要添加到该字符的移位值(可以是正数或负数)的数量(如果该字符前面有该字形的字符)。",
    "Font Glyph Struct":"字体字形结构",
    "Font Info Struct":"字体信息结构",
    "Glyphs&nbsp;Struct":"字形结构",
    "If the font was created from a sprite, this will be the image index of the glyph from that sprite, otherwise it will be its Unicode character number{} {} {}{}Note{}: All variables below this will not be present in the struct if the font was created from a sprite{} ":"如果字体是从sprite创建的，则这将是来自该精灵的字形的图像索引，否则它将是其Unicode字符编号{}{}{}{}注意{}：如果字体是从sprite创建的，则以下所有变量都不会出现在结构中{}",
    "If the supplied font doesn\u0027t exist, the function will return {}undefined{}.":"如果提供的字体不存在，函数将返回{}undefined{}。",
    "The SDF spread value set for this font":"为此字体设置的SDF跨页值",
    "The X position of the glyph on the texture page (in texels)":"字形在纹理页面上的X位置(以纹理像素为单位)",
    "The Y position of the glyph on the texture page (in texels)":"字形在纹理页面上的Y位置(以纹理像素为单位)",
    "The approximate size of the font (in pixels)":"字体的近似大小(以像素为单位)",
    "The code above&nbsp;gets the glyph struct for the \"A\" character and prints it to the output log. You can also replace the string ({}\"A\"{}) with a variable that holds a string, which will allow you to get information for any glyph&nbsp;through that variable at runtime.":"上面的代码获取\"A\"字符的字形结构并将其打印到输出日志中。您还可以将字符串({}\" A\"{})替换为包含字符串的变量，这样您就可以在运行时通过该变量获取任何字形的信息。",
    "The effects struct for this font, which can be changed with&nbsp;{}{}font_enable_effects{}{}":"此字体的效果结构，可使用{}{}font_enable_effects{}{}进行更改",
    "The font for which information should be retrieved.":"应检索其信息的字体。",
    "The function returns a {}struct{} with the following variables:":"该函数返回具有以下变量的{}结构{}：",
    "The height of the font\u0027s {}ascender{} (in pixels)":"字体的{}上升{}的高度(以像素为单位)",
    "The height of the glyph on the texture page (in texels)":"纹理页面上标志符号的高度(以纹理像素为单位)",
    "The maximum offset from the baseline to the top of the font (in pixels)":"从基线到字体顶部的最大偏移量(以像素为单位)",
    "The name of the font":"字体的名称",
    "The number of pixels to horizontally offset the rendering of this glyph (can be positive or negative)":"水平偏移此字形渲染的像素数(可以为正或负)",
    "The number of pixels to shift right when advancing to the next character (can be negative for shifting left)":"前进到下一个字符时右移的像素数(左移时可以为负值)",
    "The sprite index for the font if it was {}created from a sprite{}, otherwise -1":"字体的精灵索引(如果是{}从sprite{}创建的)，否则-1",
    "The struct returned for a glyph will contain the following variables:":"为标志符号返回的结构将包含以下变量：",
    "The width of the glyph on the texture page (in texels)":"纹理页面上标志符号的宽度(以纹理像素为单位)",
    "The {}glyphs{} variable in the returned struct will be a struct on its own, containing information for each glyph included in the font. Each variable in this&nbsp;struct will be a glyph\u0027s character name, which will hold a struct containing information for that glyph. You can imagine these nested structs in the following format (starting from the main struct):":"返回的结构中的{}字形{}变量本身将是一个结构，包含字体中包括的每个字形的信息。此结构中的每个变量将是一个字形的字符名称，它将保存一个包含该字形信息的结构。您可以想象这些嵌套结构具有以下格式(从主结构开始)：",
    "This code retrieves information for the font stored in the {}my_font{} variable. If the returned value is {}not {}{}undefined{}&nbsp;and the given font is bold, the instance\u0027s scale is doubled.":"此代码检索存储在{}my_font{}变量中的字体信息。如果返回的值为{}not{}{}undefined{}，给定字体为粗体，则实例的比例加倍。",
    "This code retrieves information for the font stored in the {}my_font{}&nbsp;variable. If the returned value is {}not {}{}undefined{} and the given font is bold, the instance\u0027s scale is doubled.":"此代码检索存储在 {}my_font{} 变量中的字体信息。如果返回的值为{}不是{} {}undefined{}，并且给定的字体为粗体，则实例的比例将加倍。",
    "This function is used to retrieve information&nbsp;for the given font. You supply a font index (which can be an asset added through the {}Asset Browser{} or a font {}added{} at runtime)":"此函数用于检索给定字体的信息。提供字体索引(可以是在运行时通过{}资源浏览器{}添加的资源或已添加的字体{})",
    "This function is used to retrieve information&nbsp;for the given font. You supply a font index (which can be an asset added through the {}Asset Browser{} or a font {}added{} at runtime) and the function returns a {}struct{} with the following variables:":"此函数用于检索给定字体的信息。提供字体索引(可以是在运行时通过{}资源浏览器{}添加的资源或已添加的字体{})，该函数返回具有以下变量的{}结构{}：",
    "This function is used to retrieve information&nbsp;for the given font. You supply a font index, which can be an asset added through {}The Asset Browser{}&nbsp;or a font {}added{} at runtime.":"此函数用于检索给定字体的信息。您可以提供字体索引，它可以是通过 {}\" 资源浏览器 \"{} 添加的资源，也可以是运行时添加的 {} 字体 {}。",
    "Whether SDF is enabled or disabled for this font":"是否为此字体启用或禁用SDF",
    "Whether effects are enabled for this font":"是否为此字体启用效果",
    "You can use a glyph\u0027s character name to retrieve its information from the struct, such as in the following code:":"可以使用标志符号的字符名称从结构中检索其信息，如下面的代码所示：",
    "{}NOTE{}&nbsp;For file fonts loaded at runtime, the&nbsp;{}x{} and {}y{}&nbsp;values for a glyph may be -1 if it hasn\u0027t been rendered yet, as it will have&nbsp;no position on the texture page used for caching.":"{}注意{}对于在运行时加载的文件字体，如果字形尚未渲染，则字形的{}X{}和{}y{}值可能为-1，因为它在用于缓存的纹理页面上没有位置。",
    "{}NOTE{}&nbsp;On HTML5, the glyphs struct will be empty for any loaded file fonts (such as {}*.ttf{} or {}*.otf{})&nbsp;as the runtime will not have information on those glyphs.":"{}注意{}在HTML5上，对于任何加载的文件字体 (例如{}*. ttf{}或{}*. otf{})，字形结构将为空，因为运行时将没有关于这些字形的信息。",
    "{}NOTE{}&nbsp;The {}{}bold{}{} and&nbsp;{}i{}{}talic{} variables only reflect the user\u0027s settings for the font, so they may not be accurate for fonts that&nbsp;appear bold or italic by default.":"{}注意{}{}bold{}{}和{}{}{}italic{}变量仅反映用户对字体的设置，因此对于默认显示为粗体或斜体的字体，这些变量可能不准确。",
    "{}true{} if the font is bold, otherwise {}false{} {}(see {}NOTE {}below){}":"{}true{}如果字体为粗体，否则{}false{}{}(见下文{}注意{}){}",
    "{}true{} if the font is bold, otherwise {}false{}&nbsp;{}(see {}NOTE {}below){}":"{}true{}如果字体为粗体，否则{}false{}{}(见下文{}注意{}){}",
    "{}true{} if the font is italic, otherwise {}false{}&nbsp;{}(see {}NOTE {}below){}":"{}true{}如果字体为斜体，否则{}false{}{}(见下文{}注意{}){}",
    "{}true{} if the font is italic, otherwise {}false{}{} (see {}NOTE {}below){}":"{}true{}如果字体为斜体，否则{}false{}{}(见下文{}注意{}){}",
    "{}{}NOTE{}{}&nbsp;For file fonts loaded at runtime, the&nbsp;{}x{} and {}y{}&nbsp;values for a glyph may be -1 if it hasn\u0027t been rendered yet, as it will have&nbsp;no position on the texture page used for caching.":"{}{}注意{}{} 对于在运行时加载的文件字体，如果字形尚未渲染，则字形的 {}X{} 和 {}Y{} 值可能为 -1，因为它在用于缓存的纹理页面上没有位置。",
    "{}{}NOTE{}{}&nbsp;On HTML5, the glyphs struct will be empty for any loaded file fonts (such as {}*.ttf{} or {}*.otf{})&nbsp;as the runtime will not have information on those glyphs.":"{}{}注意{}{} 在HTML5上，对于任何加载的文件字体 (例如{}*. ttf{}或{}*. otf{})，字形结构将为空，因为运行时将没有关于这些字形的信息。",
    "{}{}NOTE{}{}&nbsp;The {}{}bold{}{} and&nbsp;{}i{}{}talic{} variables only reflect the user\u0027s settings for the font, so they may not be accurate for fonts that&nbsp;appear bold or italic by default.":"{}{}注意{}{} {}{}bold{}{} 和 {}{}{}italic{} 变量仅反映用户对字体的设置，因此对于默认显示为粗体或斜体的字体，这些变量可能不准确。"
}