{
    "If the function fails, then it will fail silently without replacing the given sprite font.":"如果函数失败，那么它将在不替换给定的sprite字体的情况下静默失败。",
    "The index of the first available character.":"第一个可用字符的索引。",
    "The index of the font that shall be replaced (ie all references to this resource past this function will refer to the new font, not the original).":"将被替换的字体的索引(即在此功能之后对此资源的所有引用将引用新字体，而不是原始字体)。",
    "The space between each letter, 0 meaning the right of one letter just touches the left of the next one.":"每个字母之间的空格，0表示一个字母的右边刚好接触下一个字母的左边。",
    "The sprite to add a font based on.":"要添加字体的sprite.",
    "Whether white space around each letter should be removed (if false, the created font will be monospaced, otherwise it\u0027ll be like most regular fonts).":"是否应该删除每个字母周围的空白(如果为false，则创建的字体将为等宽字体，否则将与大多数常规字体一样)。",
    "With this function you can use a \"sprite strip\" to replace a previously created sprite font asset, where each sub-image would be an individual symbol or letter. The index is the UTF8 map number for the first character to use and the ranges to use are the same as you would for a normal font, starting with \"!\" but remember that you should only include what you need and that you should be using the {}{}ord(){}{}&nbsp;function to get the correct UTF8 value for the starting letter.":"使用此功能，您可以使用 \"精灵条带\" 来替换先前创建的精灵字体资源，其中每个子图像将是一个单独的符号或字母。索引是第一个要使用的字符的UTF8地图编号，使用的范围与普通字体相同，以 \"!\" 但是请记住，您应该仅包含所需的内容，并且应该使用{}{}ord(){}{}函数来获取起始字母的正确UTF8值。",
    "You can also set the spacing for the font to be proportional ({}true{}) or not ({}false{}), where a proportional font is spaced based on the actual width of the letters (so the letter \"i\" takes less room than the letter \"w\", for example) while a non-proportional font will be spaced based on the sub-image width, like a monospaced font. Finally, you can define the space to leave between each letter when writing, and this can be any integer value, with 0 being no space (the letters will \"touch\" if proportional).&nbsp;":"您还可以将字体的间距设置为按比例 ({}true{}) 或不按比例 ({}false{})，其中按比例字体的间距是根据字母的实际宽度进行的 (因此，字母 \"i\" 占用的空间比字母 \"w\" 少，例如)，而非比例字体将根据子图像宽度进行间隔，例如等宽字体。最后，您可以定义书写时每个字母之间要留出的空间，这可以是任何整数值，0是没有空格的 (如果比例，字母将 \"触摸\")。",
    "t is also worth noting that there cannot be any {}spaces{} in the character map, so that if you, for example, use \u0027.\u0027 and \u00270\u0027 but not \u0027/\u0027, you need to either include \u0027/\u0027 anyway or leave a blank sub-image between the two used characters. The image below shows a typical sprite font layout:":"t还值得注意的是，字符映射中不能有任何{}空格{}，因此，如果您例如使用 \u0027.\u0027 和 \u00270\u0027 但不使用 \u0027/\u0027，则无论如何都需要包含 \u0027/\u0027 或在两个使用的字符之间留下空白的子图像。下图显示了典型的精灵字体布局:"
}