{
    "The above code will draw whatever text the user types into the keyboard, splitting it onto new lines every time the string length for that line exceeds 300 pixels. the code will also maintain a separation of 5 pixels between lines should this occur. Each line of the text will be coloured using a blue gradient, with light blue at the top and dark blue at the bottom.":"上述代码将绘制用户在键盘中键入的任何文本，每当该行的字符串长度超过300像素时，就将其拆分为新行。如果发生这种情况，代码还将在行之间保持5像素的分隔。文本的每一行都将使用蓝色渐变进行着色，顶部为浅蓝色，底部为深蓝色。",
    "The alpha for the text.":"文本的Alpha。",
    "The colour for the bottom left of the drawn text.":"绘制文本左下角的颜色。",
    "The colour for the bottom right of the drawn text.":"绘制文本右下角的颜色。",
    "The colour for the top left of the drawn text.":"绘制文本左上角的颜色。",
    "The colour for the top right of the drawn text.":"绘制文本右上角的颜色。",
    "The distance in pixels between lines of text.":"文本行之间的距离，以像素为单位。",
    "The maximum width in pixels of the string before a line break.":"换行前字符串的最大宽度(以像素为单位)。",
    "The string to draw.":"绘制的字符串。",
    "The x coordinate of the drawn string.":"绘制字符串的x坐标。",
    "The y coordinate of the drawn string.":"绘制字符串的y坐标。",
    "This function is a combination of the base {}{}draw_text{}{}(){}{}{}{} function with the {}{}draw_text_ext{}{}(){}{}{}{} and {}{}draw_text_colour{}{}(){}{}{}{} functions, permitting you to define gradient colours for text as well as the line spacing and maximum width per line all together.":"此函数是基于{}{}draw_text{}{}(){}{}{}{}函数与{}{}draw_text_ext{}{}(){}{}{}{}和{}{}draw_text_colour{}{}(){}{}{}{}函数的组合，允许您一起定义文本的渐变色以及每行的行距和最大宽度。",
    "{}{}NOTE{} {}Gradient blending is not available for the HTML5 target unless WebGL is enabled, although you can still set the blending colours and it will blend the font with the first given colour. However all blending in this way creates a duplicate font which is then stored in the cache and used when required, which is far from optimal and if you use multiple colour changes it will slow down your games performance. You can set the font cache size to try and limit this should it be necessary using the function {}{}font_set_cache_size(){}{}.":"{}{}注意{}{}梯度混合对于HTML5目标来说是不可用的，除非启用了WebGL，尽管你仍然可以设置混合颜色，它将把字体与第一个给定的颜色混合。然而，所有以这种方式进行的混合都会创建一个重复的字体，然后存储在缓存中并在需要时使用，这远非最佳状态，而且如果你使用多种颜色变化，会降低你的游戏性能。如果有必要，你可以使用函数{}{}font_set_cache_size(){}{}来设置字体缓存大小，以尝试限制这种情况。"
}