{
    "Async Image Loaded Event":"异步图像加载事件",
    "Create Event":"创建事件",
    "Draw Event":"绘制事件",
    "In the async&nbsp;{}Image Loaded{}&nbsp;event the value stored in&nbsp;{}async_load[?\"id\"]{} is compared to the value in {}new_sprite{}. If the two are equal, it means this Image Loaded event was triggered for the call to&nbsp;{}{}sprite_add_ext{}{}&nbsp;made earlier in the Create event (there may be {}many{} other calls to {}{}sprite_add_ext{}{}). The ID of the newly loaded sprite is then assigned as this instance\u0027s {}sprite_index{}.":"在异步{}图像加载{}事件中，将存储在 {}async_load[?\"id\"]{} 中的值与 {}new_sprite{} 中的值进行比较。如果两者相等，则意味着此图像加载事件是为前面在创建事件中调用 {}{}sprite_add_ext{}{} 而触发的(可能还有{}许多其他{}对 {}{}sprite_add_ext{}{} 的调用)。然后，将新加载的精灵的 ID 指定为该实例的 {}sprite_index{}。",
    "In the&nbsp;{}Draw Event{}&nbsp;instances of the object call&nbsp;{}{}draw_self{}{}&nbsp;if their {}sprite_index{} is not set to {}-1{}&nbsp;(or, rather, {}no longer{} set to {}-1{}).":"在对象调用的{}绘制事件{}实例中，如果它们的{}sprite_index{}未设置为{}-1{}(或者，更确切地说，{}不再{}设置为{}-1{})，则调用 {2}{3}draw_self{4}{5} 。",
    "Sprite Add Error Constant":"精灵添加错误常量",
    "The above example defines code in three&nbsp;{}Object Events{}. In the {}Create{} event the instance\u0027s&nbsp;{}{}sprite_index{}{}&nbsp;is first set to {}-1{} and the function&nbsp;{}{}sprite_add_ext{}{}&nbsp;is called with {}fname{}&nbsp;set to {}\"my_new_sprite_index.png\"{} (i.e. an image file in the root of the datafiles directory). The sprite ID returned by the function is stored in an instance variable {}new_sprite{}.":"上例定义了三个{}对象事件{}中的代码。在{}创建{}事件中，实例的 {}{}sprite_index{}{} 首先设置为 {}-1{}，调用函数 {}{}sprite_add_ext{}{} 时，将 {}fname{} 设置为 {}\"my_new_sprite_index.png\"{}( 即数据文件目录根目录中的图像文件)。该函数返回的精灵 ID 存储在实例变量 {}new_sprite{} 中。",
    "The number of subimages in the file (1 for a single image, GIF or Spine sprite)":"文件中的子图像数 (1 表示单个图像、GIF 或 Spine 精灵)",
    "The path to the image file to add as a sprite (either a local file path or a web address)":"要添加为精灵的图像文件的路径(本地文件路径或网址)",
    "The supported image file formats are&nbsp;{}PNG, JPEG, GIF, QOIF and Spine JSON files (the Spine JSON files require that their associated atlas and image files are placed next to them).{}":"支持的图像文件格式为 {}PNG、JPEG、GIF、QOIF 和 Spine JSON 文件 (Spine JSON 文件要求将其关联的图集和图像文件放置在其旁边)。{}",
    "The x position of the new sprite\u0027s origin":"新的精灵原点的 X 位置",
    "The y position of the new sprite\u0027s origin":"新的精灵原点的 Y 位置",
    "The&nbsp;{}{}async_load{}{}&nbsp;{}DS Map{} will contain the following fields in the async&nbsp;{}Image Loaded{}&nbsp;event:&nbsp;":"{}{}async_load{}{}{}DS 映射 {} 将在异步 {} 图像已加载 {} 事件中包含以下字段：",
    "This function loads an image from an external file or URL {}asynchronously{} and adds it as a new sprite.":"此函数用于从外部文件或 URL {}异步{}加载图像，并将其添加为新的精灵。",
    "This is the asynchronous version of&nbsp;{}{}sprite_add{}{}; instead of blocking execution of code and thereby freezing the game, it continues execution of the game\u0027s code after the function is called and triggers an asynchronous&nbsp;{}Image Loaded{}&nbsp;event once the sprite is fully loaded.":"这是 {}{}sprite_add{}{} 的异步版本，而不是阻止代码执行从而冻结游戏，而是在调用函数后继续执行游戏代码，并在精灵完全加载后触发异步{}图像已加载{}事件。",
    "Whether to immediately load the sprite into GPU memory":"是否立即将精灵加载到 GPU 内存中",
    "{}\"filename\"{} - the path to the file that was originally passed to the function":"{}\"filename\"{} - 最初传递给函数的文件的路径",
    "{}\"http_status\"{} -&nbsp;{}contains the status value of the HTTP request if one was made, or 200 (\"OK\") if the image was loaded from a file{}":"{}\"http_status\"{} - {}如果发出请求，则包含 HTTP 请求的状态值，如果图像是从文件加载的，则返回 200(\"OK\"){}",
    "{}\"id\"{} - the sprite ID, as returned by the function":"{}\"id\"{} - 函数返回的精灵 ID",
    "{}\"status\"{} - contains a value of 0 or greater to indicate the load was successful, or one of the following (negative) error codes in case something went wrong:&nbsp;":"{}\"status\"{} - 包含 0 或更大的值以指示加载成功，或包含以下(负)错误代码之一，以防出现错误：",
    "{}Indicates that, even though all data was loaded and decompressed, sprite resource creation itself failed.{}":"{}表示即使加载并解压缩了所有数据，精灵资源创建本身也失败。{}",
    "{}This constant indicates that image decompression failed (which could be due to e.g. a corrupted file or unsupported image format).{}":"{}此常量表示图像解压缩失败(可能是由于文件损坏或图像格式不受支持等原因)。{}",
    "{}This constant indicates that the request was cancelled while it was in progress.{}":"{}此常量表示请求在进行过程中被取消。{}",
    "{}This is a generic error code when none of the others apply (the HTML5 runner only returns this constant in case of failure).{}":"{}这是当其他任何代码都不适用时的一般性错误代码 (HTML5 runner 仅在失败的情况下返回此常量)。{}",
    "{}This {}constant {}indicates that a sprite was removed somehow partway through the loading process.{}":"{}此{}常量{}表示精灵在加载过程中以某种方式被移除。{}",
    "{}This&nbsp;{}constant {} indicates that a file loading operation failed.{}":"{}此{}常量{}表示文件加载操作失败。{}",
    "{}{}{}NOTE{}{}&nbsp;Spine JSON files are only supported for locally stored files, not for files requested via HTTP (the same as for&nbsp;{}{}sprite_add{}{}).{}":"{}{}{}注意{}{} Spine JSON文件仅支持本地存储的文件，不支持通过 HTTP 请求的文件(与 {}{}sprite_add{}{}相同)。{}"
}