{
    "If you have a sprite that draws 1 frame per {}game frame{} and set the image speed to 0.5 it will draw 0.5 frames per game frame. If your game frame rate is 60 frames per second then the sprite will draw 30 frames for every 60 game frames.":"如果你有一个精灵，每{}游戏帧{}绘制1帧，并将图像速度设置为0.5，它将每游戏帧绘制0.5帧。如果你的游戏帧率是每秒60帧，那么精灵将为每60个游戏帧绘制30帧。",
    "If you have a sprite that draws 1 frame per {}second{} and set the image speed to 0.5 it will draw at 0.5 frames per second. If your game frame rate is 60 frames per second then the sprite will draw 1 frame for every 120 game frames.":"如果您有一个每{}秒{}绘制1帧的精灵，并将图像速度设置为0.5，则它将以每秒0.5帧的速度绘制。如果你的游戏帧率是每秒60帧，那么精灵将为每120个游戏帧绘制1帧。",
    "The above code sets the base animation speed for the sprite assigned to the instance to 10 frames per second.":"上面的代码将指定给实例的精灵的基础动画速度设置为每秒10帧。",
    "The index of the sprite to set the animation speed of":"要设置动画速度的sprite的索引",
    "The speed type to use":"要使用的速度类型",
    "The speed value to set":"要设置的速度值",
    "The sprite was defined with animation in {}frames per second{}.":"精灵是用每秒{}帧的动画来定义的。",
    "The sprite was defined with in animation in {}frames per game frame{}.":"在动画中，精灵被定义为每个游戏帧{}中的{}帧。",
    "This function can be used to set the base animation speed and type as for the sprite resource. This is normally set in the {}Sprite Editor{}, but there may be moments when you are required to set this manually for a given sprite resource. You need to supply the sprite index to set, the animation speed and the type of animation speed to apply. The animation speed type can be any one of the following constants:":"此函数可用于设置Sprite资源的基础动画速度和类型。这通常是在{}Sprite编辑器{}中设置的，但有时可能需要为给定的Sprite资源手动设置。您需要提供要设置的精灵索引、动画速度和要应用的动画速度类型。动画速度类型可以是以下常量之一：",
    "You can find out what the speed value used for the sprite animation was using the function {}{}sprite_get_speed(){}{}, and you can get the animation speed type using {}{}sprite_get_speed_type(){}{}.":"您可以使用函数{}{}sprite_获取_速度（）{}{}来找出用于sprite动画的速度值，并且您可以使用函数{}{Sprite_获取_速度_类型（）{}\\{}来获取动画速度类型。",
    "{} Selecting the type of speed to use to calculate animations is very important as there is a huge difference between the two options. The following two examples illustrate this difference:":"{}选择用于计算动画的速度类型非常重要，因为这两个选项之间存在巨大差异。以下两个例子说明了这种差异：",
    "{}IMPORTANT!{} This function will affect the sprite {}resource{} so any changes you make with this function will affect {}all{} instances that are using the sprite and all future instances too.":"{}重要！{}此函数将影响精灵{}资源{}，因此您使用此函数所做的任何更改都将影响{}所有正在使用该精灵的{}实例以及所有未来的实例。"
}