{
    "The above code loads a sprite into a local variable then merges it with another sprite that has been duplicated. Finally the merged sprite is assigned to the instance {}sprite_index{} while the loaded sprite is removed to free the memory it uses. Note that at some point after this operation, like in the Destroy or Room End events, you will also need to use {}{}sprite_delete(){}{} to remove the merged sprite from memory too.":"上面的代码将一个sprite加载到一个局部变量中，然后将其与另一个已复制的sprite合并。最后，合并的sprite被分配给实例{}sprite_索引{}，而加载的sprite被移除。来释放它使用的内存。请注意，在此操作之后的某个时刻，如在销毁或房间结束事件中，您还需要使用{}{}sprite_delete(){}{}来删除合并的sprite也是凭记忆。",
    "The index of the sprite that ind1 is to be merged with.":"要与ind1合并的sprite的索引。",
    "The index of the sprite to merge.":"要合并的sprite的索引。",
    "This change is permanent, and from the moment you use this function until the game is closed or the sprite deleted, the sprite that is being merged into will be changed, however the sprite that it is being merged with will remain the same.":"此更改是永久性的，从您使用此函数的那一刻起，直到游戏关闭或精灵被删除，正在合并的精灵将被更改，但与其合并的精灵将保持不变。",
    "This function will merge the sprite indexed in argument 1 (\"ind2\") with that which is indexed in argument 0 (\"ind1\"). The images themselves are {}NOT{} merged together, but rather the image indices are merged, with the sub images from sprite \"ind2\" appended onto those of sprite \"ind1\", ie: they are added on at the end. Note that if the sprites are different sizes, then the appended sprites are stretched to fit the image size for \"ind1\".":"此函数将参数1（\"ind2\"）中索引的sprite与参数0（\"ind1\"）中索引的sprite合并。图像本身{}不是{}合并在一起，而是图像索引合并，将精灵\"ind2\"的子图像附加到精灵\"ind1\"的子图像上，即：将它们添加到末尾。请注意，如果精灵大小不同，则附加的精灵将被拉伸以适合图像大小对于\"ind1\"。",
    "{}NOTE{}: Neither the image asset that is being merged into, nor the image asset that is for merging, can be one of the original game resources. You must use {}{}{}sprite_duplicate(){}{}{} first to create two new resources (if you are merging included game assets) and then merge those.":"{}注意{}：正在合并到的图像资源和要合并的图像资源都不能是原始游戏资源之一。您必须首先使用{}{}{}sprite_duplicate(){}{}{}创建两个新资源（如果您正在合并包含的游戏资源），然后合并它们。",
    "{}NOTE{}: This function is only useful for {}bitmap{} sprites and will not work with SWF or JSON (Spine) sprites.":"{}注意{}：此函数仅适用于{}位图{}精灵，不适用于SWF或JSON（Spine）精灵。"
}