{
    "Below is an image that illustrates how this function works:":"下图说明了此函数的工作原理：",
    "In this extended example we show how you can create a special effect sprite from two sprite resources. To start with we need to have a controller variable in the {}Create Event{} of the instance. This variable is to ensure that the sprite is only created once:":"在这个扩展的例子中，我们展示了如何从两个精灵资源中创建一个特殊效果精灵。首先，我们需要在实例的{}创建事件{}中有一个控制器变量。此变量用于确保只创建一次sprite：",
    "Once that is done we need to then go to the {}Draw Event{} and add in this code:":"完成后，我们需要转到{}Draw事件{}并添加以下代码：",
    "The above code first checks to see if the control variable is true or not, and if it is, it then runs the code to set the sprite alpha, setting the variable to false to prevent the code from running more than once. In this case, it creates a surface the size of the alpha mask that we wish to use, then draws the sprite that is to have its alpha changed onto the surface and creates a new sprite from it, assigning it as the {}sprite_index{} of the object. The code then clears the surface and draws the alpha map sprite to it and creates another new sprite, storing its index in a local variable. Finally, the new sprite assigned to the object gets its alpha set from this temporary sprite, the surface is freed and the temporary sprite is removed.":"上面的代码首先检查控制变量是否为true，如果为true，则运行代码以设置sprite alpha，将变量设置为false以防止代码多次运行。在本例中，它创建了一个我们希望使用的alpha遮罩大小的表面，然后将要更改其alpha的精灵绘制到该表面上，并从中创建一个新的精灵，将其指定为对象的{}sprite_索引{}。然后，代码清除表面并将Alpha Map Sprite绘制到该表面，并创建另一个新的精灵，将其索引存储在局部变量中。最后，分配给对象的新sprite从该临时sprite获得其alpha集，释放表面并移除临时sprite.",
    "The index of the sprite to change the transparency map of.":"要更改透明贴图的精灵的索引。",
    "The index of the sprite to take the transparency map data from.":"要从中获取透明贴图数据的精灵的索引。",
    "There is one final thing to do here, and that is remove the sprite that has been created for the object from memory when not in use. This would either be done in the {}Destroy Event{} or the {}Room End Event{} like this:":"这里还有最后一件事要做，那就是在不使用时从内存中删除为对象创建的精灵.这将在{}销毁事件{}或{}房间结束事件{}中完成，如下所示：",
    "This function uses the value/saturation of one sprite and multiplies it with the alpha of the target sprite. Ideally the sprite being used to generate the new alpha map should be grey-scale, with the white areas having an equivalent alpha value of 1 (opaque), the black areas being equivalent to alpha 0 (transparent), and the grey areas being an alpha in between 0 and 1. The sprite that you are setting the alpha of {}cannot be a permanent resource{}, nor can the sprite you use to set the alpha, as this will give an error. This means that you must create two completely new sprites \"on the fly\" in some way for the function to work correctly. This can be achieved by using surfaces, or by creating a sprite from the screen (the code example below shows how the effect can be achieved with surfaces).":"此函数使用一个精灵的值/饱和度，并将其与目标精灵的Alpha相乘。理想地，用于生成新的阿尔法图的精灵应该是灰度级的，其中白色区域具有等效的阿尔法值1(不透明)，黑色区域等效于阿尔法0(透明)，而灰色区域是介于0和1之间的阿尔法。您正在设置{}的alpha的精灵不能是永久资源{}，您用来设置alpha的精灵也不能是永久资源{}，因为这样会出错。这意味着您必须以某种方式“即时”创建两个全新的精灵，才能使该函数正常工作。这可以通过使用表面或从屏幕创建精灵来实现(下面的代码示例显示了如何使用表面实现该效果)。",
    "{}NOTE{}: This function is only useful for {}bitmap{} sprites and will not work with SWF or JSON (Spine) sprites.":"{}注意{}：此函数仅适用于{}位图{}精灵，不适用于SWF或JSON(Spine)精灵。",
    "{}{}{}NOTE{}{}{} This function is only useful for {}bitmap{} sprites and will not work with SWF or JSON (Spine) sprites.":"{}{}{}注意{}{}{}此函数仅对{}位图{}精灵有用，不适用于 SWF 或 JSON(Spine) 精灵。"
}