{
    "\"Default\" Groups":"\"默认\"组",
    "\"Dynamic\" Groups":"\"动态\"组",
    "A Default Texture Group is included in your final game\u0027s package (WAD file). Any such texture groups are loaded into RAM as soon as the game starts, and pre-fetched into VRAM when required or {}asked{}.":"默认纹理组包含在最终游戏的软件包(WAD文件)中。游戏开始后，任何此类纹理组都会立即加载到RAM中，并在需要时预取到VRAM中，或者{}询问{}。",
    "A Dynamic Texture Group is not loaded when the game starts. It\u0027s either loaded when required (i.e. when an image from it is drawn) or when you load it manually.":"游戏开始时不会加载动态纹理组。它可以在需要时加载(即从中绘制图像时)，也可以在手动加载时加载。",
    "A Texture Group is loaded into RAM when the game starts, unless it\u0027s a {}Dynamic Texture Group{}, which is loaded later.":"游戏开始时，会将纹理组加载到RAM中，除非它是稍后加载的{}动态纹理组{}。",
    "Dynamic Group Modes":"动态组模式",
    "Explicit":"显式",
    "Here are some more functions relating to Dynamic groups:":"下面是一些与动态组相关的更多功能：",
    "How Textures Work":"纹理的工作原理",
    "If you set the group format to \"PNG\", the exported texture files will become directly editable, allowing them to be modified by players.":"如果将组格式设置为\"PNG\"，则导出的纹理文件将变为可直接编辑，允许玩家对其进行修改。",
    "Implicit":"隐式",
    "More Functions":"更多功能",
    "Paths and Modding":"路径和建模",
    "Textures being unloaded at runtime, showing the fallback sprite":"在运行时卸载纹理，显示回退精灵",
    "The {}fallback sprite{} used in the example above was created as a gradient checkerboard, so you can tell which part of the fallback texture is being drawn at any moment, and what scale it\u0027s being drawn at, which may help diagnose texture-related issues.":"上面示例中使用的{}回退精灵{}是作为渐变棋盘创建的，因此您可以随时判断正在绘制回退纹理的哪个部分，以及绘制的比例，这可能有助于诊断与纹理相关的问题。",
    "This is the default setting. This enables automatic loading of Dynamic groups, so when an image from an unloaded Dynamic group is drawn, it will trigger the loading of that Texture Group.{} {} This may cause a small freeze as the texture is loaded into VRAM and decompressed, so making use of implicit loading is {}not recommended{}.{} {} When a Texture Group is triggered implicitly, only the required Texture Page is loaded. For example, if your unloaded Texture Group has 4 Texture Pages, and you attempt to draw something from Texture Page 2, only that page will be loaded, and Texture Pages 1, 3 and 4 will remain on disk. ":"这是默认设置。这样可以自动加载动态组，因此当绘制来自已卸载的动态组的图像时，它将触发该纹理组的加载。{}{}当纹理加载到 VRAM 中并解压缩时，这可能会导致小幅冻结，因此{}不推荐{}使用隐式加载。{}{}当隐式触发纹理组时，仅加载所需的纹理页面。例如，如果您卸载的纹理组有 4 个纹理页面，而您尝试从 Texture Page 2 中绘制某些内容，则只加载该页面，纹理页面 1、3 和 4 将保留在磁盘上。",
    "This setting disables automatic loading of Dynamic groups, meaning you have to {}load them manually{}. When you try drawing an image from a Texture Group that hasn\u0027t been loaded, the image will not draw, and an error will be printed to the output log.{} {} You can set a \"fallback\" sprite in&nbsp;{}{}texturegroup_set_mode(){}{}&nbsp;which would be drawn in place of a texture that hasn\u0027t been loaded. ":"此设置禁用动态组的自动加载，这意味着您必须{}手动加载它们{}。当您尝试从尚未加载的纹理组绘制图像时，图像将不会绘制，并且错误将打印到输出日志中。{}{}您可以在{}{}texturegroup_set_mode(){}{}中设置\"回退\"精灵，该精灵将代替尚未加载的纹理。",
    "This setting is global and can\u0027t be applied per-group.":"此设置是全局设置，不能按组应用。",
    "Using&nbsp;{}{}texturegroup_set_mode(){}{}&nbsp;you can set the \"mode\" for Dynamic groups to either \"{}Implicit{}\" (default) or \"{}Explicit{}\". This changes whether Dynamic groups can be loaded automatically.":"使用{}{}texturegroup_set_mode(){}{}可以将动态组的\"模式\"设置为\"{}隐式{}\"(默认值)或\"{}显式{}\"。这将更改是否可以自动加载动态组。",
    "When an image from a Texture Group is drawn, or one of the {}pre-fetch{} functions is run, then the Texture Group is decompressed and loaded into VRAM (video memory).":"当从纹理组中绘制图像或运行{}预取{}功能之一时，纹理组将被解压缩并加载到VRAM(视频存储器)中。",
    "When the fallback sprite is displayed, its whole texture page is drawn, so it\u0027s recommended to enable {}Separate Texture Page{} for your fallback sprite, preventing unintended graphics from appearing. The texture page for the fallback sprite is automatically loaded even if it\u0027s set as a Dynamic page.":"显示回退精灵时，将绘制其整个纹理页面，因此建议为回退精灵启用{}单独纹理页面{}，以防止出现意外的图形。回退精灵的纹理页面将自动加载，即使其设置为\"动态\"页面也是如此。",
    "While in the RAM, the Texture Group stays compressed, as it was on disk.":"在\"RAM\"中，纹理组保持压缩状态，因为它在磁盘上。",
    "You can also unload a texture group using&nbsp;{}{}texturegroup_unload(){}{}, which will remove it from memory and place it back into disk in its original, compressed form.":"也可以使用{}{}texturegroup_unload(){}{}卸载纹理组，这将从内存中删除该纹理组并将其以其原始压缩形式放回磁盘。",
    "You can disable pre-fetching by setting the function\u0027s second argument to {}false{}. This will leave you to manually {}pre-fetch{} it later, or have it fetched automatically when an image is drawn from it (the latter is not recommended due to it being synchronous).":"您可以通过将函数的第二个参数设置为{}false{}来禁用预取。这将使您稍后手动{}预取{}它，或者在从中绘制图像时自动获取它(由于它是同步的，不建议使用后者)。",
    "You can {}flush{} a Texture Group to remove it from VRAM (this doesn\u0027t remove them from RAM).":"您可以{}刷新{}纹理组以将其从VRAM中删除(这不会将其从RAM中删除)。",
    "You load a Dynamic Texture Group into RAM manually by calling&nbsp;{}{}texturegroup_load(){}{}. By default, this function will also decompress the group and pre-fetch it into VRAM.":"您可以通过调用{}{}texturegroup_load(){}{}将动态纹理组手动加载到RAM中。默认情况下，此功能还会解压缩该组并将其预取到VRAM中。",
    "{}Dynamic Textures{}":"{}动态纹理{}",
    "{}In the {}Texture Group{} settings, you can mark a group as \"{}Default{}\" or \"{}Dynamic{}\".":"{}在{}纹理组{}设置中，可以将组标记为\"{}默认值{}\"或\"{}动态{}\"。",
    "{}In the&nbsp;{}Texture Groups{}&nbsp;settings, you can set the path where the Dynamic group will be placed within the final game directory. Without a set path, the textures will be placed at the root of the game\u0027s directory.":"{}在{}纹理组{}设置中，您可以设置动态组将放置在最终游戏目录中的路径。如果没有设置路径，纹理将被放置在游戏目录的根目录中。",
    "{}{}NOTE{}{}&nbsp;Before a Dynamic Texture Group is loaded, you can\u0027t run operations that require reading its contained assets, such as {}duplicating a sprite{}&nbsp;(this will trigger the texture group to load but the function will still fail as it can\u0027t load immediately). You can however read texture information such as {}UVs{} and {}TPE{}.":"{}{}注意{}{}在加载动态纹理组之前，无法运行需要读取其包含的资源的操作，例如{}复制精灵{}(这将触发加载纹理组，但该功能仍将失败，因为无法立即加载)。但是，您可以读取纹理信息，如{}UVs{}和{}TPE{}。",
    "{}{}NOTE{}{}&nbsp;Texture decompression is asynchronous on all platforms except GX.games, which might cause stutters as textures are decompressed in-game. To avoid this, ensure your textures are prefetched during loading screens or another inactive parts of your game.":"{}{}注意{}{}除Gx.games外，所有平台上的纹理解压缩都是异步的。这可能会导致游戏中纹理解压缩时出现卡顿。要避免这种情况，请确保在加载屏幕或游戏的其他非活动部分时预取纹理。",
    "{}{}texturegroup_get_status(){}{}: This returns the status of a texture group, telling you whether it\u0027s loaded, unloaded, currently loading, or fetched into VRAM.":"{}{}texturegroup_get_status(){}{}：这将返回纹理组的状态，告诉您该纹理组是已加载、已卸载、当前正在加载还是已读取到VRAM。",
    "{}{}texturegroup_set_mode(){}{}: In addition to setting the mode, you can also enable debugging with this function, which will display information about all Texture Pages on-screen:{} {} ":"{}{}texturegroup_set_mode(){}{}：除了设置模式外，还可以使用此函数启用调试，此函数将在屏幕上显示有关所有纹理页面的信息：{}{}",
    "这是默认设置。这样可以自动加载动态组，因此当绘制来自已卸载的动态组的图像时，它将触发该纹理组的加载。{}{}当纹理加载到 VRAM 中并解压缩时，这可能会导致小幅冻结，因此{}不推荐{}使用隐式加载。{}{}当隐式触发纹理组时，仅加载所需的纹理页面。例如，如果您卸载的纹理组有 4 个纹理页面，而您尝试从 Texture Page 2 中绘制某些内容，则只加载该页面，纹理页面 1、3 和 4 将保留在磁盘上。":"这是默认设置。这样可以自动加载动态组，因此当绘制来自已卸载的动态组的图像时，它将触发该纹理组的加载。{}{}当纹理加载到 VRAM 中并解压缩时，这可能会导致小幅冻结，因此{}不推荐{}使用隐式加载。{}{}当隐式触发纹理组时，仅加载所需的纹理页面。例如，如果您卸载的纹理组有 4 个纹理页面，而您尝试从 Texture Page 2 中绘制某些内容，则只加载该页面，纹理页面 1、3 和 4 将保留在磁盘上。"
}