{
    "An image that is to be tiled will have the edges (horizontal or vertical) added to by the edges from the opposite side, while if no tiling is selected the sprite will be {}clamped {}and the edges pixels will be repeated (note that tilesets also have a setting for the output border width, found in the {}Tile Set Properties{} which does the same thing, only for each tile in the set). The following image illustrates this:":"要平铺的图像将通过对面的边添加边(水平或垂直)，而如果未选择平铺，则精灵将被{}夹住{}并重复边像素(请注意，平铺集还具有输出边框宽度的设置，可在{}平铺集属性{}中找到，该属性仅对集中的每个平铺执行相同的操作)。下图说明了这一点：",
    "If you assign the sprite a separate texture page, you can also set whether it\u0027s {}dynamic{} or not.":"如果为sprite指定单独的纹理页面，还可以设置是否为{}动态{}。",
    "It is important to understand how the different available texture settings will affect an image, so let\u0027s look at the {}Sprite Editor{} section titled {}Texture Settings{}, shown below:":"了解不同的可用纹理设置将如何影响图像非常重要，因此让我们查看{}精灵编辑器{}部分，标题为{}纹理设置{}，如下所示：",
    "It should be&nbsp;noted that in the individual platform tabs that can be found in the {}Game Options{} there is a button that permits you to view the texture pages that you have defined, just as they would be created for each target. This is very handy for working out how many pages are being created and what\u0027s on them.":"应该注意，在{}游戏选项{}中可以找到的各个平台选项卡中，有一个按钮允许您查看已定义的纹理页面，就像为每个目标创建纹理页面一样。这对于计算正在创建的页面数以及页面上的内容非常方便。",
    "Note too that if your images have a lot of empty space (i.e.: transparent pixels) around them, then they will be cropped by default to remove any of these \"invisible\" pixels and pack as many images as possible onto a single texture page. If this is not what you wish to happen, then you need to disable it from the {}Texture Groups{} window.":"另请注意，如果您的图像周围有大量空白空间(即透明像素)，则默认情况下将裁剪这些图像，以删除任何\"不可见\"像素，并将尽可能多的图像打包到单个纹理页面上。如果这不是您希望发生的情况，则需要从{}\"纹理组\"{}窗口中禁用它。",
    "Separate Texture Page":"单独的纹理页面",
    "Should you have a texture in your game that is larger than the maximum selected texture page size, then this will be {}scaled down by half {}(and half again if necessary) until it fits on the maximum page size. It will {}not {}be split into sections over various texture pages. This means that when you test your game on Windows, Ubuntu (Linux) or MacOS the game may look fine as you are using larger texture pages, but on iOS (or any of the other targets that require a smaller texture page size for optimal performance) the texture may look blurred or have artefacts. It is essential that you make sure your images are all able to fit on the smallest of the texture page sizes that your game will use, and if not then you should split them into smaller images and then draw them together in your game to give the illusion of one large, complete, image.":"如果游戏中的纹理大于选定的最大纹理页面大小，则将{}缩小一半{}(如有必要，再缩小一半)，直到适合最大页面大小。它{}不会{}拆分为各种纹理页面上的部分。这意味着，当您在Windows、Ubuntu(Linux)或MacOS上测试游戏时，游戏可能看起来很好，因为您正在使用较大的纹理页面，但是在iOS(或任何其他需要较小纹理页面大小以获得最佳性能的目标)上，纹理可能看起来模糊或有瑕疵。必须确保您的图像能够适应游戏将使用的最小纹理页面大小，如果不能，则应将它们拆分为较小的图像，然后在游戏中将它们绘制在一起，以产生一个大的、完整的图像的错觉。",
    "Texture Pages":"纹理页面",
    "These relate to how the edges of the image will be created when placed on the texture page.":"这些内容与放置在纹理页面上时如何创建图像的边有关。",
    "Tile Horizontally &amp; Tile Vertically":"水平平铺和垂直平铺",
    "Underneath those settings is the {}Separate Texture Page {}setting. This option will force {}GameMaker{} to place this image on its own unique texture page and there are no options associated with this as the tiling or clamping is controlled directly through code. This is most commonly used for texturing 3D models (in which case the texture should be a power of 2, eg: 128x128, 512x512, 256x1024, etc...), but you can use it to force any image to be drawn to its own unique page.":"在这些设置下面是{}单独纹理页面{}设置。此选项将强制{}GameMaker{}将此图像放置在其自己的唯一纹理页面上，并且不存在与此相关的选项，因为平铺或夹紧是通过代码直接控制的。这通常用于纹理3D模型(在这种情况下，纹理应为2的幂，例如：128 x 128、512 x 512、256 x 1024等)，但您可以使用它强制将任何图像绘制到自己的唯一页面。",
    "When you create a game with {}GameMaker{}, you will surely have created graphics - Sprites, Tile Sets and Fonts - to go along with it. These graphics are stored on {}Texture Pages{} which {}GameMaker{} builds for you from all the image assets that your game contains. Below is an example of a complete texture page:":"当您使用{}GameMaker{}创建游戏时，您肯定已经创建了图形(Sprites、Tile Sets和Fonts)。这些图形存储在{}纹理页面{}上，{}GameMaker{}通过游戏中包含的所有图像资源为您构建纹理页面。下面是完整纹理页面的示例：",
    "You can also set which {}Texture Group{} the sprite is assigned to.":"也可以设置将sprite指定给哪个{}纹理组{}。",
    "{}As you can see, the game graphics are all jumbled up together in such a way that they all fit on a power of 2 sized page, eg 512x512, 1024x512 etc... up to a maximum size of 4096x4096 pixels page. Note that the maximum size of a texture page will depend on the chosen export platform, as some targets will not permit pages larger than 2048x2048px, and even then, the maximum available size may not be optimal for all the devices that use the target platform OS.":"{}正如您所看到的，游戏图形混杂在一起，所有这些图形都适合2个大小的页面，例如512 x 512、1024 x 512等...最大大小为4096 x 4096像素的页面。请注意，纹理页面的最大大小将取决于所选的导出平台，因为某些目标不允许页面大于2048 x 2048 px，即使如此，对于使用目标平台O的所有设备，最大可用大小也可能不是最佳的。",
    "{}Here you can define how the image is to be stored on the texture page, as well as whether it has to be stored separately. You can also set which texture page it has to be assigned to as well as a few other options (explained in depth on the {}Sprite Editor{} page).":"{}在这里，您可以定义图像在纹理页面上的存储方式，以及是否必须单独存储。您还可以设置必须指定给哪个纹理页面以及其他一些选项(在{}Sprite Editor{}页面中有详细说明)。",
    "{}{}NOTE{}{}&nbsp;Before you go off splitting up your graphics over various texture pages, you should be aware that this is not always necessary, nor is it always the most efficient way to work. Some games may be more CPU bound than GPU bound (see the section on {}Debugging{} for more information) and those games will not benefit greatly from this optimisation, and you should also consider whether it would not be better to have all your images on two texture pages and swap between them rather than spread out over several, which is just wasting memory.":"{}{}注意{}{}在各种纹理页面上拆分图形之前，请注意这并不总是必需的，也不总是最有效的工作方式。有些游戏的CPU占用可能会比GPU更多(有关详细信息，请参阅{}调试{}一节)，这些游戏不会从此优化中获得太大好处，您还应该考虑将所有图像放在两个纹理页面上并在它们之间交换是否更好，而不是分散在几个页面上，这只是在浪费内存。",
    "{}{}NOTE{}{}&nbsp;Take care when using this option as you can quickly use up all the available texture memory, especially on mobile devices, if you have too many texture pages.":"{}{}注意{}{}使用此选项时要小心，因为您可以快速使用所有可用的纹理内存，尤其是在具有过多纹理页面的移动设备上。"
}