{
    "Note that you can find further information on instance variables here: {}Instance Variables{}.":"请注意，您可以在此处找到有关实例变量的更多信息:{}实例变量{}。",
    "The following functions are for adding and manipulating Timelines from within your game:":"以下函数用于添加和处理游戏中的时间线:",
    "The following variables are \"built in\" to all instances to make working with Timelines easier and give you control over them:":"所有实例都\"内置\"了以下变量，以便更轻松地使用时间线并对其进行控制：",
    "Timelines":"时间线",
    "Timelines are a powerful mechanism for controlling events in your game, and are based on \"moments\", where a \"moment\" is simply a single game step. These timelines are generally created from the {}Asset Browser{} using the {}Timeline Editor{} in a similar way to an object, ie: you create a timeline, then in each moment that you require it to perform an action you add some code or a GML Visual icon for it to perform. Once created, you can then stop, start, and manipulate timelines through code. You can even modify individual moments by defining a {}script function{} and adding it into the timeline dynamically from a controller object (for example), making this a very powerful and versatile tool when creating your games.":"时间线是控制游戏中事件的强大机制，并且基于 \"时刻\"，其中 \"时刻\" 只是一个游戏步骤。这些时间线通常是使用{}时间线编辑器{}从{}资源浏览器{}以类似于对象的方式创建的，即: 您创建时间线，然后，在每个时刻，你需要它执行一个动作，你添加一些代码或GML视觉图标，以使它执行。一旦创建，您就可以通过代码停止、启动和操作时间线。您甚至可以通过定义{}脚本函数{}并将其从控制器对象动态添加到时间轴中 (例如) 来修改单个时刻，从而使其成为创建游戏时非常强大且通用的工具。",
    "Timelines are used for controlling events in your game, and are based on \"moments\", where a \"moment\" is simply a single game step. These timelines are generally created from the {}Asset Browser{} using the {}Timeline Editor{} in a similar way to an object, ie: you create a timeline, then in each moment that you require it to perform an action you add some code or a GML Visual icon for it to perform. Once created, you can then stop, start, and manipulate timelines through code. You can even modify individual moments by defining a {}script function{} and adding it into the timeline dynamically from a controller object (for example), making this a very powerful and versatile tool when creating your games.":"时间线用于控制游戏中的事件，并且基于 \" 时刻\"，其中 \" 时刻 \" 只是一个游戏步骤。这些时间线通常是使用 {} 时间线编辑器 {} 从 {} 资产浏览器 {} 创建的，其方式与对象类似，即：创建时间线，然后在需要它执行您添加的操作的每个时刻一些代码或 GML Visual 图标供其执行。创建后，您可以通过代码停止、启动和操作时间线。您甚至可以通过定义 {} 脚本函数 {} 并将其从控制器对象 (例如) 动态添加到时间线中来修改各个时刻，从而使其成为创建游戏时非常强大且多功能的工具。",
    "{}{}IMPORTANT{}{}&nbsp;Timelines have been replaced by {}Sequences{} and currently only exist for legacy purposes. {}Moments can be programmed{} in a Sequence for functions to be executed at given frames in the Sequence.":"{}{} 重要{}{} 时间线已被 {} 序列 {} 取代，目前仅用于遗留目的。{} 可以在序列中对时刻进行编程 {}，以便在序列中的给定帧处执行函数。"
}