{
    "In this way you can create a new time line using the&nbsp;{}{}timeline_add{}{} function and add different behaviours at any point, or simply modify a previously created time line resource with new behaviours. Note that the function cannot require any additional arguments when using this function, and if you use it to modify a Timeline asset present in the Asset Browser, then all instances that use this timeline will be affected, and the change will last until the end of the game (calling&nbsp;{}{}game_restart{}{}&nbsp;will not reset the change either).":"通过这种方式，您可以使用 {}{}timeline_add{}{} 函数创建新的时间线，并随时添加不同的行为，或者只是使用新行为修改之前创建的时间线资源。请注意，使用此函数时，该函数不能需要任何其他参数，如果您使用它来修改资源浏览器中存在的时间轴资源，则使用此时间轴的所有实例都将受到影响，并且更改将持续到结束游戏 (调用 {}{}game_restart{}{} 也不会重置更改)。",
    "The above code will create a new time line and store its index in the variable \"global.tl\". It will then add three scripts to the time line, chosen at random, at one minute intervals.":"上面的代码将创建一个新的时间线，并将其索引存储在变量\" global.tl \"中。然后，它将以一分钟的间隔随机选择三个脚本添加到时间线。",
    "The above code will create a new time line and store its index in the variable {}global.tl{}. It will then add three scripts to the time line, chosen at random, at one minute intervals.":"上述代码将创建一个新时间线并将其索引存储在变量 {}global.tl{} 中。然后，它将以一分钟的间隔随机选择三个脚本添加到时间线中。",
    "The index of the script function to add into the moment.":"要添加到时刻的脚本函数的索引。",
    "The index of the timeline to add a moment to.":"要向其添加时刻的时间线的索引。",
    "The moment (step) to add to.":"要添加的时刻(步骤)。",
    "With this function you can dynamically add a {}script&nbsp;function{} to Timelines at any given \"moment\" within that time line, where a \"moment\" is the equivalent of one game tick (or step).":"通过此函数，您可以在该时间线内的任何给定 \" 时刻 \" 向时间线动态添加 {} 脚本函数 {}，其中 \" 时刻 \" 相当于一个游戏周期 (或步骤)。",
    "With this function you can dynamically add a {}script&nbsp;function{} to Timelines at any given \"moment\" within that time line, where a \"moment\" is the equivalent of one game tick (or step). In this way you can create a new time line using the {}{}timeline_add(){}{} function and add different behaviours at any point, or simply modify a previously created time line resource with new behaviours. Note that the function cannot require any additional arguments when using this function, and if you use it to modify a Timeline asset present in the Asset Browser, then all instances that use this timeline will be affected, and the change will last until the end of the game (calling {}game_restart(){} will not reset the change either).":"使用此函数，您可以在该时间线内的任何给定 \"时刻\" 动态添加{}脚本函数{}到时间线，其中 \"时刻\" 相当于一个游戏滴答 (或步骤)。这样，您可以使用{}{}timeline_add(){}{}函数创建新的时间线，并在任何时候添加不同的行为，或者简单地使用新的行为修改先前创建的时间线资源。请注意，该函数在使用此函数时不能要求任何额外的参数，如果您使用它来修改资源浏览器中存在的时间线资源，那么使用此时间线的所有实例都将受到影响，并且更改将持续到游戏结束 (调用{}game_restart(){}也不会重置更改)。"
}