{
    "As with all the joints, if you set the \"col\" value to {}true{} then the two instances can interact and collide with each other but {}only{} if they have collision events, however if it is set to {}false{}, they will not collide no matter what.":"与所有关节一样，如果将 \"col\" 值设置为 {}true{}，则两个实例可以相互作用并发生碰撞，但是如果它们发生碰撞事件，则{}只能{}发生碰撞，但是如果设置为 {}false{}，则无论发生什么情况，它们都不会发生碰撞。",
    "Set the velocity ratio between two instances":"设置两个实例之间的速度比率",
    "The above code creates and defines a new fixture, creates two instances of \"obj_Block\", and then binds this fixture two them. It then goes on to define a pulley joint between these instance, with no offset for the joints, a ratio of 2:1 (meaning that inst2 will move faster). No collisions occur between the two instances in the pulley.":"上述代码创建并定义了一个新的装置，创建了两个 \"obj_Block\" 实例，然后将此装置绑定为两个。然后，它继续在这些实例之间定义一个滑轮关节，关节没有偏移，比率为 2:1( 意味着 inst2 将移动得更快)。滑轮中的两个实例之间不会发生碰撞。",
    "The first instance to connect with the joint":"与关节连接的第一个实例",
    "The local x coordinate where joint 1 is anchored to the first instance":"关节 1 定位到第一个实例的局部 X 坐标",
    "The local x coordinate where joint 2 is anchored to the second instance":"关节 2 定位到第二个实例的局部 X 坐标",
    "The local y coordinate where joint 1 is anchored to the first instance":"关节 1 定位到第一个实例的局部 Y 坐标",
    "The local y coordinate where joint 2 is anchored to the second instance":"关节 2 定位到第二个实例的局部 Y 坐标",
    "The pulley joint is used to connect two instances within the physics world in such a way that moving one will directly influence the movement of the other. These joints are first anchored in the world space at two points, each one connected to an instance at its center of mass. This can be changed by setting the local anchor x/y coordinates relative to the origin of the instance, meaning that the actual connection from the instance to the physics world anchor point can be offset somewhere other than its origin. The following image illustrates this:":"滑轮关节是用来连接物理世界中的两个实例的，其方式是移动一个实例将直接影响另一个实例的运动。这些关节首先锚定在世界空间的两个点上，每个点都与一个实例的质心相连。这可以通过设置相对于实例原点的局部锚点 x/y 坐标来改变，也就是说，从实例到物理世界锚点的实际连接可以偏移到原点以外的地方。下面的图片说明了这一点。",
    "The second instance to connect with the joint":"与关节连接的第二个实例",
    "The x coordinate where the first part of joint is anchored, within the game world":"游戏世界中关节第一部分定位的 X 坐标",
    "The x coordinate where the second part of the joint is anchored, within the game world":"游戏世界中关节第二部分定位的 X 坐标",
    "The y coordinate where the first part of the joint is anchored, within the game world":"游戏世界中关节第一部分定位的 Y 坐标",
    "The y coordinate where the second part of the joint is anchored, within the game world":"游戏世界中关节第二部分定位的 Y 坐标",
    "Whether the two instances can collide (true) or not (false)":"这两个实例是否可以碰撞 (true) 或不碰撞 (false)",
    "{}If you look at inst2 you can see that its local anchor point has been offset 20 pixels to the \"left\" of its origin (Remember! The world anchor points are defined using the room coordinates, while the local anchor points are defined relative to the origin of the instance). You can also specify a ratio for the pulley joint, which tells one side or the other to move faster, with a value below 1 making the first instance move faster (E.G. 0.5 will make it move twice as fast) and a value above 1 making the second instance move faster (E.G. 2 will make it move twice as fast).":"{}如果您查看 inst2，可以看到其本地锚点已偏移 20 像素到其原点的 \" 左侧 \"( 请记住！使用房间坐标定义世界定位点，而相对于实例的原点定义局部定位点)。也可以为滑轮关节指定一个比率，该比率指示一侧或另一侧移动得更快，值小于 1 会使第一个实例移动得更快 (例如，0.5 会使其移动得快一倍)，值大于 1 会使第二个实例移动得更快 (例如，2 会使其移动得快一倍)。"
}