{
    "A revolute joint forces two bodies to share a common anchor point (often called a hinge point) and the joint has a single degree of freedom - the relative rotation of the two bodies around this point. To specify a revolute you need to provide two instances and a single anchor point in the room, as you can see in the image provided:":"旋转关节强制两个主体共享一个公共锚点 (通常称为铰点)，并且关节具有单个自由度 - 即两个主体围绕该点的相对旋转。要指定旋转，需要在房间中提供两个实例和一个锚点，如所提供的图像中所示：",
    "As with all the joints, if you set the \"col\" value to {}true{} then the two instances can interact and collide with each other but {}only{} if they have collision events, however if it is set to {}false{}, they will not collide no matter what.":"与所有关节一样，如果将 \"col\" 值设置为 {}true{}，则两个实例可以相互作用并发生碰撞，但是如果它们发生碰撞事件，则只能 {} 发生碰撞，但是如果设置为 {}false{}，则无论发生什么情况，它们都不会发生碰撞。",
    "Sets the maximum motor torque used to achieve the desired motor speed (in Newtons per meter)":"设置用于实现所需电动机转速的最大电动机转矩(单位：牛顿/米)",
    "The above code creates and defines a new fixture and then creates an instance of \"obj_Door\", binding the created fixture to the two new objects. They are then joined by a revolute joint with no motor and the angles limited to a +/- 90 degree swing. Finally the fixture is deleted as it is no longer needed.":"上述代码创建并定义了一个新的装置，然后创建 \"obj_Door\" 实例，将创建的装置绑定到两个新对象。然后通过一个没有电机的旋转接头连接它们，角度限制在 +/- 90 度回转。最后，由于不再需要该夹具，因此将其删除。",
    "The first instance to connect with the joint":"与关节连接的第一个实例",
    "The lower permitted limit for the joint angle":"关节角度的允许下限",
    "The second instance to connect with the joint":"与关节连接的第二个实例",
    "The upper permitted limit for the joint angle":"关节角度的允许上限",
    "The x coordinate for the joint, within the game world":"游戏世界中关节的 X 坐标",
    "The y coordinate for the joint, within the game world":"游戏世界中关节的 Y 坐标",
    "This is the speed at which the motor should rotate":"这是电机应该旋转的速度",
    "Whether the motor should be active (true) or not (false)":"电动机是否应该启动 (true) 或不启动 (false)",
    "Whether the to limit the angle of the joint (true) or not (false)":"是否限制关节的角度 (true) 或 (false)",
    "Whether the two instances can collide (true) or not (false)":"这两个实例是否可以冲突 (true) 或不冲突 (false)",
    "{}As you can see, angles in the physics world are {}not{} the same as the standard {}GameMaker{} angles where right is 0 degrees and then it goes anti-clockwise so that up is 90, left is 180, and down is 270. No, when dealing with the revolute joint, the 0 degrees axis runs from the joint position to the origin of the second instance defined by the function and the angles are then calculated in a clockwise direction. If you switch on angle limiting, the limits are defined as being relative to this 0 degree axis and the limit range {}should include zero{}, otherwise the joint will lurch when the room begins. Finally, you can define the joint as having a motor or not. This means that when uninfluenced by a collision the joint will move in a direction, which is defined by the motor speed with a positive number being clockwise and a negative number being anti-clockwise. The \"max_motor_torque\" argument is for limiting the speed of the rotation so that you don\u0027t get a perpetually accelerating motor and to limit the influence that a collision may have on the rotation. In this way you can use a joint motor to simulate joint friction by setting joint speed to zero and maximum torque to some small, but significant value. The motor will try to prevent the joint from rotating, but will yield to a significant load.":"{}如您所见，物理世界中的角度与标准 {}GameMaker{} 的角度{1}不同{2} ，其中右为 0 度，然后逆时针旋转，所以向上为 90 度，向左为 180 度，向下为 270 度。否，在处理旋转关节时，0 度轴从关节位置延伸到由函数定义的第二个实例的原点，然后沿顺时针方向计算角度。如果打开角度限制，则将限制定义为相对于此 0 度轴，并且限制范围 {} 应包括零 {}，否则当房间开始时，关节将倾斜。最后，可以将关节定义为是否具有电动机。这意味着，当不受碰撞影响时，接头将沿着一个方向移动，该方向由电机速度定义，正数为顺时针方向，负数为逆时针方向。\"max_motor_torque\" 参数用于限制旋转速度，从而避免马达永久加速，并限制碰撞对旋转的影响。通过这种方式，可以使用马达关节通过将关节速度设置为零并将最大扭矩设置为某个较小但有效的值来模拟关节摩擦力。马达将尝试防止关节旋转，但会产生较大的负载。",
    "{}If you look at the image, you can see that the two instances have been created to over-lap and at the point where they are touching, we have defined a revolute joint. Now, this joint can be limited in its freedom of rotation thanks to the \"ang_min_limit\" and \"ang_max_limit\" values. How does this work? Well, let\u0027s look at another image:":"{}如果您查看图像，可以看到这两个实例已创建为重叠，并且在它们接触的点处，我们定义了一个旋转关节。现在，由于 \"ang_min_limit\" 和 \"ang_max_limit\" 值，该关节的旋转自由度可能受到限制。这是如何工作的？好吧，让我们看看另一个图像："
}