{
    "As with all the joints, if you set the \"col\" value to {}true{} then the two instances can interact and collide with each other but {}only{} if they have collision events, however if it is set to {}false{}, they will not collide no matter what.":"与所有关节一样，如果将 \"col\" 值设置为 {}true{}，则两个实例可以相互作用并发生碰撞，但是如果它们发生碰撞事件，则{}只能{}发生碰撞，但是如果设置为 {}false{}，则无论发生什么情况，它们都不会发生碰撞。",
    "Like a revolute joint, the prismatic joint only has one degree of freedom, but with this joint it is directional relative to an axis rather than rotational and actually prevents any form of rotation. Here is an image to help you visualise how this works:":"与旋转运动类似，棱柱运动类型只有一个自由度，但使用此运动类型时，它相对于轴是方向性的，而不是旋转的，实际上会阻止任何形式的旋转。下面是一张图片，可帮助您直观了解这种方式的工作原理：",
    "Sets the maximum movement speed for the motor":"设置电动机的最大移动速度",
    "The above code creates and defines a new fixture and then creates an instance of \"obj_Piston\", binding the created fixture to the two new objects. They are then joined by a prismatic joint with the anchor position at the same x/y coordinates of the first instance and an axis formed by the vector of the x/y position and the axis x/y (in this case 0,10, which is \"down\"). There are no limits placed on the amount of movement along this axis, but we have added a motor with 0 speed and a maximum force of 5 to simulate joint friction.":"上述代码创建并定义了一个新的装置，然后创建 \"obj_Piston\" 的实例，将创建的装置绑定到两个新对象。然后通过棱柱关节将它们连接起来，所述棱柱关节具有在第一实例的相同 x/y 坐标处的锚定位置和由 x/y 位置和轴 x/y(在这种情况下为 \" 向下 \") 的矢量形成的轴。沿此轴的移动量没有限制，但我们添加了一个速度为 0 且最大力为 5 的电动机来模拟关节摩擦。",
    "The first instance to connect with the joint":"与关节连接的第一个实例",
    "The lower permitted limit for the joint movement":"关节运动允许的下限",
    "The second instance to connect with the joint":"与关节连接的第二个实例",
    "The x component of the axis vector":"轴向量的 X 分量",
    "The x coordinate where the joint is anchored, within the game world":"游戏世界中关节定位的 X 坐标",
    "The y component of the axis vector":"轴向量的 Y 分量",
    "The y coordinate where the joint is anchored, within the game world":"游戏世界中关节定位的 Y 坐标",
    "This is the speed at which the motor should move":"这是电机应该移动的速度",
    "Whether the motor should be active (true) or not (false)":"电动机是否应该启动 (true) 或不启动 (false)",
    "Whether the two instances can collide (true) or not (false)":"这两个实例是否可以冲突 (true) 或不冲突 (false)",
    "Whether to limit the movement of the joint (true) or not (false)":"是否限制关节的运动 (true) 或 (false)",
    "{}We have two instances joined at the anchor point, with an axis for movement defined from the vector the two w_axis x/y coordinates relative to the (0,0) coordinates of the physics world (so an x component of 0 and a y component of 1 (0,1) would make the joint a vertical prismatic joint). This joint can then {}only{} move relative to this axis, like a spring or a piston. If you set the lower or upper trans limit, you are basically limiting the amount of movement along this axis, where the 0 position is the exact spot that you defined with w_anchor x/y, so a negative value would go to the \"left\" of that point along the axis and a positive value to the \"right\" as shown in the following diagram (realise that \"left\" and \"right\" are relative terms!):":"{} 我们有两个实例在锚点处连接，其中一个运动轴由矢量定义，两个 w_axis x/y 坐标相对于物理世界的 (0,0) 坐标 (因此 x 分量为 0，y 分量为 1(0,1) 会使关节成为垂直棱柱关节)。然后，此关节只能 {} 相对于此轴移动，如弹簧或活塞。如果设置传输限制的下限或上限，则基本上是限制沿此轴的移动量，其中 0 位置是使用 w_anchor x/y 定义的精确点，因此负值将沿轴转到该点的 \" 左\"，正值将转到 \" 右\"，如下图所示 (请注意，\"左\" 和 \"右\" 是相对术语！)：",
    "{}You can also define the joint as having a motor or not. This means that when un-influenced by a collision the joint will move in a direction along the axis. this direction is defined by the motor speed, with a positive number being towards the axis coordinates (\"right\") and a negative number being towards the anchor point (\"left\"). The \"max_motor_force\" argument is for limiting the speed of the movement so that you don\u0027t get a perpetually accelerating motor and to limit the influence that a collision may have on the movement. In this way you can use a joint motor to simulate joint friction by setting the joint speed to zero and maximum force to some small, but significant value. The motor will try to prevent the joint from moving, but will yield to a significant load.":"{}你也可以将关节定义为是否具有电动机。这意味着，当不受碰撞影响时，关节将沿轴向移动。此方向由电动机速度定义，正数朝向轴坐标 (\" 右 \")，负数朝向锚点 (\" 左 \")。\"max_motor_force\" 参数用于限制移动速度，以便不会得到永久加速的电动机，并限制碰撞可能对移动的影响。通过这种方式，可以使用运动类型电动机来模拟运动类型的摩擦力，方法是将运动类型的速度设置为零，并将最大力设置为某个较小但有意义的值。马达将尽量防止接头移动，但会产生较大的负载。"
}