{
    "Enable or disable angle limiting for the joint. Set the value to {}true{} to enable or {}false{} to disable.":"启用或禁用关节的角度限制。将值设置为 {}true{} 以启用或 {}false{} 以禁用。",
    "For a distance, weld, and wheel joints you can use the following constants (as well as those for pulley joints):":"对于距离、焊接和车轮关节，可以使用以下常量(以及滑轮关节的常量)：",
    "For a friction joint you can use the following constants:":"对于滑动关节，可以使用以下常量：",
    "For a prismatic joint you can use the following constant:":"对于棱柱关节，可以使用以下常量：",
    "For a revolute joint you can use the following constant (as well as the {}motor{} constants if one has been added):":"对于旋转关节，可以使用以下常量(如果添加了{}一个马达{}常量)：",
    "For a rope joint you can use the following constant:":"对于绳索关节，可以使用以下常量：",
    "Gets the distance between the anchor x/y coordinates and the local x/y coordinates.":"获取锚点 X/Y 坐标和局部 X/Y 坐标之间的距离。",
    "In general these constants would be used in conjunction with the following functions:":"通常，这些常数将与以下函数一起使用：",
    "No":"否",
    "Physics Joint Constant":"物理关节常量",
    "Physics Joint Constants":"物理关节常量",
    "The angle that a line between the two anchor points of the joint makes. This is calculated using the {}physics world{} coordinates{} ({}not{} the {}GameMaker{} room coordinates) in radians.":"关节的两个锚点之间的直线形成的角度。这是使用{}物理世界{}以弧度计算的坐标。{}({}不是 {}GameMaker{} 房间坐标) ",
    "The current joint movement speed.":"当前关节移动速度。",
    "The current motor force":"当前的马达力",
    "The current motor speed":"当前马达速度",
    "The current motor torque":"当前马达扭矩",
    "The damping ratio is non-dimensional and defines the \"springiness\" of the joint. The value for this constant is typically between 0 and 1, but can be larger, and at 1, the damping is critical meaning that all oscillations should vanish.":"阻尼比是非尺寸性的，定义了关节的 \"弹性\"。这个常数的值通常在 0 和 1 之间，但可以更大，在 1 时，阻尼是关键的，意味着所有的振荡都会消失。",
    "The following constants can be applied to any of the available joint types:":"以下常量可以应用于任何可用的关节：",
    "The lower angle limit for the joint in degrees.":"关节的角度下限(以度为单位)。",
    "The maximum extension for the connection between the two anchor points.":"两个锚点之间连接的最大延伸。",
    "The maximum force value for the joint.":"关节的最大力值。",
    "The maximum torque value for the joint.":"关节的最大扭矩值。",
    "The upper angle limit for the joint in degrees.":"关节的角度上限(以度为单位)。",
    "The value specified when the joint was created for the maximum motor force":"为最大马达力创建关节时指定的值",
    "The value specified when the joint was created for the maximum motor torque":"为最大马达扭矩创建关节时指定的值",
    "The x coordinate of the first anchor point of the joint {}in the room{}":"{}房间{}中关节的第一个锚点的 X 坐标",
    "The x coordinate of the second anchor point of the joint {}in the room{}":"{}房间{}中关节的第二个锚点的 X 坐标",
    "The y coordinate of the first anchor point of the joint {}in the room{}":"{}房间{}中关节的第一个锚点的 Y 坐标",
    "The y coordinate of the second anchor point of the joint {}in the room{}":"{}房间{}中关节的第二个锚点的 Y 坐标",
    "There are a great number of constants included within the {}GameMaker{} GML that are specific to {}joints{} between fixtures in the physics world. These can be used in conjunction with many of the different joint functions to set or get information from them in real time while the physics simulation is running. You should be aware, however, that complex calculations are done when you call these, so they should be used with care and only when necessary and note that {}many are unique to a specific type of joint{}. Also note that while you can get all these values with the appropriate function, you can only set those that are marked as not being read-only.":"{}GameMaker{} GML 中包含大量常量，这些常量特定于物理世界中固定装置之间的{}关节{}。这些功能可以与许多不同的关节功能配合使用，以便在运行物理模拟时实时设置或从中获取信息。但是，您应该注意，调用这些值时会执行复杂的计算，因此应该谨慎使用，并且只有在必要时才使用这些值，并且请注意，{}许多值对于特定类型的联接{}是唯一的。另请注意，虽然您可以使用适当的函数获取所有这些值，但是您只能设置那些标记为不是只读的值。",
    "These constants are for those joints that have a {}motor{} attached to them (revolute, prismatic, wheel):":"这些常量适用于连接有{}马达{}的关节(旋转、棱柱、车轮)：",
    "This is the reaction force being applied to the second instance in a joint at the x anchor position":"这是施加在 X 锚位置的关节的第二个实例上的反作用力",
    "This is the reaction force being applied to the second instance in a joint at the y anchor position":"这是施加在 Y 锚位置的关节的第二个实例上的反作用力",
    "This is the torque being applied to the second instance in a joint at the anchor position":"这是在锚定位置的关节中被施加到第二实例的扭矩",
    "This will return (or set) the oscillation frequency for the joint, in hertz, and typically the frequency should be less than a half the frequency of the time step, as set by the function {}{}physics_world_update_speed(){}{}.":"这将返回 (或设置) 关节的振荡频率，单位为赫兹，通常这个频率应该小于时间步长的一半，由函数 {}{}physics_world_update_speed(){}{} 设置。",
    "This will return the length of the joint from the first local x/y coordinates to the first anchor x/y coordinates (Distance joints only, can only be read from)":"这将返回关节从第一个局部 X/Y 坐标到第一个锚点 X/Y 坐标的长度 (仅距离关节，只能从中读取)",
    "This will return the length of the joint from the second local x/y coordinates to the second anchor x/y coordinates (Distance joints only, can only be written to)":"这将返回关节从第二个局部 X/Y 坐标到第二个锚点 X/Y 坐标的长度 (仅距离关节，只能从中写入)",
    "Yes":"是",
    "{} {}Distance Joints, Weld Joints and Wheel Joints{} ":"{} {}距离关节、焊接关节和车轮关节{}",
    "{} {}Friction Joints{} ":"{} {}滑动关节{}",
    "{} {}Motors{} ":"{} {}马达{} ",
    "{} {}Prismatic Joints{} ":"{} {}棱柱关节{} ",
    "{} {}Revolute Joints{} ":"{} {}旋转关节{}",
    "{} {}Rope Joints{} ":"{} {}绳索关节{}",
    "{}General{}":"{}通用{}"
}