{
    "Generating Object Events":"生成对象事件",
    "In {}GameMaker{} you have objects and you have instances. Objects are essentially the base template for an instance, and as such are {}never{} present in a room directly... only {}instances{} of the object are placed in the room. This means that if you want to change something for all instances you are going to create, then you can do it by changing the {}object{}.":"在{}GameMaker{}中，您拥有对象和实例。对象本质上是实例的基本模板，因此{}永远不会{}直接存在于房间... 仅{}对象的实例{}放置在房间中。这个意思是，如果您想为将要创建的所有实例更改某个实例，则可以通过更改{}对象{}来实现。",
    "Objects":"对象",
    "There are also a number of functions that permit you set the properties for an object. It should be noted that any instances of this object that already exist in the room {}may not be affected by these functions{}, but all new instances of this object created in the room will be, so it is recommend that you never change an objects properties when instances of that object are present in the current room.":"还有许多函数允许您设置对象的属性。需要注意的是，房间{}中已存在的此对象的任何实例可能不受这些函数{}的影响，但此对象的所有新实例将在房间中创建，因此建议您在当前房间中存在对象的实例时，不要更改该对象的属性。",
    "You can also access information about a base object and use it to dictate behaviors or changes in the game. For example, you can do a check for a parent object ID, and in the following code if an instance with that parent is found you can then check its {}object_index{} to decide what should be done.":"您还可以访问有关基本对象的信息，并使用它来指示游戏中的行为或变化。例如，您可以检查父对象ID，在下面的代码中，如果找到具有该父对象的实例，则可以检查其{}object_index{}决定应该做什么。",
    "You can also use certain functions to generate events from code from within a specific instance or object. These functions can be very useful, especially when dealing with {}Parents and Children{}, and are outlined in the following section:":"您还可以使用某些函数从特定实例或对象中的代码生成事件。这些函数非常有用，特别是在处理{}父母和子女{}时。并在以下章节中概述：",
    "{}GameMaker{}&nbsp;gives you a number of functions that permit you to get various details about an object. Note, an object is&nbsp;{}not{}&nbsp;an instance (an in-game entity), it is purely a resource from which all instances are created. This means that the return values of these functions may be different to the actual values shown by instances in the room, as once an instance is created it can be changed through code and GML Visual actions.":"{}GameMaker{}为您提供了许多函数，允许您获取有关对象的各种详细信息。注意，对象是{}而不是{}实例(游戏中的实体)，它纯粹是创建所有实例的资源。这意味着这些函数的返回值可能与房间中的实例所显示的实际值不同，因为一旦创建了实例，就可以通过代码和GML视觉动作来更改它。",
    "{}IMPORTANT!{} Changing anything about an object will {}not{} change any instances currently present in the room, only those that are created after the change.":"{}重要！{}更改对象的任何内容{}都不会{}更改房间中当前存在的任何实例，只会更改更改后创建的实例。"
}