{
    "Please note that this is not an instance function! You can set the persistent flag of individual instances using the {}{}persistent{}{}&nbsp;variable and so have ten instances all flagged as persistent even though the object in question has the flag set to false in the IDE, and even if you change the persistent flag of the object to true using this function, all instances that currently in the room will remain as they were, and only instances created after calling the function will start with persistent flagged as true.":"请注意这不是实例函数！您可以使用{}{}持久{}{}变量设置单个实例的持久标记，因此即使相关对象在 IDE 中将标记设置为 false，仍有 10 个实例全部标记为持久化，即使使用此函数将对象的持久标记更改为 true，房间中当前的所有实例将保持原样，只有调用函数后创建的实例才会以永久标记为 true 开始。",
    "The above code checks to see in which room the instance is currently in and if it is in the specified \"rm_final\" then it sets the persistence of the object \"obj_Player\" to false and then creates the instance.":"上面的代码检查实例当前位于哪个房间，如果它位于指定的\"rm_final\"中，则它将对象\"obj_Player\"的持久性设置为false，然后创建实例。",
    "The index of the object to change.":"要更改的对象的索引。",
    "When you create an instance with persistence enabled in a room, it will be assigned a layer or a depth (depending on which function you used to create the instance of the object). When the room is changed, and if the following room does {}not{} have a layer with the same name or depth as the one assigned, then a new layer will be created for the instance that is persisting across the rooms. If you gave a named layer when the instance was created, then the new layer will also be named the same as original layer, while if you assigned a depth to the instance then the new layer will be named \"{}_layer_XXX{}\", where \"XXX\" is a hex value used to give the layer a unique name. These layers will be removed from the room on Room End. Another thing to note about layers and persistent instances is that if you have assigned the instance a named layer on creation, and there is another layer in the following rooms with the same name, then the persisted instance will be assigned to the layer with the same name {}regardless of the depth of the layer{}. Finally, if a persisted instance moves to a room with a layer at the same depth as the instance was created on, it will {}not{} be assigned to this layer, but instead a new layer will be created at the same depth (following the naming convention explained previously).":"在房间中创建启用持久性的实例时，将为其指定一个图层或深度(取决于用于创建对象实例的函数)。更改房间时，如果下列房间{}没有{}与所分配的图层具有相同名称或深度的图层，则将为贯穿这些房间的实例创建新的图层。如果在创建实例时指定了命名层，则新层的名称也与原始层相同，而如果为实例指定了深度，则新层将命名为\"{}_layer_XXX{}\"，其中\"XXX\"是用于给层指定唯一名称的十六进制值。这些层将从房间末端的房间移除。关于层和持久实例，需要注意的是，如果您在创建时为实例分配了命名层，并且以下房间中有另一个层具有相同名称，则不管层{}的深度如何，持久实例都将被分配给具有相同名称的层{}。 最后，如果持久实例移动到层深度与实例创建深度相同的房间，则{}不会{}将其分配给此层，而是在相同深度创建新层(遵循前面说明的命名约定)。",
    "Whether the object should be flagged as persistent ({}true{}) or not ({}false{}).":"对象是否应标记为持久({}true{})或不标记为持久({}false{})。",
    "With this function you can set the persistence of a specific object. A persistent object is \"carried over\" from room to room and maintains its properties at all times (for more information on persistence see the section on the&nbsp;{}Object Editor{}). Setting the persistence of the object means that all instances of this object that are created {}after the persistence has been changed{} will be created persistent, while instances that are already in the room may not be affected.":"使用此函数，可以设置特定对象的持久性。永久对象从房间\"携带\"到另一个房间，并始终保持其属性(有关持久性的更多信息，请参阅{}对象编辑器{}部分)。 设置对象的持久性意味着该对象的所有实例(在持久性被更改{}后创建{})将持久创建，而已经在房间中的实例可能不会受到影响。"
}