{
    "Below is a list of all the available asynchronous dialog&nbsp;functions:":"下面是所有可用的异步对话框函数的列表:",
    "Most modern computers and mobile devices do not like it when a game is stopped while a dialog window is shown. They tend to interpret this as game runner having stopped, and may consider it an error and close the app prematurely. To prevent this {}GameMaker{} has {}asynchronous{} dialog functions that permit you to request certain forms of user feedback or input, but without blocking&nbsp;the game runner at any time, meaning that - when called - the game will run as normal in the background while the user responds to the shown dialog window. Once the user has responded, a {}Dialog&nbsp;Asynchronous Event{} will be called so that you can deal with the results.":"大多数现代计算机和移动设备都不喜欢在显示对话窗口时停止游戏。 他们倾向于将此解释为游戏运行程序已停止，并可能认为这是一个错误并过早关闭应用程序。 为防止这种情况发生，{}GameMaker{} 具有{}异步{}对话函数，允许您请求特定形式的用户反馈或输入，但不会在任何时候阻塞游戏运行程序，这意味着 - 在被调用时 - 游戏将运行 当用户响应显示的对话框窗口时，在后台正常运行。 用户做出响应后，系统将调用{}对话框异步事件{}，以便您处理结果。",
    "{}NOTE{}: With the exception of {}{}shop_leave_rating(){}{}, these functions are&nbsp;{}for {}debugging and testing&nbsp;use only{} and should not be used in released games. For that purpose you should create a custom user interface&nbsp;to receive input from players so that you have complete control over how the dialogs look and behave.{}":"{}注意{}：除了 {}{}shop_leave_rating(){}{} 之外，这些函数&nbsp;{}仅供{}调试和测试&nbsp;使用{}，不应在已发布的游戏中使用。 为此，您应该创建一个自定义用户界面&nbsp;以接收玩家的输入，以便您可以完全控制对话框的外观和行为。{}",
    "{}{}NOTE{}{}&nbsp;These functions don\u0027t work in regular fullscreen mode on Windows as your game \"owns\" the entire screen. You can use them with borderless fullscreen instead, see&nbsp;{}{}window_enable_borderless_fullscreen{}{}.":"{}{} 注意{}{} 这些功能在 Windows 上的常规全屏模式下不起作用，因为您的游戏 \" 拥有 \" 整个屏幕。您可以将它们用于无边框全屏，请参阅 {}{}window_enable_borderless_fullscreen{}{}。",
    "{}{}NOTE{}{}&nbsp;With the exception of {}{}shop_leave_rating{}{}, these functions are&nbsp;{}for {}debugging and testing&nbsp;use only{} and should not be used in released games. For that purpose you should create a custom user interface&nbsp;to receive input from players so that you have complete control over how the dialogs look and behave.{}":"{}{} 注意 {}{} 除了 {}{}shop_leave_rating{}{} 之外，这些函数 {} 仅供 {} 调试和测试使用 {}，不应在已发布的游戏中使用。为此，您应该创建一个自定义用户界面来接收玩家的输入，以便您可以完全控制对话框的外观和行为。{}"
}