{
    "Now that the asynchronous code has been fired off, we need to check for the return value in the {}asynchronous event for Dialogs{} in the following way:":"现在异步代码已被触发，我们需要通过以下方式检查 {}对话框的异步事件{}中的返回值：",
    "The above code checks the \"id\" key of the {}async_load{}&nbsp;DS&nbsp;map and if it holds the same value as that stored in the \"login\" variable, the map details are then read into the corresponding variables which you can then store or use to check against database values etc...":"上面的代码检查 {}async_load{} DS map的“id”键，如果它与存储在“login”变量中的值相同，则映射详细信息将读入相应的变量，然后您可以存储或使用这些变量来检查 针对数据库值等...",
    "The above code opens an ini file (or creates one if it doesn\u0027t exist) and gets the name and password stored in that file. If they do not exist, then the default of an empty string (\"\") is returned. These values are then used in {}get_login_async(){} to ask the user for their username and password details, with the request index being stored in the variable \"login\". Note that while waiting for the user to give the necessary information the game and its events will continue to run as normal.":"上面的代码打开一个 ini 文件(如果不存在则创建一个)并获取存储在该文件中的名称和密码。 如果它们不存在，则返回默认的空字符串 (\"\")。 然后在 {}get_login_async(){} 中使用这些值来询问用户的用户名和密码详细信息，请求索引存储在变量“login”中。 请注意，在等待用户提供必要信息的同时，游戏及其事件将继续正常运行。",
    "The default password":"默认密码",
    "The default user name":"默认用户名",
    "The {}create event{} (for example) of the object that is controlling the login of our user would have the following code:":"控制用户登录的对象的{} 创建事件{}(例如)将具有以下代码:",
    "This function opens a window that asks the user to input a username and password. These arguments can be set as an empty string or you can store previously entered values to use if you wish. This is an asynchronous function, and as such {}GameMaker{} does {}not{} block the device it is being run on while waiting for an answer, but rather keeps on running events as normal. Once the user has input the details and pressed the \"Okay\" button, an asynchronous {}User Interaction{} event is triggered which, for the duration of that event {}only{}, will have a DS&nbsp;map stored in the variable {}{}async_load{}{}.":"此函数打开一个窗口，要求用户输入用户名和密码。 这些参数可以设置为空字符串，或者您可以根据需要存储以前输入的值以供使用。 这是一个异步函数，因此 {}GameMaker{} 在等待答案时{}不会{}阻止运行它的设备，而是继续正常运行事件。 用户输入详细信息并按下“确定”按钮后，将触发一个异步{}用户交互{}事件，在该事件持续期间{}仅{}，变量中将存储一个 DS map{}{} async_load{}{}。",
    "This function will return an index number for the async event&nbsp;that was triggered, which can then be checked in the corresponding event so that you can \"target\" specific data&nbsp;in case you\u0027re expecting more than one async events to be triggered (perhaps from some other function).":"此函数将返回触发的异步事件的索引号，然后可以在相应的事件中检查该索引号，以便您可以“定位”特定数据，以防万一您期望触发多个异步事件( 也许来自其他一些函数)。",
    "This map will contain the two keys, \"{}username{}\" and \"{}password{}\", with the corresponding user input stored in each. As it is a DS Map that has been created, this can then be used, for example, by the {}{}json_encode(){}{} function ready to be sent to a server or written to a file on the chosen device.":"此映射将包含两个键，“{}username{}”和“{}password{}”，每个键中都存储了相应的用户输入。 由于它是已创建的 DS map，因此可以使用它，例如，准备发送到服务器或写入所选设备上的文件的 {}{}json_encode(){}{} 函数 .",
    "{}{}{}NOTE{}{}{}{}&nbsp;This function is&nbsp;{}for {}debugging and testing&nbsp;use only{} and should not be used in released games. For that purpose you should create a custom user interface&nbsp;to receive input from players so that you have complete control over how the dialogs look and behave.{}{}":"{}{}{}注意{}{}{}{} 此函数 {}仅供{}调试和测试 使用{}，不应在已发布的游戏中使用。 为此，您应该创建一个自定义用户界面&nbsp;以接收玩家的输入，以便您可以完全控制对话框的外观和行为。{}{}"
}