{
    "Finally, the three values are looked up using the DS map accessor {}?{}&nbsp;and shown using&nbsp;{}{}show_debug_message{}{}.":"最后，使用 DS 地图访问器 {}?{} 查找这三个值，并使用 {}{}show_debug_message{}{} 显示这三个值。",
    "Next, three different keys in the DS map are set using&nbsp;{}{}ds_map_set{}{}, each having a different type: the first key is a string, the second a number and the last one a struct.":"接下来，使用 {}{}ds_map_set{}{} 设置 DS 映射中的三个不同键，每个键具有不同的类型：第一个键是字符串，第二个键是数字，最后一个键是结构体。",
    "Since the function doesn\u0027t return anything, you should use the function {}{}ds_map_replace{}{}&nbsp;to check if the key value has been replaced or a new key has been created.":"由于该函数不返回任何内容，因此您应该使用函数 {}{}ds_map_replace{}{} 来检查键值是否已被替换或是否已创建新键。",
    "The above code first creates a basic struct {}struct_key{}. It then creates a new DS map using&nbsp;{}{}ds_map_create{}{}&nbsp;and stores it in a variable {}map_key_value_pairs{}.":"上面的代码首先创建一个基本结构体 {}struct_key{}。然后，它使用 {}{}ds_map_create{}{} 创建一个新的 DS 地图，并将其存储在变量 {}map_key_value_pairs{} 中。",
    "The above code will check to see if the given key exists and if it doesn\u0027t then it is created and set.":"以上代码将检查给定的密钥是否存在，如果不存在，则会创建并设置该密钥。",
    "The id of the map to use.":"要使用的映射的ID。",
    "The key to set.":"要设置的关键。",
    "The value to set the key to.":"要将密钥设置为的值。",
    "This function sets the value of a key within a given DS map.":"此函数设置给定 DS 映射内的键值。",
    "With this function you can set the value of a key within a given DS map. You supply the DS map ID value (as returned by the function {}{}ds_map_create(){}{}), then give the key you want to set and the value to set it to. Keys can be integers or strings, and if the given key does not exist then it will be created for you and set to the value. This function is the same as using the {}DS map accessor{} to set/create a map key/value pair. The function does not return anything, so if you need to check if the key value has been replaced or a new key has been created, then you should use the function {}{}ds_map_replace(){}{}.":"使用此函数，您可以在给定的DS映射中设置关键点的值。提供DS映射ID值(由函数{}{}ds_map_create(){}{}返回)，然后提供要设置的密钥和要设置的值。关键点可以是整数或字符串，如果给定的关键点不存在，则将为您创建该关键点并将其设置为值。此函数与使用{}DS映射访问器{}设置/创建映射键/值对相同。函数不返回任何内容，因此，如果需要检查是否已替换密钥值或已创建新密钥，则应使用函数{}{}ds_map_replace(){}{}。",
    "You supply the {}{}DS Map{}{}&nbsp;value (as returned by the function {}{}ds_map_create{}{}), then give the key you want to set and the value to set it to. If the given key does not exist then it will be created for you and set to the value.":"您提供 {}{}DS Map{}{} 值 (由函数 {}{}ds_map_create{}{} 返回)，然后给出您要设置的键以及要设置的值。如果给定的键不存在，那么将为您创建它并设置为该值。",
    "{}{}NOTE{}{}&nbsp;This function is the same as using the {}DS map accessor{} to set/create a map key/value pair.":"{}{} 注意{}{} 此函数与使用 {}DS 地图访问器 {} 设置 / 创建地图键 / 值对相同。",
    "{}{}TIP{}{}&nbsp;The key isn\u0027t limited to strings and can be of any&nbsp;type, including a&nbsp;{}struct{}.":"{}{} 提示{}{} 键不限于字符串，可以是任何类型，包括 {} 结构体 {}。"
}