{
    "Apart from the specific functions listed below you can all use an {}expression{} (called an {}accessor{}) to add or modify the contents of your DS map.&nbsp;This accessor looks similar to a 1D array with the following syntax:":"除了下面列出的特定函数外，您还可以使用{}表达式{}(称为{}访问器{})来添加或修改DS映射的内容。此存取器类似于1D阵列，具有以下语法：",
    "Apart from the specific functions listed below you can also use an {}expression{} (called an {}accessor{}) to add or modify the contents of your DS map.&nbsp;This accessor looks similar to a 1D array with the following syntax:":"除了下面列出的特定函数外，您还可以使用{}表达式{}(称为{}访问器{})来添加或修改DS映射的内容。此存取器类似于1D阵列，具有以下语法：",
    "DS Maps":"DS 映射",
    "For example, a character in your game can have a quantity of different items ({}keys{}) and for each individual item he can have a number of them ({}values{}), like in an RPG where you can have 10 health potions, 5 mana potions and 100 gold. Maps maintain such pairs all together in one place. You can add pairs to the map, search for the value corresponding to certain keys and use some simple functions.":"例如，游戏中的角色可以拥有一定数量的不同物品 ({} 键 {})，并且对于每个单独的物品，他可以拥有一定数量的物品 ({} 值 {})，就像在 RPG 中一样，您可以拥有 10 种生命药水、5 种法力药水和 100 金币。地图将这些对全部保存在一个地方。您可以将对添加到映射中，搜索与某些键对应的值并使用一些简单的函数。",
    "One of the uses that DS maps&nbsp;have is when working with JSON, and so there are a few special functions that are specific to that:":"DS 映射的一个用途是与 JSON 一起使用时，因此有一些特殊函数专用于：",
    "The DS map data structure is an exceptionally useful one as it lets you store {}key{} and {}value{} pairs. For example, a character in your game can have a quantity of different items ({}keys{}) and for each individual item he can have a number of them ({}values{}), like in an RPG where you can have 10 health potions, 5 mana potions and 100 gold. Maps maintain such pairs all together in the one place and you can add pairs to the map and search for the value corresponding to certain keys as well using some simple functions. There are a couple of things you should know about maps before you use them, however! Maps are {}not{} sorted in any (recognisable) way, meaning that to find a certain key you may have to iterate through the whole thing (which is {}very{} slow). There is also no way to hold two keys that are the same, nor can you assign one key two values.":"映射数据结构非常有用，因为它允许您存储{}密钥{}和{}值{}对。例如，游戏中的一个角色可以有一定数量的不同项目({}项目{})，每个项目都可以有一定数量的项目({}值{})，就像Rpg中的一样，在Rpg中可以有10种保健药水、5种法力药水和100种黄金。地图在一个位置将这些对保持在一起，您可以向地图添加对，并使用一些简单的函数搜索与某些关键点对应的值。然而，在使用地图之前，您应该了解一些关于地图的知识！地图{}没有{}以任何(可识别)方式排序，这意味着要找到某个密钥，您可能必须遍历整个过程({}非常{}慢)。也无法保持两个相同的关键点，也无法为一个关键点指定两个值。",
    "The DS map data structure lets you store {}key{} and {}value{} pairs, making it an exceptionally useful one.":"DS 映射数据结构可让您存储{}键{}和{}值{}对，这使其成为一种非常有用的数据结构。",
    "The following functions exist that deal with DS maps:":"存在以下处理DS映射的函数：",
    "There are a couple of things you should know about maps before you use them, however! Maps are {}not{} sorted in any (recognisable) way, meaning that to find a certain key you may have to iterate through the whole thing (which is {}very{} slow). There is also no way to hold two keys that are the same, nor can you assign one key two values.":"然而，在使用地图之前，您应该了解一些有关地图的知识！地图 {} 不 {} 以任何 (可识别的) 方式排序，这意味着要找到某个键​​，您可能必须遍历整个过程 (这 {} 非常 {} 慢)。也无法保存两个相同的键，也无法为一个键分配两个值。",
    "There are four further functions available for saving and loading a DS map. These functions will obfuscate the map and store it in a secure location on the target platform using a file format that means that the final file is not able to be transfered between devices:":"还有四个函数可用于保存和加载DS映射。这些函数将模糊地图，并使用文件格式将其存储在目标平台上的安全位置，这意味着无法在设备之间传输最终文件：",
    "There are four further functions available for saving and loading a DS map. These functions will obfuscate the map and store it in a secure location on the target platform using a file format that means that the final file is not able to be transferred between devices:":"还有四个函数可用于保存和加载DS映射。这些函数将模糊地图，并使用文件格式将其存储在目标平台上的安全位置，这意味着无法在设备之间传输最终文件：",
    "You can find more information, plus examples, from from the GML Overview page on {}Accessors{}.":"您可以从{}访问器{}的GML 概述页面中找到更多信息和示例。",
    "You can find more information, plus examples, from the GML Overview page on {}Accessors{}.":"您可以从{}访问器{}的GML 概述页面中找到更多信息和示例。",
    "{}NOTE{}: It is recommended to use {}structs{} over DS maps as they have similar features, are easier to use and are garbage collected automatically.":"{}注意{}：建议在DS映射上使用{}结构{}，因为它们具有相似的函数，更易于使用，并且是自动收集的垃圾。",
    "{}{}NOTE{}{} As with all dynamic resources, data structures take up memory and so should {}always{} be destroyed when no longer needed to prevent memory leaks which will slow down and eventually crash your game.":"{}{}注意{}{} 与所有动态资源一样，数据结构占用内存，因此当不再需要{}防止内存泄漏时，应始终销毁{}，这将降低速度并最终导致游戏崩溃。",
    "{}{}NOTE{}{} While these functions permit you to add lists and maps within a map, they are useless for anything other than JSON, and nested maps and lists will not be read correctly if written to disk or accessed in any other way.":"{}{}注意{}{} 虽然这些函数允许您在映射中添加列表和映射，但它们对于JSON以外的任何内容都是无用的，并且如果将嵌套映射和列表写入磁盘或以任何其他方式进行访问，将无法正确读取。",
    "{}{}NOTE{}{}&nbsp;As with all dynamic resources, data structures take up memory and so should {}always{} be destroyed when no longer needed to prevent memory leaks which will slow down and eventually crash your game.":"{}{}注意{}{} 与所有动态资源一样，数据结构会占用内存，因此在不再需要时应{}始终{}销毁以防止内存泄漏，因为内存泄漏会降低游戏速度并最终导致游戏崩溃。",
    "{}{}NOTE{}{}&nbsp;It is recommended to use {}structs{} over DS maps as they have similar features, are easier to use and are garbage collected automatically.":"{}{}注意{}{} 推荐使用{}结构{}而不是DS 映射，因为它们具有相似的功能，更易于使用，并且会自动进行垃圾回收。",
    "{}{}NOTE{}{}&nbsp;While these functions permit you to add lists and maps within a map, they are useless for anything other than JSON, and nested maps and lists will not be read correctly if written to disk or accessed in any other way.":"{}{}注意{}{} 虽然这些函数允许您在映射中添加列表和映射，但它们对于JSON以外的任何内容都是无用的，并且如果将嵌套映射和列表写入磁盘或以任何其他方式进行访问，将无法正确读取。",
    "{}{}TIP{}{}&nbsp;The key isn\u0027t limited to strings and can be of any&nbsp;type, including a&nbsp;{}struct{}.":"{}{} 提示{}{} 键不限于字符串，可以是任何类型，包括 {} 结构体 {}。"
}