{
    "The ID of the list to add.":"要添加的列表的 ID。",
    "The ID of the map to use.":"要使用的地图的 ID。",
    "The above code will create a list and populate it with the various values of global variables. This list is then \"nested\" within a DS map, and the map is then encoded into a JSON string, before the map is destroyed, removing it, and any lists it contains, from memory.":"以上代码将创建一个列表，并使用全局变量的各种值填充该列表。然后，该列表被\"嵌套\"在DS映射中，然后该映射被编码成JSON字符串，在该映射被销毁之前，从存储器中删除它及其包含的任何列表。",
    "The id of the list to add.":"要添加的列表的ID。",
    "The id of the map to use.":"要使用的映射的ID。",
    "The key for the added list.":"添加列表的密钥。",
    "This function is designed for creating JSON compatible maps which you would then encode using&nbsp;{}{}json_encode{}{} and should only be used in conjunction with that functionality. If a DS map has a list added in this way, destroying the parent map will also destroy the contained lists and free their memory, and calling&nbsp;{}{}ds_map_clear{}{} on the parent map will also destroy and clean up any flagged lists.":"此函数旨在创建 JSON 兼容地图，然后您可以使用 {}{}json_encode{}{} 对其进行编码，并且只能与该功能结合使用。如果 DS 地图以这种方式添加了列表，则销毁父地图也会销毁所包含的列表并释放其内存，并且在父地图上调用 {}{}ds_map_clear{}{} 也会销毁并清除所有已标记的列表列表。",
    "With this function you can assign a (previously created) {}DS list{} to a key within the given DS map.":"通过此函数，您可以将 (之前创建的 ){}DS 列表 {} 分配给给定 DS 映射中的键。",
    "With this function you can assign a (previously created) {}DS list{} to a key within the given DS map. This function is designed for creating JSON compatible maps which you would then encode using {}{}json_encode(){}{} and should only be used in conjunction with that functionality. If a DS map has a list added in this way, destroying the parent map will also destroy the contained lists and free their memory, and calling {}{}ds_map_clear(){}{}&nbsp;on the parent map will also destroy and clean up any flagged lists.":"使用此函数，您可以将(以前创建的){}DS列表{}分配给给定DS映射中的某个键。此函数用于创建JSON兼容映射，然后使用{}{}json_encode(){}{}对其进行编码，并且只能与该函数配合使用。如果以这种方式添加了DS映射的列表，则销毁父映射也会销毁包含的列表并释放其内存，而在父映射上调用{}{}ds_map_clear(){}{}也会销毁并清除任何标记的列表。"
}